{
  "product_id": "pimprod2049192",
  "product_url": "https://www.ulta.com/p/retrinal-eye-advanced-3-in-1-eye-cream-pimprod2049192",
  "extracted_at": "2025-09-23T05:03:26.362749+00:00",
  "product_name": "AveneRetrinal Eye Advanced 3-in-1 Eye Cream",
  "brand": "Avene",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Cream"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "eye-cream"
  ],
  "currency": "USD",
  "list_price": "49.50",
  "sale_price": "34.65",
  "availability": "in_stock",
  "rating_avg": "4.5",
  "rating_count": "135",
  "images": [
    "https://media.ulta.com/i/ulta/2635458?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2635458?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635458_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635458_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635458_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635458_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635458_alt05?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsVeganSustainable PackagingAvène's Retrinal Eye Advanced 3-in-1 Eye Cream is powered by dermatologist gold-standard ingredient Retinaldehyde which minimizes the appearance of under-eye lines, puffiness and dark circles while providing hydration, nourishment and smoothing effect around the delicate eye contour.",
  "details": "DetailsKey IngredientsRETINALDEHYDE: Smoothes appearance of wrinkles and brightens skin.HYALURONIC ACID: Moisturizes, smoothes and plumps the skin.DEXTRAN SULFATE: Reduces the appearance of puffiness and dark circles.AVENE THERMAL SPRING WATER: Clinically shown by 150+ studies to soothe, soften and calm the skinBenefitsFormulated with high-performance ingredients and clinically proven efficacy to minimize the appearance of under-eye lines, puffiness, and dark circlesProvides hydration & soothing around the eye contourHelps to brighten and even out the under-eye area leaving a healthy refreshed complexionVisibly reduces puffiness and dark circlesPowered by physician-strength Retinaldehyde which smoothes the appearance of wrinkles and brightens skin98% Natural Origin IngredientsFragrance-Free FormulaSuitable for sensitive skinFormulated WithoutFragranceSoapParabenSulfateAlcoholAluminumSiliconeSilicaSoyMineral OilDairyTalcItem 2635458How To UseApply in the evening on the eye contour, patting lightly. Then smooth from the inside to the outside on the lower part of the eye and along the eyebrow arch.Precautions: For external use only. Avoid exposure to the sun and use adapted sun protection. If you experience tingling, allow more time between applications. Avoid contact with the eyes. If eye contact occurs, rinse thoroughly with water. Do not use if pregnant or breastfeeding.IngredientsAvene Thermal Spring Water (Avene Aqua). Caprylic/Capric Triglyceride. Glycerin.Arachidyl Alcohol. Squalane. Myristyl Alcohol.Behenyl Alcohol. 1,2-Hexanediol. Arachidyl Glucoside. Caprylyl Glycol. Citric Acid. Helianthus Annuus (Sunflower) Seed Oil (Helianthus Annuusseed Oil). Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer. Myristyl Glucoside. Polysorbate 60. Retinal. Sodium Dextran Sulfate. Sodium Hyaluronate. Sorbitan Isostearate. Tocopherol. Tocopheryl Glucoside. Xanthan Gum.",
  "how_to_use": "Apply in the evening on the eye contour, patting lightly. Then smooth from the inside to the outside on the lower part of the eye and along the eyebrow arch.Precautions: For external use only. Avoid exposure to the sun and use adapted sun protection. If you experience tingling, allow more time between applications. Avoid contact with the eyes. If eye contact occurs, rinse thoroughly with water. Do not use if pregnant or breastfeeding.",
  "ingredients": [
    "Avene Thermal Spring Water (Avene Aqua). Caprylic/Capric Triglyceride. Glycerin.Arachidyl Alcohol. Squalane. Myristyl Alcohol.Behenyl Alcohol. 1",
    "2-Hexanediol. Arachidyl Glucoside. Caprylyl Glycol. Citric Acid. Helianthus Annuus (Sunflower) Seed Oil (Helianthus Annuusseed Oil). Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer. Myristyl Glucoside. Polysorbate 60. Retinal. Sodium Dextran Sulfate. Sodium Hyaluronate. Sorbitan Isostearate. Tocopherol. Tocopheryl Glucoside. Xanthan Gum"
  ],
  "extended_contents": {
    "text": "Show less"
  },
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "moisturizer",
      "mask",
      "treatment",
      "eye cream"
    ],
    "skin_type": [
      "sensitive",
      "mature"
    ],
    "finish": [
      "sheer",
      "creamy",
      "cream",
      "oil"
    ],
    "ingredients": [
      "sulfate-free"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "vegan",
      "natural",
      "fragrance-free",
      "spf",
      "anti-aging",
      "soothing"
    ]
  },
  "reviews": {
    "product_id": "pimprod2049192",
    "total_reviews": 135,
    "reviews": [
      {
        "review_id": 546993780,
        "rating": 5,
        "headline": "Anti-Wrinkle",
        "comments": "Avene Retinol Cream is a gentle yet effective product for smoother, more youthful-looking skin. It works well to reduce fine lines and improve skin texture without causing irritation. The lightweight formula absorbs quickly and provides a nice, hydrated feel. Ideal for those new to retinol or with sensitive skin, it offers gradual results that make a noticeable difference over time.",
        "nickname": "Nina",
        "location": "San Diego",
        "created_date": 1740003640624,
        "bottom_line": "Yes",
        "helpful_votes": 17,
        "not_helpful_votes": 15
      }
    ],
    "paging": {
      "total_results": 1,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        2,
        3,
        9,
        29,
        92
      ],
      "review_histogram": [
        2,
        3,
        9,
        29,
        92
      ],
      "rating_count": 135,
      "review_count": 135,
      "average_rating": 4.53,
      "recommended_ratio": 1.0,
      "media": [
        {
          "id": "546993791",
          "review_id": 546993780,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/zh6r1g4ahihlfduxxbi9.jpg",
          "headline": "Anti-Wrinkle",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Nina",
          "created_date": 1740003640624
        },
        {
          "id": "546993711",
          "review_id": 546993780,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/w1lhhjeo6giiaqlxknym.jpg",
          "headline": "Anti-Wrinkle",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Nina",
          "created_date": 1740003640624
        }
      ],
      "faceoff_positive": {
        "comments": "The Avène RetrinAL EYES Advanced 3-in-1 Eye Cream is a dermatologist-recommended treatment designed to address fine lines, puffiness, and dark circles around the delicate eye area. Its key ingredient, retinaldehyde, is a stabilized form of vitamin A that is more potent than retinol yet gentle enough for sensitive skin. This compound promotes collagen production and accelerates skin cell turnover, aiming to smooth wrinkles and enhance skin firmness.  ￼ ￼  The formula also includes hyaluronic acid for hydration and dextran sulfate to reduce puffiness and dark circles. Avène's signature Thermal Spring Water is incorporated to soothe and calm the skin.  ￼ ￼  Clinical studies have shown that 72% of users experienced improved skin firmness around the eye contour, and 68% saw a decrease in dark circle intensity after 57 days of use.  ￼  While many users appreciate its lightweight, velvety texture and effectiveness, some with extremely sensitive eyes have reported irritation. It's advisable for individuals with known sensitivities to review the ingredient list carefully before use.  Overall, the Avène RetrinAL EYES Advanced 3-in-1 Eye Cream is a well-formulated product that combines potent anti-aging ingredients with soothing components, making it a suitable option for those seeking to improve the appearance of the eye area. ￼",
        "headline": "Works in like 2 weeks",
        "rating": 5,
        "ugc_id": 559320116
      },
      "faceoff_negative": {
        "comments": "Not too sure about this one. I really want to like this eye cream, but I haven't noticed it doing very much.  I have noticed slight improvement in my dark circles (they were BAD lol), but haven't noticed anything in terms of improving fine lines. My eyes aren't ever really puffy so I can't attest to that claim at all. Maybe it would be best for that.   But it is super gentle on my sensitive skin and doesn't make my skin any drier (I'd probably shrivel up atp lol). The scent and texture are both nice too, and don't break me out. But the bottle tends to leak a bit.  I'm only about 2ish months in so maybe it'll get better, but as of now, I could take it or leave it.",
        "headline": "It's fine",
        "rating": 3,
        "ugc_id": 559319762
      },
      "native_review_count": 1,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 134,
      "locale": "en_US"
    }
  }
}