{
  "product_id": "pimprod2019394",
  "product_url": "https://www.ulta.com/p/glopro-skin-prep-pads-clarifying-skin-cleansing-wipes-with-peptides-pimprod2019394",
  "extracted_at": "2025-09-23T04:00:23.472430+00:00",
  "product_name": "BeautyBioGloPRO Skin Prep Pads Clarifying Skin Cleansing Wipes with Peptides",
  "brand": "BeautyBio",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wipes"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "39.00",
  "availability": "in_stock",
  "rating_avg": "4.2",
  "rating_count": "39",
  "images": [
    "https://media.ulta.com/i/ulta/2572403?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2572403?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2572403cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2572403cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2572403cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2572403cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2572403cm_vid01/thumbs/ec773fdc-371e-4056-9780-b5d062bc7b8b?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsVeganThese alcohol-free BeautyBio GloPRO Skin Prep Pads Clarifying Skin Cleansing Wipes with Peptides and SteriGlo Complex gently clarify, cleanse, and condition skin in one simple swipe.",
  "details": "DetailsBenefitsRemoves impurities prior to GloPRO treatmentSteriGLO complex clarifies and conditions skinEnhances anti-aging benefits of GloPRO toolIdeal for all skin types and particularly helpful for blemish-prone skin to keep breakouts at bay.Key IngredientsSteriGlo Complex: Deep cleansing proprietary peptide technology designed to purify and condition skin prior to GloPRO use. Powerful enough to kill P. acnes, blemish-causing bacteria that lives on the skinEssential Oils: Lemongrass and cedarwood help clarify skinCitric Acid: Boosts collagen production and diminishes the appearance of dark spots and age spotsPeptides: Stimulates a collagen-building response to help create firmer, smoother looking skinFormulated WithoutParabensPhthalatesSulfatesFormaldehydeTriclosanHydroquinoneTriclocarbanOxybenzoneItem 2572403How To UseApply AM or PM on clean skin. Swipe a pad across targeted area(s) prior to treating with GloPRO. Safe for use on face, lips, neck, chest and body.Precautions: Avoid direct eye contact.IngredientsWater/aqua/eau, Sorbitan Oleate Decylglucoside Crosspolymer, Cocoyl Argininamide, Syringa Vulgaris (lilac) Flower Extract, Pelargonium Graveolens Flower Oil, Lavandula Angustifolia (lavender) Oil, Cymbopogon Schoenanthus Oil, Cedrus Atlantica Bark Oil, Glyceryl Caprylate, Caprylyl Glycol, Myristoyl Tetrapeptide-13, Myristoyl Hexapeptide-23, 1,2-hexanediol, Guar Hydroxypropyltrimonium Chloride, Maltodextrin, Polysorbate 60, Polysorbate 80, Simethicone, Citric Acid, Linalool, Geraniol.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Apply AM or PM on clean skin. Swipe a pad across targeted area(s) prior to treating with GloPRO. Safe for use on face, lips, neck, chest and body.Precautions: Avoid direct eye contact.",
  "ingredients": [
    "Water/aqua/eau",
    "Sorbitan Oleate Decylglucoside Crosspolymer",
    "Cocoyl Argininamide",
    "Syringa Vulgaris (lilac) Flower Extract",
    "Pelargonium Graveolens Flower Oil",
    "Lavandula Angustifolia (lavender) Oil",
    "Cymbopogon Schoenanthus Oil",
    "Cedrus Atlantica Bark Oil",
    "Glyceryl Caprylate",
    "Caprylyl Glycol",
    "Myristoyl Tetrapeptide-13",
    "Myristoyl Hexapeptide-23",
    "2-hexanediol",
    "Guar Hydroxypropyltrimonium Chloride",
    "Maltodextrin",
    "Polysorbate 60",
    "Polysorbate 80",
    "Simethicone",
    "Citric Acid",
    "Linalool",
    "Geraniol"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser"
    ],
    "skin_type": [
      "acne-prone",
      "mature",
      "all skin types"
    ],
    "finish": [
      "sheer",
      "creamy",
      "oil"
    ],
    "ingredients": [
      "peptides"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "vegan",
      "alcohol-free",
      "anti-aging",
      "purifying"
    ]
  },
  "reviews": {
    "product_id": "pimprod2019394",
    "total_reviews": 39,
    "reviews": [
      {
        "review_id": 509705714,
        "rating": 2,
        "headline": "Too dry",
        "comments": "I ordered these because i ran out of the ones that came in the kit but these in the container were super dry. They barely had any liquid on them. Disappointed as the ones in the kit were perfect.",
        "nickname": "HB",
        "location": "Fort Worth Tx",
        "created_date": 1711382756175,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 1,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        5,
        1,
        2,
        4,
        27
      ],
      "review_histogram": [
        5,
        1,
        2,
        4,
        27
      ],
      "rating_count": 39,
      "review_count": 39,
      "average_rating": 4.21,
      "recommended_ratio": 0.81,
      "media": [],
      "faceoff_positive": {
        "comments": "The whole unit is amazing I bought the pads to go with it I have eye bags have spent literally thousands of dollars on eye creams that don't work I decided to give this a try used it for a few days the difference was so subtle but I was putting on my make up and noticed my puffiness under my eyes was dramatically reduced my friends and husband noticed it too !!!! I highly recommend this skin tool.",
        "headline": "Fantastic",
        "rating": 5,
        "ugc_id": 302114414
      },
      "faceoff_negative": {
        "comments": "These pads left my face itchy, red, swollen and irritated for days after using them. I thought it was the process of micro needling itself that was causing this reaction. However, I had to skip this step as I'd left these pads at home while on a trip. I had no itchiy, painful reaction and my face did not swell. I checked the ingredients list and realized of all things, a known allergen and irritant, MALTODEXTRINE, had been included. I was SHOCKED as I usually only have to watch out for this in processed foods! If I consume Maltodextrine, my throat and airways feel like they will close. Imagine my shock and DISAPPOINTMENT that a 'clean' brand would use something like this in their products without offering an alternative for this stage in the micro needling process. I've purchased many (at BeautybBIO online and at Ulta) of these and did not know it was causing this reaction.\r\n\r\nWhy is Maltodextrine included in the list of ingredients?\r\n\r\nWhat possible reason does Maltodextrine (which is an allergen and irritant to many) have to be included in the ingredients list? There are alternatives that do not cause unnecessary irritation and adverse reactions that could have been used instead. \r\n\r\nIs there a possibility that you will leave this ingredient out in future? Is there another way to accomplish this initial step in the skin prep process?",
        "headline": "Alarmed Maltodextrine is in it. I had an allergic",
        "rating": 1,
        "ugc_id": 408220886
      },
      "name": "GloPRO Skin Prep Pads Clarifying Skin Cleansing Wipes with Peptides",
      "native_review_count": 1,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 38,
      "locale": "en_US"
    }
  }
}