{
  "product_id": "pimprod2043262",
  "product_url": "https://www.ulta.com/p/moisturizing-eye-bomb-eye-cream-pimprod2043262",
  "extracted_at": "2025-09-23T04:38:06.334670+00:00",
  "product_name": "belifMoisturizing Eye Bomb Eye Cream",
  "brand": "belif",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Cream"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "eye-cream"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "48.00",
  "availability": "in_stock",
  "rating_avg": "4.5",
  "rating_count": "96",
  "images": [
    "https://media.ulta.com/i/ulta/2619879?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2619879?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619879_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619879_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619879_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619879_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619879_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2619879_vid01/thumbs/263c62fb-bfee-4752-9186-106023f1bb91?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean Ingredientsbelif's Moisturizing Eye Bomb Eye Cream is a lightweight cream that floods the eye area with explosive moisture for up to 48 hours, visibly firming and reducing fine lines and wrinkles.",
  "details": "DetailsKey IngredientsPeptide: Helps improve skin's elasticityCeramide: Helps improve skin's moisture barrierSqualane: Helps stabilize the skin's moisture barrier and maintain skin hydrationResearch ResultsClinically tested to retain skin's moisture for up to 48 hoursClinically shown to provide firmness targeting 3 areas: eye bags, crow's feet, eyelidsClinically tested to provide up to 48 hours of moisture and improve skin's elasticity96% agree the skin around the eyes looks smoother after 2 weeks of use*93% agree it feels like the eye skin area firmness has improved after 2 weeks of use*93% agree it feels like the moisture layer around the eyes has improved after 2 weeks of use*Skin concerns: dryness, loss of firmness and elasticity, fine lines, wrinklesTargets: eye bags, crow's feet, eyelidsFormulation: Rich CreamProvides long-lasting moisturization and helps firm skin around the eye areaFormulated with two Napiers formulas, Peptides, Ceramide, and Squalane to visibly firm and reduce fine lines and wrinkles around the eye areaDermatologically TestedIdeal for all skin types*Based on a consumer studyFormulated WithoutMineral oilSynthetic fragrancesSynthetic colorsSynthetic preservativesItem 2619879How To UseBefore applying moisturizer, take a small amount and gently massage around the eye area using your ring fingers and pat along the contours until product is well absorbed.Discontinue use if irritation or rash occurs. Consult a physician if irritation persists. Do not use on broken or damaged skin. Keep out of reach of children. Do not store at extreme temperatures or in direct sunlight. For external use only.IngredientsWater/Eau, Dipropylene Glycol, Butylene Glycol, Glycerin, Squalane, Cyclopentasiloxane, Caprylyl Trimethicone, Dimethicone, HDI/Trimethylol Hexyllactone Crosspolymer, 1,2-Hexanediol, Sucrose Polystearate, Glyceryl Stearate, Panthenol, PCA Dimethicone, Triethylhexanoin, Dimethicone/Vinyl Dimethicone Crosspolymer, PEG-100 Stearate, C14-22 Alcohols, Silica, Ceramide NP, Hydrogenated Lecithin, Cedrol, Hydrogenated Polyisobutene, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, PEG-10 Rapeseed Sterol, Carbomer, C12-20 Alkyl Glucoside, Tromethamine, Polysorbate 60, Glycereth-20, Cellulose, Trisodium EDTA, Sorbitan Isostearate, Bakuchiol, Caffeine, Centella Asiatica Leaf Extract, Calendula Officinalis FLower Extract*, Avena Sativa (Oat) Kernel Extract*, Nepeta Cataria Extract*, Rubus Idaeus (Raspberry) Leaf Extract*, Baptisia Tinctoria Root Extract*, Stellaria Media (Chickweed) Extract*, Alchemilla Vulgaris Leaf Extract†, Spiraea Ulmaria Flower Extract†, Viola Tricolor Extract†, Achillea Millefolium Flower Extract, Symphytum Officinale Leaf Extract, Trifolium Pratense (Clover) Flower Extract, Menyanthes Trifoliata Leaf Extract, Salix Alba (Willow) Bark Extract, Sodium Lactate, Polysorbate 20, Caprylyl Glycol, Palmitoyl Tripeptide-1, Acetyl Hexapeptide-8, Palmitoyl Tetrapeptide-7, Citrus Aurantium Dulcis (Orange) Peel Oil‡, Citrus Aurantifolia (Lime) Oil‡, Pelargonium Graveolens Flower Oil‡, Rosmarinus Officinalis (Rosemary) Leaf Oil‡, Limonene, Citronellol, Geraniol, Citral, Linalool. *Napiers Original Formula†Napiers Moisture Formula‡Fragrances of Botanical OriginShipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Before applying moisturizer, take a small amount and gently massage around the eye area using your ring fingers and pat along the contours until product is well absorbed.Discontinue use if irritation or rash occurs. Consult a physician if irritation persists. Do not use on broken or damaged skin. Keep out of reach of children. Do not store at extreme temperatures or in direct sunlight. For external use only.",
  "ingredients": [
    "Water/Eau",
    "Dipropylene Glycol",
    "Butylene Glycol",
    "Glycerin",
    "Squalane",
    "Cyclopentasiloxane",
    "Caprylyl Trimethicone",
    "Dimethicone",
    "HDI/Trimethylol Hexyllactone Crosspolymer",
    "2-Hexanediol",
    "Sucrose Polystearate",
    "Glyceryl Stearate",
    "Panthenol",
    "PCA Dimethicone",
    "Triethylhexanoin",
    "Dimethicone/Vinyl Dimethicone Crosspolymer",
    "PEG-100 Stearate",
    "C14-22 Alcohols",
    "Silica",
    "Ceramide NP",
    "Hydrogenated Lecithin",
    "Cedrol",
    "Hydrogenated Polyisobutene",
    "Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer",
    "PEG-10 Rapeseed Sterol",
    "Carbomer",
    "C12-20 Alkyl Glucoside",
    "Tromethamine",
    "Polysorbate 60",
    "Glycereth-20",
    "Cellulose",
    "Trisodium EDTA",
    "Sorbitan Isostearate",
    "Bakuchiol",
    "Caffeine",
    "Centella Asiatica Leaf Extract",
    "Calendula Officinalis FLower Extract*",
    "Avena Sativa (Oat) Kernel Extract*",
    "Nepeta Cataria Extract*",
    "Rubus Idaeus (Raspberry) Leaf Extract*",
    "Baptisia Tinctoria Root Extract*",
    "Stellaria Media (Chickweed) Extract*",
    "Alchemilla Vulgaris Leaf Extract†",
    "Spiraea Ulmaria Flower Extract†",
    "Viola Tricolor Extract†",
    "Achillea Millefolium Flower Extract",
    "Symphytum Officinale Leaf Extract",
    "Trifolium Pratense (Clover) Flower Extract",
    "Menyanthes Trifoliata Leaf Extract",
    "Salix Alba (Willow) Bark Extract",
    "Sodium Lactate",
    "Polysorbate 20",
    "Caprylyl Glycol",
    "Palmitoyl Tripeptide-1",
    "Acetyl Hexapeptide-8",
    "Palmitoyl Tetrapeptide-7",
    "Citrus Aurantium Dulcis (Orange) Peel Oil‡",
    "Citrus Aurantifolia (Lime) Oil‡",
    "Pelargonium Graveolens Flower Oil‡",
    "Rosmarinus Officinalis (Rosemary) Leaf Oil‡",
    "Limonene",
    "Citronellol",
    "Geraniol",
    "Citral",
    "Linalool. *Napiers Original Formula†Napiers Moisture Formula‡Fragrances of Botanical Origin"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "moisturizer",
      "mask",
      "treatment",
      "eye cream"
    ],
    "skin_type": [
      "dry",
      "mature",
      "all skin types"
    ],
    "finish": [
      "sheer",
      "long-wear",
      "creamy",
      "cream",
      "oil"
    ],
    "ingredients": [
      "peptides",
      "ceramides",
      "fragrance"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "natural",
      "anti-aging",
      "hydrating"
    ]
  },
  "reviews": {
    "product_id": "pimprod2043262",
    "total_reviews": 96,
    "reviews": [
      {
        "review_id": 561026455,
        "rating": 5,
        "headline": "Holy grail eye cream",
        "comments": "This is the only eye cream that I use. I get dry patches under my eyes and this is the only eye cream that has made them disappear. It's effective and feels so nice on the skin.",
        "nickname": "Rach",
        "location": "Denver",
        "created_date": 1755997985794,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 561011974,
        "rating": 5,
        "headline": "Eye bomb works",
        "comments": "I havent used this cream yet but I love the gel with applicator. All the belief products work well for me.",
        "nickname": "Marianne",
        "location": "Southern florida",
        "created_date": 1755967277956,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560005403,
        "rating": 5,
        "headline": "Magic in a jar!",
        "comments": "I have had wrinkles under my eyes since I was a teenager. I'm now 37 and I have tried so, so many eye creams under $50. This eye cream is the only one that has not only worked, but the results keep getting better as time goes on, months later. I got a sample back in February, and I was so stunned by the results, I bought a jar in April. I have ZERO undereye wrinkles, and all discoloration has gone away. I swear, this is made of clouds and magic. It feels so soothing when applying. It doesn't overhydrate and make my skin greasy, it's perfect. My husband even noticed a difference. Bottom line, it's absolutely worth the money.",
        "nickname": "Sarah",
        "location": "Seattle",
        "created_date": 1755028077436,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558047832,
        "rating": 5,
        "headline": "Eye Belif!",
        "comments": "I am 47 years old, very fair skin, and live in Florida. In short, maturing skin that shows every flaw living on the surface of the sun. This has been the only eye cream that has worked so well for me I can't wait to use it every day. Firm, bright, decreased lines, and weightless.",
        "nickname": "Belif",
        "location": "Gainesville, FL",
        "created_date": 1753235881491,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551034217,
        "rating": 3,
        "headline": "Love the product but...",
        "comments": "I love the eye cream, however, the packaging is large for the amount of product. This seems very wasteful and not environmentally friendly. Disappointing. Not sure I will purchase again due to the large wasteful packaging.",
        "nickname": "Laura",
        "location": "California",
        "created_date": 1743787949601,
        "bottom_line": "No",
        "helpful_votes": 4,
        "not_helpful_votes": 5
      },
      {
        "review_id": 550869185,
        "rating": 1,
        "headline": "Gave both of us eye infections",
        "comments": "This eye cream gave both my mother and I big, fat, stys. Our entire upper eyelids were swollen shut. We only applied this to the undereyes at night, and still woke up with swollen eyelids. My mother's, on one eye, has now turned into a hard, visible chalazion that she will have to get surgically removed or drained. Do not recommend, it's not worth the risk.",
        "nickname": "Alex",
        "location": "Chicago, IL",
        "created_date": 1743608836087,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 7
      },
      {
        "review_id": 549522360,
        "rating": 5,
        "headline": "Love it",
        "comments": "This eye cream is the best I've tried. It's super-moisturizing and doesn't cause acne or any bad reaction around my sensitive eye area. I recommend!",
        "nickname": "Roselyn",
        "location": "New York",
        "created_date": 1742398060576,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547597029,
        "rating": 3,
        "headline": "Burns my eyes",
        "comments": "This product burns my eyes and makes them water. I havent noticed a lot of results in terms on fine lines.",
        "nickname": "Madi",
        "location": "Pittsburgh PA",
        "created_date": 1740958983611,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 538956949,
        "rating": 5,
        "headline": "WOW",
        "comments": "This product is amazing! I was looking for an eye cream because the skin around my eyes were super dry and flakey. After using this for only one night, I see such a difference!",
        "nickname": "Jasmine",
        "location": "Dallas, TX",
        "created_date": 1733337970304,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 535422846,
        "rating": 5,
        "headline": "Used for years now!",
        "comments": "I heard about this cream from a friend years ago, so I bought a whole line of skin care from belif- their witch hazel toner is amazing too but this is the one item that I continuously rebuy and restock. I have now been using this product for probably 3 1/2 years. I have sensitive skin and I am 33 years old now with 2 kids under 2 and my under eyes have no noticeable signs of wrinkles and they look plump and make up glides on without issue. I love it so much i share with my husband. So pleased with this product!",
        "nickname": "Lifelong Customer",
        "location": "Greenfield IN",
        "created_date": 1728060078765,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 527656131,
        "rating": 5,
        "headline": "Love this",
        "comments": "I got this in a travel pack and recently I've been traveling a lot and using it more. I noticed a significant difference in the moisture in my under eyes when I use this product. It's immediately refreshing, very moisturizing, and calming to any dryer irritation you get after washing your face.   \nI've had it for a while and I turned 30 this year and noticed that my under eyes are a lot dryer and more sensitive. I used it for the first time today after turning 30 (which was a few months ago) and my eyes feel amazing. I honestly did not do not really believe in eye cream, but now that my body is changing and I've used this product after those changes, I am 100% on board. If you're looking for an introductory eye cream to bring moisture to your under eyes and you have sensitive skin, This is the one! Also, I love every single product in my travel/sample kit from this brand. It's really great if you have combination skin and sensitive skin. 10 Out of 10 recommend!",
        "nickname": "Jasz",
        "location": "Los Angeles",
        "created_date": 1724134772524,
        "bottom_line": null,
        "helpful_votes": 12,
        "not_helpful_votes": 0
      },
      {
        "review_id": 527649414,
        "rating": 5,
        "headline": "Highly Recommend!",
        "comments": "I got this eye cream in a set of other Belif products and this is my favorite product from them. This eye cream is the best, it moisturizes and it also absorbs well. It smells good and there is no strong fragrance! I will definitely repurchase this product!",
        "nickname": "Teresa",
        "location": "Jacksonville, Florida",
        "created_date": 1724116459121,
        "bottom_line": null,
        "helpful_votes": 8,
        "not_helpful_votes": 0
      },
      {
        "review_id": 525870673,
        "rating": 5,
        "headline": "I never write these",
        "comments": "Ive tried sooo many eye creams for my dry undereye and this is the ONLY one thats ever made a difference, I stopped using ir and tried something else and within a few days went right back to this! Will never stray away again !",
        "nickname": "Cris",
        "location": "Jacksonville FL",
        "created_date": 1722343283383,
        "bottom_line": null,
        "helpful_votes": 13,
        "not_helpful_votes": 0
      },
      {
        "review_id": 525725341,
        "rating": 1,
        "headline": "Made my under eyes dry",
        "comments": "Eyes started to become red and dry after shortly using this product.",
        "nickname": "Helena C.",
        "location": "Los Angeles, CA",
        "created_date": 1722117880029,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 2
      },
      {
        "review_id": 524200860,
        "rating": 4,
        "headline": "Why did they change the formula?!",
        "comments": "After years and hundreds of dollars looking for a good ice cream, I finally found this one two years ago and that I have never been more happy. It is the perfect eye cream however only giving it four stars because they recently changed the formula. So far I don't like the new consistency. The original formula was nice. I have only used this new formula a couple of times and i hope it doesn't disappoint. Would really hate to have to look for a new eye cream. :(",
        "nickname": "JoceyV",
        "location": "Portland, OR",
        "created_date": 1719983569463,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 512377973,
        "rating": 5,
        "headline": "Effective",
        "comments": "Omg!! I LOVE this eye cream! I received a free sample from Ulta Beauty. It was a generous size sample that I could use over 3 days. I love how quickly this eye cream melts and sinks into your skin. Very comfortable because it does not leave a greasy film after absorbing fully. I can visibly see a difference in the hydration under my eyes. The moisture plumps my fine lines and wrinkles. Everything I've tried from this brand has seemed to work for me very well. I'm definitely going to purchase a full size. I highly recommend you try this for yourself, especially if you have experience dry under your eyes. I do think that it helps with the puffiness as well. I think this is an affordable brand. This is a Korean brand that I definitely can't live without.",
        "nickname": "ReneeC",
        "location": "Waynesville NC",
        "created_date": 1714224019256,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 510653956,
        "rating": 5,
        "headline": "YAS girlyyy",
        "comments": "For people who have dry eyes all around, this is PERFECT for them!! You got this eye cream because my eyes were dry and my first day of using it my eyes were fully moisturized when I woke up. and the best part is it's safe to put all around your eye. It works very well. Doesn't have any bad odor or anything like that",
        "nickname": "That gorly",
        "location": "AR, United States?",
        "created_date": 1712372227425,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 508400181,
        "rating": 4,
        "headline": "feels great",
        "comments": "i was on a search for a new eye cream. i use belif as my moisturizer and i love it so i decided to give the eye cream a try. currently still testing it but i have been loving it so far. as of so far, i have been loving it since i feel hydrated",
        "nickname": "jessi",
        "location": "New Jersey",
        "created_date": 1710377408004,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 508315819,
        "rating": 5,
        "headline": "Visibly reduces crepey under eyes",
        "comments": "Im over 40 and have used lots of eye creams over the years. This eye cream helps your under skin not look crepey and it sits well under make up after tou let it \"dry\".",
        "nickname": "Caro",
        "location": "South Carolina",
        "created_date": 1710301202788,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 505815575,
        "rating": 5,
        "headline": "The best eye cream!!!!",
        "comments": "Definitely one the best eye creams i've ever used! I purchased a set that included a moisturizer, aqua balm, and this eye cream. I am obsessed! I absolutely love this eye cream. It's cooling, smells great, and is extremely effective. I'm a big fan on this brand and this product is a necessity to your skincare routine!",
        "nickname": "Paige",
        "location": "New York",
        "created_date": 1707506912845,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 20,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "None",
              "count": 42
            },
            {
              "label": "Size/Packaging",
              "count": 11
            },
            {
              "label": "Cost",
              "count": 10
            },
            {
              "label": "Not Effective",
              "count": 6
            },
            {
              "label": "Product Scent",
              "count": 5
            },
            {
              "label": "Irritated Skin",
              "count": 1
            },
            {
              "label": "Too Thick/Heavy",
              "count": 1
            },
            {
              "label": "Pealed",
              "count": 1
            },
            {
              "label": "Missing instructions",
              "count": 1
            }
          ],
          "display_values": [
            "Cost",
            "Doesn't Absorb Well",
            "Irritated Skin",
            "Missing instructions",
            "None",
            "Not Effective",
            "Pealed",
            "Product Scent",
            "Size/Packaging",
            "Too Thick/Heavy"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "Moisturizing",
              "count": 66
            },
            {
              "label": "Absorbs Quickly",
              "count": 52
            },
            {
              "label": "Non Greasy",
              "count": 48
            },
            {
              "label": "Effective",
              "count": 33
            },
            {
              "label": "Long Lasting",
              "count": 29
            },
            {
              "label": "Safe for Sensitive Skin",
              "count": 26
            },
            {
              "label": "Immediate/Visible Results",
              "count": 24
            },
            {
              "label": "Quality",
              "count": 23
            },
            {
              "label": "Smells Great",
              "count": 21
            },
            {
              "label": "Fragrance Free",
              "count": 18
            }
          ],
          "display_values": [
            "Absorbs Quickly",
            "Effective",
            "Fragrance Free",
            "Immediate/Visible Results",
            "Immediate/Visible Results ",
            "Long Lasting",
            "Moisturizing",
            "Moisturizing ",
            "Non Greasy",
            "Quality",
            "Safe for Sensitive Skin",
            "Smells Great"
          ]
        }
      ],
      "rating_histogram": [
        2,
        0,
        9,
        20,
        65
      ],
      "review_histogram": [
        2,
        0,
        9,
        20,
        65
      ],
      "rating_count": 96,
      "review_count": 96,
      "average_rating": 4.52,
      "recommended_ratio": 0.9,
      "media": [
        {
          "id": "522888561",
          "review_id": 522888574,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/aguontopp2ttoflm2aht.jpg",
          "headline": "Perfect",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Ana",
          "created_date": 1718793988963
        },
        {
          "id": "522449739",
          "review_id": 522449738,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/b11gtkbpcazgnu94ulcx.jpg",
          "headline": "Doesn't move makeup",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Eye cream",
          "nickname": "Nicshanae",
          "created_date": 1718201680273
        },
        {
          "id": "522168783",
          "review_id": 522168666,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ouup82evbc0xxqv9re2h.jpg",
          "headline": "A competitor with eye creams triple in price",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Sample size I received for a free honest review.",
          "nickname": "Ceara",
          "created_date": 1717817163768
        },
        {
          "id": "521787837",
          "review_id": 521787836,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/gadnvglv40b2nlyf00a1.jpg",
          "headline": "Nice Product",
          "rating": 3,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Camp",
          "created_date": 1717580174210
        },
        {
          "id": "521340109",
          "review_id": 521340171,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/zzglhmu0cttds7hbuz3x.jpg",
          "headline": "Hydrated Eyes",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Tiny jar",
          "nickname": "Amina",
          "created_date": 1717494109128
        },
        {
          "id": "520069309",
          "review_id": 520069341,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/dvygfwnckafspx0jrh9e.jpg",
          "headline": "Thick and beautiful",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Megan",
          "created_date": 1717334895595
        },
        {
          "id": "520069322",
          "review_id": 520069341,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ecrqbcaoolclfn0xxrca.jpg",
          "headline": "Thick and beautiful",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Megan",
          "created_date": 1717334895595
        },
        {
          "id": "516228501",
          "review_id": 516228425,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/etshmxw7facecgsdlx6z.jpg",
          "headline": "Rich moisturising eye cream you will know you always needed",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "MoonMom",
          "created_date": 1716463478260
        },
        {
          "id": "516228426",
          "review_id": 516228425,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/nxj2oeqdsfvwyqrnldfg.jpg",
          "headline": "Rich moisturising eye cream you will know you always needed",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "MoonMom",
          "created_date": 1716463478260
        },
        {
          "id": "516228510",
          "review_id": 516228425,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ocz0b8ekdoqcwds5l9fe.jpg",
          "headline": "Rich moisturising eye cream you will know you always needed",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "MoonMom",
          "created_date": 1716463478260
        },
        {
          "id": "516017208",
          "review_id": 516017207,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ddcucaspnbterd8okac3.jpg",
          "headline": "Cooking & Refreshing",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Dark circles gone!",
          "nickname": "AliP",
          "created_date": 1716306845041
        },
        {
          "id": "515776273",
          "review_id": 515776253,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/sdcdh9gbn4dahisdlcj5.jpg",
          "headline": "Hydrating Eye Cream",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Eye Bomb",
          "nickname": "SydneyRR",
          "created_date": 1716239544952
        },
        {
          "id": "515538687",
          "review_id": 515538780,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/zz2nbkk6rwy5ooyxxoqe.jpg",
          "headline": "Wonderful eye cream !",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Namm",
          "created_date": 1716164895124
        },
        {
          "id": "515538790",
          "review_id": 515538780,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/wjlomotqgggkfugpt8ia.jpg",
          "headline": "Wonderful eye cream !",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Namm",
          "created_date": 1716164895124
        },
        {
          "id": "515498799",
          "review_id": 515498844,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/hppddyss1c885wjnkt6l.jpg",
          "headline": "Super moisturizing for my tired eyes!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Itsjusstbeth",
          "created_date": 1716142977042
        },
        {
          "id": "515498798",
          "review_id": 515498844,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/vqblnhd0rem8nx2d15u3.jpg",
          "headline": "Super moisturizing for my tired eyes!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Itsjusstbeth",
          "created_date": 1716142977042
        },
        {
          "id": "515484056",
          "review_id": 515484121,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/rbkfbsi2rgguxeit6cto.jpg",
          "headline": "Eye Bomb",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "GZM",
          "created_date": 1716131334488
        },
        {
          "id": "514166604",
          "review_id": 514166664,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/qlvnb9vew5clhwixbgvv.jpg",
          "headline": "Feels incredibly!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Feels incredibly! 1",
          "nickname": "Andre",
          "created_date": 1715825251370
        },
        {
          "id": "514166670",
          "review_id": 514166664,
          "uri": "//res.cloudinary.com/powerreviews/video/upload/v1715825118/prod/duq7m4yuzt2qryomrjmx.mp4",
          "headline": "Feels incredibly!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "video",
          "caption": "Feels incredibly! 2",
          "nickname": "Andre",
          "created_date": 1715825251370
        },
        {
          "id": "513929544",
          "review_id": 513929865,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/xxhg8wjbps7qatk1jwzy.jpg",
          "headline": "love it",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Tn",
          "created_date": 1715733472919
        },
        {
          "id": "513877819",
          "review_id": 513877859,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/enhkpvjuajbzs7l0lp6n.jpg",
          "headline": "Nice and lightweight",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Packaging!",
          "nickname": "__AT",
          "created_date": 1715726514051
        },
        {
          "id": "513727025",
          "review_id": 513727024,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/yqhjkxczso4ko6lqx4hx.jpg",
          "headline": "Around eye area to go from now on",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Perfect for summer",
          "nickname": "Tinakaos",
          "created_date": 1715704278462
        },
        {
          "id": "513722678",
          "review_id": 513722676,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/qeemkjqxdc88qctxmvcx.jpg",
          "headline": "LOVE IT! Best eye moisturizer ever!!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Left my skin feeling so soft and refreshed!",
          "nickname": "Whitney",
          "created_date": 1715699227574
        },
        {
          "id": "513722677",
          "review_id": 513722676,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/gvmscz40rk8scyskbafw.jpg",
          "headline": "LOVE IT! Best eye moisturizer ever!!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Amazing results! Long lasting!",
          "nickname": "Whitney",
          "created_date": 1715699227574
        },
        {
          "id": "513651750",
          "review_id": 513651740,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/qcr3k38zumsjgzfabdfz.jpg",
          "headline": "Great eye cream",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Katy",
          "created_date": 1715631136163
        }
      ],
      "faceoff_positive": {
        "comments": "As someone who battles dark circles and puffiness daily, finding an eye cream that delivers results has been a game-changer for me.\n\nThis eye bomb has a gel-cream formula that feels incredibly lightweight and refreshing on the skin. It absorbs quickly without any greasiness or heaviness, which is a huge plus for me, especially when applying my makeup.\nThis eye cream is an absolute powerhouse when it comes to moisturizing the delicate skin around the eyes. With just a small dab, my under-eye area feels instantly plumped and hydrated, and any dryness or tightness disappears almost immediately. \n\nWith consistent use, I've noticed a significant reduction in the appearance of my dark circles and puffiness. My under-eye area looks brighter, smoother, and more refreshed than ever before.\n I love how sleek and compact it is, making it perfect for travel or throwing in my bag for touch-ups throughout the day. \n\nI can't recommend the Moisturizing Eye Bomb enough. If you're struggling with tired, dehydrated eyes like I was, do yourself a favor and give this eye cream a try. It's a true game-changer that will leave you looking and feeling refreshed, no matter what life throws your way.",
        "headline": "Feels incredibly!",
        "rating": 5,
        "ugc_id": 514166664
      },
      "faceoff_negative": {
        "comments": "I received a sample of the Belif Moisturizing Eye Bomb to try for being a BzzAgent and I have to say, if I hadn't received it, I wouldn't have purchased it on my own. I had high hopes that this moisturizer would be a great addition to my beauty routine, but after using it I just didn't notice it being any different than the other products I use. It has a great texture and I like the fact that there is no strong scent, but I didn't see any specific results from using it. Not something I would have purchased on my own.",
        "headline": "Nice Product",
        "rating": 3,
        "ugc_id": 521787836
      },
      "name": "Moisturizing Eye Bomb Eye Cream",
      "variant_names": [
        "Moisturizing Eye Bomb"
      ],
      "native_review_count": 20,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 76,
      "locale": "en_US"
    }
  }
}