{
  "product_id": "pimprod2019139",
  "product_url": "https://www.ulta.com/p/bryce-harper-strong-hold-hair-clay-pimprod2019139",
  "extracted_at": "2025-09-23T03:28:50.947907+00:00",
  "product_name": "Blind BarberBryce Harper Strong Hold Hair Clay",
  "brand": "Blind Barber",
  "categories": [
    "Home",
    "Hair",
    "Styling Products",
    "Smoothing"
  ],
  "category_keys": [
    "home",
    "hair",
    "styling-products",
    "smoothing"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "21.99",
  "availability": "in_stock",
  "rating_avg": "4.7",
  "rating_count": "537",
  "images": [
    "https://media.ulta.com/i/ulta/2570517?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2570517?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2570517cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2570517cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2570517cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2570517cm_vid01/thumbs/03df58bb-0363-49b0-8dad-3b137e8c3e89?w=600&h=411&fmt=auto"
  ],
  "summary": "SummaryHighlightsCruelty FreeSustainable PackagingGive BackBlind Barber Bryce Harper Strong Hold Hair Clay is infused with natural ingredients, such as kaolin clay and hops extract to soak up excess oil, and in the end, providing a strong, pliable hold, texture and volume. Formulated in collaboration with baseball superstar Bryce Harper.",
  "details": "DetailsBenefitsStrong HoldMatte FinishCream of Coconut FragranceWater Soluble - Rinses out with easeKaolin Clay adds volume by soaking up dirt and impuritiesEnhanced with: Shea Butter and Marula Seed OilParaben and Sulfate-FreeKey IngredientsCoconut provides a light coconut fragrance with hints of vanillaKaolin Clay is a natural clay that helps absorb excess oil and moistureMarula Seed Oil is a multipurpose oil that conditions the hair and helps soothe and moisturize the scalpShea Butter conditions the hair and scalp, softens hair and helps soothe scalp irritationItem 2570517How To UseWhen applying start at the back of the head and work your way toward the front, making sure you coat those roots. This method helps spreads the product evenly, avoiding clumps of product at the front portion of your hair.Precautions: Avoid direct contact with eyes and do not ingest. Keep out of reach of children.IngredientsWater (Aqua), Ceteareth-20, Bis-Diglyceryl Polyacyladipate-2, Cetearyl Alcohol, Copernicia Cerifera (Carnauba) Wax, Glycerin, Polyacrylate-2 Crosspolymer, Microcrystalline Wax, Hydrogenated Polybutene, Glyceryl Stearate, PEG-100 Stearate, Paraffin, Phenoxyethanol, Butyrospermum Parkii (Shea) Butter, Fragrance (Parfum), Caprylyl Glycol, Chlorphenesin, Oryza Sativa (Rice) Bran Extract, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Sodium Phytate, Sodium Hydroxide, Helianthus Annuus (Sunflower) Extract, Tocopherol, Rosmarinus Officinalis (Rosemary) Leaf Extract, Sclerocarya Birrea Seed Oil, Kaolin, Argania Spinosa Kernel Oil",
  "how_to_use": "When applying start at the back of the head and work your way toward the front, making sure you coat those roots. This method helps spreads the product evenly, avoiding clumps of product at the front portion of your hair.Precautions: Avoid direct contact with eyes and do not ingest. Keep out of reach of children.",
  "ingredients": [
    "Water (Aqua)",
    "Ceteareth-20",
    "Bis-Diglyceryl Polyacyladipate-2",
    "Cetearyl Alcohol",
    "Copernicia Cerifera (Carnauba) Wax",
    "Glycerin",
    "Polyacrylate-2 Crosspolymer",
    "Microcrystalline Wax",
    "Hydrogenated Polybutene",
    "Glyceryl Stearate",
    "PEG-100 Stearate",
    "Paraffin",
    "Phenoxyethanol",
    "Butyrospermum Parkii (Shea) Butter",
    "Fragrance (Parfum)",
    "Caprylyl Glycol",
    "Chlorphenesin",
    "Oryza Sativa (Rice) Bran Extract",
    "Acrylates/C10-30 Alkyl Acrylate Crosspolymer",
    "Sodium Phytate",
    "Sodium Hydroxide",
    "Helianthus Annuus (Sunflower) Extract",
    "Tocopherol",
    "Rosmarinus Officinalis (Rosemary) Leaf Extract",
    "Sclerocarya Birrea Seed Oil",
    "Kaolin",
    "Argania Spinosa Kernel Oil"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "hair",
      "haircare"
    ],
    "skin_type": [
      "oily"
    ],
    "finish": [
      "matte",
      "sheer",
      "cream",
      "oil"
    ],
    "ingredients": [
      "fragrance"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "natural",
      "sulfate-free"
    ],
    "product_type": []
  },
  "reviews": {
    "product_id": "pimprod2019139",
    "total_reviews": 537,
    "reviews": [
      {
        "review_id": 533233607,
        "rating": 5,
        "headline": "I would highly recommend buying this product",
        "comments": "I can put this product in my hair and style it in the morning and I'll stay put in until I get home; because it is hard to find a good product for my hair because I've really thick straight hair",
        "nickname": "John",
        "location": "Opelika",
        "created_date": 1726500230632,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 510481438,
        "rating": 2,
        "headline": "Not holding up",
        "comments": "This product was easy to appy and smells great! The hold was horribble. It held up barley but maybe its because i have long hair currently but the hold doesnt even an hour",
        "nickname": "RAF",
        "location": "Sfv",
        "created_date": 1712185877109,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 508210405,
        "rating": 3,
        "headline": "Dried out my hair",
        "comments": "Dried out my hair and hard to work into hair. Smells nice though. Returned it and sticking to my usual product Harrys texturizing.",
        "nickname": "J",
        "location": "Orange county",
        "created_date": 1710177330724,
        "bottom_line": "No",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 446119100,
        "rating": 4,
        "headline": "Pulls hair",
        "comments": "It has a strong hold, not shiny, smells so good, small bit of a tropical smell, but boy does it tug on my hair.  Yanks out many pieces of my hair, stuck to my hand when done.",
        "nickname": "Audizzle",
        "location": "Texas",
        "created_date": 1677732550528,
        "bottom_line": "No",
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 416193099,
        "rating": 5,
        "headline": "Fantastic",
        "comments": "This stuff if fantastic. I enjoy the scent, texture, sheen and hold it provides to my hair. It last a long time too. Really love the whole blind barber line. The face scrub is amazing too",
        "nickname": "Gg15202",
        "location": "Pittsburgh",
        "created_date": 1657232528513,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 386531172,
        "rating": 5,
        "headline": "Really good!",
        "comments": "This and the 90 proof have the same amount of hold, and they're both matte finish.\nThis has a bit of kaolin clay in the formula so it gives a tad but more \"grip\" while styling. Results are very similar, this has a tad bit more dryness to it but nothing bad, it's still very smooth!\nThe matte finish is a true matte, just like blind barber 90 proof. \n\nBut overall, the results are 98% identical. Very slight difference in the texture due to the clay in it. \n\nThe main difference is the scent.\nThe 90 proof has a vanilla tonka bean scent and this one has a light refreshing coconut - vanilla scent.\n\nBoth smell delicious!\n\nSo to be honest, at the end of the day, this and the 90 proof are both wonderful. The true main difference is the scent.",
        "nickname": "Tamas",
        "location": "Los Angeles",
        "created_date": 1635919526073,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 343688525,
        "rating": 5,
        "headline": "I am so glad I found this product",
        "comments": "I searched high and low for an affordable matte wax/clay that i could use to create some piecey bangs. I like to style my hair and take a small amount of product and warm it up in my hands and pull some pieces from my bangs and separate them creating a piecey look. I couldnt find a product that didnt smell like a man. Finally, I found this one and it smells amazing. It smells like coconut. I love it and will continue to buy it. However, there is so much product in this container it will probably last for awhile.",
        "nickname": "Kim",
        "location": "Gastonia, NC",
        "created_date": 1620326157823,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 7,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "hairtype",
          "name": "Hair Type",
          "type": "tag",
          "values": [
            {
              "label": "Straight Hair",
              "count": 2
            },
            {
              "label": "Wavy Hair",
              "count": 1
            }
          ],
          "display_values": [
            "Straight Hair",
            "Very Curly Hair",
            "Wavy Hair"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "Smooth fluffy feel",
              "count": 1
            },
            {
              "label": "a little product goes a long way",
              "count": 1
            },
            {
              "label": "great texture",
              "count": 1
            },
            {
              "label": "holds hair in place",
              "count": 1
            },
            {
              "label": "smells amazing",
              "count": 1
            }
          ],
          "display_values": [
            "Smooth fluffy feel",
            "a little product goes a long way",
            "great texture",
            "holds hair in place",
            "smells amazing"
          ]
        }
      ],
      "rating_histogram": [
        10,
        15,
        7,
        46,
        459
      ],
      "review_histogram": [
        10,
        15,
        7,
        46,
        459
      ],
      "rating_count": 537,
      "review_count": 537,
      "average_rating": 4.73,
      "recommended_ratio": 0.7,
      "media": [],
      "faceoff_positive": {
        "comments": "Truly amazing! I've tested many pomades, clays, waxes... From homebrewed to high-end Salon Grade...   I absolutely love the Harper clay. The scent is out of this world!   They should have this cream of coconut scent option available for the other blind barber products!   I love the vanilla tonka bean scent too but, I much prefer the cream of coconut scent.   This clay gives such nice texture, volume &amp; thickness to the hair; with a nice matte finish.  And the good thing is that, the formula is very light weight. So this means that if you have fine or medium thick hair, it will not weigh your hair down at all. It'll keep that nice volume all day... And even into the next day.  It doesn't get greasy even in 2nd day hair and also, if you have sensitive scalp like I do, don't worry, it doesn't irritate nor gives you any itchy feel on the scalp.   You can use a tiny bit into damp hair, to blow-dry it in for nice volume.   You can use it in damp hair styling.  You can use it in dry hair styling.  It works every which way you choose to use it.  I usually use a dab in damp hair and blow-dry it in, and then I'll add a dab more into dry hair, and, BOOM .. Done!   The scent is very subtle and delicious.  It washes out super easily at the end of the day.  Truly a wonderful product that is well formulated, and just simply works.  Truly awesome.",
        "headline": "Superb",
        "rating": 5,
        "ugc_id": 546932942
      },
      "faceoff_negative": {
        "comments": "This is a terrific product - when it's not expired? I previously bought this from Blind Barber locations in NYC or Ulta, and the texture was, I think what's it's supposed to be? However, I purchased two from the Blind Barber website most recently, and the texture is solid and unworkable. Can't rub together in hands, and clumps hopelessly in hair. Disappointing. Would like my money back or replacements.",
        "headline": "Expired?",
        "rating": 2,
        "ugc_id": 468583753
      },
      "name": "Bryce Harper Strong Hold Hair Clay",
      "native_review_count": 7,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 530,
      "locale": "en_US"
    }
  }
}