{
  "product_id": "pimprod2019140",
  "product_url": "https://www.ulta.com/p/40-proof-sea-salt-textured-hold-spray-pimprod2019140",
  "extracted_at": "2025-09-23T03:09:44.765898+00:00",
  "product_name": "Blind Barber40 Proof Sea Salt Textured Hold Spray",
  "brand": "Blind Barber",
  "categories": [
    "Home",
    "Men",
    "Hair",
    "Styling"
  ],
  "category_keys": [
    "home",
    "men",
    "hair",
    "styling-products"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "21.99",
  "availability": "in_stock",
  "rating_avg": "4.8",
  "rating_count": "579",
  "images": [
    "https://media.ulta.com/i/ulta/2570518?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2570518?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2570518cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2570518cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2570518cm_vid01/thumbs/b7e44395-d9d3-41e0-aa5c-96e28bd3d6ef?w=600&h=411&fmt=auto"
  ],
  "summary": "SummaryHighlightsCruelty FreeSustainable PackagingGive BackBlind Barber 40 Proof Sea Salt Spray is a protein-rich spray that gives your hair an extra boost of volume and texture. The formula is infused with sea salt and hops to mimic those \"just-off-the-beach\" waves while providing a light hold.",
  "details": "DetailsBenefitsLight to Medium HoldTextured FinishTonka Bean (light vanilla) FragranceWater Soluble - Rinses out with easeEnhanced with Hops (yes from beer) to add protein and fight dandruffParaben-FreeKey IngredientsTonka Bean resembles a sweet/spicy fragrance that is reminiscent of vanilla and almondHops Extract tones the scalp and provides vitality, it regulates dandruff and slows hair lossSea Salt works to absorb this excess oil, or alternatively if you suffer from dry flakes, sea salt is thought to help get rid of dandruff. It also adds plenty of volume to hair and provides a long lasting hold.Citronellol can keep a scalp looking healthy and clean when applied topicallyItem 2570518How To UseGreat for all types of hair but if you want to add texture and volume to longer hair, be sure to apply spray from mid-length to the tips of the hair. Stylist Tip: For best results, spray evenly, starting at the roots on damp or towel-dried hair.Precautions: Avoid direct contact with eyes and do not ingest. Keep out of reach of children.IngredientsWater/Aqua/Eau, Magnesium Sulfate, PVP, Polysorbate 20, Sucrose, Laureth-12, Phenoxyethanol, Sorbitol, Fragrance/Parfum, Panthenol, PEG-40 Hydrogenated Castor Oil, Sodium Chloride, Linalool, Hexyl Cinnamal, Cinnamyl Alcohol, Butylphenyl Methylpropional, Coumarin, Alpha-Isomethyl Ionone, Citronellol, Limonene, Citric Acid.",
  "how_to_use": "Great for all types of hair but if you want to add texture and volume to longer hair, be sure to apply spray from mid-length to the tips of the hair. Stylist Tip: For best results, spray evenly, starting at the roots on damp or towel-dried hair.Precautions: Avoid direct contact with eyes and do not ingest. Keep out of reach of children.",
  "ingredients": [
    "Water/Aqua/Eau",
    "Magnesium Sulfate",
    "PVP",
    "Polysorbate 20",
    "Sucrose",
    "Laureth-12",
    "Phenoxyethanol",
    "Sorbitol",
    "Fragrance/Parfum",
    "Panthenol",
    "PEG-40 Hydrogenated Castor Oil",
    "Sodium Chloride",
    "Linalool",
    "Hexyl Cinnamal",
    "Cinnamyl Alcohol",
    "Butylphenyl Methylpropional",
    "Coumarin",
    "Alpha-Isomethyl Ionone",
    "Citronellol",
    "Limonene",
    "Citric Acid"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "men",
      "hair",
      "mens",
      "haircare"
    ],
    "product_type": [
      "toner"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "sheer",
      "oil"
    ],
    "color": [
      "red"
    ],
    "ingredients": [
      "fragrance",
      "sulfate-free"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "paraben-free"
    ]
  },
  "reviews": {
    "product_id": "pimprod2019140",
    "total_reviews": 579,
    "reviews": [
      {
        "review_id": 560445558,
        "rating": 1,
        "headline": "Stay Away Defective design Gets Clogged up",
        "comments": "I had the same clogging issue with two of these bottles. Half way though using this product it got clogged up and NO longer worked. I contacted Vince at B.Barber. NO HELP, at all. Waste of time and money!",
        "nickname": "mario",
        "location": "IL",
        "created_date": 1755610124098,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557408479,
        "rating": 3,
        "headline": "Would be perfect if it was fragrance free",
        "comments": "This works really well.It's probably one of the best salt sprays i have used. that's sad because the scent is incredibly overpowering and like all day, it sticks around. Maybe some people who don't already have their own scent that they want to wear will like that , but for those of us who are already wearing scents that may clash with this , such an overwhelming long lasting scent makes it unusable.",
        "nickname": "R",
        "location": "maryland",
        "created_date": 1752725953270,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551466410,
        "rating": 1,
        "headline": "Sticky, stinky mess",
        "comments": "I bought this based on the stellar reviews, and I don't understand. The scent is overwhelming and the product is sticky. I would have returned it on that basis alone, but it also leaked during shipment, covering everything in my order in it, and it leaked through the box.",
        "nickname": "D",
        "location": "Lansing MI",
        "created_date": 1744383696806,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 2
      },
      {
        "review_id": 548870418,
        "rating": 5,
        "headline": "Great product",
        "comments": "My son loves it. He has longish shaggy hair, like every other high school kid, and it gives it texture and keeps the waves poufy. No cap hahah",
        "nickname": "Blossom",
        "location": "Reno, NV",
        "created_date": 1742146245050,
        "bottom_line": null,
        "helpful_votes": 15,
        "not_helpful_votes": 1
      },
      {
        "review_id": 542880900,
        "rating": 3,
        "headline": "Great product but poor packaging",
        "comments": "My sons love this sea salt spray! However, over the last 10 purchases, 4 spray nozzles have malfunctioned. So in our opinion its a 5 star product in 1 star packaging.",
        "nickname": "Laura",
        "location": "Winchester, TN",
        "created_date": 1736873093683,
        "bottom_line": null,
        "helpful_votes": 13,
        "not_helpful_votes": 0
      },
      {
        "review_id": 533932697,
        "rating": 4,
        "headline": "Love but….",
        "comments": "Thought the brand created products for women also but the scent was very much geared toward \"masculinity.\" Very heavy on sandalwoods and cedar. However, the product produces the texture that I wanted hence the 4 stars.",
        "nickname": "vjsca",
        "location": "Fresno, CA",
        "created_date": 1727019469005,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 2
      },
      {
        "review_id": 528760973,
        "rating": 5,
        "headline": "Silky smooth !",
        "comments": "It smells great and adds texture to my hair without the crunch. It keeps my hair holding curl all day but does not add any frizz like most texture sprays. It makes my hair silky soft while still holding what I need",
        "nickname": "Tiffany B",
        "location": "Texas",
        "created_date": 1724616275345,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 524378481,
        "rating": 4,
        "headline": "I would re-purchase",
        "comments": "I learned after the first application don't apply too much. The scent linger all day/night & into day 2. I don't like the scent so I was bothered. It's a peppery masculine scent. Also spray too much and your hair will feel sticky and tangled. I liked the 2nd application better. I used less and no stinky scent and my hair was much more manageable. The aluminum bottle gets slippery when you scrunch then go to spray more, so I don't like the packaging.",
        "nickname": "Melissa",
        "location": "OH",
        "created_date": 1720199051461,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 2
      },
      {
        "review_id": 523678000,
        "rating": 5,
        "headline": "Perfect Summer Staple",
        "comments": "I am obsessed with this spray. Salts sprays can be too textured or not textured enough, and this is the perfect amount of texture. The scent is great - natural and not overpowering. My hair has the perfect wave amount with this. Best summer staple!",
        "nickname": "Sierra",
        "location": "Minneapolis, MN",
        "created_date": 1719353028715,
        "bottom_line": "Yes",
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 518943261,
        "rating": 1,
        "headline": "Disappointed",
        "comments": "I cant believe this got auch goid reviews.  The only thing i can say good about it, is I liked the smell.  I may not be a good judge as it could juat have been my bottle.  It didnt come out as a spray. It ran down my hand and if it would came out in my hair, it was like a lump.  It was so sticky running down my hand.  The first time I tried it, i ended up juat outting aomw in my hands and run it in my hair.  It sis nothing.  The second tume i tried it, i just threw it away.  Glad so many others had a better experience",
        "nickname": "Dani",
        "location": "Lexington, KY",
        "created_date": 1717074460402,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 13
      },
      {
        "review_id": 485884591,
        "rating": 5,
        "headline": "Husband likes",
        "comments": "Husband hates sticky hair products. He likes some but they are highly fragrances and I'm not a fan. This seems to be the one for an easy everyday for his medium-thick hair for some texture. Doesn't leave his hair sticky, or dirty, or greasy. Doesn't stink of man perfume. Great product. Been asked to repurchase.",
        "nickname": "Brit",
        "location": "USA",
        "created_date": 1703636054431,
        "bottom_line": null,
        "helpful_votes": 17,
        "not_helpful_votes": 0
      },
      {
        "review_id": 485844081,
        "rating": 5,
        "headline": "High performing product",
        "comments": "My natural hair is thick, textured, & lightly wavy. I bought this thinking it was an after styling texture spray but decided to try it after a shower anyways. I haven't seen my waves like this in 7 years! Highly recommend if you want a light wave.",
        "nickname": "Alissa",
        "location": "Malibu, CA",
        "created_date": 1703571411305,
        "bottom_line": "Yes",
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 477143721,
        "rating": 5,
        "headline": "lov",
        "comments": "great",
        "nickname": "jay",
        "location": "Gainesville, Fl",
        "created_date": 1697642619531,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 3
      },
      {
        "review_id": 468177465,
        "rating": 4,
        "headline": "Great Product, Problem Bottle",
        "comments": "My teen son's favorite hair product (he's tried them all). The spray bottle clogs frequently however, which is so frustrating when trying to get ready. We have to unclog weekly.",
        "nickname": "BeautyGirl23",
        "location": "Missouri",
        "created_date": 1691856336446,
        "bottom_line": null,
        "helpful_votes": 11,
        "not_helpful_votes": 3
      },
      {
        "review_id": 462730905,
        "rating": 1,
        "headline": "Think 80s Hairspray Feel",
        "comments": "I decided to try this because it was half off and had quite a few good reviews. I'm convinced those are paid reviews...lol. I have used several sea salt texture sprays and have never had one that made my hair feel like I used a half a can of Aqua Net from the 80s. This was only with a few pumps. My hair felt and looked stiff. I will say it does wash out easily and the smell is pretty good. Other than that a hard pass.",
        "nickname": "Del",
        "location": "Louisiana",
        "created_date": 1687842731276,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 449107954,
        "rating": 5,
        "headline": "Best Sea Salt Spray!",
        "comments": "Other products just made my hair feel like straw but this one makes my choppy bob look great! I spray it on my hair when it's wet, blow dry it with a round brush and do a cool shot all over to give lift and movement, and then spray again for the texture and hold. It makes my style last two days and let's me get away with washing twice a week, which helps prolong my bright purple colour. Bonus: it smells so good. This will always be in my rotation!",
        "nickname": "Pinkidabrain",
        "location": "Dallas TX",
        "created_date": 1679322276769,
        "bottom_line": null,
        "helpful_votes": 18,
        "not_helpful_votes": 0
      },
      {
        "review_id": 445578714,
        "rating": 3,
        "headline": "Great Product lousy container",
        "comments": "I like this product and the smell. Have bought several bottles because the sprayer stops working and I have to pour it into my hand which is not effective. Have tried washing the sprayer, different sprayers, but a continual problem",
        "nickname": "Scott",
        "location": "Las Vegas NV",
        "created_date": 1677536275819,
        "bottom_line": null,
        "helpful_votes": 11,
        "not_helpful_votes": 0
      },
      {
        "review_id": 444747626,
        "rating": 5,
        "headline": "Best styling product live the results",
        "comments": "I jump out of the shower spray the sea salt in my hair gently touch my hair around Rita. Great luck with less effort.",
        "nickname": "Chris",
        "location": "Las Vegas",
        "created_date": 1676734712723,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 1
      },
      {
        "review_id": 430631971,
        "rating": 5,
        "headline": "Great sea salt spray",
        "comments": "I absolutely love this spray! It smells great and gives my normally limp and flat hair great texture and body. I find I don't need much spray to achieve the texture I want and used too much the first few times and ended up with crunchy waves so you have to find the balance. Overall great product and I will definitely buy again!",
        "nickname": "Cyrene",
        "location": "Sacramento",
        "created_date": 1666367864771,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 2
      },
      {
        "review_id": 421201776,
        "rating": 2,
        "headline": "Not for me",
        "comments": "I used this once with wet hair and once with dry. I like the way my hair looked after using on my wet hair, it gave the beachy wave I wanted. On dry it made my hair feel really sticky and clumpy. In both cases my scalp was unbearably dry and itchy. I struggle with a dry scalp normally so I wouldn't recommend for others with this problem. I ended up returning it.",
        "nickname": "Maddy",
        "location": "West Des Moines",
        "created_date": 1660688328770,
        "bottom_line": null,
        "helpful_votes": 10,
        "not_helpful_votes": 3
      }
    ],
    "paging": {
      "total_results": 27,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2019140/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "hairtype",
          "name": "Hair Type",
          "type": "tag",
          "values": [
            {
              "label": "Straight Hair",
              "count": 4
            },
            {
              "label": "Wavy Hair",
              "count": 2
            }
          ],
          "display_values": [
            "Straight Hair",
            "Very Curly Hair",
            "Wavy Hair"
          ]
        }
      ],
      "rating_histogram": [
        6,
        15,
        24,
        26,
        508
      ],
      "review_histogram": [
        6,
        15,
        24,
        26,
        508
      ],
      "rating_count": 579,
      "review_count": 579,
      "average_rating": 4.75,
      "recommended_ratio": 0.89,
      "media": [
        {
          "id": "444747548",
          "review_id": 444747626,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/vlspy5nyyxqv98oh6yhq.jpg",
          "headline": "Best styling product live the results",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Chris",
          "created_date": 1676734712723
        }
      ],
      "faceoff_positive": {
        "comments": "I love Blind Barber! I recently purchased this and i was sent the wrong bottle size and i emailed the customer service center and they very quickly responded and sent me the right size! They are very easy to contact, they resolve your problems quickly and with no hassle! I received my new bottle in just a couple days.  as for the spray, i have naturally straight hair, i spray a little in my damp hair and it gives it such a great curl, i've tried a lot of sea salt sprays but this is the best one out there! and it seems very concentrated, with other brand i would have to use 5 times as much to get similar results.  do yourself and your hair a favor and buy this!",
        "headline": "Love It!",
        "rating": 5,
        "ugc_id": 546932967
      },
      "faceoff_negative": {
        "comments": "I recently repurchased this product because I was happy with my original purchase. The product did what it was supposed to do providing volume and texture to my hair. The first thing that I noticed when the product arrived was that the spray bottle had changed, purportedly for environmental reasons. I was all for that, however, I discovered that without any notification the volume of the bottle had been reduced from 6 fl.oz to 5 fl oz and this despite the fact that the price had increased. Less product for more money. I was displeased, but still willing to continue purchasing the product- that is until the spray bottle stopped working. I could not get the pump to deliver any spray. I figured it was just clogged and tried soaking the pump in warm, soapy water which did nothing. I then soaked it in alcohol - still nothing. There was no evidence that the nozzle was clogged. It just would not work. As a result, I was left with a half full bottle that I could not use. Applying the liquid with my hands proved unsatisfactory. I had to toss the bottle out. I will not purchase this product again for fear of the same result next time. It's unfortunate because, as I said, I liked the product.",
        "headline": "Good Product Rendered Useless By Bad Spray Bottle",
        "rating": 2,
        "ugc_id": 468583151
      },
      "name": "40 Proof Sea Salt Textured Hold Spray",
      "native_review_count": 27,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 552,
      "locale": "en_US"
    }
  }
}