{
  "product_id": "pimprod2039811",
  "product_url": "https://www.ulta.com/p/melting-balm-cleanser-pimprod2039811",
  "extracted_at": "2025-09-23T04:31:57.438237+00:00",
  "product_name": "BYOMAMelting Balm Cleanser",
  "brand": "BYOMA",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Cleansing Balms & Oils"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "cleansing-balms--oils"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "15.99",
  "availability": "in_stock",
  "rating_avg": "4.1",
  "rating_count": "252",
  "images": [
    "https://media.ulta.com/i/ulta/2611686?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2611686?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611686_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611686_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611686_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611686_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611686_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2611686_vid01/thumbs/df02dc68-8bf9-406b-b521-f4f4212d4eab?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingBYOMA Melting Balm Cleanser is a buttery-soft, hydrating cleansing balm that effectively melts away makeup & impurities to strengthen the skin barrier",
  "details": "DetailsBenefitsDeeply hydrates while effectively melting away even the most stubborn makeup, SPF and impuritiesBarrier Lipids help restore the skin barrierRestorative blend of Olive Fruit, Sea Buckthorn + Grapeseed Oils leave skin nourished and hydratedFeaturing Niacinamide to balance and control oilinessSoft, velvety texture melts into an oil upon contact with skin for a seamless, sensorial, silky-soft cleansing experienceDermatologist tested & approved skincareAlcohol & fragrance-freeRecyclable bottlesClinically proven to strengthen skin barrier functionClinically proven to improve skin texture + calm rednessClinically proven to reduce the appearance of wrinkles by up to 38%FeaturesOils nourish and hydrate skin, without clogging pores or leaving an oily residue.Restorative and lightweight formula works with Niacinamide to help balance skin and control oiliness.Soft, velvety texture melts into an oil on contact with skin for a sensorial cleansing experience, leaving skin perfectly cleansed, soothed and silky-soft.Key IngredientsBarrier Lipids to help restore the skin barrierRestorative blend of Olive Fruit, Sea Buckthorn + Grapeseed Oils leave skin nourished and hydratedFeaturing Niacinamide to balance and control oilinessItem 2611686How To UseScoop a pea sized amount onto dry skin and gently massage in circular motions. Add a splash of warm water to emulsify and rinse thoroughly. Follow with preferred second cleanser.Precautions: Eye irritant.IngredientsOlea Europaea (Olive) Fruit Oil, Vitis Vinifera (Grape) Seed Oil, Sorbeth-30 Tetraoleate, Cetyl Ethylhexanoate, Synthetic Wax, Orbignya Oleifera Seed Oil, Niacinamide, 1,2-Hexanediol, Ceramide NP, Hippophae Rhamnoides Oil, Sphingolipids, Tocopheryl Acetate, Palmitic Acid, Rosmarinus Officinalis (Rosemary) Leaf Oil, Stearic Acid, Myristic Acid.",
  "how_to_use": "Scoop a pea sized amount onto dry skin and gently massage in circular motions. Add a splash of warm water to emulsify and rinse thoroughly. Follow with preferred second cleanser.Precautions: Eye irritant.",
  "ingredients": [
    "Olea Europaea (Olive) Fruit Oil",
    "Vitis Vinifera (Grape) Seed Oil",
    "Sorbeth-30 Tetraoleate",
    "Cetyl Ethylhexanoate",
    "Synthetic Wax",
    "Orbignya Oleifera Seed Oil",
    "Niacinamide",
    "2-Hexanediol",
    "Ceramide NP",
    "Hippophae Rhamnoides Oil",
    "Sphingolipids",
    "Tocopheryl Acetate",
    "Palmitic Acid",
    "Rosmarinus Officinalis (Rosemary) Leaf Oil",
    "Stearic Acid",
    "Myristic Acid"
  ],
  "extended_contents": {},
  "tags": {
    "product_type": [
      "cleanser",
      "moisturizer",
      "lip gloss",
      "oil"
    ],
    "skin_type": [
      "oily",
      "dry",
      "mature"
    ],
    "finish": [
      "sheer",
      "creamy",
      "oil"
    ],
    "ingredients": [
      "niacinamide",
      "ceramides",
      "synthetic"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "dermatologist-tested",
      "fragrance-free",
      "spf",
      "anti-aging",
      "hydrating",
      "purifying"
    ],
    "category": []
  },
  "reviews": {
    "product_id": "pimprod2039811",
    "total_reviews": 252,
    "reviews": [
      {
        "review_id": 561050893,
        "rating": 4,
        "headline": "Mmm",
        "comments": "I have mixed feelings about this cleanser. I have been using this cleanser for a couple days now. For starters i have combination skin. So, what i do like about it is it takes out all the excess oil my skin builds up throughout the day without it making me feel dry. What i don't like about it is i have super clear skin, but i am starting to believe this product is making me break out. i got 3ish - 4 pimples in one day and MIND YOU i rarely break out. I guess breaking out is bretter than being allergic to it.. It does have a stinky smell and i was worried the smell would stick to my face but it honestly doesnt.",
        "nickname": "cori",
        "location": "idaho",
        "created_date": 1756065743367,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559794505,
        "rating": 2,
        "headline": "Decent product but smells awful",
        "comments": "Granted, I may be biased as I have been using another cleansing balm for years. I tried this one because my favorite was out of stock and I enjoy other Byoma products. \n\nI was immediately horrified by the terrible chemical smell this product has. The smell is so bad, I had no desire to use it on my face whatsoever. Like I was questioning my purchasing choices, the smell was so bad. \n\nIf you can get past the smell, the cleansing balm gets the job done. The texture of this balm is also not my favorite; there is something very stiff about it. It's hard to describe. But all in all, it is a cleansing balm and it will work decently. \n\nThis product is somewhat of a letdown compared to Byoma's other products, in my opinion.",
        "nickname": "K",
        "location": "Hagerstown",
        "created_date": 1754610976220,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559774826,
        "rating": 2,
        "headline": "Bad for my skin",
        "comments": "I guess my skin is mote sensitive than I thougjt, but probably fine dor other skin types.",
        "nickname": "Arlo",
        "location": "New Hope",
        "created_date": 1754583507684,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558432972,
        "rating": 5,
        "headline": "Great product",
        "comments": "Definitely a great way to remove all make up and it leaves your face feeling fresh and hydrated.  It also smells delicious.",
        "nickname": "Rochel'le",
        "location": "San Antonio, TX",
        "created_date": 1753735357445,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558352327,
        "rating": 5,
        "headline": "Love this product!!",
        "comments": "It gets off my 3 layers of waterproof mascara in like a minute, would definitely recommend to anyone who would listen.",
        "nickname": "Evelyn",
        "location": "Denver",
        "created_date": 1753563125730,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558116255,
        "rating": 1,
        "headline": "So bad",
        "comments": "After seeing some good reviews & having a great experience with other products from the brand I wanted to give this cleanser a try. I only used it once & will be making a return. The product smells terrible! The texture is really strange too, it almost pills up like drying glue & I could barely spread it across my face (using a pea sized amount like the instructions say)! It smelt & felt so disgusting to the point where I almost think I got a product from a defective batch or something.",
        "nickname": "Holly",
        "location": "Indiana",
        "created_date": 1753361516786,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556082445,
        "rating": 3,
        "headline": "It's ok",
        "comments": "The melting balm works ok. Wish there wasnt a minty feel and smell. Will finish the product, but will not be repurchasing.",
        "nickname": "Jay",
        "location": "Pennsylvania",
        "created_date": 1751328203205,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554495469,
        "rating": 4,
        "headline": "good balm, wish it smelled better",
        "comments": "left my skin feeling clean and soft. I double cleanse and love the way this product left my my skin. No dry patches and I found it didn't irritate my skin at all. I do not use it on my eyes. The smell is strong, it reminds me of petroleum jelly, I'm not a fan but I can deal with it.",
        "nickname": "lex",
        "location": "kalamazoo michigan",
        "created_date": 1749033818042,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553976160,
        "rating": 3,
        "headline": "Not loving it",
        "comments": "I should've read more reviews other than an article I saw online that promoted this. I'm used to a melting balm removing all of your make up. I'm traveling so I thought this would be a good idea to purchase this as they didn't have the Neutrogena melting bomb. What a waste. It couldn't even remove my NXY eyeliner. For this price it could have at least done that. If this ever happens again, and I don't see the Neutrogena one, I'll just pay a little bit more and buy the small Clinique one.",
        "nickname": "Lo",
        "location": "MS",
        "created_date": 1748226844569,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553237115,
        "rating": 4,
        "headline": "Gets the job done!",
        "comments": "Smells great, a little goes a long way. Very effective at removing eyeliner and mascara. Packsging is a bit wasteful imo",
        "nickname": "Jade",
        "location": "Miami, FL",
        "created_date": 1747096669292,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552972453,
        "rating": 5,
        "headline": "Winner!🏆Best Gentle Makeup Remover",
        "comments": "Wow — this is an absolute must-have for anyone who wears eyeshadow or mascara! This remover truly gets all your makeup off. Seriously, just rub it on, and you can even leave it for a couple of minutes while you do other things before rinsing — it takes off every bit of eyeshadow and makeup. The texture feels amazing on the skin, and it's so gentle. I'm completely obsessed! This is hands-down the best makeup remover I've ever used, and I highly recommend it. Btw, I have dry, sensitive skin and have had no problems for two months. Thumbs up. Highly recommend. Love the consistency!",
        "nickname": "Dani",
        "location": "Long Island, NY",
        "created_date": 1746573770851,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552771693,
        "rating": 5,
        "headline": "my favorite balm cleanser!",
        "comments": "Ive loved this product for a while, I think Im on my third container. It removes makeup in one go and is the perfect pre cleanser step. I know some people think it has a smell but its super minimal and doesnt last on your face",
        "nickname": "clareg19",
        "location": "Orange County, CA",
        "created_date": 1746215107185,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552526124,
        "rating": 5,
        "headline": "Good cleanser",
        "comments": "I've been using this cleanser and personally really like it! I know a lot of people mention it makes their eyes blurry, but the description clearly states that it's an eye irritant — so I wouldn't recommend using it to remove mascara or eye makeup. As a general face cleanser, though, I think it works really well. It leaves my skin feeling clean without being overly drying, and I absolutely love the scent! It does not smell like Vicks or wet dog.",
        "nickname": "Madgie",
        "location": "Phoenix, AZ",
        "created_date": 1745760135714,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551788315,
        "rating": 1,
        "headline": "Absolutely god awful!",
        "comments": "I used this product as a balm to remove my makeup and first off it smells exactly like vicks vaporub. second it literally irritated my face so bad. I have dry patches under my eyes and on parts of my face from psorasis and this made it 10x worse. Please do not buy it, go with the elf removing balm, its cheaper also.",
        "nickname": "hailey m",
        "location": "lexington, ky",
        "created_date": 1744768214709,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551202343,
        "rating": 5,
        "headline": "This stuff is great for taking off makeup!",
        "comments": "I love how easy it is to take off my makeup with this. It saves me cotton pads! The scent is natural/herbal nothing crazy or offputting. I love how it emulsifies with water so you dont have to take it off with a towel if youre not wearing super heavy makeup. I use this when I double cleanse. The packaging is a little bulky but other than that this product is great. Will repurchase!",
        "nickname": "Sarah",
        "location": "El paso, tx",
        "created_date": 1744082091015,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550824284,
        "rating": 3,
        "headline": "it's okay",
        "comments": "ive always liked removing my makeup with cleansing balms compared to just oil cleansers because i feel like it does a better job. ive always used the pixi brands balm cleanser, but wanted to find something different since pixi is more expensive and you dont get much product from it bc its in a duo pack with their regular cleanser. decided to try this out since it was cheaper, and all over tiktok people rave about this brand. honestly dissapointed with it. it removes makeup pretty well besides mascara, i didnt even use a waterproof mascara and it struggled to get it off ( i had to wash my face 2x with the balm & then regular cleanser). It was also very irritating to my eyes, even when I wasnt wearing mascara which with the pixi balm I've used was never irritating.",
        "nickname": "bri",
        "location": "muskegon, mi",
        "created_date": 1743524035916,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550214475,
        "rating": 3,
        "headline": "50/50",
        "comments": "product worked decent for taking face makeup off once the weird top layer of product came off. Kind of expensive for the amount you are getting, but its one of the balm cleansers that doesnt make ur eyes blurry.",
        "nickname": "Leah",
        "location": "New York",
        "created_date": 1743180720135,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550077608,
        "rating": 5,
        "headline": "Love this to take off makeup",
        "comments": "I love that it worke great to take off waterproof makeup and also gets milky when mixed with water. Great product.",
        "nickname": "Sarahi",
        "location": "El paso, tx",
        "created_date": 1743140871328,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 548933253,
        "rating": 5,
        "headline": "I do think it works great to remove makeup",
        "comments": "I do the two step wash.  I use Byoma melting bomb for mg first wash to remove makeup.  Then I was with my cerave face wash.  My face feels more moisturized and completely clean by dissolving the slather of makeup first!",
        "nickname": "Nancy",
        "location": "Addison, Texas",
        "created_date": 1742234445643,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547874467,
        "rating": 3,
        "headline": "Product fine, packaging NOT",
        "comments": "As a cleansing balm, it works like it supposed to. My complaint is w/ packaging. It's very deceiving. Comes in a large square container, open it up and see a very small amount of product. So much waste. Either fill the entire container or shrink it",
        "nickname": "Ellen",
        "location": "Los Angeles",
        "created_date": 1741290326110,
        "bottom_line": "No",
        "helpful_votes": 10,
        "not_helpful_votes": 1
      }
    ],
    "paging": {
      "total_results": 109,
      "pages_total": 6,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2039811/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Combination",
              "count": 4
            },
            {
              "label": "Dry",
              "count": 3
            },
            {
              "label": "Normal",
              "count": 3
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        18,
        18,
        27,
        44,
        145
      ],
      "review_histogram": [
        18,
        18,
        27,
        44,
        145
      ],
      "rating_count": 252,
      "review_count": 252,
      "average_rating": 4.11,
      "recommended_ratio": 0.86,
      "media": [
        {
          "id": "547874485",
          "review_id": 547874467,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/mgy3du47jfut4oo2xd9q.jpg",
          "headline": "Product fine, packaging NOT",
          "rating": 3,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Product is same amount as what's found in this smaller container",
          "nickname": "Ellen",
          "created_date": 1741290326110
        },
        {
          "id": "547874267",
          "review_id": 547874467,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/bpr0tztxmwcvb7hpr5xm.jpg",
          "headline": "Product fine, packaging NOT",
          "rating": 3,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Product is same amount as what's found in this smaller container",
          "nickname": "Ellen",
          "created_date": 1741290326110
        },
        {
          "id": "547874484",
          "review_id": 547874467,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/u2k5b651cn55onqravpg.jpg",
          "headline": "Product fine, packaging NOT",
          "rating": 3,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Nice large container which you think is filled with product",
          "nickname": "Ellen",
          "created_date": 1741290326110
        },
        {
          "id": "537018784",
          "review_id": 537018859,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ctgbcmseyowugb8iqkf4.jpg",
          "headline": "Would never buy this product again",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "No filter, same day as other photo, taken at 11:30p",
          "nickname": "Cayla",
          "created_date": 1730253325094
        },
        {
          "id": "537018860",
          "review_id": 537018859,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/evtrackpuojbtlwdb4qo.jpg",
          "headline": "Would never buy this product again",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Taken at 1pm",
          "nickname": "Cayla",
          "created_date": 1730253325094
        },
        {
          "id": "467771572",
          "review_id": 467771642,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/vj58orolmmkbypulx9bv.jpg",
          "headline": "Unique",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Already melted",
          "nickname": "Dani991",
          "created_date": 1681239444000
        },
        {
          "id": "467771672",
          "review_id": 467771642,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/b8g326w9xmdm3pworpuu.jpg",
          "headline": "Unique",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Consistently",
          "nickname": "Dani991",
          "created_date": 1681239444000
        },
        {
          "id": "467771752",
          "review_id": 467771695,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/i6kcx5y7agobqxsrui5x.jpg",
          "headline": "It works great!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "It's the best cleansing balm I've ever tried!",
          "nickname": "Matt1",
          "created_date": 1681137709000
        }
      ],
      "faceoff_positive": {
        "comments": "I was impressed when I first opened the package. The packaging is great and I was impressed instantly with the logo and meaning of the brand. The yellow square caught my attention. The texture is light and has a great soft texture when I applied to my skin. It's perfect for removing makeup. I got me a scoop of the balm and rubbed it onto my face and jawline each evening for the past few weeks. I have to say the feeling afterwards left my skin instantly feeling so soft and clean. It's gentle for all skin types. If you are prone to having dry skin you especially will love this. I have combo skin and my skin loves it. A little goes a long ways, and it didn't irritate my eyes or my skin. I have began to notice my skin isn't as dry as it use to be. My face feels soft and well moisturized since trying out this cleansing balm. This brand is in all the magazines and social media so I was super excited to try it out and yes it's worth the purchase and it's super affordable and looks nice and sleek on my bathroom sink! I'm definitely going to try more products from this brand!",
        "headline": "It works great!",
        "rating": 5,
        "ugc_id": 467771695
      },
      "faceoff_negative": {
        "comments": "So I've been on the hunt for a cleansing balm that is microplastics free, and this is one that came up so I decided to try it. \n\nUm, it's really really thick. Not in a good way like the \"oh this'll melt into the skin really nice and remove everything\" way, but in a bad way like \"oh crap I forgot my squeezy tube lip balm in my car in the middle of winter and now I need to put it in my bra for five minutes to warm it up\" way. And even then it STILL doesn't melt enough. You'd think that with it being so thick, it would at least melt everything away, right? Wrong! It doesn't remove makeup that well, and I don't wear a ton of makeup. I've used it on heavy makeup days, light makeup days, and days where all Ive put on is sunscreen, and it's never really felt totally clean, and I would have to double cleanse with my regular cleanser, which because I have very dry and sensitizing skin I don't use a gel cleanser, I use a cream cleanser. \n\nIt also takes a long time to wash off completely, and even when it's washed off completely the smell of it lingers. A lot of people have said it smells like Vicks and it kind of does, but I feel it smells more like Amrut Malam which is an Indian ointment which is used for everything by Indians in the same way Latines use Vicks (I'm Indian and Latine, so these have been staples in my house and while they do smell similar, it's still a very different scent.) Anyways, whether it smells more like one or the other isn't that important, it just smells medicinal in like your family's super secret cold remedy from the old country. So it's an uncomfortable smell to have lingering on your face even after going in with your regular cleanser. \n\ntldr: It's a very thick and impossible to melt, and barely warms up enough to spread across the face. It's hard to wash off, and doesn't remove makeup or sunscreen well, and has a lingering cold medicine scent.",
        "headline": "It's not it bro",
        "rating": 1,
        "ugc_id": 479971277
      },
      "name": "Melting Balm Cleanser",
      "native_review_count": 109,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 143,
      "locale": "en_US"
    }
  }
}