{
  "product_id": "pimprod2043206",
  "product_url": "https://www.ulta.com/p/superfood-facial-cleansing-bar-pimprod2043206",
  "extracted_at": "2025-09-23T05:21:07.403340+00:00",
  "product_name": "Carbon Theory.Superfood Facial Cleansing Bar",
  "brand": "Carbon Theory.",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wash"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "9.99",
  "availability": "in_stock",
  "rating_avg": "4.6",
  "rating_count": "27",
  "images": [
    "https://media.ulta.com/i/ulta/2620554?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2620554?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2620554_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2620554_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2620554_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2620554_alt04?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryCarbon Theory's Supafood Facial Cleansing Bar is a vitamin rich cleanser, containing Cucumber, Kale and Spinach extract to support a healthy, glowing complexion. Suitable for sensitive skin.",
  "details": "DetailsBenefitsGently soothes and hydrates your complexionSuitable for sensitive skinVeganKey Ingredientsucumber, Kale and Spinach Extract: Rich in Omega 3 fatty acids that support a healthy, glowing complexion and soothe sensitive skinShea Butter: Keeps skin nourished and hydratedResearch ResultsEvery skin is different, many customers see improvement in their skin in only 7 days but Carbon Theory. recommends using the products for 3-4 weeks for best results.Item 2620554How To UseActivate cleansing bar with warm water, apply active foam to a wet face avoiding eyes and leave to penetrate skin for 30 seconds before rinsing thoroughly. Gentle enough to use twice daily.If product enters the eyes, rinse well with warm water. Do not apply to irritated or broken skin. If irritation occurs, discontinue use.IngredientsSodium Palmate, Sodium Palm Kernelate, Aqua (Water), Glycerin, Parfum (Fragrance), Butyrospermum Parkii (Shea) Butter, Sodium Citrate, Tetrasodium Glutamate Diacetate, Limonene, Citric Acid, Sodium Chloride, Spinacia Oleracea (Spinach) Extract, Cucumis Sativaus (Cucumber) Fruit Extract, Sodium Benzoate, Potassium Sorbate, CI 77891 (Titanium Dioxide), CI 77288 (Oxide), CI 19140 (Yellow 4), CI 42090 (Blue 2).",
  "how_to_use": "Activate cleansing bar with warm water, apply active foam to a wet face avoiding eyes and leave to penetrate skin for 30 seconds before rinsing thoroughly. Gentle enough to use twice daily.If product enters the eyes, rinse well with warm water. Do not apply to irritated or broken skin. If irritation occurs, discontinue use.",
  "ingredients": [
    "Sodium Palmate",
    "Sodium Palm Kernelate",
    "Aqua (Water)",
    "Glycerin",
    "Parfum (Fragrance)",
    "Butyrospermum Parkii (Shea) Butter",
    "Sodium Citrate",
    "Tetrasodium Glutamate Diacetate",
    "Limonene",
    "Citric Acid",
    "Sodium Chloride",
    "Spinacia Oleracea (Spinach) Extract",
    "Cucumis Sativaus (Cucumber) Fruit Extract",
    "Sodium Benzoate",
    "Potassium Sorbate"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser"
    ],
    "skin_type": [
      "sensitive"
    ],
    "finish": [
      "dewy",
      "foam"
    ],
    "ingredients": [
      "fragrance"
    ],
    "brand": [
      "mid-range",
      "budget"
    ],
    "special_features": [
      "vegan",
      "soothing",
      "purifying"
    ]
  },
  "reviews": {
    "product_id": "pimprod2043206",
    "total_reviews": 27,
    "reviews": [
      {
        "review_id": 547502207,
        "rating": 5,
        "headline": "An honest review, this wasn't gifted/paid by the company!",
        "comments": "I have dry skin & live in an area with hard water, so most hydrating products aren't strong enough to fight both the water and my dry skin. Hard water can also make bar soaps leave a waxy residue on your skin. Which makes it all the more baffling that I even tried this product in the first place. It's pretty cheap & their Anti-Breakout bar is highly rated, so I figured I'd give it a shot & if it didn't work just get my money back.\nI'm not lying when I say in my nearly 15 years of trying to find a hydrating face wash this is the ONLY ONE that works for me! My skin isn't terrible, so the fact I could never find a good face wash has been frustrating. I've tried drug store, name brand, knockoff, specialized, cheap, expensive, and every other kind of face wash out there, but none did what I needed. This one does everything I've been looking for at an absolute steal of a price!\nAny other face wash would either clean my skin or hydrate it, but never both. This one DOES! I like the smell and it cleans my skin without making it feel tight. I still use a moisturizer afterwards but the times I've skipped it my face never dried out like other face washes did. It suds really well and since it's a bar there's a ton of it. If you buy a soap saver or a tin it lasts forever! I bought this months ago and even after washing off stage makeup from theatre performances I'm only just now buying another. \nEveryone's skin is different but I genuinely can't believe how well this works for me. Seriously at least give it a shot, you'll probably also be surprised! I wish I had more words to describe this bar but it all boils down to this: IT! WORKS!",
        "nickname": "Katherine",
        "location": "Oklahoma",
        "created_date": 1740736247585,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 1
      },
      {
        "review_id": 537618968,
        "rating": 1,
        "headline": "Ugh, it burns",
        "comments": "This is super irritated to the eyes, nose, lips, mouth. Was just not meant to be used on the face. Has a super strong smell. Leaves skin feeling tight. Just overall unpleasant.",
        "nickname": "Rebekah",
        "location": "Columbia, MD",
        "created_date": 1731292100417,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 2
      },
      {
        "review_id": 524145938,
        "rating": 3,
        "headline": "Worked for a bit",
        "comments": "Caused allergies on my skin, and eyes there is no way to avoid the eyes if your washing your face. It's been 3 days that my eyes feel terrible. It worked on my skin for 2 'months it would clean and i felt good after that my skin would get so dry and and it would have like a slimly feel to it just like \"olay\" bar soaps < hate that. caused break outs that all i would use. I threw it out. I hope they make one for sensative skin and that it doesnt cause allergies to the eyes.",
        "nickname": "Kim",
        "location": "Texas",
        "created_date": 1719890336465,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 510919238,
        "rating": 5,
        "headline": "Exceeded my Expectations",
        "comments": "The Carbon Theory Superfood Cleansing Bar was a gifted by Carbon Theory. I was impressed with the results. I sometimes get acne when I eat Gluten because of a gluten allergy. This bar calmed my skin and made it glow and helped reduce the irritation. I only use it at night for three days a week to keep from drying out my skin. The scent is not the best but it does work and was impressed.",
        "nickname": "Steph",
        "location": "Maryland",
        "created_date": 1712681077669,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 2
      },
      {
        "review_id": 510886343,
        "rating": 5,
        "headline": "Feel so clean",
        "comments": "I'm loving the superfood cleansing bar gifted by carbontheory! Not only have used it on my face but also have been using it as a body wash. It lathers so nicely and makes my skin feel super clean. It kinda dries my skin out but nothing moisturizer can't fix. My blemishes have also minimized.",
        "nickname": "Miya",
        "location": "Ohio",
        "created_date": 1712631936122,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 2
      },
      {
        "review_id": 510795811,
        "rating": 5,
        "headline": "Great for on the go",
        "comments": "I was gifted by carbontheory to review this product for free! This facial cleansing bar is perfect for traveling and great for on the go! I always hate bringing a huge bottle of face wash so this is perfect! I have sensitive skin and was concerned that it would irritate my skin. But it left my skin feeling amazing. It doesn't dry out my skin and leaves my skin looking glowy. It helped with my redness as well Definitely will be my go to when traveling",
        "nickname": "Jenny",
        "location": "FL",
        "created_date": 1712567912273,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 510775704,
        "rating": 5,
        "headline": "Works great",
        "comments": "I like the CARBON THEORY Superfood Cleansing Bar. Doesn't dry my skin out or cause any breakouts. Leaves my skin feeling clean and hydrated. I can definitely tell a difference after using this product. Highly recommend. Gifted by CARBON THEORY",
        "nickname": "Tiffany",
        "location": "Lexington, Kentucky",
        "created_date": 1712532075968,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 510698883,
        "rating": 5,
        "headline": "Works well for my skin",
        "comments": "I have very oily skin so cleansing bars are always a good option for me. This one is really good at cleaning the dirt off my face without leaving my skin feeling very dry or stripped. I like the scent, not overwhelming at all. Gifted by carbon theory",
        "nickname": "Nikki",
        "location": "New york, NY",
        "created_date": 1712432654342,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 510456276,
        "rating": 5,
        "headline": "Love it!!",
        "comments": "Complimentary from Carbon Theory \nI'm loving this cleanser!! The scent is fresh and not overwhelming. My face feels clean and moisturized, but not greasy. Sometimes my skin can be a bit sensitive but I haven't had any reaction to this! Storing it has been my only problem.",
        "nickname": "Morgan",
        "location": "Nashville, TN",
        "created_date": 1712163237168,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 510182808,
        "rating": 5,
        "headline": "Good",
        "comments": "Upon unwrapping the Carbon Theory Superfood Cleansing Bar, I was greeted with a subtle yet refreshing fragrance that hinted at its botanical ingredients. The texture was smooth and luxurious, with just the right amount of exfoliating particles to provide a gentle scrub without being abrasive.",
        "nickname": "N123",
        "location": "San Jose, CA",
        "created_date": 1711820993537,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 510122980,
        "rating": 5,
        "headline": "I would buy this product again!",
        "comments": "After using SUPERFOOD CLEANSING BALM as part of my skincare routine, I noticed a significant improvement in the overall appearance and texture of my skin! It looked brighter, smoother, and more even-toned, with a noticeable reduction in redness and irritation. The star ingredients, including kale, and spinach, are packed with antioxidants and vitamins that help to protect the skin from environmental damage and promote a healthy, radiant complexion. These superfoods work in harmony to detoxify and rejuvenate the skin, leaving it feeling clean, soft, and refreshed! The product was gifted by carbontheory.",
        "nickname": "Kate",
        "location": "Menlo Park, CA",
        "created_date": 1711742948649,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 509927123,
        "rating": 5,
        "headline": "Love it! Amazing ingredients!",
        "comments": "I chose this bar offered by carbontheory because I believe soap bars save money compared to soap in bottles. I love the ingredients. I am very picky with facial cleansers as I have dry skin and most of the times my skin gets too dry after cleanser. I like that it hydrates my skin and looks like cleansed my skin from my make up :)",
        "nickname": "Shyrailym",
        "location": "Fort Lauderdale, Florida",
        "created_date": 1711588197694,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 509854842,
        "rating": 5,
        "headline": "Love love",
        "comments": "Honestly after using this  cleansing bqr my skin has felt so refreshed and looks so amazing! I usually have never used a bar but honestly it's actually really great for my skin it leaves it glowy and moisturized. Gifted by carbontheory",
        "nickname": "Nikki",
        "location": "Virginia",
        "created_date": 1711498283389,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 509838613,
        "rating": 5,
        "headline": "super smooth skin",
        "comments": "i was gifted by Carbon Theory for free in exchange for my honest review!! i actually have enjoyed using this! i was hesitant because of it being a bar, but it's made my skin so soft! i feel like my texture has just melted away. the only thing i don't like about the product is figuring out how to store it. i don't want to leave it out but when u put it back in the bag it gets stuck to the sides. i'm happy with this tho and i think it's a really great product!",
        "nickname": "lauren",
        "location": "philadelphia",
        "created_date": 1711480390864,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 509795133,
        "rating": 5,
        "headline": "Love it",
        "comments": "I was gifted by theory this cleansing bar and I'm happy I was! As someone always on the lookout for effective skincare solutions, I recently tried the Carbon Theory Superfood Cleansing Soap Bar, and I must say, it exceeded my expectations. Firstly, the packaging is sleek and environmentally friendly, which already earns points in my book. Upon opening, the bar emits a subtle, pleasant scent, not overpowering like some other products. The lather is rich and creamy, making it feel luxurious on the skin. I appreciate that it doesn't strip away moisture, leaving my skin feeling clean but not dry or tight. One of the standout features is its ability to combat blemishes and acne. The inclusion of charcoal and tea tree oil, known for their clarifying properties, helps to keep breakouts at bay without being too harsh on the skin. After consistent use, I've noticed a significant improvement in the overall texture and clarity of my skin. It feels smoother, looks brighter, and any pesky blemishes have noticeably reduced in size and redness. I also appreciate that it's suitable for all skin types, including sensitive skin like mine. It's gentle yet effective, making it a staple in my skincare routine. In conclusion, the Carbon Theory Superfood Cleansing Soap Bar is a must-try for anyone looking for a gentle yet powerful cleanser that delivers results. It's a skincare gem that I'll definitely be repurchasing.",
        "nickname": "Kayla",
        "location": "Cypress, TX",
        "created_date": 1711471199459,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 509794332,
        "rating": 5,
        "headline": "Would buy again for sure",
        "comments": "I chose this bar because it says it's good for breakouts and it's also cucumber which is one of my favorites especially for the benefits it has on the skin. It seems to be great so far. It left my skin feeling refreshed and clean. I like it. Great experience. Will continue using. Was gifted by carbontheory.",
        "nickname": "Elizabeth",
        "location": "El Paso, TX",
        "created_date": 1711470196538,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 509752915,
        "rating": 4,
        "headline": "Great",
        "comments": "I am loving this awesome cleansing bar, I struggle with mild acne and an oily face. I mainly use this product later in the day right before my bedtime, a quick and rich lather foams up my face entirely and has my skin feeling soft and comfortable all night long. Gifted by carbontherory",
        "nickname": "Jay99",
        "location": "Los Angeles",
        "created_date": 1711422143690,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 509750640,
        "rating": 5,
        "headline": "smoothes and cleanses",
        "comments": "I chose this Carbon Theory Superfood Facial Cleansing Bar to clean my pores and reduce clogged pores and acne . After using this bar I noticed my skin feeling smooth and soft with less build up in my pores . #carbontheory #complimentary #giftedbycarbonyheory #adcarbontheory #superfood",
        "nickname": "Ashley",
        "location": "California",
        "created_date": 1711418416947,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 509748114,
        "rating": 5,
        "headline": "Really nice product!! packaging is a game changer",
        "comments": "As an acne prone girl, the superfood facial cleansing bar was something i wanted to try as carbon theory is an acne safe brand! i usually don't like bar soaps but the packaging it comes in has a zip at the top which really makes it a lot easier to preserve product! my face feels super clean and tight after using it! offered by carbontheory",
        "nickname": "Haylee",
        "location": "Illinois",
        "created_date": 1711415388161,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 509719786,
        "rating": 3,
        "headline": "Squeaky Clean Feeling with a Couple Flaws",
        "comments": "I was really drawn to this product because of its green ingredients. For a bar product, I'm pleasantly surprised by the amount of lather this cleanser has. While it's not as sudsy as your typical liquid cleanser, I'm still able to work the product into my skin for 1-2 minutes before rinsing off. I'm left with that 'squeaky' clean feeling without feeling stripped of moisture (though I have oily skin, so those with drier skin may have a different experience). The biggest downside for me is storage...it's much easier to stow away or travel with a bottled cleanser than it is an exposed bar of soap. I'm not sure if the purpose of the design is to minimize waste because the product still arrived in plastic packaging. Also worth noting that this WILL sting your eyes...yes, the packaging warns you of this, but as someone who likes to massage cleanser on my face for 60+ seconds, this has been a nuisance. \n\ncomplimentary from carbontheory",
        "nickname": "Taylor",
        "location": "St. Louis, MO",
        "created_date": 1711392788773,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 1
      }
    ],
    "paging": {
      "total_results": 27,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2043206/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        1,
        0,
        2,
        2,
        22
      ],
      "review_histogram": [
        1,
        0,
        2,
        2,
        22
      ],
      "rating_count": 27,
      "review_count": 27,
      "average_rating": 4.63,
      "recommended_ratio": 0.92,
      "media": [
        {
          "id": "510775862",
          "review_id": 510775704,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/wd7nrernbdfdbodgtnfc.jpg",
          "headline": "Works great",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Tiffany",
          "created_date": 1712532075968
        },
        {
          "id": "510456281",
          "review_id": 510456276,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/cvueq5ssmulzd6cbiibg.jpg",
          "headline": "Love it!!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Morgan",
          "created_date": 1712163237168
        },
        {
          "id": "509927124",
          "review_id": 509927123,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/jnzzszmockadpdn4msde.jpg",
          "headline": "Love it! Amazing ingredients!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Shyrailym",
          "created_date": 1711588197694
        },
        {
          "id": "509750642",
          "review_id": 509750640,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/csyxm6xma7eqq1jhc5ii.jpg",
          "headline": "smoothes and cleanses",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Ashley",
          "created_date": 1711418416947
        },
        {
          "id": "509750641",
          "review_id": 509750640,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/sozahnb5kkk44ozqojfx.jpg",
          "headline": "smoothes and cleanses",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Ashley",
          "created_date": 1711418416947
        },
        {
          "id": "509717599",
          "review_id": 509717847,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/spweggssafnttqodpqkq.jpg",
          "headline": "Hydrating cleanser",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Dia",
          "created_date": 1711390818981
        },
        {
          "id": "509710201",
          "review_id": 509710200,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/kwybxxmhalrid9hy0zoh.jpg",
          "headline": "superfood facial bar",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Khadija",
          "created_date": 1711386699964
        },
        {
          "id": "509662748",
          "review_id": 509662813,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/k5iiz45f7dszwa5oceph.jpg",
          "headline": "Would purchase again!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Very glowy after use!!",
          "nickname": "Anna",
          "created_date": 1711326686840
        },
        {
          "id": "509662786",
          "review_id": 509662813,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/fe60v3pstjvhx8j3v4yq.jpg",
          "headline": "Would purchase again!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Anna",
          "created_date": 1711326686840
        }
      ],
      "faceoff_positive": {
        "comments": "I have dry skin & live in an area with hard water, so most hydrating products aren't strong enough to fight both the water and my dry skin. Hard water can also make bar soaps leave a waxy residue on your skin. Which makes it all the more baffling that I even tried this product in the first place. It's pretty cheap & their Anti-Breakout bar is highly rated, so I figured I'd give it a shot & if it didn't work just get my money back.\nI'm not lying when I say in my nearly 15 years of trying to find a hydrating face wash this is the ONLY ONE that works for me! My skin isn't terrible, so the fact I could never find a good face wash has been frustrating. I've tried drug store, name brand, knockoff, specialized, cheap, expensive, and every other kind of face wash out there, but none did what I needed. This one does everything I've been looking for at an absolute steal of a price!\nAny other face wash would either clean my skin or hydrate it, but never both. This one DOES! I like the smell and it cleans my skin without making it feel tight. I still use a moisturizer afterwards but the times I've skipped it my face never dried out like other face washes did. It suds really well and since it's a bar there's a ton of it. If you buy a soap saver or a tin it lasts forever! I bought this months ago and even after washing off stage makeup from theatre performances I'm only just now buying another. \nEveryone's skin is different but I genuinely can't believe how well this works for me. Seriously at least give it a shot, you'll probably also be surprised! I wish I had more words to describe this bar but it all boils down to this: IT! WORKS!",
        "headline": "An honest review, this wasn't gifted/paid by the company!",
        "rating": 5,
        "ugc_id": 547502207
      },
      "faceoff_negative": {
        "comments": "I was really drawn to this product because of its green ingredients. For a bar product, I'm pleasantly surprised by the amount of lather this cleanser has. While it's not as sudsy as your typical liquid cleanser, I'm still able to work the product into my skin for 1-2 minutes before rinsing off. I'm left with that 'squeaky' clean feeling without feeling stripped of moisture (though I have oily skin, so those with drier skin may have a different experience). The biggest downside for me is storage...it's much easier to stow away or travel with a bottled cleanser than it is an exposed bar of soap. I'm not sure if the purpose of the design is to minimize waste because the product still arrived in plastic packaging. Also worth noting that this WILL sting your eyes...yes, the packaging warns you of this, but as someone who likes to massage cleanser on my face for 60+ seconds, this has been a nuisance. \n\ncomplimentary from carbontheory",
        "headline": "Squeaky Clean Feeling with a Couple Flaws",
        "rating": 3,
        "ugc_id": 509719786
      },
      "name": "Superfood Facial Cleansing Bar",
      "native_review_count": 27,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 0,
      "locale": "en_US"
    }
  }
}