{
  "product_id": "pimprod2028665",
  "product_url": "https://www.ulta.com/p/deep-hydration-healthy-glow-daily-cream-fragrance-free-pimprod2028665",
  "extracted_at": "2025-09-23T03:44:48.946667+00:00",
  "product_name": "CetaphilDeep Hydration Healthy Glow Daily Cream Fragrance-Free",
  "brand": "Cetaphil",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Face Moisturizer"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "face"
  ],
  "currency": "USD",
  "list_price": "25.99",
  "sale_price": "18.19",
  "availability": "in_stock",
  "rating_avg": "4.3",
  "rating_count": "343",
  "images": [
    "https://media.ulta.com/i/ulta/2586971?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2586971?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2586971_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2586971_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2586971_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2586971_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2586971_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2586971_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2586971_vid01/thumbs/1f8f0121-a1a3-4e90-928e-4be8bdf4b7a7?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryCetaphil Deep Hydration Healthy Glow Daily Cream Fragrance-Free replenishs skin's hydration for 48 hours. Rehydrate and soothe dry, dehydrated sensitive skin. Lightweight, non-greasy formula leaves skin soft and supple. Designed for sensitive skin, won't clog pores or irritate.",
  "details": "DetailsBenefitsIdeal for dry and dehydrated skinLeaves skin immediately soft and suppleLightweight and non-greasy creamReplenishes skin's hydration for 48 hoursNon-comedogenicHypoallergenicDEFENDS AGAINST 5 SIGNS OF SKIN SENSITIVITY: Dryness, irritation, roughness, tightness and a weakened skin barrierRehydrates and soothesKey IngredientsHyaluronic AcidNiacinamideVitamin B5Vitamin EFormulated WithoutFragranceItem 2586971How To UseUse every morning and night after cleansing, gently smoothing over face and neck.IngredientsWater, Dicaprylyl Carbonate, Glycerin, Caprylic/Capric Triglyceride, Glyceryl Stearate Citrate, Cetearyl Alcohol, Niacinamide (Vitamin B3)Anhydroxylitol, Butyrospermum Parkii (Shea) Oil, Citric Acid, Globularia Alypum Leaf Extract (Blue Daisy), Hydrolyzed Hyaluronic Acid, Panthenol (Vitamin B5), Pantolactone, Phenoxyethanol, Sodium Benzoate, Sodium Polyacrylate, Squalane, Tocopherol (Vitamin E)Xylitol, Xylitylglucoside.",
  "how_to_use": "Use every morning and night after cleansing, gently smoothing over face and neck.",
  "ingredients": [
    "Water",
    "Dicaprylyl Carbonate",
    "Glycerin",
    "Caprylic/Capric Triglyceride",
    "Glyceryl Stearate Citrate",
    "Cetearyl Alcohol",
    "Niacinamide (Vitamin B3)Anhydroxylitol",
    "Butyrospermum Parkii (Shea) Oil",
    "Citric Acid",
    "Globularia Alypum Leaf Extract (Blue Daisy)",
    "Hydrolyzed Hyaluronic Acid",
    "Panthenol (Vitamin B5)",
    "Pantolactone",
    "Phenoxyethanol",
    "Sodium Benzoate",
    "Sodium Polyacrylate",
    "Squalane",
    "Tocopherol (Vitamin E)Xylitol",
    "Xylitylglucoside"
  ],
  "extended_contents": {
    "images": [
      "https://content.syndigo.com/asset/7fffe72a-96e0-4dee-9397-16b1a4440caf/480.webp",
      "https://content.syndigo.com/asset/75f9716f-2d6d-45aa-8bd7-8ff36f0b0cd9/480.webp",
      "https://content.syndigo.com/asset/7f32db87-f41f-4554-abff-99d5fdfb2a97/480.webp",
      "https://content.syndigo.com/asset/e90050fa-1ed4-4e09-918e-9f1545225941/480.webp",
      "https://content.syndigo.com/asset/061d1a72-8994-40b6-a22e-a71d637005c9/240.png",
      "https://content.syndigo.com/asset/9f59a741-7c70-41a1-9ce7-80a4c7d7f825/150.jpg",
      "https://content.syndigo.com/asset/0a78e29c-b7dc-44e5-8481-de3386145f81/150.jpg",
      "https://content.syndigo.com/asset/2bec8771-ef8d-4491-91b0-d77de8303260/150.jpg",
      "https://content.syndigo.com/asset/1329fdd2-f242-4a96-8e4c-09a55205c24b/150.jpg"
    ]
  },
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "moisturizer"
    ],
    "skin_type": [
      "dry",
      "sensitive"
    ],
    "finish": [
      "dewy",
      "sheer",
      "creamy",
      "cream",
      "oil"
    ],
    "ingredients": [
      "hyaluronic-acid",
      "niacinamide",
      "vitamin-e"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "hypoallergenic",
      "non-comedogenic",
      "fragrance-free",
      "purifying"
    ]
  },
  "reviews": {
    "product_id": "pimprod2028665",
    "total_reviews": 343,
    "reviews": [
      {
        "review_id": 556293986,
        "rating": 2,
        "headline": "burns really badly",
        "comments": "felt nice at first but then started burning and hurt pretty bad. used this for about 4 days and my skin became extremely irritated and red. my skin stayed irritated for a few days after i stopped using the lotion. it did moisturize alright",
        "nickname": "Libby",
        "location": "San Jose, CA",
        "created_date": 1751434837905,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554601179,
        "rating": 1,
        "headline": "Face appears burned after using",
        "comments": "I would not recommend this product to people with sensative skin. I purchased this for my daughter who has psoriasis and struggles with dry skin. Within minutes her face appeared burned, swollen, extremely red. Will not be using again.",
        "nickname": "Kelly",
        "location": "Baltimore, Maryland",
        "created_date": 1749171970853,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551108213,
        "rating": 2,
        "headline": "Another great moisturizer ruined with niacinamide",
        "comments": "I loved this product for a long time until recently when they decided to add niacinamide to it. I know it's the holy grail for some, but it gives me cystic acne. It's frustrating to have yet another favorite of mine ruined by niacinamide.",
        "nickname": "Ivy",
        "location": "Cincinnati",
        "created_date": 1743963113009,
        "bottom_line": "No",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542494375,
        "rating": 5,
        "headline": "The best moisturizer",
        "comments": "As a very, very dry sensitive skin person living in the midwest, you can imagine how dry my skin can get. I have tried so many moisturizers yet only have tried one cleanser - cetaphil. After spending so much money, I decided to go to cetaphil for my moisturizer as well. After cleansing, I applied two layers of the moisturizer while my skin was damp. I must say the difference in my skin was absolutely incredible! My skin felt so soft and plump that this is now my holy grail. I also decided to pair it up with the cetaphil healthy renew face serum and any possible chance of my skin flaking is out the window. These are my favorite products. Although, I must say, I wish there was more product for how much you're paying. I will also add that the product is super thick, so you don't need a lot, but my skin can't ever have enough! 100% recommend giving it a try!",
        "nickname": "Laura",
        "location": "Ohio",
        "created_date": 1736365682170,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537645918,
        "rating": 5,
        "headline": "Skin is so much healthier",
        "comments": "I have eczema on my face and I have it bad on my eyes specifically. Before I used this product my skin was flaking to the point where flesh was showing and Id have multiple cuts from it, but then my doctor recommended this to me. After only a week of using this product I noticed such a big difference. My face was still dry, but my eyes werent flaking anymore and the other places with bad eczema felt so much smoother. This product helped me boost my confidence so much and made it so I could actually go in public without applying lotion every 30 minutes. If you have eczema or just any type of dry skin, this product could be such a game changer for you.",
        "nickname": "R",
        "location": "Pennsylvania",
        "created_date": 1731348050109,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 517672990,
        "rating": 2,
        "headline": "Will not be buying again",
        "comments": "As a moisturizer it was good & I liked it, but thought there would be a lot more product than there was. It looks deceptively bigger than it actually is.\nAlso, the lid never stays on right. Would not travel well.",
        "nickname": "Jessica",
        "location": "Hershey, PA",
        "created_date": 1716682099789,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 3
      },
      {
        "review_id": 511275973,
        "rating": 2,
        "headline": "Catfished by packaging",
        "comments": "I grabbed this moisturizer to tide me over while I waited for my preferred moisturizer to arrive in the mail.  I was disappointed when I opened the container to find that the packaging is deceptive.  There is not nearly as much product inside as the container would have you believe.  In addition to that, the lid doesn't screw on properly or securely.  Will not purchase again.",
        "nickname": "Kelly",
        "location": "Kentucky",
        "created_date": 1713028097061,
        "bottom_line": "No",
        "helpful_votes": 4,
        "not_helpful_votes": 2
      },
      {
        "review_id": 498852970,
        "rating": 2,
        "headline": "Too sticky",
        "comments": "Made my face feek tacky",
        "nickname": "Rs",
        "location": "Villanova, PA",
        "created_date": 1706254051387,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 482126814,
        "rating": 2,
        "headline": "Didn't work for my dry, sensitive skin",
        "comments": "I wanted to love this product so badly! I originally tried this product about half a year ago when I was teaching swim lessons almost every day, and it was way too harsh on my skin then. I assumed it had to do with how the pool was affecting my skin more so than the product itself, so I decided to give this product another try after I had stopped swim lessons. I have dry, sensitive skin and live in a dry climate. I wash my face with cleanser at night and water in the morning because my skin is so sensitive and dry. Unfortunately this product was too harsh on my skin even when I wasn't in the pool. It caused my skin to become red and splotchy after every application, and was worse if I used it the day or two following retinol application (I applied this product on my face when it was slightly damp). I give it 2 stars instead of 1 because I did notice that my fine lines appeared smoother, but at the cost of having a red splotchy face.",
        "nickname": "Nicole",
        "location": "Denver",
        "created_date": 1700591922739,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 457543895,
        "rating": 1,
        "headline": "Do not buy this",
        "comments": "I tried using this 4 times and everytime it burned my face and left my face feeling drier than before I had put it on. This is the worst moisturizer I've ever tried. I literally just threw away the, practically full, bottle because it was that bad. I work a minimum wage job so the fact that I wasted my money on this is very disappointing. Like I can't believe this is in stores on shelves",
        "nickname": "Brooke",
        "location": "Ohio",
        "created_date": 1683766346331,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 6
      },
      {
        "review_id": 452964043,
        "rating": 1,
        "headline": "Burned my face",
        "comments": "I saw a dermatologist about two months ago for acne rosacea. She prescribed me azelaic acid for the rosacea and recommended I use cetaphil (or a few other brands) for cleansing and moisturizing my face. I've been using Cetaphil cleanser and it's been fine. I started using this moisturizer since starting the new skin care routine. My face reacted strongly and burned, but since that was a side effect of the prescription I ignored it. In the last week I switched back to my Tula moisturizer and my skin improved. I thought I had just been on the azelaic acid long enough. Tonight I decided to apply the cetaphil moisturizer and within a few minutes my whole face started to burn. You can see in the photo where I didn't apply the moisturizer to my eye area and it's not bright red. Definitely didn't go well with my skin, I just wish I would have realized it sooner.",
        "nickname": "Adrian",
        "location": "Beaverton, OR",
        "created_date": 1681614859502,
        "bottom_line": "No",
        "helpful_votes": 4,
        "not_helpful_votes": 5
      },
      {
        "review_id": 451774540,
        "rating": 1,
        "headline": "Pilling!",
        "comments": "I really wanted this to be a dupe for the Belif moisturizing bomb but it started pilling after I put it on and made my face look and feel dry. I woke up with small pimples all over my face.",
        "nickname": "K",
        "location": "Livermore",
        "created_date": 1681096696182,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 1
      },
      {
        "review_id": 441404058,
        "rating": 4,
        "headline": "Decent product for the money.",
        "comments": "I bought this on a whim when I had a coupon. I'd been using Olay's Ultra Rich, but thought it was too heavy and felt like my face was sticking to my pillow at night. I decided to try this instead and it's definitely working better for me, while still leaving my skin soft and hydrated without feeling heavy or sticky. As others said, the container may seem deceiving, but it contains the same amount my Olay does with similar packaging. I don't think this moisturizer is life changing by any means, but it's serving its purpose by hydrating and not feeling heavy. I haven't noticed any rashes or breakouts to my skin. I'm happy with the product.",
        "nickname": "JWest",
        "location": "Green Bay, WI",
        "created_date": 1674358607179,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 439265183,
        "rating": 3,
        "headline": "Mediocre and a rash",
        "comments": "I bought this moisturizer about 3-4 weeks ago; used it as my daily moisturizer every morning. It was good at first, keeping moisture during the very very cold and windy days that would usually make my skin flake and dry. Recently I noticed a large rash on the center of my neck that was red, flaky and burned. I believe this product gave me a slight chemical burn. I went back to my old moisturizer a few days ago and the rash on my neck has progressively disappeared. Will be returning the product.",
        "nickname": "Lys",
        "location": "Maryland",
        "created_date": 1672624416601,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 437715530,
        "rating": 4,
        "headline": "I enjoy it but it isn't anything special",
        "comments": "I bought this because my skin has been so incredibly dry since I had my baby! I usually use the regular Cetaphil lotion with the green cap. I feel that this product is very similar to that. I feel like maybe it hydrates a little more. My first impression was that it felt small for the price. Such a big container for such little product. It goes on nicely though. I use it when my skin is still wet like after cleansing or after a shower. Soaks right in! I am not sure I would repurchase this product since it is so similar to the one I already had.",
        "nickname": "Kimco",
        "location": "Idaho",
        "created_date": 1671201134932,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 434945988,
        "rating": 1,
        "headline": "Rash",
        "comments": "So I decided to try this because it's getting colder and my skin dries out well after 2 days of using I have a rash on my face and it burns. I'm so disappointed I really wanted to like this product",
        "nickname": "Kim",
        "location": "Lancaster PA",
        "created_date": 1669157122846,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 418449575,
        "rating": 4,
        "headline": "Favorite moisturizer so far",
        "comments": "Love it like really",
        "nickname": "Amy09",
        "location": "Wisconsin",
        "created_date": 1658700128513,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 417569091,
        "rating": 5,
        "headline": "i would buy this again",
        "comments": "the best moisturizer i've used so far i love it it feels amazing and doesn't make me feel gross after and leaves skin super soft",
        "nickname": "lun",
        "location": "bradenton , Fl",
        "created_date": 1658079502605,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 416528498,
        "rating": 1,
        "headline": "Severe dryness",
        "comments": "My skin is super dry and itch all over and leave patches of dry skin right on chicks under my eyes.",
        "nickname": "Che",
        "location": "Louisiana",
        "created_date": 1657313159624,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 4
      },
      {
        "review_id": 408051730,
        "rating": 4,
        "headline": "Love product/hate packaging",
        "comments": "Good for sensitive skin, wasteful packing I wish it came in a pump and larger size. Alittle pricy for drugstore but doesn't break me out and it's fragrance free.",
        "nickname": "StephP",
        "location": "Pompano beach , FL",
        "created_date": 1652186533325,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 75,
      "pages_total": 4,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2028665/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "Stings at first",
              "count": 1
            },
            {
              "label": "Usually have to rinse half of it off due to burn",
              "count": 1
            },
            {
              "label": "NONE",
              "count": 1
            },
            {
              "label": "None yet",
              "count": 1
            },
            {
              "label": "Scent",
              "count": 1
            },
            {
              "label": "Fragrance",
              "count": 1
            },
            {
              "label": "It's not hydrating enough",
              "count": 1
            },
            {
              "label": "Bad Reaction",
              "count": 1
            },
            {
              "label": "Bad for allergy prone skin",
              "count": 1
            },
            {
              "label": "Bad for sensitive skin",
              "count": 1
            },
            {
              "label": "Irritating",
              "count": 1
            },
            {
              "label": "Scented",
              "count": 1
            },
            {
              "label": "fragrance",
              "count": 1
            },
            {
              "label": "jar packaging",
              "count": 1
            }
          ],
          "display_values": [
            "Bad Reaction",
            "Bad for allergy prone skin",
            "Bad for sensitive skin",
            "Fragrance",
            "Irritating",
            "It's not hydrating enough",
            "NONE",
            "None yet",
            "Scent",
            "Scented",
            "Stings at first",
            "Usually have to rinse half of it off due to burn",
            "fragrance",
            "jar packaging"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "Sensitive skin",
              "count": 2
            },
            {
              "label": "Big dry scaly red patches on face",
              "count": 1
            },
            {
              "label": "Fragrance sensitive",
              "count": 1
            },
            {
              "label": "Incredibly sensitive skin",
              "count": 1
            },
            {
              "label": "normal to dry skin",
              "count": 1
            },
            {
              "label": "Combo skin, with extremely dry skin due to winte",
              "count": 1
            },
            {
              "label": "Daily Skincare Routine Simple",
              "count": 1
            },
            {
              "label": "Maintenance",
              "count": 1
            },
            {
              "label": "Natural Look",
              "count": 1
            },
            {
              "label": "Acne prone",
              "count": 1
            },
            {
              "label": "It claims to be a super moisturizer with water",
              "count": 1
            },
            {
              "label": "Dry skin",
              "count": 1
            },
            {
              "label": "Acne-Prone",
              "count": 1
            },
            {
              "label": "Combination Skin",
              "count": 1
            },
            {
              "label": "Prone to dry, flakey patches",
              "count": 1
            }
          ],
          "display_values": [
            "Acne prone",
            "Acne-Prone",
            "Big dry scaly red patches on face",
            "Casual Dresser",
            "Combination Skin",
            "Combo skin, with extremely dry skin due to winte",
            "Comfort-seeking",
            "Daily Skincare Routine Simple",
            "Dry skin",
            "Energetic/Active",
            "Fragrance sensitive",
            "Incredibly sensitive skin",
            "It claims to be a super moisturizer with water",
            "Maintenance",
            "Natural Look",
            "Prone to dry, flakey patches",
            "Sensitive skin",
            "Stylish/Fashionista",
            "Trendy/Stylish Dresser",
            "Youthful",
            "normal to dry skin"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "Completely transformed my face",
              "count": 1
            },
            {
              "label": "Makes skin look healthy",
              "count": 1
            },
            {
              "label": "Overall a decent moisturizer",
              "count": 1
            },
            {
              "label": "Skin feels smoother",
              "count": 1
            },
            {
              "label": "Moisturizing",
              "count": 1
            },
            {
              "label": "Dry Skin improved in first week",
              "count": 1
            },
            {
              "label": "Good for Sensitive Skin",
              "count": 1
            },
            {
              "label": "Very Light",
              "count": 1
            },
            {
              "label": "It moisturize the skin",
              "count": 1
            },
            {
              "label": "Gentle",
              "count": 1
            },
            {
              "label": "Great hydration",
              "count": 1
            },
            {
              "label": "absorbs quickly",
              "count": 1
            },
            {
              "label": "gets rid of flakes",
              "count": 1
            },
            {
              "label": "great under makeup",
              "count": 1
            },
            {
              "label": "hydrating",
              "count": 1
            },
            {
              "label": "moisturizing",
              "count": 1
            },
            {
              "label": "not sticky",
              "count": 1
            }
          ],
          "display_values": [
            "Completely transformed my face",
            "Dry Skin improved in first week",
            "Gentle",
            "Good for Sensitive Skin",
            "Great hydration",
            "It moisturize the skin",
            "Makes skin look healthy",
            "Moisturizing",
            "Overall a decent moisturizer",
            "Skin feels smoother",
            "Very Light",
            "absorbs quickly",
            "gets rid of flakes",
            "great under makeup",
            "hydrating",
            "moisturizing",
            "not sticky"
          ]
        },
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Dry",
              "count": 4
            },
            {
              "label": "Normal",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        25,
        16,
        17,
        59,
        226
      ],
      "review_histogram": [
        25,
        16,
        17,
        59,
        226
      ],
      "rating_count": 343,
      "review_count": 343,
      "average_rating": 4.3,
      "recommended_ratio": 0.52,
      "media": [
        {
          "id": "511276021",
          "review_id": 511275973,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/mvjuzfvllzzu4iimfe0o.jpg",
          "headline": "Catfished by packaging",
          "rating": 2,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "The small circle is the size of the product through the entire jar.  It does NOT expand past the opening into the larger part of the container like you might think.  Trickery.",
          "nickname": "Kelly",
          "created_date": 1713028097061
        },
        {
          "id": "452964202",
          "review_id": 452964043,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ild561gzogoszgfuje5j.jpg",
          "headline": "Burned my face",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Adrian",
          "created_date": 1681614859502
        },
        {
          "id": "452964182",
          "review_id": 452964043,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/zhbzvvbncw9hbi8hfu6m.jpg",
          "headline": "Burned my face",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Adrian",
          "created_date": 1681614859502
        },
        {
          "id": "393585385",
          "review_id": 393585384,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ipgavlh252outswytveq.jpg",
          "headline": "Breakouts from this product",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Break out on my forehead",
          "nickname": "melanie r.",
          "created_date": 1641790427859
        },
        {
          "id": "393585437",
          "review_id": 393585384,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/rbxiizrfww5vyvfco7ky.jpg",
          "headline": "Breakouts from this product",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "(Pimple patch) dryness around nose and redness",
          "nickname": "melanie r.",
          "created_date": 1641790427859
        },
        {
          "id": "393555909",
          "review_id": 393555779,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/bxffb7it0ll6pniwtgmb.jpg",
          "headline": "Nice cream for sensitive skin, rich feel, wasteful packaging",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "apitt",
          "created_date": 1641745637597
        },
        {
          "id": "381763048",
          "review_id": 381762994,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/izka9qinake8izfcevrj.jpg",
          "headline": "Misleading packaging",
          "rating": 3,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Smaller amount of cream than expected",
          "nickname": "Sarah A",
          "created_date": 1611288199000
        },
        {
          "id": "325337227",
          "review_id": 325337226,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/p2mk15aijnhdq0m0jun1.jpg",
          "headline": "Instantly burned",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Alice",
          "created_date": 1610936041448
        },
        {
          "id": "325337215",
          "review_id": 325337226,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/zmqcrylveq2glkxifmnn.jpg",
          "headline": "Instantly burned",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "My face is hot too the touch and very painful.",
          "nickname": "Alice",
          "created_date": 1610936041448
        }
      ],
      "faceoff_positive": {
        "comments": "I got this a week ago and it is amazing. I have combination skin. This cream doesn't leave your skin tight or itchy. This also has a gentle sent.",
        "headline": "Nice feel",
        "rating": 5,
        "ugc_id": 381762989
      },
      "faceoff_negative": {
        "comments": "I unscrewed the lid only to find that the contents are much smaller than the packaging. Seems like this is misleading considering I bought it thinking I would be getting a great deal of cream. Not to mention this is not sustainable packaging.",
        "headline": "Misleading packaging",
        "rating": 3,
        "ugc_id": 381762994
      },
      "name": "Deep Hydration Healthy Glow Daily Cream Fragrance-Free",
      "native_review_count": 75,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 268,
      "locale": "en_US"
    }
  }
}