{
  "product_id": "pimprod2041296",
  "product_url": "https://www.ulta.com/p/healthy-renew-purified-peptides-eye-gel-serum-pimprod2041296",
  "extracted_at": "2025-09-23T04:05:38.545076+00:00",
  "product_name": "CetaphilHealthy Renew Purified Peptides Eye Gel Serum",
  "brand": "Cetaphil",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Serums"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "serums"
  ],
  "currency": "USD",
  "list_price": "28.99",
  "sale_price": "20.29",
  "availability": "in_stock",
  "rating_avg": "4.5",
  "rating_count": "492",
  "images": [
    "https://media.ulta.com/i/ulta/2611321?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2611321?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611321_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611321_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611321_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611321_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2611321_vid01/thumbs/a9419ac1-65a2-4dc7-abdb-44d2b30e320f?w=600&h=337&fmt=auto",
    "https://media.ulta.com/v/ulta/2611321_vid02/thumbs/b6a7859b-0bf4-4356-a7de-7cf230e9b1b0?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryCetaphil Healthy Renew Purified Peptides Eye Gel Serum reduces look of dark circles, fine lines and signs of fatigue.",
  "details": "DetailsBenefitsHydrates for up to 24 hoursBoosts skin luminosity2 WEEKS - Reduces the appearance of fine linesCLINCALLY PROVEN RESULTS: 93% of consumers agreed skin around the eye stays hydrated all day longDeveloped with Dermatologists. Designed for even the most sensitive skinHypoallergenicNon-comedogenicKey IngredientsHIGHLY PURIFIED PEPTIDES - Retinol alternative to help minimize the look of fine lines and wrinklesBOTANICAL EXTRACTS (Edelweiss + Rice Lees) - help target dullness and uneven skin tonePRO-VITAMIN B5 + VITAMIN B3 - Helps hydrate, repair skin’s barrier and soothe skinFormulated WithoutParabensSulfatesItem 2611321How To UseApply a pearl-sized amount around the eye area morning and night and smooth until absorbed.IngredientsWater, Glycerin, Propanediol, Panthenol, 1, 2-Hexanediol, Niacinamide, C13-15 Alkane, Butyrospermum Parkii (Shea) Butter, Cocos Nucifera (Coconut) Oil, Sodium Polyacryloyldimethyl Taurate, Hydrogenated Polydecene, Silica, Tocopheryl Acetate, Vinyl Dimethicone, C14-22 Alcohols, Leontopodium Alpinum Extract, Polyglyceryl-2 Stearate, Polyacrylate-13, C12-20 Alkyl Glucoside, Oryza Sativa (Rice) Lees Extract, Glyceryl Stearate, Stearyl Alcohol, Polyisobutene, Hydrolyzed Soy Flour, Adenosine, Dimethicone/Vinyl Dimethicone Crosspolymer, Butylene Glycol, Trisodium Ethylenediamine Disuccinate, Acacia Senegal Gum, Citric Acid, Agar, Caprylyl Glycol, Polysorbate 20, Sodium Benzoate, Sorbitan Isostearate, Potassium Sorbate, Sodium Hyaluronate, Xanthan Gum, Ethylhexyl Glycerin, Buddleja Davidii Extract, Thymus Vulgaris (Thyme) Extract.",
  "how_to_use": "Apply a pearl-sized amount around the eye area morning and night and smooth until absorbed.",
  "ingredients": [
    "Water",
    "Glycerin",
    "Propanediol",
    "Panthenol",
    "2-Hexanediol",
    "Niacinamide",
    "C13-15 Alkane",
    "Butyrospermum Parkii (Shea) Butter",
    "Cocos Nucifera (Coconut) Oil",
    "Sodium Polyacryloyldimethyl Taurate",
    "Hydrogenated Polydecene",
    "Silica",
    "Tocopheryl Acetate",
    "Vinyl Dimethicone",
    "C14-22 Alcohols",
    "Leontopodium Alpinum Extract",
    "Polyglyceryl-2 Stearate",
    "Polyacrylate-13",
    "C12-20 Alkyl Glucoside",
    "Oryza Sativa (Rice) Lees Extract",
    "Glyceryl Stearate",
    "Stearyl Alcohol",
    "Polyisobutene",
    "Hydrolyzed Soy Flour",
    "Adenosine",
    "Dimethicone/Vinyl Dimethicone Crosspolymer",
    "Butylene Glycol",
    "Trisodium Ethylenediamine Disuccinate",
    "Acacia Senegal Gum",
    "Citric Acid",
    "Agar",
    "Caprylyl Glycol",
    "Polysorbate 20",
    "Sodium Benzoate",
    "Sorbitan Isostearate",
    "Potassium Sorbate",
    "Sodium Hyaluronate",
    "Xanthan Gum",
    "Ethylhexyl Glycerin",
    "Buddleja Davidii Extract",
    "Thymus Vulgaris (Thyme) Extract"
  ],
  "extended_contents": {
    "images": [
      "https://content.syndigo.com/asset/3be3e43a-8273-42a1-8f8e-c91239fba7ae/480.webp",
      "https://content.syndigo.com/asset/3954d719-d877-473d-8874-22d230638729/480.webp",
      "https://content.syndigo.com/asset/d9745c57-cc0d-40f6-8e54-f17c51c504ae/480.webp",
      "https://content.syndigo.com/asset/41654604-c221-4dae-8d7b-fd384504f527/480.webp",
      "https://content.syndigo.com/asset/061d1a72-8994-40b6-a22e-a71d637005c9/240.png",
      "https://content.syndigo.com/asset/a3ffca7b-5fe4-49b8-a1d7-7515eff9840e/150.jpg",
      "https://content.syndigo.com/asset/dd7c1c80-37b6-4fe2-99c0-c69a3e2f66f8/150.jpg",
      "https://content.syndigo.com/asset/fb9ff697-05ea-46dd-a1f0-f45f99d58b15/150.jpg",
      "https://content.syndigo.com/asset/89af4baa-da93-47c9-be52-aaff260b1029/150.jpg",
      "https://content.syndigo.com/asset/01db833d-2984-4ac5-b8ea-2d6dda5f080b/150.jpg"
    ]
  },
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "cleanser",
      "serum",
      "mask",
      "treatment",
      "eye cream"
    ],
    "skin_type": [
      "sensitive",
      "mature"
    ],
    "finish": [
      "matte",
      "long-wear",
      "creamy",
      "gel",
      "oil"
    ],
    "ingredients": [
      "niacinamide"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "natural",
      "hypoallergenic",
      "non-comedogenic",
      "anti-aging"
    ]
  },
  "reviews": {
    "product_id": "pimprod2041296",
    "total_reviews": 492,
    "reviews": [
      {
        "review_id": 555189488,
        "rating": 1,
        "headline": "Not a single peptide in the product",
        "comments": "It says peptide on the label but there is not a single peptide in the ingredients.  This is false advertising!",
        "nickname": "Toast",
        "location": "California",
        "created_date": 1750050383926,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 3
      },
      {
        "review_id": 542686554,
        "rating": 5,
        "headline": "Great value",
        "comments": "I've been using this eye serum for about a year now. I use it in the morning and at night. I'm in my early 30s, I do not have bangs under my eyes or crows feet so I cannot say the effectiveness for these issues but it did lessen the darkness under my eyes. My husband could even tell the difference probably 1-2 weeks after I started using this. I am very happy that I did not have to spend $50+ to solve one issue.",
        "nickname": "Annie",
        "location": "Chicago, IL",
        "created_date": 1736690380443,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 525339295,
        "rating": 2,
        "headline": "Not my favorite",
        "comments": "Ive been using this for months. It hasnt done anything for my under eyes. However i am not sure if this is just a defective product i got but theres little balls that dont rub in nicely or soak into my skin. I would not recommend",
        "nickname": "Gabby",
        "location": "Palm Beach, FL",
        "created_date": 1721427507767,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 523108089,
        "rating": 5,
        "headline": "Big bang for your buck",
        "comments": "I really like this product so far. A little goes a long way, so you are definitely getting your moneys woth. It gets to work pretty quickly and I've noticed it really reduces my puffiness in the morning. Make sure to take the time rub it in until it absorbs. I then typically wait at least 3 minutes until I put on my moisturizer next.",
        "nickname": "Aprilnoel",
        "location": "Denver",
        "created_date": 1718820446090,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 487257461,
        "rating": 4,
        "headline": "I would purchase again",
        "comments": "Goes on great, no sticky feelings.",
        "nickname": "Emilie",
        "location": "Oklahoma",
        "created_date": 1704816795092,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 485080760,
        "rating": 5,
        "headline": "love",
        "comments": "I used to use Fresh Skincare but it got a bit expensive so I wanted to find something a little cheaper.  I recently stumbled upon cetaphil bar soap and fell in love so I figured to try their skincare. I got this along with a cetaphil face moisturizer. Its been about 1 month of usage and honestly it's awesome.  My face feels nicely hydrated with the duo. on its own it feels great but my skin drinks it up so a moisturizer afterwards is a must.  I use in the morning and night.  Im going to see how it handles nyc winters but so far so good and love that it goes on sale buy 1 get 1. One con tho, within 1 month I already am on the brink of needing to buy another. This will pose a problem on my wallet.  I do 2 pumps each use, which is really not a lot. There really should be a bit more. Fresh was pricey but the serum I was using was a big bottle and would legit last me up to 4 months. Take what you can from this review.  Pro feels great, skin loves,  works well with moisturizer, doesnt pill, great sale price.  Con small bottle. [ reference I have dry skin.]",
        "nickname": "Angelica",
        "location": "ny",
        "created_date": 1702789532835,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 1
      }
    ],
    "paging": {
      "total_results": 6,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        7,
        10,
        40,
        132,
        303
      ],
      "review_histogram": [
        7,
        10,
        40,
        132,
        303
      ],
      "rating_count": 492,
      "review_count": 492,
      "average_rating": 4.45,
      "recommended_ratio": 1.0,
      "media": [],
      "faceoff_positive": {
        "comments": "I received those wonderful line of skincare to review from Cetaphil and Influenster in exchange for my honest opinion.\nOkay, so I had no idea how good peptides were for my skin. Peptides aid in the production of collagen and elastin. So using them topically in your skincare routine could help with a number of things, including firmer skin, younger looking skin, and possibly less breakouts. Having rosacea, I am picky with my skincare and Cetaphil is a brand that I trust. So I was excited to try their healthy renew purified peptide infused line. I also have quite a lot of texture on my face from old acne scarring. I received a facial serum, an eye serum, a day moisturizer, and also a nighttime moisturizer. I wanted to use them for four weeks before writing a review, but I only had the chance to use them for a little over three. \n\nThe Face Serum: The face serum comes in an airless pump. It is nice and lightweight. It absorbed quickly. It did not pill with any other of my skincare items. I really enjoyed it, and I was starting to see results, but I stopped using it because it kinda left a tacky texture on my face. I did see results (firmer skin and a more youthful appearance), but I couldn't get over how it made my skin feel after using it (and even hours after). \n\nThe Eye Serum: This is one of my favorites in the line. The texture is lightweight and absorbed quickly. A little goes a long way. It absolutely does make my eyes look less tired and less puffy. I did not see a major improvement in the overall texture of my eye area, but it did make my eyes look younger and better. There was slight improvement in my itty bitty crows feet. I definitely feel like this eye serum will prevent them from getting any worse. This is one that I will definitely repurchase after using up!\n\nThe Day Cream: Nothing majorly special here. It's a wonderful daily moisturizer with 30 spf. Absorbs nicely. Doesn't pill. It is similar to most of their other daily moisturizers with spf.\n\nThe Night Cream: This is my second favorite next to the eye serum gel. This night cream is wonderful. It is a THICK night cream. So, if you enjoy a lighter kind of cream at bedtime, maybe skip this one. I happen to love a thick, rich, luxurious feeling night cream before I go to bed, and this is it. This is the one. In the morning, my skin looks and feels hydrated and more youthful. I stopped using it only because I am saving it for winter time. \n\nOverall, I did enjoy the line. While I did not see a major improvement in my textured skin, I feel like my face was younger looking and was more firm. All of the products are wonderful if you happen to mess up your skin barrier.",
        "headline": "Love it!",
        "rating": 5,
        "ugc_id": 480164950
      },
      "faceoff_negative": {
        "comments": "I received the Cetaphil Healthy Renew Eye Gel Serum for free from Influenster and Cetaphil in exchange for my honest opinion. In the first time using this product I had a hard time with the pump, it took a long time to make it work. I have really sensitive eyes, so I test a couple times this Gel Serum, but my eyes got irritated, so I had to stopped using it. I'm sure people with not so much sensitive eyes will have a better experience.",
        "headline": "Cetaphil Healthy Renew Eye Gel Serum",
        "rating": 2,
        "ugc_id": 480164793
      },
      "name": "Healthy Renew Purified Peptides Eye Gel Serum",
      "native_review_count": 6,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 486,
      "locale": "en_US"
    }
  }
}