{
  "product_id": "pimprod2043379",
  "product_url": "https://www.ulta.com/p/beautiful-skin-medium-full-coverage-radiant-concealer-pimprod2043379",
  "extracted_at": "2025-09-23T03:21:46.215888+00:00",
  "product_name": "Charlotte TilburyBeautiful Skin Medium to Full Coverage Radiant Concealer",
  "brand": "Charlotte Tilbury",
  "categories": [
    "Home",
    "Makeup",
    "Face",
    "Concealer"
  ],
  "category_keys": [
    "home",
    "makeup",
    "face",
    "concealer"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "33.00",
  "availability": "in_stock",
  "rating_avg": "4.5",
  "rating_count": "507",
  "images": [
    "https://media.ulta.com/i/ulta/2619466?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2619466?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619466_sm?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619466_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619466_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619466_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619440cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619440cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619440cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619440cm_alt04?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryCharlotte Tilbury's Beautiful Skin Medium to Full Coverage Radiant Concealer with Hyaluronic Acid is a creamy, skin-like, medium-to-full-coverage concealer that visibly conceals, brightens, and lifts eyes and face, available in 30 waterproof shades with up to 16 hours of wear.",
  "details": "DetailsBenefitsCharlotte Tilbury developed this skincare-infused concealer to improve the look of skin with each application.Designed with a doe-foot applicator for easy application, the lightweight and long-wearing formula visibly hydrates, brightens, and smooths the complexion.Radiant Finish.Good for: Dark Circles.Medium Coverage.Hyaluronic Acid.Long-wearing.Best for Dry, Combo, Normal Skin.Key IngredientsHyaluronic Acid: Hydrates skin and revitalizes the outer, visible layers.Niacinamide: Smooths.Golden Vitamin C: Visibly brightens.Research ResultsIn a test with 15 people, participants reported:Skin feels 2X more hydrated after 1 hour of wearThe concealer provided up to 16 hours of wearIn a test with 105 men and women over 28 days:93% agree the product visibly reduces dark circles over time and with each wearItem 2619466How To UseBeautiful Skin Radiant Concealer can be applied in three ways:Conceal areas of concern on the face:Utilize a shade that is your perfect skin match.Brighten the look of dark circles and under-eye area:Use a concealer that is two shades lighter than your perfect match.Visibly lift and sculpt face:Apply concealer to the corners of the mouth, the corners of the nose, and the inner and outer corners of the eye.Blend and lift.IngredientsAqua/Water/Eau, Dicaprylyl Ether, Polyglyceryl-3 Polyricinoleate, Glycerin, Coco-Caprylate/Caprate, Polyglyceryl-3 Diisostearate, Niacinamide, Mica, Hydrogenated Castor Oil, Acacia Decurrens/Jojoba/Sunflower Seed Wax Polyglyceryl-3 Esters, Collagen, Magnesium Sulfate, Silica, Lauroyl Lysine, Aluminum Hydroxide, Squalane, Levulinic Acid, Sodium Dehydroacetate, Sodium Levulinate, Tocopherol, Sodium Lauroyl Glutamate, Camellia Japonica Seed Oil, Hydrolyzed Sodium Hyaluronate, Helianthus Annuus (Sunflower) Seed Oil, Lysine, Parfum (Fragrance), Magnesium Chloride, Sorbitol, Propanediol, Caprylic/Capric Triglyceride, Cetyl Palmitate, 1,2-Hexanediol, Caprylyl Glycol, Polysorbate 80, Sorbitan Stearate, Xanthan Gum, Sodium Benzoate, Citric Acid, Hydrogenated Lecithin, Ascorbic Acid, Colloidal Gold, Glutathione, Palmitoyl Tetrapeptide-10. May Contain: Titanium Dioxide (CI 77891), Iron Oxides (CI 77491, CI 77492, CI 77499).Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Beautiful Skin Radiant Concealer can be applied in three ways:Conceal areas of concern on the face:Utilize a shade that is your perfect skin match.Brighten the look of dark circles and under-eye area:Use a concealer that is two shades lighter than your perfect match.Visibly lift and sculpt face:Apply concealer to the corners of the mouth, the corners of the nose, and the inner and outer corners of the eye.Blend and lift.",
  "ingredients": [
    "Aqua/Water/Eau",
    "Dicaprylyl Ether",
    "Polyglyceryl-3 Polyricinoleate",
    "Glycerin",
    "Coco-Caprylate/Caprate",
    "Polyglyceryl-3 Diisostearate",
    "Niacinamide",
    "Mica",
    "Hydrogenated Castor Oil",
    "Acacia Decurrens/Jojoba/Sunflower Seed Wax Polyglyceryl-3 Esters",
    "Collagen",
    "Magnesium Sulfate",
    "Silica",
    "Lauroyl Lysine",
    "Aluminum Hydroxide",
    "Squalane",
    "Levulinic Acid",
    "Sodium Dehydroacetate",
    "Sodium Levulinate",
    "Tocopherol",
    "Sodium Lauroyl Glutamate",
    "Camellia Japonica Seed Oil",
    "Hydrolyzed Sodium Hyaluronate",
    "Helianthus Annuus (Sunflower) Seed Oil",
    "Lysine",
    "Parfum (Fragrance)",
    "Magnesium Chloride",
    "Sorbitol",
    "Propanediol",
    "Caprylic/Capric Triglyceride",
    "Cetyl Palmitate",
    "2-Hexanediol",
    "Caprylyl Glycol",
    "Polysorbate 80",
    "Sorbitan Stearate",
    "Xanthan Gum",
    "Sodium Benzoate",
    "Citric Acid",
    "Hydrogenated Lecithin",
    "Ascorbic Acid",
    "Colloidal Gold",
    "Glutathione",
    "Palmitoyl Tetrapeptide-10. May Contain: Titanium Dioxide (",
    "Iron Oxides ("
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "makeup",
      "face",
      "cosmetics"
    ],
    "product_type": [
      "foundation"
    ],
    "skin_type": [
      "dry",
      "combination",
      "normal"
    ],
    "finish": [
      "dewy",
      "sheer",
      "full coverage",
      "medium coverage",
      "long-wear",
      "waterproof",
      "creamy",
      "cream",
      "oil"
    ],
    "ingredients": [
      "niacinamide",
      "peptides",
      "collagen",
      "fragrance",
      "sulfate-free"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "brightening"
    ]
  },
  "reviews": {
    "product_id": "pimprod2043379",
    "total_reviews": 507,
    "reviews": [
      {
        "review_id": 561039424,
        "rating": 5,
        "headline": "Impressed",
        "comments": "Bought this item because I'm having surgery and didnt want to have to put on foundation. One of the ladies showed me a new way using this product and i was obsessed with the results. A little goes a long way.",
        "nickname": "Miss Kay",
        "location": "Kansas",
        "created_date": 1756043067109,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560507510,
        "rating": 5,
        "headline": "This prodcut is the BOMB.com",
        "comments": "I am so happy that I purchased this concealer.  I actually purchased two (#16 and #17).  I use #16 everyday and I feel so refreshed.  I gives my skin a glow that I never had with other concealers.  I highly recommend this product for dark skin!",
        "nickname": "Monique R.",
        "location": "Chicago",
        "created_date": 1755703768222,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560507514,
        "rating": 5,
        "headline": "I LOVE this product!!!",
        "comments": "I am so happy that I purchased this concealer.  I actually purchased two (#16 and #17).  I use #16 everyday and I feel so refreshed.  I gives my skin a glow that I never had with other concealers.  I highly recommend this product for dark skin!",
        "nickname": "Monique R.",
        "location": "Chicago, IL",
        "created_date": 1755703713742,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557407468,
        "rating": 4,
        "headline": "Yeah it's a nice product but is it my go to",
        "comments": "It feels nice coverage is good is it my total go to, no. Prefer the Dior one and the chanel one but this one is ok",
        "nickname": "Nikkie",
        "location": "Kronenwetter wi",
        "created_date": 1752721642998,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 553193904,
        "rating": 4,
        "headline": "It's okay",
        "comments": "If your looking for a light coverage concealer this is the one for you. \nApplys smooth like butter. Not cakey, but definitely creases and has sparkle in it. Coverage definitely needs to be built up. Might not purchase again.\nDoesn't fully cover eye bag color.",
        "nickname": "Jules",
        "location": "California",
        "created_date": 1747010118522,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550903048,
        "rating": 1,
        "headline": "Terrible concealer",
        "comments": "This has glitter in it. I used it for my under eyes because I have extremely dark circles. This did not build up and I noticed glitter all over my under eye area. The glitter just made everything look so bad. This is not a good product.",
        "nickname": "Abscret",
        "location": "Alabama",
        "created_date": 1743676804698,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 548016049,
        "rating": 2,
        "headline": "It has glitter in it",
        "comments": "This literally has glitter in it. When i apply this to my under eyes, it draws more attention to them because of this.",
        "nickname": "Elizabeth",
        "location": "Oregon",
        "created_date": 1741494114846,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 545880978,
        "rating": 3,
        "headline": "Good coverage but really sparkly",
        "comments": "I have inherited dark circles under my eyes & feel like I'm constantly trying to find a good concealer. I tried this & loved it, great coverage that I can build but it has micro glitter particles. It's so weird!! I only use it around my eyes so that's the only sparkly part. Wish I could return it but I bought it back in December.",
        "nickname": "Megan",
        "location": "Seattle, WA",
        "created_date": 1738633232144,
        "bottom_line": "No",
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542511868,
        "rating": 5,
        "headline": "Best Concealer Ever",
        "comments": "I have truly never found a concealer this beautiful. It is exactly what I was looking for - medium to full coverage concealer with a radiant, skin-like finish. You can truly customize the look with however youd like. Letting it sit to thicken allows fir more coverage, while blending it out faster gives a more natural coverage. You can blend with a sponge to absorb more into the skin, or with your finger to have the skin texture heat up and blend the product. It looks great under the eyes, not leaving it dry or creasing. There may be some problems with creasing before setting, but as long as you blend them out prior to powder youll look beautiful the entire day. Worth everh penny, a little goes a long way. Thank you Charlotte for this holy grail kf a product, a must have.",
        "nickname": "Cesca",
        "location": "Chicago, IL",
        "created_date": 1736401144318,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541956056,
        "rating": 5,
        "headline": "Stays put. Conceals",
        "comments": "I blend with a brush. Works great",
        "nickname": "LS",
        "location": "MT",
        "created_date": 1735495781422,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 538978815,
        "rating": 4,
        "headline": "I prefer Safflowers to Sunflowers",
        "comments": "Let me start by saying the concealer is good. It's not the best I've ever tried, but my review is more about preference than performance. Had I not had to return it due to missing the inclusion of Helianthus annuus oil (Sunflower) upon purchase (I'm allergic to it), I can't say that I would have purchased again. The search continues as finding a Yuka good or excellent concealer without Sunflower has been quite the challenge.",
        "nickname": "ccbarlow11",
        "location": "Birmingham, AL",
        "created_date": 1733359960562,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 6
      },
      {
        "review_id": 537836837,
        "rating": 5,
        "headline": "It actually works!",
        "comments": "Usually concealers end up looking patchy or turn mottled on my skin. This one takes away dark circles under my eyes and hides imperfections. This is my go to now!",
        "nickname": "Stephanie",
        "location": "Riverview, FL",
        "created_date": 1731609656644,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537350196,
        "rating": 2,
        "headline": "Not for older skin",
        "comments": "The consistency is thin so applying is easy. But that also effects the coverage. As an undereye concealer it is leaving my skin dry and not covering my dark circles. Micro patches of dryness develops when I use this (and I moisturize daily). Settles in lines and magnifies it.",
        "nickname": "Lovemesomeglamour",
        "location": "Santa Clarita, CA",
        "created_date": 1730819012498,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 526858446,
        "rating": 5,
        "headline": "Amazing!!!!!",
        "comments": "Had I tried this concealer first! I would have saved a ton of money! Its nothing short of Amazing and I now love you Charlotte- please don't ever change this formula-",
        "nickname": "Bella",
        "location": "Madison, WI",
        "created_date": 1723311680810,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 524830664,
        "rating": 5,
        "headline": "Already bought it again",
        "comments": "Love the way it goes on and stays on without separating.",
        "nickname": "Cindy",
        "location": "Riverside",
        "created_date": 1720887824182,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 522664412,
        "rating": 5,
        "headline": "I have severely underestimated you, Charlotte Tilbury",
        "comments": "As a former die hard nars rcc user and THE SAEM (korean brand) concealer user, I thought I was done searching for concealers for life and was set using these badboys that had great coverage as far as being super pigmented went. I'm 23 and wear spf 50 religiously, theres no chance i could have giant wrinkles under my eyes and around my mouth!!! Which is what nars was highlighting (clearly they changed their formula) so i needed to abandon it STAT.. i have oily dry skin so i cant find good products easily that dont melt off without setting it with powder (which then make me look dry and clings to patches.) THIS CONCEALER..OH MY GOD. Literally on my driest day and when my acne was scarring over with dead skin visible from a yard away- somehow it didnt cling or highlight it at all? It doesnt look like a filter in the sense that it fills your pores or is literal theater makeup- but my chin and buccal area, which is an area with hormonal acne that is painfully red, dry and oily at the same time- looked completwly normal. It is even more incredible for under eye circles, even with three layers, and i applied it using five different methods just to see, and it did not wrinkle or settle in the creases at all. Im so stunned. \n\nOily friendly\nTx heat friendly\nIf your makeup usually separates or clings to patches, this wont \nnot mattifying but doesnt make you greasy\nUndereye friendly\nHyperpigmentation friendly\nMight oxidize slightly darker, shade down!\nYou might not like the slight glimmer.\n\nIf you need shade reference- i am a madeleine in nars rcc and a shade 4 in this one. Also i was kinda turned off by all the influencers in these review sections but i paid full price for these and dont make more than 60k a year lol #workinggirlfriendly",
        "nickname": "Emi",
        "location": "Texas",
        "created_date": 1718554839896,
        "bottom_line": null,
        "helpful_votes": 19,
        "not_helpful_votes": 0
      },
      {
        "review_id": 522438204,
        "rating": 5,
        "headline": "I will keep this in my makeup bag",
        "comments": "I love this concealer. I have fair, sensitive skin. If I want lighter coverage, I dabble it in with a damp sponge. If I want full coverage, I dab it with a stippling brush. I make sure to moisturize my skin and use a primer -especially under the eyes! If you have fine lines around your eyes, you need a primer (probably a plumping primer), or this will settle into them- this isn't a smoothing concealer. I then top with a powder- not always a setting one. Then I've been using my mist face sunscreen over top, and it feels like a setting spray.\nI have not tested it as waterproof.\nI will say when I go to wash my face, I need to use an oil face wash or a balm with my microfiber face poof then I follow with my gentle cleanser.",
        "nickname": "Ashleigh",
        "location": "Seattle",
        "created_date": 1718177991342,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 513211672,
        "rating": 2,
        "headline": "Clings to dry skin, poor coverage",
        "comments": "My skin somehow looks worse with this concealer because it clings to dry patches and highlights it with sparkles...coverage looks good for first hour but fades throughout the day",
        "nickname": "Erin",
        "location": "New York",
        "created_date": 1715094495831,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 513009833,
        "rating": 5,
        "headline": "Love this concealer",
        "comments": "I am in my 60's and always use a moisturizer under my eyes first.  This goes on so nicely.  I use the applicator to dab it on and a concealer  brush to distribute it.  Really brightens up my eyes and hides my dark circles.  After a few weeks I can already see my dark circles are lighter.  I think the complaints about this product might be due to users not using moisturizers and doing proper skin care.   Makeup always looks better over properly prepared skin.  I know because I used to scrimp on skincare and nothing looked great over my dry skin.",
        "nickname": "Tilley",
        "location": "CA",
        "created_date": 1714858121825,
        "bottom_line": "Yes",
        "helpful_votes": 14,
        "not_helpful_votes": 1
      },
      {
        "review_id": 512819020,
        "rating": 2,
        "headline": "Creases",
        "comments": "Creases almost immediately even after setting with powder. Also definitely not water proof as it came off when I used a little bit of eye drops",
        "nickname": "Jaz",
        "location": "Wenatchee wa",
        "created_date": 1714674922089,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 2
      }
    ],
    "paging": {
      "total_results": 26,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2043379/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        5,
        17,
        42,
        111,
        332
      ],
      "review_histogram": [
        5,
        17,
        42,
        111,
        332
      ],
      "rating_count": 507,
      "review_count": 507,
      "average_rating": 4.48,
      "recommended_ratio": 0.73,
      "media": [],
      "faceoff_positive": {
        "comments": "As a former die hard nars rcc user and THE SAEM (korean brand) concealer user, I thought I was done searching for concealers for life and was set using these badboys that had great coverage as far as being super pigmented went. I'm 23 and wear spf 50 religiously, theres no chance i could have giant wrinkles under my eyes and around my mouth!!! Which is what nars was highlighting (clearly they changed their formula) so i needed to abandon it STAT.. i have oily dry skin so i cant find good products easily that dont melt off without setting it with powder (which then make me look dry and clings to patches.) THIS CONCEALER..OH MY GOD. Literally on my driest day and when my acne was scarring over with dead skin visible from a yard away- somehow it didnt cling or highlight it at all? It doesnt look like a filter in the sense that it fills your pores or is literal theater makeup- but my chin and buccal area, which is an area with hormonal acne that is painfully red, dry and oily at the same time- looked completwly normal. It is even more incredible for under eye circles, even with three layers, and i applied it using five different methods just to see, and it did not wrinkle or settle in the creases at all. Im so stunned. \n\nOily friendly\nTx heat friendly\nIf your makeup usually separates or clings to patches, this wont \nnot mattifying but doesnt make you greasy\nUndereye friendly\nHyperpigmentation friendly\nMight oxidize slightly darker, shade down!\nYou might not like the slight glimmer.\n\nIf you need shade reference- i am a madeleine in nars rcc and a shade 4 in this one. Also i was kinda turned off by all the influencers in these review sections but i paid full price for these and dont make more than 60k a year lol #workinggirlfriendly",
        "headline": "I have severely underestimated you, Charlotte Tilbury",
        "rating": 5,
        "ugc_id": 522664412
      },
      "faceoff_negative": {
        "comments": "This was my first CT product and it didn't really blow me away. The formula wasn't anything special, if anything it settled in the creases under my eyes. I don't really like glitter in my makeup either; even with a radiant formula I think it should achieve more of a glow than a shimmer. I wouldn't recommend this for anyone with aging skin who is going for a subtle look. It would probably do fine with someone in their teens or 20s or someone who can/will put all the proper products below/above this to make it work. Certainly if it's something you think you wouldn't mind then go for it. It's very pigmented so you will get a great bang for your buck. \n\nSince Covid I've become very low maintenance with my skin and makeup routines. I generally don't wear any makeup except concealer under my eyes some days but this just wasn't what I needed it to be to replace the 2 I already have in rotation. It doesn't quite achieve the \"no makeup, makeup\" look. I can appreciate that it is probably a fine product for someone else. Just not me.",
        "headline": "Meh",
        "rating": 3,
        "ugc_id": 498866123
      },
      "native_review_count": 26,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 481,
      "locale": "en_US"
    }
  }
}