{
  "product_id": "pimprod2052756",
  "product_url": "https://www.ulta.com/p/dramatically-different-moisturizing-lotion-spf35-face-pimprod2052756",
  "extracted_at": "2025-09-23T03:47:58.269376+00:00",
  "product_name": "CliniqueDramatically Different Moisturizing Lotion+ SPF35 for Face",
  "brand": "Clinique",
  "categories": [
    "Home",
    "Body Care",
    "Suncare",
    "Sunscreen"
  ],
  "category_keys": [
    "home",
    "body-care",
    "suncare",
    "sun-care"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "34.00",
  "availability": "in_stock",
  "rating_avg": "4.5",
  "rating_count": "419",
  "images": [
    "https://media.ulta.com/i/ulta/2640696?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2640696?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2640696_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2640696_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2640696_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2640696_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2640696_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2640696_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2640696_alt07?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2640696cm_vid01/thumbs/f53d63ee-0d8d-4f99-a086-11cc73abafc9?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsSustainable Packaging​​Clinique Dramatically Different Moisturizing Lotion+ SPF 35 strengthens skin’s barrier, instantly boosts moisture, and helps protect with SPF.​",
  "details": "DetailsBenefitsSkin Types: Very Dry to Dry, Dry CombinationLightweight moisturizing face lotion helps protect with SPF - without leaving a white cast.Leaves skin healthier and more resilient.Strengthens skin’s barrier to help keep more moisture in and harmful irritants out.Delivers instant and all-day hydration, soothing skin in need of comfort.Replenishes skin's oil-water balance for healthier skin.Helps defend against skin-damaging UVA and UVB rays. When used as directed, SPF 35 filters up to 97% of UV rays. (UV rays associated with sunburn; based on SPF testing.)Silky lotion slips on easily, absorbs quickly. Non-greasy.Works well under makeup.Free of: Parabens, phthalates, oil, sodium lauryl sulfate, sodium laureth sulfate.Non-acnegenic.Dermatologist developed. Dermatologist tested. Allergy tested. 100% fragrance free. Safe for sensitive skin.Key IngredientsPure glycerin: This powerful humectant helps attract and retain moisture to help repair and support the skin barrier.Hyaluronic acid: This moisture-binding ingredient helps infuse skin with plumping hydration.Research ResultsRapidly repairs skin's protective barrier by 21% in just 2 hours.*Rapidly strengthens skin's protective barrier by 45% in 4 hours.*Instantly boosts skin's moisture by 58%.*Other powerful results:95% say skin instantly looks healthier and more radiant.**93% say skin instantly feels stronger and more resilient.**98% say they don't see a white cast.**98% say it's gentle and non-irritating.****Clinical testing on 24 women.**Consumer testing on 170 women immediately after product use.***Consumer testing on 172 women after 1 week of product use.Item 2640696How To UseApply face lotion with SPF to face in the AM.For best results, use after Liquid Facial Soap and Clarifying Lotion.IngredientsAvobenzone 3%, Homosalate 7%, Octisalate 4.5%, Octocrylene 5%Ingredients: Water\\Aqua\\Eau, Glycerin, Butylene Glycol, Phenyl Trimethicone, Butyloctyl Salicylate, Peg-100 Stearate, Silica, Silica Silylate, Hydrogenated Lecithin, Dextrin Palmitate, Sodium Hyaluronate, Biosaccharide Gum-1, Caprylyl Glycol, Cetearyl Alcohol, Potassium Cetyl Phosphate, Hexylene Glycol, Tromethamine, Triacontanyl Pvp, Carbomer, Stearyl Alcohol, Dehydroxanthan Gum, Disodium Edta, Phenoxyethanol, Potassium Sorbate, Red 33 (Ci 17200), Yellow 5 (Ci 19140), Yellow 6 (Ci 15985).Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Apply face lotion with SPF to face in the AM.For best results, use after Liquid Facial Soap and Clarifying Lotion.",
  "ingredients": [
    "Avobenzone 3%",
    "Homosalate 7%",
    "Octisalate 4.5%",
    "Octocrylene 5%Ingredients: Water\\Aqua\\Eau",
    "Glycerin",
    "Butylene Glycol",
    "Phenyl Trimethicone",
    "Butyloctyl Salicylate",
    "Peg-100 Stearate",
    "Silica",
    "Silica Silylate",
    "Hydrogenated Lecithin",
    "Dextrin Palmitate",
    "Sodium Hyaluronate",
    "Biosaccharide Gum-1",
    "Caprylyl Glycol",
    "Cetearyl Alcohol",
    "Potassium Cetyl Phosphate",
    "Hexylene Glycol",
    "Tromethamine",
    "Triacontanyl Pvp",
    "Carbomer",
    "Stearyl Alcohol",
    "Dehydroxanthan Gum",
    "Disodium Edta",
    "Phenoxyethanol",
    "Potassium Sorbate",
    "Red 33 (Ci 17200)",
    "Yellow 5 (Ci 19140)",
    "Yellow 6 (Ci 15985)"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "body",
      "sunscreen",
      "sun-care",
      "bath-body"
    ],
    "product_type": [
      "moisturizer",
      "sunscreen"
    ],
    "skin_type": [
      "dry",
      "combination",
      "sensitive",
      "acne-prone"
    ],
    "finish": [
      "dewy",
      "sheer",
      "creamy",
      "liquid",
      "oil"
    ],
    "brand": [
      "luxury",
      "mid-range"
    ],
    "special_features": [
      "dermatologist-tested",
      "hypoallergenic",
      "fragrance-free",
      "spf",
      "hydrating",
      "brightening",
      "soothing"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2052756",
    "total_reviews": 419,
    "reviews": [
      {
        "review_id": 561011011,
        "rating": 5,
        "headline": "I would buy this again",
        "comments": "I wish it was a bigger size",
        "nickname": "",
        "location": "Herriman UT",
        "created_date": 1755965592582,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559827035,
        "rating": 5,
        "headline": "Been waiting for this!",
        "comments": "Finally Clinique made their daily lotion with sunscreen and it's as good as I was hoping it would be! Goes on smooth with no greasy feeling. I hope they make a larger size soon! The two sizes they offer are small!",
        "nickname": "Tami",
        "location": "Foster City",
        "created_date": 1754666635266,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559178624,
        "rating": 1,
        "headline": "I would not buy this product again.",
        "comments": "I've used dramatically different lotion for many years.  This new version with sunscreen feels heavy and greasy on my face.  I felt so uncomfortable and Jcouldn't wait to get it off.  I will go back to using my separate sunscreen.",
        "nickname": "Jen",
        "location": "Newport RI",
        "created_date": 1754170271758,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558123160,
        "rating": 5,
        "headline": "My favorite moisturizer",
        "comments": "I'm so happy it's now offered with SPF",
        "nickname": "",
        "location": "Arizona",
        "created_date": 1753371984470,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558016386,
        "rating": 1,
        "headline": "I am going to return it.",
        "comments": "I'm going to return it. I cannot find a clinic sunscreen that I like. At least this one does not \"ball-up\" like The moisture surge and wrinkle cream ones did on me. However, it was a little too oily for me, and the smell was too \"sunscreeny\" for me to wear in my daily moisturizer.",
        "nickname": "JA",
        "location": "Waukesha, WI",
        "created_date": 1753198829972,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556969560,
        "rating": 4,
        "headline": "Works fine",
        "comments": "It's a good enough sunscreen, it is moisturizing. Was hoping it would be a 1 and done but with sweating it needs reapplication every 2 hours, can't blame it for that all sunscreen does. Does burn if sweat drips product into your eyes. \n\nApplies easily, and you can barely feel it on your face at all. Doesn't give your face a white cast or anything. Nice enough to use daily.",
        "nickname": "Wolfie",
        "location": "Paris, KY",
        "created_date": 1752274383024,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 6,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        5,
        7,
        23,
        124,
        260
      ],
      "review_histogram": [
        5,
        7,
        23,
        124,
        260
      ],
      "rating_count": 419,
      "review_count": 419,
      "average_rating": 4.5,
      "recommended_ratio": 0.94,
      "media": [],
      "faceoff_positive": {
        "comments": "[I received this product in exchange for my honest review] I received the Clinique Dramatically Different Moisturizing Lotion at no cost in exchange for my review. \n\nClinique's Dramatically Different Moisturizing Lotion + Broad Spectrum SPF 35 delivers a smooth, soothing experience that feels like a daily boost of comfort and protection.\n\nTexture & Absorption\nThe lightweight lotion glides effortlessly across the skin—silky without being slick. It absorbs quickly, leaving a soft, velvety finish that isn't greasy. Perfect for both morning routines and hot, humid days.\n\nScent\nScent is delicate and clean, a whisper of fresh cotton with a hint of sunscreen powder. It's subtle enough that even those sensitive to fragrances will find it pleasant or nearly unnoticeable.\n\nSun Protection\nWith SPF 35, this moisturizer provides solid daily defense, shielding your skin from both UVA and UVB rays. It works well under makeup or alone, offering peace of mind without the heaviness of a thick sunscreen.\n\nPackaging\nHoused in a crisp, opaque bottle with a simple pump top, it feels sturdy and hygienic. The pump dispenses just the right amount—no spills, no wastage. And the minimalistic design is clean and functional, fitting seamlessly into any bathroom shelf.\n\nFinal Thoughts\nThis lotion strikes a wonderful balance: nourishing yet non‑oily, fragranced yet subtle, moisturizing yet protective. It's a reliable daily staple for anyone seeking hydration with trusted sun care—all wrapped in a user‑friendly package.",
        "headline": "Daily Hydration with Sun-Smart Protection",
        "rating": 5,
        "ugc_id": 557692289
      },
      "faceoff_negative": {
        "comments": "I received the Clinique Dramatically Different Moisturizing Lotion + Broad Spectrum SPF 35 for free in exchange for my honest review. \n\nAs someone with dehydrated, not necessarily dry skin, I was a bit apprehensive about trying this product. It's marketed toward very dry to dry combination skin, and I wasn't sure if it would suit my particular skin needs. But I was intrigued by the built-in SPF 35 and Clinique's reputation for gentle, dermatologist-developed formulas.\n\nThe first use was fairly good. The texture is light and absorbs quickly without feeling greasy or heavy. Right after applying, my skin was noticeably more hydrated and had a healthy, plump look. It created a smooth base for makeup, and I didn't notice any pilling or interference with my foundation or concealer.\n\nIt held up well throughout most of the day, and my skin felt comfortable with it on. However, around the 7-hour mark, I started to notice my skin feeling tight and a bit parched, especially in my cheek and forehead areas where I tend to lose moisture fastest. It wasn't flaky or irritated; it just felt dehydrated. \n\nI wore this moisturizer two more days because that was all I could take of it. I found it made my makeup look a bit separated, and I followed the same skincare routine that I used on the first day of application. So, that was a bit disappointing. I think it could be because of the SPF ingredients since I don't have this experience with my usual moisturizer that doesn't contain SPF. \n\nOverall, this could be a solid product for someone looking for a daytime moisturizer with SPF and who has truly dry or dry combination skin. But for those with dehydrated skin, it might not provide long-lasting hydration, especially for extended wear. I'd recommend layering it over a hydrating serum or mist for possibly better results.",
        "headline": "Good but not great for my skin",
        "rating": 3,
        "ugc_id": 555563049
      },
      "name": "Dramatically Different Moisturizing Lotion+ SPF35 for Face",
      "native_review_count": 6,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 413,
      "locale": "en_US"
    }
  }
}