{
  "product_id": "pimprod2042538",
  "product_url": "https://www.ulta.com/p/take-day-off-facial-cleansing-mousse-cleanser-pimprod2042538",
  "extracted_at": "2025-09-23T05:22:36.832713+00:00",
  "product_name": "CliniqueTake The Day Off Facial Cleansing Mousse Cleanser",
  "brand": "Clinique",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wash"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "34.00",
  "availability": "in_stock",
  "rating_avg": "3.6",
  "rating_count": "91",
  "images": [
    "https://media.ulta.com/i/ulta/2616986?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2616986?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2616986cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2616986cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2616986cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2616986cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2616986cm_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2616986cm_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2616986cm_alt07?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2616986cm_vid01/thumbs/8bf3ff2a-ee10-41d5-ac12-999c2d1587c5?w=600&h=337&fmt=auto",
    "https://media.ulta.com/v/ulta/2616986cm_vid02/thumbs/82ac15d0-c534-4e0a-83d3-4e811722a5d7?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsSustainable PackagingClinique's Take The Day Off Facial Cleansing Mousse Cleanser removes makeup, sunscreen, oil, and other impurities for clean, refreshed skin.",
  "details": "DetailsBenefitsAll skin typesSilky mousse cleanser lathers into a soft, comforting foamIn seconds, starts to remove makeup, excess oil, sunscreen, dirt, and pollutionCleanses thoroughly, rinses off completelyLeaves skin clean, smooth, and refreshedDermatologist testedAllergy tested and 100% fragrance freeKey Ingredients10% glycerin + hyaluronic acidNaturally derived cleansing system, with coconutResearch ResultsClinical improvements in:Skin texture*Skin smoothness**Clinical testing on 26 women after using the product onceItem 2616986How To UseUse cleanser morning and night, avoiding eye area.Preps skin to better absorb products that follow.At night, use after Take The Day Off Cleansing Balm for the ultimate double cleanse.IngredientsWater\\Aqua\\Eau, Myristic Acid, Glycerin, Sodium Methyl Cocoyl Taurate, Potassium Hydroxide, Lauric Acid, Behenic Acid, Ppg-24-Glycereth-24, Sodium Hyaluronate, Sodium Acetylated Hyaluronate, Butylene Glycol, Caprylyl Glycol, Glycol Distearate, Polyquaternium-7, Hexylene Glycol, Tetrasodium Edta, Phenoxyethanol, Sodium Benzoate, Ext. Violet 2 (CI 60730).Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Use cleanser morning and night, avoiding eye area.Preps skin to better absorb products that follow.At night, use after Take The Day Off Cleansing Balm for the ultimate double cleanse.",
  "ingredients": [
    "Water\\Aqua\\Eau",
    "Myristic Acid",
    "Glycerin",
    "Sodium Methyl Cocoyl Taurate",
    "Potassium Hydroxide",
    "Lauric Acid",
    "Behenic Acid",
    "Ppg-24-Glycereth-24",
    "Sodium Hyaluronate",
    "Sodium Acetylated Hyaluronate",
    "Butylene Glycol",
    "Caprylyl Glycol",
    "Glycol Distearate",
    "Polyquaternium-7",
    "Hexylene Glycol",
    "Tetrasodium Edta",
    "Phenoxyethanol",
    "Sodium Benzoate",
    "Ext. Violet 2 ("
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser",
      "day cream"
    ],
    "skin_type": [
      "all skin types"
    ],
    "finish": [
      "sheer",
      "creamy",
      "oil",
      "foam"
    ],
    "brand": [
      "luxury",
      "mid-range"
    ],
    "special_features": [
      "natural",
      "dermatologist-tested",
      "hypoallergenic",
      "fragrance-free",
      "purifying"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2042538",
    "total_reviews": 91,
    "reviews": [
      {
        "review_id": 555687637,
        "rating": 3,
        "headline": "Takes off makeup but I would not purchase again",
        "comments": "I was looking for a new facewash that specifically removes makeup. This lathers well, has a nice creamy texture, and a little goes a long way. It effectively removed my makeup, but it left my skin feeling dry/tight and stung my eyes pretty bad.",
        "nickname": "Christen",
        "location": "Sonoma, CA",
        "created_date": 1750570705532,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553942902,
        "rating": 2,
        "headline": "Not as good as the balm",
        "comments": "I love the take off the day balm and oil, but the mousse didnt take my mascara off as well and stung my eyes like crazy.",
        "nickname": "Amanda",
        "location": "Lansing, MI",
        "created_date": 1748117680407,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 4
      },
      {
        "review_id": 552045427,
        "rating": 5,
        "headline": "The best make up remover.",
        "comments": "The best make up remover I ever used. Other brands were too harsh on my face and barely removed the make up.",
        "nickname": "Susan",
        "location": "Waukesha, Wisconsin",
        "created_date": 1745031659267,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551047492,
        "rating": 5,
        "headline": "Fine on my sensitive skin!",
        "comments": "I got a sample of this and had no problems on my super sensitive rosacea skin. Loved the smoothness of the foam and it washed off clean. I'll buy a tube.",
        "nickname": "J",
        "location": "NC",
        "created_date": 1743796746974,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 548886955,
        "rating": 2,
        "headline": "removed my makeup but my eyes burnedddd",
        "comments": "i got the travel size cleansing mousse with a free gift after i bought clinique products and was excited to try it. i read the back and there were no words in the directions saying avoid eyes. i only wear eyeliner and mascara so the eyes were the only place i needed to use it. once i put it on my eyes and rubbed it in, it burned like helllll. after i used it i looked on the back again and there is a little picture of an eye crossed out. but like who makes a makeup remover that cant be used on eyes like what???!!! make it make sense.",
        "nickname": "tessi",
        "location": "covington, LA",
        "created_date": 1742183416533,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 7
      },
      {
        "review_id": 547579856,
        "rating": 1,
        "headline": "Painful!",
        "comments": "I used it and within 30 seconds my face started burning. I rinsed it off as fast as I could, and my face was all red and tingly, even a day later it's irritated and red. I don't know what's in this stuff, but I've never had a reaction like that before and I use Take The Day Off Balm with no problems.",
        "nickname": "Kris",
        "location": "IL",
        "created_date": 1740917553466,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 1
      },
      {
        "review_id": 545711285,
        "rating": 1,
        "headline": "Oh boy did I mess up",
        "comments": "Please use caution with this product. I used this to take off my makeup at the end of the day, assuming it was a similar formula to the other 'take the day off' products like their cleansing balm. It was indeed not. My eyes have never burned more. I dont know why they would make a makeup remover you cannot put anywhere near your eyes. To be fair there was a TINY 'avoid contact with eyes' on the back, I read after I burned my eyes. Even so, there is still redness aroumd my eyes and all over my cheeks. I have allergic reactions to a lot of products so I had to take multiple benadryl after this experience and am hoping not to wake up with my eyes completely swollen shut tomorrow.",
        "nickname": "D",
        "location": "Wisconsin",
        "created_date": 1738299954931,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 2
      },
      {
        "review_id": 542263317,
        "rating": 5,
        "headline": "Does what it says!",
        "comments": "Love the formula, hate the smell.  I mean, it's not fragranced, but it has a chemical smell to it.  That said, its one of the most effective cleaners I've ever used.  I use only as an evening cleanser—it literally removes every trace of makeup/dirt/oil.  It foams up very nicely, it rinses right off, and it doesn't leave any residue.  I use over my eyes, but I don't open them until I've thoroughly rinsed, so I've never had an issue with it burning my eyes.  I do prefer the smell of Clinque's liquid soap facial cleanser—actually, I love the non-fragrances smell of that one; wish this could smell just clean rather than \"chemically\".  Take the day off will leave your skin squeaky clean.  I don't mind that because I apply serum and moisturizer afterward.  When the bottle got to then end, it still felt kind of heavy.  I cut the tube and scraped out what was left and transferred to a clean, reusable jar and got about 3 more weeks of cleanser out if it.  Will purchase again when I've worked through my stash of other face cleansers I've purchased.",
        "nickname": "Fragrance Obsessed",
        "location": "Minnesota",
        "created_date": 1736083673376,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542007177,
        "rating": 1,
        "headline": "Not for sensitive skin",
        "comments": "I had high hopes, cause a little went a long way once the product was wet. Didnt have any reaction the first time, then the second is when i felt a burn. I think this may have dried out my skin since its one of two new products i added to my routine (the other being a moisterizer)",
        "nickname": "Sj",
        "location": "Orange, CA",
        "created_date": 1735578322677,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 541626702,
        "rating": 5,
        "headline": "Love this cleanser!",
        "comments": "This cleanser takes off a full coverage full face of makeup in one shot. It leaves my normal-to-oily skin feeling amazing! I highly recommend this cleanser.",
        "nickname": "doodlemars",
        "location": "Houston, TX",
        "created_date": 1734828607599,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541557125,
        "rating": 5,
        "headline": "Love it",
        "comments": "This product is awesome!!  So silky smooth as it cleanses your face.",
        "nickname": "Kathy",
        "location": "Westland, MI",
        "created_date": 1734712080917,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541410526,
        "rating": 5,
        "headline": "I would buy this again",
        "comments": "Leaves my face clean and fresh not dry",
        "nickname": "Samantha",
        "location": "Bloomfield CT",
        "created_date": 1734539331599,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541083908,
        "rating": 1,
        "headline": "I had a bad reaction to this",
        "comments": "I have never once had a bad reaction to a skin care or makeup product before, but immedietly after trying this my face was hot and I started to develop hives, Do not try this product!",
        "nickname": "Any",
        "location": "Phoenix, Az",
        "created_date": 1734242485075,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541083742,
        "rating": 3,
        "headline": "My skin had a bad reaction to this product",
        "comments": "I tried this product from my grab bag, and my skin was immedietly burning and inflamed after using. I have never once had a bad reaction to a makeup or skin care product i have used before, so if you're gettin this make sure you know about the ingredients, otherwise it lathered well and did good job taking off my makeup.",
        "nickname": "Any",
        "location": "Phoenix, Az",
        "created_date": 1734241916420,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 539069691,
        "rating": 5,
        "headline": "Clinique Take The Day Off Mousse",
        "comments": "Love the texture of this cleanser. Made my skin feel smooth.",
        "nickname": "salAMANDAr1010",
        "location": "WI",
        "created_date": 1733461007897,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 538625841,
        "rating": 5,
        "headline": "My new favorite",
        "comments": "I bought a Clinique grab bag from Ulta because i wanted to try the black cherry lipgloss. It came with this product, the \"take the day off\" mousse, and i absolutely fell in love. I live in a dry colder climate in Denver CO and finding products that dont dry me out is crucial. This stuff works like a charm, a little goes a long way, and youre ready to face the world with a bare face in no time. I couple this with Cliniques eye makeup remover instead of rubbing this stuff in/near my eyes.",
        "nickname": "Loren",
        "location": "Denver, CO",
        "created_date": 1732588476431,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537885383,
        "rating": 5,
        "headline": "Gentle cleanser",
        "comments": "It makes my skin feel so soft and renewed and clean.",
        "nickname": "Bobbie",
        "location": "Grants Pass, OR",
        "created_date": 1731688294113,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537617754,
        "rating": 5,
        "headline": "Love the texture",
        "comments": "A little goes a long way. Does a great job of removing makeup, leaving my skin fresh and clean. Did not have to doubie cleanse. A nice product from Clinique.",
        "nickname": "Shoefan",
        "location": "Frisco TX",
        "created_date": 1731289229287,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 535318952,
        "rating": 2,
        "headline": "Take the day off mousse",
        "comments": "I got the mousse in a gift.   I like the esy it removes makeup, but the stinhing of my skin is not worth it.  Im going back to my DHC oil.\n\nI wish Clinique would provide an explanation.",
        "nickname": "Mo",
        "location": "St Louis, MO",
        "created_date": 1727920584088,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 534280097,
        "rating": 4,
        "headline": "All Traces of Makeup Are Gone!",
        "comments": "I tried this when it first came out and I returned it because it burned my eyes no matter how careful i was. I repurchased 6 months later because after trying many other products this one was the best at removing all my makeup and leaving my skin soft, not tight dry or itchy. I still am very careful not to get near my eyes but when i did, it didn't burn as much as I remembered. I use the liquid take the day off with a cotton pad for my eye makeup. Now, im always stocked with this stuff.",
        "nickname": "Awoww",
        "location": "So Cal",
        "created_date": 1727246248206,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 60,
      "pages_total": 3,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2042538/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        21,
        8,
        4,
        8,
        50
      ],
      "review_histogram": [
        21,
        8,
        4,
        8,
        50
      ],
      "rating_count": 91,
      "review_count": 91,
      "average_rating": 3.64,
      "recommended_ratio": 0.7,
      "media": [],
      "faceoff_positive": {
        "comments": "I recently purchased this by recommendation from a Clinique specialist who to use an official cleanser to wash my face. At first I thought, \"here we go buying more product that should do the same things\", but I realized all products that state they take off makeup & cleanses actually never do and i always wake up finding maskara left under my eyes which add to dark circles when I wash my face over 3 times.. I use the \"take-it-off\" pomade origional and alternate with the new charcoal pomade to aggressively remove my mascara and liner ect., then this cleanser to removed ALL left over- never see a glimps of leftover makeup on my lashes or under my eyes! When I wash my face I feel my skin squeak!. Its that powerful and a nickel size is more than enough and with a little water it lathers like a mouse. Absolutely have to follow-up with a good moisturizer since your skin is thouroughly cleaned and may need extra strength if your face is extremely dry (which drinking water w/ electrolytes can help!) If you need a good cleansure without any leftover residue feel, this is definitely it! I would continue buying this!",
        "headline": "Takes IT ALL OFF!",
        "rating": 5,
        "ugc_id": 508935775
      },
      "faceoff_negative": {
        "comments": "Let me preface this by saying I love Clinique products and recommend them to everyone I know. Clinique products have always been great for me. Now, I tried this product which I ordered from Ulta Beauty. I followed the directions and specifically avoided the eye area. It lathered nicely, but within moments it started to burn. I frantically was grabbing my soft cloth to get it off as I didn't think just water would be fast enough to get it off. I had a big red mark on my cheekbone and my skin was burning. I've been trying to sooth it with Redness Relief Cream and Moisture Surge which I'm keeping in the fridge for a cooling affect. When I apply cream, my skin hurts. Please note, I very rarely review products, but this was so bad I felt I needed to share my feedback. I would give 0 stars if I could. The only thing I would recommend with this product is that Ulta Beauty and Clinique stop selling it.",
        "headline": "Save your skin!!!",
        "rating": 1,
        "ugc_id": 511176927
      },
      "name": "Take The Day Off Facial Cleansing Mousse Cleanser",
      "native_review_count": 60,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 31,
      "locale": "en_US"
    }
  }
}