{
  "product_id": "pimprod2049076",
  "product_url": "https://www.ulta.com/p/electrolyte-water-cream-pimprod2049076",
  "extracted_at": "2025-09-23T03:49:41.270563+00:00",
  "product_name": "cocokindElectrolyte Water Cream",
  "brand": "cocokind",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Face Moisturizer"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "face"
  ],
  "currency": "USD",
  "list_price": "19.99",
  "sale_price": "13.99",
  "availability": "in_stock",
  "rating_avg": "4.7",
  "rating_count": "321",
  "images": [
    "https://media.ulta.com/i/ulta/2632910?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2632910?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2632910_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2632910_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2632910_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2632910_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2632910_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2632910_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2632910_alt07?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive BackCocokind's electrolyte-powered water cream delivers lightweight, breathable hydration that softens, plumps, and revitalizes skin. An electrolyte blend (magnesium PCA, sodium PCA, and zinc PCA) supports skin's natural moisturizing factors, balances hydration, and controls shine.",
  "details": "DetailsBenefitsUnique gel texture absorbs quickly with a shine-free, non-sticky finishOptimized formula locks in lightweight, calming hydrationVisibly calms stressed, irritated skin and reduces rednessHelps replenish and maintain optimal moisture levelsHelps improve skin barrier strength and restores moisture balance to dehydrated skinDermatologist Tested and Clinically Tested for Sensitive SkinPerfect for combo, oily, and blemish-prone skin, daytime skin prep, or anytime you want a weightless, smooth finishKey IngredientsElectrolyte Blend (magnesium PCA, zinc PCA, sodium PCA) Optimizes performance of the formula's hydrating ingredients and supports skin’s own natural moisturizing factors to balance moisture levels, support healthy skin barrier function, and defend against environmental stress.Magnesium PCA: activates natural skin functions to revitalize dull, lackluster skin, while also supporting the skin barrier.Zinc PCA: helps visibly calm stressed skin, reduce redness, and control oil.Sodium PCA: helps balance skin’s hydration levels over time and keeps skin looking plump.Beta Glucan: Delivers hydration that can outperform many forms of hyaluronic acid and supports optimal skin barrier functionGlycerin: Powerful humectant draws in moisture helping to hydrate, soften, and soothe skin's appearance.Microalgae peptides: Sustainably cultivated, helps protect sensitive skin from signs of stress and redness.Item 2632910How To UseDispense 2-3 pumps onto clean skin and gently massage over the face and neck. Cream can be used in the morning and/or evening to soften, plump, and revitalize skin.IngredientsWater/Eau, Glycerin, Propanediol, Coco-Caprylate/Caprate, Caprylic/Capric Triglyceride, Sodium Acrylates Copolymer, Pentylene Glycol, Magnesium Pca, Sodium Pca, Zinc Pca, Manganese Pca, Beta-Glucan, Chlamydomonas Extract, Sea Water (Maris Aqua) (Eau De Mer), Ceramide Np, Lecithin, Caprylyl Glycol, Glyceryl Acrylate/Acrylic Acid Copolymer, Maltodextrin, Aloe Barbadensis Flower Extract, Curcuma Longa (Turmeric) Root Extract, Solanum Melongena (Eggplant) Fruit Extract, Ocimum Basilicum (Basil) Flower/Leaf Extract, Coccinia Indica Fruit Extract, Melia Azadirachta Leaf Extract, Melia Azadirachta Flower Extract, Corallina Officinalis Extract, Ocimum Sanctum Leaf Extract, Ethylhexylglycerin.",
  "how_to_use": "Dispense 2-3 pumps onto clean skin and gently massage over the face and neck. Cream can be used in the morning and/or evening to soften, plump, and revitalize skin.",
  "ingredients": [
    "Water/Eau",
    "Glycerin",
    "Propanediol",
    "Coco-Caprylate/Caprate",
    "Caprylic/Capric Triglyceride",
    "Sodium Acrylates Copolymer",
    "Pentylene Glycol",
    "Magnesium Pca",
    "Sodium Pca",
    "Zinc Pca",
    "Manganese Pca",
    "Beta-Glucan",
    "Chlamydomonas Extract",
    "Sea Water (Maris Aqua) (Eau De Mer)",
    "Ceramide Np",
    "Lecithin",
    "Caprylyl Glycol",
    "Glyceryl Acrylate/Acrylic Acid Copolymer",
    "Maltodextrin",
    "Aloe Barbadensis Flower Extract",
    "Curcuma Longa (Turmeric) Root Extract",
    "Solanum Melongena (Eggplant) Fruit Extract",
    "Ocimum Basilicum (Basil) Flower/Leaf Extract",
    "Coccinia Indica Fruit Extract",
    "Melia Azadirachta Leaf Extract",
    "Melia Azadirachta Flower Extract",
    "Corallina Officinalis Extract",
    "Ocimum Sanctum Leaf Extract",
    "Ethylhexylglycerin"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "moisturizer"
    ],
    "skin_type": [
      "oily",
      "dry",
      "combination",
      "sensitive",
      "acne-prone"
    ],
    "finish": [
      "matte",
      "sheer",
      "creamy",
      "cream",
      "gel",
      "oil"
    ],
    "ingredients": [
      "ceramides"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "natural",
      "dermatologist-tested",
      "hydrating",
      "soothing"
    ]
  },
  "reviews": {
    "product_id": "pimprod2049076",
    "total_reviews": 321,
    "reviews": [
      {
        "review_id": 561180698,
        "rating": 5,
        "headline": "I would repurchase",
        "comments": "This cream basically melts into the skin. I have sensitive skin and this works great for me, I use it in the morning before SPF and I noticed that the SPF pills less when I use this cream first. Lightweight but still plenty of hydration.",
        "nickname": "Lola",
        "location": "New York",
        "created_date": 1756303830217,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 561042664,
        "rating": 5,
        "headline": "Wonderful",
        "comments": "I switched from Clinique moisture surge to this and I am in love with it. Not greasy, very lightweight on skin!",
        "nickname": "Susan",
        "location": "Ohio",
        "created_date": 1756050137465,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 561024798,
        "rating": 3,
        "headline": "Won't repurchase",
        "comments": "This was just okay. I expected a much more soothing affect than what I got from it but it does not hurt my skin so I will continue to use. I was hoping it was a good dupe for the Tatcha Water Cream but it doesn't even come close.",
        "nickname": "MilaBilla",
        "location": "Cleveland, OH",
        "created_date": 1755993227206,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560370404,
        "rating": 5,
        "headline": "Obsessed",
        "comments": "It made my skin feel so nourished and hydrated. Most moisturizers are too heavy for my skin but this moisturizer is so light weight and refreshing.",
        "nickname": "Ri",
        "location": "New Jersey",
        "created_date": 1755459015969,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559892154,
        "rating": 5,
        "headline": "I replaced my Clinique Moisture Surge 100h with this!",
        "comments": "I ordered this on a whim because their rosewater toner became a staple in my nightly skincare routine (I've bought it repeatedly, probably on bottle #5 at this point) and I needed a lightweight (affordable) moisturizer. \n\nI've always struggled with shine and oily skin throughout the day, the Clinique was fantastic but WAY too expensive so I tried this. \n\nI've been using it all summer, morning and night - it wears great under makeup (I use the NYX pore eraser primer or the Smashbox one, and Estee Lauder doublewear foundation), and I don't feel oily OR dry. At night, I use this followed by a few spritzes of the rosewater toner. It's lightweight enough for summer humidity, and I know it's moisturizing enough to get me through the Maine winter. \n\nThis is a fantastic product and I'm about to buy a second bottle!",
        "nickname": "Gabrielle",
        "location": "Maine",
        "created_date": 1754837476552,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559841574,
        "rating": 5,
        "headline": "I love this moisturizer",
        "comments": "I am someone with oily acne prone skin and I love this moisturizer. It is super lightweight but is also deeply hydrating. I also love the airless pump delivery mechanism, so you get every last drop.",
        "nickname": "Kendall",
        "location": "State College, PA",
        "created_date": 1754682087842,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559381396,
        "rating": 5,
        "headline": "My skin loves it",
        "comments": "This moisturizer is everything I need out of a moisturizer. First of all, it feels amazing and cooling on the skin. It never pills with my other products and sits beautifully under makeup. My redness has been noticeably reduced. It's lovely!",
        "nickname": "Heather",
        "location": "Florida",
        "created_date": 1754445534811,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559316409,
        "rating": 5,
        "headline": "The best moisturizer ever",
        "comments": "I used to be a Paula's choice fan, until every product that worked well for my skin was discontinued. It took me a long time to find those products,  so I was a little upset that I was going to have to start the whole process of trying new products and deal with nasty breakouts and my skin freaking out. I wouldn't say my skin is sensitive, but moisturizers and me don't get along. I actually decided to not use moisturizer anymore because I didn't want to deal with the hassle. Even with trenitoin and salycilic acid, my face was ok without moisturizer,  but after awhile I started to miss slathering my face with it, so I went searching for products. I tried a few and got horrible cysts on my face, some made my face red, and burn and peel like crazy. I found the coco water cream and decided to try it and what ever is in this product helps with pimples. My pimples were all gone after 4 days. My skin is clear, hydrated and no irritation. It doesn't leave a gross thick film on the face. I hope this product never gets discontinued.",
        "nickname": "Sarah",
        "location": "CA",
        "created_date": 1754405249441,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559201888,
        "rating": 3,
        "headline": "Broke out",
        "comments": "As an acne prone skin girly, wanted to love this, but I kept breaking out every time I used it.",
        "nickname": "Ann",
        "location": "Ca",
        "created_date": 1754234736479,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 2
      },
      {
        "review_id": 559026424,
        "rating": 5,
        "headline": "My acne prone skin LOVES this",
        "comments": "my skin would be lost without this! (literally, whenever i run out and don't use it, i break out). i have oily and acne prone skin, and i tend to be sensitive to fragrances/scents. this moisturizer is light but nourishing, and it has no scent.  honestly, my skin just loves it!",
        "nickname": "Jess b",
        "location": "New Jersey",
        "created_date": 1754062919847,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 558936444,
        "rating": 5,
        "headline": "Good for oily acne prone skin.",
        "comments": "I love this moisturizer!!! Doesnt make me oily or break out. I will be purchasing again!",
        "nickname": "KB",
        "location": "Sacramento",
        "created_date": 1753999846213,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558315204,
        "rating": 5,
        "headline": "Great for summer!",
        "comments": "I usually sweat more than others especially when its hot, my face sweats the most (depending what moisturizer i use). Once I used this moisturizer, my face has been less oily and this moisturizer isnt too heavy on my face.",
        "nickname": "Amariah",
        "location": "Chicago, IL",
        "created_date": 1753502435593,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558123965,
        "rating": 5,
        "headline": "Oily/Acne-prone DREAM moisturizer",
        "comments": "I hope they never stop making this! I have oily, acne-prone, sensitive skin and this is one of the very few moisturizers I can use without breaking out. It is super lightweight, absorbs quickly, and not sticky at all. Very hard to find a moisturizer that is both silicone and oil free (and squalane-free! Squalane is such an acne trigger for me and is in a lot of products now) but this one doesn't have any of those! It hasn't caused any breakouts or clogged pores. It is rather light, so if you don't have oily skin I would say you could layer it with something heavier on top and use this as more of a hydrating step. But for me, this is the best moisturizer I've found in a long time.",
        "nickname": "Rachel",
        "location": "New York",
        "created_date": 1753373385136,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557875372,
        "rating": 5,
        "headline": "Beautiful Moisturizer",
        "comments": "I have sensitive, acne prone, reactive and combo skin. This moisturizer sinks into my skin nicely. Its similar to the tatcha water cream , but it has no scent and at a better price! I use this during make up prep and my make up lays beautifully . I get so many compliments ! I am on my second bottle and i cant get enough!!. I highly recommend this cream!",
        "nickname": "Maira",
        "location": "New York, NY",
        "created_date": 1753047039445,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557650827,
        "rating": 5,
        "headline": "Perfect lightweight moisturizer",
        "comments": "This is the perfect lightweight moisturizer! I have normal/dry skin and it provides enough hydration. It's perfect for daytime!!!!!",
        "nickname": "Sarah",
        "location": "North Carolina",
        "created_date": 1752936407904,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557107875,
        "rating": 5,
        "headline": "LOVEEE",
        "comments": "Just what i needed for a summer moisterizer and it even cleared up my skin!",
        "nickname": "Kat",
        "location": "San Jose",
        "created_date": 1752506831448,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556974111,
        "rating": 2,
        "headline": "my sensitive skin hated this",
        "comments": "I have sensitive, combination skin. My skin is pretty dehydrated/dry, but heavier moidturizers almost always break me out, while light weight moisturizers almost always irritate my skin (my rosacea doesn't react well to hyaluronic acid or niacinamide, which ironically rules out a lot of \"sensitive skin\" products). \n\nUnfortunately, this moisturizer both broke me out and irritated my skin. It also made my eyes feel like they were burning - which I've never had with a moisturizer before. I'm so disappointed and confused, because I chose this product specifically because it didn't have any of my known trigger ingredients. I had to stop using it after a couple days because of how much worse my redness was getting, and I was getting so many whiteheads everywhere.",
        "nickname": "ck",
        "location": "Portland, OR",
        "created_date": 1752290158889,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556913547,
        "rating": 5,
        "headline": "Updating my review!",
        "comments": "**I am updating my review after realizing that another active I was using in combo with this moisturizer is what broke me out so badly. **\n\nSo far I really like this moisturizer, hydrating and light weight without being oily by the end of the day. Summer super power!",
        "nickname": "Meg",
        "location": "Nj",
        "created_date": 1752161159502,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556702833,
        "rating": 5,
        "headline": "New Favorite Daily Moisturizer",
        "comments": "LOVE this product. This is perfect for normal to oily skin folks like myself. Absorbs quickly, and doesn't leave skin oily. They really hit it out if the park with this one!",
        "nickname": "Dalton",
        "location": "Denver",
        "created_date": 1751756277020,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556086465,
        "rating": 5,
        "headline": "COCOKIND is THE BEST",
        "comments": "Every single product I've tried is incredible!",
        "nickname": "Whitney",
        "location": "Los Angeles",
        "created_date": 1751344780842,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 2
      }
    ],
    "paging": {
      "total_results": 61,
      "pages_total": 4,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2049076/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        5,
        7,
        9,
        31,
        269
      ],
      "review_histogram": [
        5,
        7,
        9,
        31,
        269
      ],
      "rating_count": 321,
      "review_count": 321,
      "average_rating": 4.72,
      "recommended_ratio": 0.89,
      "media": [],
      "faceoff_positive": {
        "comments": "Firstly, if you have very dry skin, this is not the moisturizer for you. This is marketed as a lightweight gel/water consistency, so if you don't find it super moisturizing, that's the point. I see reviews speaking to that issue, but this is not sold as heavy moisture... That being said, I have truly oily skin, like oily even in the winter. Yet my skin can also be really dehydrated, especially because I avoid putting heavy moisturizer on it. If you have combination, greasy, or oily skin, I think this is perfect. I don't like most moisturizers, as they leave me feeling greasy within two hours. Normally my blotting sheets are a complete oil slick lol, but after using this moisture, there is noticeably less oil on my face. Yet it still feels soft and hydrated.\n\nIt's also hard to find a great moisturizer with toxic ingredients, without SPF, and without extra frills. I've only found two moisturizers that I like before this one, but they are too heavy for the warmer weather as it turn to May here. So I stumbled upon this and gave it a try - and it's perfect for my skin. This will suit me in all seasons, except maybe in the dead of winter… even then, I could probably get away with it as long as I use an extra hydrating serum underneath it. I'm not one to wear much makeup, and if I do its only light powder, so I can't speak to how it layers or performs underneath it.\n\nbut this is definitely a holy grail level lightweight moisturizer for those of us who have oily skin. it's so soothing, calming, and hydrating without heaviness. You really can't ask for more! I put it over a vitamin C serum and it's the perfect skin care combo for me, for every day and night. Thank you so much Cocokind, for making a simple yet highly effective moisturizer for oily skin!",
        "headline": "excellent moisturizer for oily skin!",
        "rating": 5,
        "ugc_id": 552906155
      },
      "faceoff_negative": {
        "comments": "I have sensitive, combination skin. My skin is pretty dehydrated/dry, but heavier moidturizers almost always break me out, while light weight moisturizers almost always irritate my skin (my rosacea doesn't react well to hyaluronic acid or niacinamide, which ironically rules out a lot of \"sensitive skin\" products). \n\nUnfortunately, this moisturizer both broke me out and irritated my skin. It also made my eyes feel like they were burning - which I've never had with a moisturizer before. I'm so disappointed and confused, because I chose this product specifically because it didn't have any of my known trigger ingredients. I had to stop using it after a couple days because of how much worse my redness was getting, and I was getting so many whiteheads everywhere.",
        "headline": "my sensitive skin hated this",
        "rating": 2,
        "ugc_id": 556974111
      },
      "name": "Electrolyte Water Cream",
      "native_review_count": 61,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 260,
      "locale": "en_US"
    }
  }
}