{
  "product_id": "",
  "product_url": "https://www.ulta.com/p/essentials-radiance-toner-with-glycolic-acid-xlsImpprod17761971",
  "extracted_at": "2025-09-23T03:51:04.098151+00:00",
  "product_name": "DERMA EEssentials Radiance Toner with Glycolic Acid",
  "brand": "DERMA E",
  "categories": [
    "Home",
    "Skin Care",
    "Dermatologist Recommended"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "men"
  ],
  "currency": "USD",
  "list_price": "17.00",
  "sale_price": "11.90",
  "availability": "in_stock",
  "rating_avg": "4.7",
  "rating_count": "294",
  "images": [
    "https://media.ulta.com/i/ulta/2527936?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2527936?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2527936cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2527936cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2527936cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2527936cm_alt04?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive BackDerma E's Essentials Radiance Toner with Glycolic Acid is an alcohol-free, exfoliating, beauty toner that helps to tone, tighten and brighten for a soft, smooth and luminous appearance. A must-have essential for radiant-looking skin.",
  "details": "DetailsBenefitsTighten and brighten for a soft, smooth and luminous appearanceA blend of Glycolic Acid, Rooibos, Rosehip, Chamomile, and Aloe Vera rinses impurities away, reviving the skin for a fresh and radiant complexionFeaturesRecyclable & wind energy certifiedFormulated without GMOs, gluten, or soyKey IngredientsGlycolic Acid: Helps to reveal brighter, fresher skinRooibos: Helps to detox encouraging healthy skinRosehip Extract: Helps to brighten and rejuvenate skinItem 2527936How To UsePump a small amount of cleanser into dampened hands and massage over face and neck. Rinse with water.IngredientsPurified Water, Glycolic Acid, Sodium Hyaluronate (Hyaluronic Acid), Polysorbate 20, Sodium Hydroxide, Pinus Pinaster (Pycnogenol) Bark Extract, Panthenol (Provitamin B5), Aspalathus Linearis (Rooibos) Leaf Extract, Rosa Canina (Rosehip) Fruit Extract, Saccharide Isomerate, Organic Aloe Barbadensis (Aloe Vera) Extract*, Allantoin, Organic Chamomilla Recutita (Matricaria) Flower Extract*, Cucumis Sativus (Cucumber) Fruit Extract, Phenoxyethanol, Ethylhexylglycerin, Natural Fragrance Oils.",
  "how_to_use": "Pump a small amount of cleanser into dampened hands and massage over face and neck. Rinse with water.",
  "ingredients": [
    "Purified Water",
    "Glycolic Acid",
    "Sodium Hyaluronate (Hyaluronic Acid)",
    "Polysorbate 20",
    "Sodium Hydroxide",
    "Pinus Pinaster (Pycnogenol) Bark Extract",
    "Panthenol (Provitamin B5)",
    "Aspalathus Linearis (Rooibos) Leaf Extract",
    "Rosa Canina (Rosehip) Fruit Extract",
    "Saccharide Isomerate",
    "Organic Aloe Barbadensis (Aloe Vera) Extract*",
    "Allantoin",
    "Organic Chamomilla Recutita (Matricaria) Flower Extract*",
    "Cucumis Sativus (Cucumber) Fruit Extract",
    "Phenoxyethanol",
    "Ethylhexylglycerin",
    "Natural Fragrance Oils"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "men",
      "mens"
    ],
    "product_type": [
      "toner"
    ],
    "finish": [
      "dewy",
      "sheer",
      "creamy",
      "oil"
    ],
    "ingredients": [
      "hyaluronic-acid",
      "glycolic-acid",
      "organic",
      "natural",
      "fragrance"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "organic",
      "natural",
      "alcohol-free",
      "exfoliating",
      "brightening",
      "purifying"
    ],
    "skin_type": []
  },
  "reviews": {
    "product_id": "xlsImpprod17761971",
    "total_reviews": 294,
    "reviews": [
      {
        "review_id": 538818979,
        "rating": 5,
        "headline": "Constant Repurchase",
        "comments": "This toner is one of the only ones that does not irritate my face but also has a noticeable a improvement on my skin",
        "nickname": "Bec",
        "location": "Pittsburgh, PA",
        "created_date": 1733097397673,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 538452934,
        "rating": 5,
        "headline": "Remarkable results even on the most sensitive skin..",
        "comments": "This has beena  game changer for me and my sensitive skin. I no longer get monthly breakouts, pores are smaller, and it it so gentle.",
        "nickname": "lindsay",
        "location": "IL",
        "created_date": 1732399086647,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 486582490,
        "rating": 1,
        "headline": "Not for me",
        "comments": "Used this for a month and made me breakout.",
        "nickname": "VintageDoll",
        "location": "Dallas, TX",
        "created_date": 1704433105617,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 4
      },
      {
        "review_id": 442010291,
        "rating": 5,
        "headline": "Amazing",
        "comments": "Smells good, goes on smoothly, doesn't make your face feel tight and doesn't leave any residue behind.",
        "nickname": "Noddy",
        "location": "North Augusta SC",
        "created_date": 1674882295377,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 429644314,
        "rating": 3,
        "headline": "Ruined my skin barrier",
        "comments": "Made my skin breakout and everything I did to my skin stung after using it.",
        "nickname": "Megan",
        "location": "Sugarland",
        "created_date": 1665793042788,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 422342298,
        "rating": 5,
        "headline": "Love this!",
        "comments": "Ever since I started using this my skin tone is more even, less break-outs and  improvement in my texture.",
        "nickname": "",
        "location": "Illinois",
        "created_date": 1661698589224,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 422019758,
        "rating": 5,
        "headline": "Good purchase... Great toner for my skin!",
        "comments": "I have been using this toner for about month now and I'm very happy with the results. I have dry skin and even drier skin in the winter. I use this day and night after cleansing my skin. It evens out my skin by getting rid of dead skin cells and it helps prepare my skin for my serums & moisturizers. I notice that my skin absorbs serums & moisturizers much better these days. This is definitely a good addition to my skincare routine.",
        "nickname": "JP",
        "location": "Washington, DC",
        "created_date": 1661483295662,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 402358835,
        "rating": 4,
        "headline": "Love",
        "comments": "Got a sample, loved it so much I bought the full size. The toner hydrates my dry skin so well. While I'm usually not a fan of scented products, the lotus-like smell is so nostalgic that I don't mind it too much - it's a nice scent in the morning.\n\nI did dock one point because of what another commenter mentioned - there is definitely crusting around the bottle cap. It's pretty clear that it's due to the toner running down, settling and drying there, but it can be annoying.",
        "nickname": "S",
        "location": "California",
        "created_date": 1647506279241,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 392504956,
        "rating": 5,
        "headline": "Fantastic Toner",
        "comments": "I've been using this toner for about 4 months now and I don't see myself ever using a different type of toner. I have a health condition that can really dry out my skin, and when that happens it makes my skin so much more hydrated and I feel so much more comfortable. During the months where my skin tends to go more to the oily side, I feel like my skin is still very well balanced. The ingredients like glycolic acid, hyaluronic acid, and pycnogenol are amazing. Different parts of this contributes different benefits; Exfoliating, hydrating, anti-inflammatory, reduces redness, prevents UV ray damage and UVB wrinkles, and reduces melasma. It definitely smells like rose/botanical, but the smell becomes less and less noticeable with time regardless of how you feel about it (I'm personally totally fine with how it smells). \nI'd personally recommend this toner for people who are trying to prevent aging and are aiming to balance their skin hydration. Anyone who has more irritated or inflamed skin may also benefit from using this. If your skin is super sensitive, you may want to have another toner on standby, but this has so many soothing agents in it I think you'll be fine.",
        "nickname": "Neve",
        "location": "USA",
        "created_date": 1640877633084,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 384816867,
        "rating": 3,
        "headline": "Really wanted to love this",
        "comments": "I have grown fond of Derma E - they're vitamin C line is really nice but this toner did not do anything for me at all. I did not notice any difference in acne or overall texture and the product would get a crust around the opening where product would dispense. I felt that was odd. I used the whole bottle because I wanted to give it a shot but honestly I was glad when it was finally gone. I'm glad it's worked for others but did nothing for my skin.",
        "nickname": "Natalie",
        "location": "Pa",
        "created_date": 1634613743018,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 377441397,
        "rating": 5,
        "headline": "Great toner",
        "comments": "I love this stuff I use it after makeup remover wipe and I use it before moisturizer & before face masks & I even use it after I use my face wash 👍👍I love it I would use it again and again repurchase it because it's great for my sensitive skin8😇🙏🏻",
        "nickname": "Aromdee honey",
        "location": "Fayetteville n.c.",
        "created_date": 1629988020130,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 327054745,
        "rating": 5,
        "headline": "Best toner/exfoliator I Ever used",
        "comments": "2 weeks now and my skin is clear and lighter I am literally seeing some dark marks that wasn't showing before because i had that much dead skin and my whole face was as dark as the spots.. now i had to mix my foundation with a lighter shade because my cheeks are at least 2 tones lighter  . it feels exactly right like its working but not harming my sensitive skin. I should mention that i have been using the Derma e blue cleanser then this toner and finally the collagen moisturizer all from derma e.",
        "nickname": "Leena",
        "location": "California",
        "created_date": 1612212883985,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 325975251,
        "rating": 5,
        "headline": "AMAZING PRODUCT",
        "comments": "This is by far the best toner I have ever used. It helped clear my acne alongside using the Derma E Acne control serum. I have oily combo skin too btw. but this product I feel is so so essential to my skincare routine. Its alcohol free I believe and has really good skincare benefits (see details on product and view ingredients) Its so mild but EFFECTIVE on the skin. and My skin does not feel dry and tight after using it actually feels very hydrated and clean!!! and the scent is nice as well its like a mild light floral scent. I will forever use this product.  Highly recommend!!!",
        "nickname": "court",
        "location": "Tennessee US",
        "created_date": 1611390005504,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 318841246,
        "rating": 4,
        "headline": "Good for price",
        "comments": "Long lasting. Gentle. Recommend as an introduction to toners. Almost always leaves my skin smooth right after application. Only flaw is that the product builds up and gets crusty at the top.",
        "nickname": "Chubs",
        "location": "Cincinnati, OH",
        "created_date": 1607481022776,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 312508022,
        "rating": 5,
        "headline": "Works Very Well!",
        "comments": "I use this product along with several other Derma E items and I just love it! Smells good and leaves my skin clean and glowing. I highly recommend.",
        "nickname": "Beauty Lover",
        "location": "Las Vegas",
        "created_date": 1604524959846,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 308977974,
        "rating": 5,
        "headline": "Completely balanced my skin",
        "comments": "I used to be completely drenched in oil by end of day, eve when my skin was dry. Ever since I started using this my skin is perfectly normal!! It cleans skin in the morning without stripping. My skin isn't greasy and my makeup stays on all day now. Will keep on buying forever!",
        "nickname": "MissL",
        "location": "Indianapolis",
        "created_date": 1603822450051,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 303878330,
        "rating": 5,
        "headline": "Holy Grail toner!",
        "comments": "I recently switched to this Derma E Essentials Radiance Toner and I am in love. I have combination skin and in my 20's, it seemed to lean more oily. Now that I'm in my 30's, it's definitely leaning more dry...but I still get the occasional hormonal breakout. My former toner was too harsh for my skin and was causing it to dry out even more, which also caused my skin texture to show more (I will admit it's great for clearing up acne). Now that I'm using this Derma E toner, my skin is clear, glowing, and so dang healthy looking! I feel so pretty in my own skin again. I'm not having to carry around travel-size moisturizers at all time anymore. Definitely worth trying out. Oh and one last thing...this toner reminds me of the Fresh Kombucha Essence. Smells and feels just like it.",
        "nickname": "wwinters",
        "location": "Midwest",
        "created_date": 1602183458305,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 301985873,
        "rating": 5,
        "headline": "Class is in session!",
        "comments": "To anyone who is new to skincare and to comment on the review that says false advertising...there are certain acids specifically aha/bhas that in order to use them you HAVE to wear sunscreen spf 30 or higher every day after exposure these acids in my opinion you should wear sunscreen everyday NO MATTER WHAT! But the main ingredient in this toner is glycolic acid an AHA that significantly increases the skins sensitivity to uv rays (sun) this product can help minimize the texture on the skin so when informed and used correctly it can be very beneficial in skincare:)",
        "nickname": "Emily",
        "location": "California",
        "created_date": 1601805436741,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 300685318,
        "rating": 5,
        "headline": "black specs",
        "comments": "does any of your guys come w little black specs in the bottle? if it does pls give it a helpful",
        "nickname": "nancy",
        "location": "california",
        "created_date": 1600810072347,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 298956655,
        "rating": 5,
        "headline": "LIFE CHANGING",
        "comments": "This is the best purchase I've ever made. I've only used it for a week now and my skin has never looked better. I have extremely sensitive, oily, and acne prone skin. I've struggled with acne on and off for 12 years and this is the product that has made my skin the most clear, glowy, and even that it has ever been. I'm genuinely shocked at how quickly and effectively this product has worked. If you struggle with acne and scaring you HAVE to get this product.",
        "nickname": "Danielle",
        "location": "Dallas, Tx",
        "created_date": 1599531482141,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 58,
      "pages_total": 3,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/xlsImpprod17761971/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "bestuses",
          "name": "Best Uses",
          "type": "tag",
          "values": [
            {
              "label": "Daily Use",
              "count": 5
            },
            {
              "label": "All Skin Types",
              "count": 4
            },
            {
              "label": "Sensitive Skin",
              "count": 3
            },
            {
              "label": "Acne-Prone Skin",
              "count": 2
            },
            {
              "label": "Combination Skin",
              "count": 2
            },
            {
              "label": "Oily Skin",
              "count": 2
            },
            {
              "label": "After Cleansing",
              "count": 1
            },
            {
              "label": "Prevent Aging and skin damage",
              "count": 1
            },
            {
              "label": "Affordable glycolic toner",
              "count": 1
            }
          ],
          "display_values": [
            "Acne-Prone Skin",
            "Affordable glycolic toner",
            "After Cleansing",
            "All Skin Types",
            "Combination Skin",
            "Daily Use",
            "Dry Skin",
            "Oily Skin",
            "Prevent Aging and skin damage",
            "Sensitive Skin"
          ]
        },
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "Stingy near eyes",
              "count": 1
            }
          ],
          "display_values": [
            "Stingy near eyes"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "Budget Shopper",
              "count": 4
            },
            {
              "label": "Brand Buyer",
              "count": 2
            },
            {
              "label": "Mid-20s",
              "count": 1
            },
            {
              "label": "combination skin",
              "count": 1
            },
            {
              "label": "Skincare enthusiast",
              "count": 1
            }
          ],
          "display_values": [
            "Brand Buyer",
            "Budget Shopper",
            "Casual Dresser",
            "Comfort-seeking",
            "Energetic/Active",
            "Mid-20s",
            "Skincare enthusiast",
            "Stylish/Fashionista",
            "Trendy/Stylish Dresser",
            "Youthful",
            "combination skin"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "Balances Skin",
              "count": 6
            },
            {
              "label": "Improves Skin Texture",
              "count": 6
            },
            {
              "label": "Gentle",
              "count": 5
            },
            {
              "label": "Leaves Clean Feel",
              "count": 4
            },
            {
              "label": "Smells Great",
              "count": 4
            },
            {
              "label": "Not Greasy",
              "count": 3
            },
            {
              "label": "Moisturizing",
              "count": 2
            },
            {
              "label": "Incredible ingredients",
              "count": 1
            },
            {
              "label": "hydrating",
              "count": 1
            },
            {
              "label": "smoothing",
              "count": 1
            },
            {
              "label": "Good Power Output",
              "count": 1
            },
            {
              "label": "Cruel free",
              "count": 1
            },
            {
              "label": "Eco positive",
              "count": 1
            },
            {
              "label": "Effective",
              "count": 1
            },
            {
              "label": "Fast",
              "count": 1
            },
            {
              "label": "Removes dead skin",
              "count": 1
            },
            {
              "label": "Glowy",
              "count": 1
            },
            {
              "label": "Clean brand",
              "count": 1
            },
            {
              "label": "Instant results",
              "count": 1
            },
            {
              "label": "Price",
              "count": 1
            }
          ],
          "display_values": [
            "Balances Skin",
            "Clean brand",
            "Cruel free",
            "Eco positive",
            "Effective",
            "Fast",
            "Gentle",
            "Glowy",
            "Good Power Output",
            "Improves Skin Texture",
            "Incredible ingredients",
            "Instant results",
            "Leaves Clean Feel",
            "Moisturizing",
            "Not Greasy",
            "Price",
            "Removes dead skin",
            "Smells Great",
            "hydrating",
            "smoothing"
          ]
        }
      ],
      "rating_histogram": [
        9,
        5,
        9,
        26,
        245
      ],
      "review_histogram": [
        9,
        5,
        9,
        26,
        245
      ],
      "rating_count": 294,
      "review_count": 294,
      "average_rating": 4.68,
      "recommended_ratio": 0.85,
      "media": [
        {
          "id": "431607723",
          "review_id": 431607808,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/upy9hsl6ttvmgneq5u1f.jpg",
          "headline": "Beautiful and gentle formula",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Pao",
          "created_date": 1666962770599
        },
        {
          "id": "431607799",
          "review_id": 431607808,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/zocwmcqrhdqjypinxutw.jpg",
          "headline": "Beautiful and gentle formula",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Pao",
          "created_date": 1666962770599
        },
        {
          "id": "323756643",
          "review_id": 323756624,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/icvgnpt0k2rvydmhcusu.jpg",
          "headline": "Been using it for over 2 years",
          "rating": 5,
          "helpful_votes": 1,
          "not_helpful_votes": 2,
          "type": "image",
          "nickname": "CristyLey",
          "created_date": 1610073085538
        },
        {
          "id": "301706958",
          "review_id": 301706894,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/zogga7pwdw17tc5qcwi6.jpg",
          "headline": "FALSE ADVERTISING! \"Sunburn Alert\"  Do not buy!",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 4,
          "type": "image",
          "caption": "\"Sunburn Alert: This product contains an AHA that may increase your skin's sensitivity to the sun and particularly the possibility of sunburn.  Limit sun exposure while using this product and for a week afterwards\"",
          "nickname": "False Advertising",
          "created_date": 1601434208280
        },
        {
          "id": "261240378",
          "review_id": 261240444,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/vi4ec4rh1k8xd3ztzzba.jpg",
          "headline": "I Love This Radiance Toner!",
          "rating": 5,
          "helpful_votes": 1,
          "not_helpful_votes": 1,
          "type": "image",
          "nickname": "Sable60",
          "created_date": 1573429471711
        },
        {
          "id": "261240391",
          "review_id": 261240444,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/gtdwm06m5vgtfvnsahhd.jpg",
          "headline": "I Love This Radiance Toner!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 1,
          "type": "image",
          "caption": "Radiance Toner, Bottle in Forefront",
          "nickname": "Sable60",
          "created_date": 1573429471711
        },
        {
          "id": "243173160",
          "review_id": 243173306,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/idpkziggpakyqdycrhfx.jpg",
          "headline": "Will purchase again and again",
          "rating": 5,
          "helpful_votes": 1,
          "not_helpful_votes": 1,
          "type": "image",
          "nickname": "Angella",
          "created_date": 1562521367390
        }
      ],
      "faceoff_positive": {
        "comments": "I bought this because it's cruelty free and I am against animal testing. I am glad I chose this brand because this product is wonderful! I have acne prone skin and am in my 30s and prior to this my skin was getting dull and uneven in color and this has also helped me with blackheads, I don't get them anymore.",
        "headline": "Radiance",
        "rating": 5,
        "ugc_id": 191424452
      },
      "faceoff_negative": {
        "comments": "I hate when companies do not say the percentages of their active ingredients... Feel like this is a scam and only has a minuscule amount.... An ingredient list would be nice.... We have a right to know what we are putting on our skin! I asked the company but they denied my question and basically said it was a secret. No thanks. Ill keep purchasing from The Ordinary and use THEIR toner.",
        "headline": "PERCENTAGE OF AHA???",
        "rating": 1,
        "ugc_id": 191424417
      },
      "name": "Essentials Radiance Toner with Glycolic Acid",
      "variant_names": [
        "Essentials Radiance Toner"
      ],
      "native_review_count": 58,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 236,
      "locale": "en_US"
    }
  }
}