{
  "product_id": "pimprod2017301",
  "product_url": "https://www.ulta.com/p/anti-wrinkle-retinol-eye-treatment-pimprod2017301",
  "extracted_at": "2025-09-23T03:18:09.220145+00:00",
  "product_name": "DERMA EAnti-Wrinkle Retinol Eye Treatment",
  "brand": "DERMA E",
  "categories": [
    "Home",
    "Skin Care",
    "Dermatologist Recommended"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "men"
  ],
  "currency": "USD",
  "list_price": "20.00",
  "sale_price": "14.00",
  "availability": "in_stock",
  "rating_avg": "3.5",
  "rating_count": "185",
  "images": [
    "https://media.ulta.com/i/ulta/2569277?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2569277?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2569277cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2569277cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2569277cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2569277cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2569277cm_alt05?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive BackGet visibly smoother-looking eyes with Derma E's Anti-Wrinkle Retinol Eye Treatment.",
  "details": "DetailsBenefitsUniquely formulated with Retinol to reduce appearance of fine lines and wrinklesGolden Aloe-infused beads, Grape Seed and adaptogen Reishi Mushroom Extracts gently moisturize and protect delicate skin around the eyes from free radical damage, renewing skin for healthy, younger-looking eyesFeaturesRecyclable & wind energy certifiedFormulated without GMOs, gluten, or soyKey IngredientsRetinol (Vitamin A): Known as the \"skin vitamin\" for its ability to help increase the speed of cellular renewalGrape Seed Extract: Powerful antioxidant that helps improve skin moisture and softnessReishi Mushroom: Helps reduce appearance of wrinkles, puffiness, and protects skin from free radical damageItem 2569277How To UseGently squeeze a small amount of product out of applicator tip. Applyaround the eye area, including lids. Use finger to smooth until absorbed.IngredientsAloe Barbadensis Leaf Juice, Glycerin (Vegetable Derived), Hydroxypropyl Starch Phosphate, Allantoin, Vitis Vinifera (Grape) Seed Extract, Panthenol (Provitamin B5), Helianthus Annuus (Sunflower) Seed Oil, Ganoderma Lucidum (Mushroom) Extract, Algin, Chlorophyll, Retinol, Leuconostoc/Radish Root Ferment Filtrate, Microcrystalline Cellulose, Mannitol, Iron Oxides, Xanthan Gum, Polysorbate 20, Ethylhexylglycerin, Phenoxyethanol, Disodium EDTA, Natural Fragrance Oil.",
  "how_to_use": "Gently squeeze a small amount of product out of applicator tip. Applyaround the eye area, including lids. Use finger to smooth until absorbed.",
  "ingredients": [
    "Aloe Barbadensis Leaf Juice",
    "Glycerin (Vegetable Derived)",
    "Hydroxypropyl Starch Phosphate",
    "Allantoin",
    "Vitis Vinifera (Grape) Seed Extract",
    "Panthenol (Provitamin B5)",
    "Helianthus Annuus (Sunflower) Seed Oil",
    "Ganoderma Lucidum (Mushroom) Extract",
    "Algin",
    "Chlorophyll",
    "Retinol",
    "Leuconostoc/Radish Root Ferment Filtrate",
    "Microcrystalline Cellulose",
    "Mannitol",
    "Iron Oxides",
    "Xanthan Gum",
    "Polysorbate 20",
    "Ethylhexylglycerin",
    "Phenoxyethanol",
    "Disodium EDTA",
    "Natural Fragrance Oil"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "men",
      "mens"
    ],
    "product_type": [
      "mask",
      "treatment",
      "eye cream"
    ],
    "skin_type": [
      "mature"
    ],
    "finish": [
      "sheer",
      "creamy",
      "oil"
    ],
    "ingredients": [
      "retinol",
      "natural",
      "fragrance"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "natural",
      "anti-aging",
      "repairing"
    ]
  },
  "reviews": {
    "product_id": "pimprod2017301",
    "total_reviews": 185,
    "reviews": [
      {
        "review_id": 555967146,
        "rating": 2,
        "headline": "Poor design for liquid product",
        "comments": "I though the product had gone bad and turned to water. I just learned by reading the reviews that is how it is. I  also have wasted A LOT of product not knowing. I have figured out if you just put the tip under your eye and not squeeze, it is a little better. Like somone else said here, just let gravity take over. I like the way it feels. I haven't noticed any results yet because I just started using it.",
        "nickname": "Alexandra",
        "location": "MA",
        "created_date": 1751039989549,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555926317,
        "rating": 1,
        "headline": "Too watery for me",
        "comments": "I tried this and the tube I had was very thin and watery. I expected it to be more like a gel.  It also has little beads of chinks in it which seemsd contradictory to something you would put around your eyes. I needed additional moisturizer because it felt drying. I finished up the tube on my neck and chest, but for my eye area this product was not for me.",
        "nickname": "B",
        "location": "California",
        "created_date": 1750954106351,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555875581,
        "rating": 1,
        "headline": "Runny and not moisturizing",
        "comments": "I am very disappointed in this product. It is not moisturizing at all. If you plan to layer this with another eye product, then it might work for you. Otherwise, don't waste your money.",
        "nickname": "Nikki",
        "location": "Tampa, FL",
        "created_date": 1750865122655,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 534004082,
        "rating": 1,
        "headline": "too liquidy",
        "comments": "the product is very runny, more liquid than creme which is far from ideal with a retinol product for eyes (v irritating when it inevitably gets in your eyes). also, it ages poorly - within about 3 months, the clear lip balm-like applicator had accumulated some kind of opaque clumps precipitated from the product... had to throw out when only half used. won't repurchase.",
        "nickname": "Haley",
        "location": "Atlanta, GA",
        "created_date": 1727097984676,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 475461830,
        "rating": 2,
        "headline": "Only for those desperately in need of it",
        "comments": "For reference, I'm a 34 yr old with combination skin. Even though I look like I'm in my mid twenties, I'm beginning to see early signs of wrinkles around the eye area, so I figured I'd try something in addition to my skin care routine. I've been using this for a few months now and, honestly, I can't tell a difference. Hopefully it's working as a preventative, but aside from that this doesn't even moisturize. It comes out like WATER, so it absorbs immediately. I once used this alone for a few weeks when I ran out of eye cream and my eyes felt dry and tired, which is a problem I never had with other eye creams. I know I'm not dehydrated and I sleep enough, so that can't be the problem lol. That's when I knew I needed to combine it with a hydrating eye cream. Anyway, this might work better for those who have more visible wrinkles and might be able to see the difference in time. I also agree with the reviews about the applicator, it makes no sense with how watery this product is. No matter how careful I try to be, I still end up losing several drops of product on my counter top... and last but not least, I'm NOT a fan of the tiny seeds in the tube. They all ended up stuck inside the applicator tip, so I get a few seeds in ever use. What's the point of a super absorbent product, if you still have to take your time in flicking off tiny seeds from your face before your next skin care step? I don't know whether to laugh or be annoyed at this point anymore.",
        "nickname": "Chris",
        "location": "Illinois",
        "created_date": 1696890650862,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 474444123,
        "rating": 5,
        "headline": "Product itself is wonderful!",
        "comments": "I do agree that the applicator is not well matched to the product. But I am still giving it 5 stars, because I'm rating the product, not the packaging. The product itself is soooo so good! After a week, I can see a visible difference! I work in a wellness department at a co-op and got this product as a sample, and I will be buying again. My coworkers even noticed and asked what I was using. I happened to have a roller applicator from an old product that was empty, and I moved the product to the roller and it works like a dream.",
        "nickname": "Sierra",
        "location": "Port townsend, wa",
        "created_date": 1695965476379,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 464421957,
        "rating": 3,
        "headline": "Ughhhh",
        "comments": "I wanna love this product so badly, but its so runny and hard to apply I feel im wasting most of the product when trying to use it. Other than that it does feel tightening and like it is working.",
        "nickname": "T",
        "location": "Tuscon, AZ",
        "created_date": 1689130756181,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 451771229,
        "rating": 1,
        "headline": "Not good",
        "comments": "This product is so so runny. Not only is it runny but it is super sticky. If you aren't going to bed immediately it is miserable to use.",
        "nickname": "Katie",
        "location": "Omaha, Nebraska",
        "created_date": 1681091520851,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 449047583,
        "rating": 2,
        "headline": "Too messy, wasting too much product",
        "comments": "The product should not be in this container - runs right out the tube and forces me to use more product than I need.",
        "nickname": "Alex",
        "location": "Salem, Oregon",
        "created_date": 1679281648635,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 446651762,
        "rating": 3,
        "headline": "Very runny",
        "comments": "Good product but it definitely needs different packaging. No matter how careful you are product is wasted as it's practically water consistency.",
        "nickname": "Noddy",
        "location": "North Augusta SC",
        "created_date": 1678091946184,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 443090054,
        "rating": 1,
        "headline": "Horribly mismatched container for watery product",
        "comments": "The product designer for this should be sent back to work in the mailroom. Hard to believe this was ever a viscous gel when first manufactured, as it is now upon opening tacky liquid with hard particles in it. Putting the product in a lip gloss applicator is deceptive and wasteful for buyers but a brilliant cost-saving move for the manufacturer.",
        "nickname": "Kay",
        "location": "Los Gatos, CA",
        "created_date": 1675784127105,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 441666368,
        "rating": 1,
        "headline": "Really messy",
        "comments": "Definitely should have read reviews.  This is watery.  Like I lost half the product just by opening it and trying to put some on my finger.",
        "nickname": "Cait",
        "location": "California",
        "created_date": 1674622188609,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 440127508,
        "rating": 2,
        "headline": "Too runny for my taste",
        "comments": "I should have read the reviews before purchasing.  I wasn't expecting it to be like water.  The first time I went to use it, it spilled all over.  I thought it was going to be more of a cream.  I think the product feels fine once I get it on my eyes and not running down my face but I'll stick with their other eye creams and won't buy this again.",
        "nickname": "Lynn",
        "location": "Hortense, GA",
        "created_date": 1673464579754,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 439088468,
        "rating": 1,
        "headline": "Runny and sticky",
        "comments": "I really wanted to like this product but it is super runny and liquidy. Additionally, in my experience, I found it to be very sticky every time I would blink.",
        "nickname": "Mia",
        "location": "Lincoln",
        "created_date": 1672434519578,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 426021180,
        "rating": 3,
        "headline": "Maybe???",
        "comments": "Is it helping? Maybe???? I can't say I see a huge improvement but it doesn't dry sting, irritate, or dry my sensitive under eye area like many other eye creams do. The problem is that it is like trying to apply water to a target area using the same applicator component they put petroleum jelly (or other thicker gel) based lip glosses in. They either need to make the eye cream thicker (it is no thicker than water) or use an applicator better suited to watery products like a sponge tip or a dropper. \n\nI can't say I have seen improvement yet but that could also be bc most of it runs down my face and feels like a huge waste. I will just have to try one of their other eye creams.",
        "nickname": "Naughty pagan",
        "location": "ID",
        "created_date": 1664095700381,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 402149929,
        "rating": 5,
        "headline": "You have to get used to it",
        "comments": "I hated this at first but once I got the hang of it I really loved it. I works just as well as the expensive alternatives. Yes it's super watery- it's a treatment, not a serum, not a cream. It helps if you shake it up really good before using, but I applied it sort of like an essence for my eyes. Let it dry completely then apply a really good moisturizing eye cream. It works well and is much more affordable than others like it.",
        "nickname": "Lanie",
        "location": "Nevada",
        "created_date": 1647219990413,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 394478587,
        "rating": 1,
        "headline": "Save your money",
        "comments": "This is insanely watery. Not like a serum, but it's the consistency of actual water. It's hard to apply and you use way more than intended because it just runs down your face.",
        "nickname": "Suzi",
        "location": "Illinois",
        "created_date": 1642641383618,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 394355309,
        "rating": 5,
        "headline": "Try it",
        "comments": "It's a very watery product but I absolutely love it. I have been using it for a week and notice a difference already! Just be careful when getting the product out of the tube. You barely have to squeeze at all.",
        "nickname": "Lena",
        "location": "Colerain, OH",
        "created_date": 1642513551903,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 394283107,
        "rating": 1,
        "headline": "I tried to love this product, but it's terrible.",
        "comments": "I love Derma E and I so badly wanted to love this product. But its flaws are too much. It's so watery and difficult to apply. Every time I have applied it, my eyes water like crazy. A little too much pressure when you're squeezing the tube, and bam! Half the tube is sprayed everywhere. I won't buy this again.",
        "nickname": "Alison the coffee lover",
        "location": "Seattle, WA",
        "created_date": 1642394447323,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 392859311,
        "rating": 2,
        "headline": "Water in a Tube",
        "comments": "This product is so runny that it's impossible to get a good application with the lip-gloss-like plastic applicator. I have several serums that are thicker than this - this I water with the occasional orange bead thing. I ended up using it up by squeezing/pouring it onto my fingers then applying to my eye area. Many times I'd squeeze too much and it was applied basically as a face serum because of all the product I got. I don't feel like it did anything, but at least it wasn't sticky or negatively affect my eye make-up application process, otherwise I'd give it 1 star.",
        "nickname": "Nicole",
        "location": "Missouri",
        "created_date": 1641147751948,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 36,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2017301/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "doesn't do anything",
              "count": 1
            },
            {
              "label": "runny",
              "count": 1
            },
            {
              "label": "Messy",
              "count": 1
            },
            {
              "label": "sticky",
              "count": 1
            },
            {
              "label": "Takes time. Be patient. Saw results after a week",
              "count": 1
            }
          ],
          "display_values": [
            "Messy",
            "Takes time. Be patient. Saw results after a week",
            "doesn't do anything",
            "runny",
            "sticky"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "simple skincare",
              "count": 1
            },
            {
              "label": "30 yrs, olive skin",
              "count": 1
            }
          ],
          "display_values": [
            "30 yrs, olive skin",
            "Casual Dresser",
            "Comfort-seeking",
            "Energetic/Active",
            "Stylish/Fashionista",
            "Trendy/Stylish Dresser",
            "Youthful",
            "simple skincare"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "You can feel it working. If that makes sense",
              "count": 1
            }
          ],
          "display_values": [
            "You can feel it working. If that makes sense"
          ]
        },
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Combination",
              "count": 1
            },
            {
              "label": "Dry",
              "count": 1
            },
            {
              "label": "Normal",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        37,
        23,
        20,
        21,
        84
      ],
      "review_histogram": [
        37,
        23,
        20,
        21,
        84
      ],
      "rating_count": 185,
      "review_count": 185,
      "average_rating": 3.5,
      "recommended_ratio": 0.43,
      "media": [
        {
          "id": "507755295",
          "review_id": 507755311,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/wqlkknq6r6cokzawnmjd.jpg",
          "headline": "Well!",
          "rating": 2,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Booboo",
          "created_date": 1709874676573
        },
        {
          "id": "443089977",
          "review_id": 443090054,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/r4chksoncobbesulgkzc.jpg",
          "headline": "Horribly mismatched container for watery product",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Direction to gently squeeze is a joke, right?",
          "nickname": "Kay",
          "created_date": 1675784127105
        },
        {
          "id": "342819379",
          "review_id": 342819514,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ej5ot3rffvbyzadwmfmp.jpg",
          "headline": "Good one",
          "rating": 3,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "",
          "nickname": "Stephanie",
          "created_date": 1619460378787
        },
        {
          "id": "284377253",
          "review_id": 284377227,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/eptmaoseckaxm1zlfynj.jpg",
          "headline": "moisturizing",
          "rating": 5,
          "helpful_votes": 5,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "eye cream on my hand",
          "nickname": "vanessa6297",
          "created_date": 1595273067107
        }
      ],
      "faceoff_positive": {
        "comments": "I was never good about using eye cream before this product, but it came with my anti aging set that I bought so I decided to give it a real try. It's been about 2 weeks of continual use, and although I'm not seeing notable improvements in wrinkles, my eyes are noticeably less puffy in the mornings. I even ate potato chips before bed, which usually results in eye bags the following morning, but no eye bags were to be seen when using this product before bed. I don't know how it works but I'll keep using this over and over for this function alone. Also, just wanted to note for anyone having trouble with too much product dispensing: instead of squeezing the tube, just flip it upside down with the tip over your finger. Gravity will allow a small amount to dispense, usually enough for both eyes. Don't squeeze the tube! It's not the most luxurious packaging but I'm ok with paying less for a good product with functional packaging.",
        "headline": "Unexpected results",
        "rating": 5,
        "ugc_id": 549776533
      },
      "faceoff_negative": {
        "comments": "For reference, I'm a 34 yr old with combination skin. Even though I look like I'm in my mid twenties, I'm beginning to see early signs of wrinkles around the eye area, so I figured I'd try something in addition to my skin care routine. I've been using this for a few months now and, honestly, I can't tell a difference. Hopefully it's working as a preventative, but aside from that this doesn't even moisturize. It comes out like WATER, so it absorbs immediately. I once used this alone for a few weeks when I ran out of eye cream and my eyes felt dry and tired, which is a problem I never had with other eye creams. I know I'm not dehydrated and I sleep enough, so that can't be the problem lol. That's when I knew I needed to combine it with a hydrating eye cream. Anyway, this might work better for those who have more visible wrinkles and might be able to see the difference in time. I also agree with the reviews about the applicator, it makes no sense with how watery this product is. No matter how careful I try to be, I still end up losing several drops of product on my counter top... and last but not least, I'm NOT a fan of the tiny seeds in the tube. They all ended up stuck inside the applicator tip, so I get a few seeds in ever use. What's the point of a super absorbent product, if you still have to take your time in flicking off tiny seeds from your face before your next skin care step? I don't know whether to laugh or be annoyed at this point anymore.",
        "headline": "Only for those desperately in need of it",
        "rating": 2,
        "ugc_id": 475461830
      },
      "name": "Anti-Wrinkle Retinol Eye Treatment",
      "variant_names": [
        "Eye Wrinkle Cream"
      ],
      "native_review_count": 36,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 149,
      "locale": "en_US"
    }
  }
}