{
  "product_id": "pimprod2051669",
  "product_url": "https://www.ulta.com/p/acne-biotic-moisturizer-pimprod2051669",
  "extracted_at": "2025-09-23T03:10:58.470121+00:00",
  "product_name": "DermalogicaAcne Biotic Moisturizer",
  "brand": "Dermalogica",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Face Moisturizer"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "76.00",
  "availability": "in_stock",
  "rating_avg": "4.8",
  "rating_count": "180",
  "images": [
    "https://media.ulta.com/i/ulta/2638666?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2638666?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2638666_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2638666_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2638666_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2638666_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2638666_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2638666_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2638666_alt07?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive BackHSA/FSA eligibleDermalogica’s Acne Biotic Moisturizer treats and prevents breakouts while preserving the skin’s microbiome. Formulated with a prebiotic blend, it targets adult acne caused by stress, hormones, and lifestyle, promoting clearer, healthier skin and combating premature aging.",
  "details": "DetailsBenefitsTreats + prevents breakouts dailyHydrates + supports skin's microbiomeHelps aging skin look healthier, now and in the futureKey Ingredients0.5 Salicylic AcidPrebiotic Inulin ExtractErythritol + Xylitol + Glutamic AcidOlive-lipid + squalane blendResearch ResultsClearer-looking skin in 5 daysVisible improvements in 20 minutes*Independent clinical results. Based on a 6-week study with 31 volunteers, 2 applications/day.Item 2638666How To UseAfter cleansing and toning, apply over face and neck in light, upward strokes. Follow with your Dermalogica SPF in the morning.Avoid the eye areas.IngredientsActive: Salicylic Acid (0.5%). Inactive: Water/Aqua/Eau, Butylene Glycol, Propanediol, Niacinamide, Octyldodecanol, Ethylhexyl Olivate, Glycerin, Erythritol, Inulin, Cetearyl Olivate, Lavandula Angustifolia (Lavender) Oil, Lavandula Hybrida Oil, Citrus Limon (Lemon) Peel Oil, Salvia Sclarea (Clary) Oil, Hydrolyzed Jojoba Esters, Morinda Citrifolia Fruit Extract, Leptospermum Scoparium Branch/Leaf Oil, Phaeodactylum Tricornutum Extract, Magnolia Officinalis Bark Extract, Piper Nigrum (Pepper) Seed Extract, Rosmarinus Officinalis (Rosemary) Leaf Oil, Tocopherol, Xylitol, Squalane, Caprylyl Glycol, Lecithin, Glutamic Acid, Polyquaternium-80, Didecyldimonium Chloride, Methylpropanediol, Sorbitan Olivate, Tetrasodium Glutamate Diacetate, Citric Acid, Sodium Hydroxide, Polyacrylate Crosspolymer-6, Caprylic Acid, Linalool, Limonene.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "After cleansing and toning, apply over face and neck in light, upward strokes. Follow with your Dermalogica SPF in the morning.Avoid the eye areas.",
  "ingredients": [
    "Active: Salicylic Acid (0.5%). Inactive: Water/Aqua/Eau",
    "Butylene Glycol",
    "Propanediol",
    "Niacinamide",
    "Octyldodecanol",
    "Ethylhexyl Olivate",
    "Glycerin",
    "Erythritol",
    "Inulin",
    "Cetearyl Olivate",
    "Lavandula Angustifolia (Lavender) Oil",
    "Lavandula Hybrida Oil",
    "Citrus Limon (Lemon) Peel Oil",
    "Salvia Sclarea (Clary) Oil",
    "Hydrolyzed Jojoba Esters",
    "Morinda Citrifolia Fruit Extract",
    "Leptospermum Scoparium Branch/Leaf Oil",
    "Phaeodactylum Tricornutum Extract",
    "Magnolia Officinalis Bark Extract",
    "Piper Nigrum (Pepper) Seed Extract",
    "Rosmarinus Officinalis (Rosemary) Leaf Oil",
    "Tocopherol",
    "Xylitol",
    "Squalane",
    "Caprylyl Glycol",
    "Lecithin",
    "Glutamic Acid",
    "Polyquaternium-80",
    "Didecyldimonium Chloride",
    "Methylpropanediol",
    "Sorbitan Olivate",
    "Tetrasodium Glutamate Diacetate",
    "Citric Acid",
    "Sodium Hydroxide",
    "Polyacrylate Crosspolymer-6",
    "Caprylic Acid",
    "Linalool",
    "Limonene"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "moisturizer"
    ],
    "skin_type": [
      "acne-prone",
      "mature"
    ],
    "finish": [
      "sheer",
      "oil"
    ],
    "ingredients": [
      "niacinamide",
      "salicylic-acid"
    ],
    "brand": [
      "mid-range",
      "premium"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "spf",
      "purifying"
    ]
  },
  "reviews": {
    "product_id": "pimprod2051669",
    "total_reviews": 180,
    "reviews": [
      {
        "review_id": 554822988,
        "rating": 5,
        "headline": "My skin lovess",
        "comments": "I've been using the Dermalogica Acne Biotic Moisturizer and it's been great for calming breakouts without drying out my skin. It feels lightweight, sinks in fast, and helps keep my skin balanced. I like that it doesn't feel greasy and still gives me enough moisture. It's a solid everyday option if you're dealing with acne or clogged pores. Gifted by dermalogica",
        "nickname": "",
        "location": "NA",
        "created_date": 1749540472993,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554819426,
        "rating": 5,
        "headline": "so good!",
        "comments": "This was gifted by Dermalogica! This is such a great moisturizer, so hydrating and leaves my skin feeling amazing. Highly recommended if you're looking to try something new that's going to do wonders for your skin.",
        "nickname": "leea",
        "location": "new york city",
        "created_date": 1749522272039,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554807536,
        "rating": 5,
        "headline": "Great moisturizer!",
        "comments": "I received the Acne Biotic Moisturizer complimentary from Dermalogica, and here's my honest experience:\n\nThis moisturizer feels lightweight but still gives the skin the hydration it needs, especially if you're using acne treatments that tend to dry you out. I really liked the texture; it sinks in quickly and doesn't leave a greasy finish. After a few uses, my skin felt more balanced and calm, without irritation or heaviness.\n\nIt's a great everyday option if you're breakout-prone but still want something soothing and gentle on your skin barrier.",
        "nickname": "Bianca",
        "location": "Grand Rapids",
        "created_date": 1749502331791,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554796420,
        "rating": 5,
        "headline": "Amazing",
        "comments": "The Acne Biotic Moisturizer is a gentle, lightweight formula designed for acne-prone skin. It absorbs quickly, hydrates without feeling greasy, and doesn't clog pores. Key ingredients like probiotics, bisabolol, and squalane help calm irritation and support the skin's natural barrier. It pairs well with acne treatments and leaves the skin feeling balanced and smooth. While it works great for many, some users with very sensitive skin may want to patch test first. Overall, it's a solid choice for those managing breakouts and dryness at the same time.gifted by dermalogica",
        "nickname": "zulya",
        "location": "Houston texas",
        "created_date": 1749486771765,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554783824,
        "rating": 5,
        "headline": "No heavy sent",
        "comments": "I got this product was gifted by Dermalogica and was excited to try it. It fits perfectly into my busy routine—fast absorbing, no heavy scent, and it actually helped soothe my skin during a breakout. So happy with it!",
        "nickname": "Bogdana",
        "location": "Miami, FL",
        "created_date": 1749473465393,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554752841,
        "rating": 5,
        "headline": "must have",
        "comments": "I've been using Dermalogica's Acne Biotic Moisturizer for a few weeks now, and I'm genuinely impressed with the results. This moisturizer has struck the perfect balance between treating adult acne and maintaining my skin's overall health. It's lightweight but hydrating, and unlike other acne treatments I've tried, it doesn't leave my skin feeling stripped or irritated. gifted by dermalogica",
        "nickname": "beebz",
        "location": "LA",
        "created_date": 1749441066724,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554751556,
        "rating": 5,
        "headline": "Love it",
        "comments": "I've been using this moisturizer for about a week, and I'm honestly so happy with it. My skin was breaking out from stress, and this really helped calm everything down fast. Within a few days, the redness went down and my skin felt way smoother. It's super lightweight and not greasy at all, which I love. It also keeps my skin really hydrated and gives it a healthy glow. I like that it has salicylic acid to treat breakouts, but also ingredients that are good for your skin long-term. My face just looks fresher and more even overall. Gifted by dermalogica",
        "nickname": "Kam",
        "location": "Philly",
        "created_date": 1749435507793,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554751402,
        "rating": 5,
        "headline": "Hydrating",
        "comments": "So good. This moisturizer has been working well on my skin. I apply a good amount on my skin. It absobs quickly into my skin. It is not greasy or sticky on my skin. It leaves my skin feeling hydrated, smooth, soft and look healthier. I highly recommend this moisturizer. Gifted by Dermalogica.",
        "nickname": "Lydia",
        "location": "Florida",
        "created_date": 1749434962231,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554751272,
        "rating": 4,
        "headline": "Lightweight moisturizer",
        "comments": "I received this Complimentary from dermalogica. I like this moisturizer a lot. It's really light weight and doesn't feel greasy on my skin. One thing I will say is that I do feel like I broke out more when I first started using it. Not sure if that's because it was bringing everything to the surface of my skin or what. After a few uses, my skin hasn't had any issues so I'll definitely keep using this!",
        "nickname": "McKenzie",
        "location": "Navarre, FL",
        "created_date": 1749434492751,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554737284,
        "rating": 5,
        "headline": "Great product!",
        "comments": "I received this product as complimentary from Dermologica. I really am enjoying this moisturizer because it is lightweight and also helps with fighting acne. I have very acne prone skin and I have noticed a difference with using this product. Would recommend!",
        "nickname": "Amber",
        "location": "Fontana CA",
        "created_date": 1749403355764,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554729092,
        "rating": 5,
        "headline": "Great for mild exfoliation",
        "comments": "I'm 36 years old and I don't really have acne but my skin love salicylic acid which is the main ingredient in this moisturizer. I feel like it does a good job and mildly exfoliating my skin and making it feel smoother overall. Gifted by Dermalogica for review purposes.",
        "nickname": "Melissa",
        "location": "Charlotte, NC",
        "created_date": 1749383298722,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554720204,
        "rating": 5,
        "headline": "Hydrating",
        "comments": "I and this really like this moisturizer, it is perfect for someone that has combination skin and easily break out. My skin is pretty sensitive to moisturizers so I have to watch what I put it on because I don't want to break it out. This was actually really helpful at not only not breaking out my skin that helping to reduce the current breakouts that I have without drying them.  It absorbs really good, doesn't make me look oily, and I'm able to wear makeup over it. Then it gives me a really nice smooth base. Gifted complimentary from dermalogica",
        "nickname": "Danielle",
        "location": "Atascadero",
        "created_date": 1749356703040,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554708731,
        "rating": 5,
        "headline": "Great for acne prone",
        "comments": "Super lightweight and calming this moisturizer surprised me in the best way. It hydrates without making me greasy and actually helps keep breakouts in check. My skin feels balanced, not stripped or irritated. Definitely a solid pick if you're acne-prone but still want something that feels gentle and soothing. Gifted by dermalogica",
        "nickname": "Alin",
        "location": "Houston",
        "created_date": 1749322975784,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554705182,
        "rating": 5,
        "headline": "A total game changer for my skin!",
        "comments": "This moisturizer exceeded my expectations. It calmed my skin almost instantly and left it feeling soothed, not stripped or irritated like some acne treatments tend to do. The texture is light but still deeply hydrating, and my face feels balanced, never greasy or tight. I started seeing a more even skin tone and fewer flare ups without any dryness or flaking. It's now one of the few products I trust to keep my skin clear and happy long term. Gifted by Dermalogica",
        "nickname": "Maritza",
        "location": "Warwick, RI",
        "created_date": 1749316840689,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554691457,
        "rating": 5,
        "headline": "Love!",
        "comments": "I really enjoyed this moisturizer! I have sensitive and acne prone skin, and i found that this moisturizer worked very well on my skin type. It didn't break me out, and helped calm my skin and acne. I received this product complimentary from Dermalogica.",
        "nickname": "Emma",
        "location": "Seattle, WA",
        "created_date": 1749288156425,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554686376,
        "rating": 5,
        "headline": "This product is a must have!",
        "comments": "This product was gifted by dermalogica. After using this product for a week on my acne spots, I have noticed a tremendous difference! On top of this making my acne less visible, my skin feels so hydrated as well! This product is a must have in my opinion, and I can't see myself going without it anymore!",
        "nickname": "Angelina",
        "location": "Ohio",
        "created_date": 1749263344192,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554678067,
        "rating": 5,
        "headline": "Love it",
        "comments": "I received this product gifted by Dermalogica and I love it. Its nice to have something that moisturizes but is still gentle and doesnt cause sensitive skin to break out. I havent had a single pimple since I started using this moisturizer it's been amazing so far.",
        "nickname": "Morgan",
        "location": "Nm",
        "created_date": 1749239588243,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554676993,
        "rating": 5,
        "headline": "Love",
        "comments": "Gifted by Dermalogica. I am absolutely in love with this moisturizer! This moisturizer is perfect for me as I've been struggling with very stubborn acne recently and nothing has worked for my sensitive skin. This has really helped clear the acne up!",
        "nickname": "Mo",
        "location": "Dc",
        "created_date": 1749237464574,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554629397,
        "rating": 5,
        "headline": "Amazing moisturizer!",
        "comments": "I've been so impressed with this moisturizer! It's super lightweight, doesn't feel greasy and my skin's been way less fussy lately. My breakouts have calmed down since I've been using this and it layers well under makeup too. So glad this was offered by Dermalogica!",
        "nickname": "rd17b",
        "location": "USA",
        "created_date": 1749218516277,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554626524,
        "rating": 5,
        "headline": "Lightweight and Soothing - Perfect for Sensitive Skin",
        "comments": "Dermalogica can literally never steer me wrong and this new moisturizer is no exception! I have very sensitive, acne-prone skin and this moisturizer has helped, soothe and calm my skin when I'm having breakouts. Because it's a gel, I assumed it would be sticky - but it's super lightweight and feels comfortable on my skin. I would highly recommend!! Gifted by Dermalogica",
        "nickname": "Lilli",
        "location": "Washington DC",
        "created_date": 1749212478246,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 144,
      "pages_total": 8,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2051669/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        0,
        0,
        1,
        26,
        153
      ],
      "review_histogram": [
        0,
        0,
        1,
        26,
        153
      ],
      "rating_count": 180,
      "review_count": 180,
      "average_rating": 4.84,
      "recommended_ratio": 0.99,
      "media": [
        {
          "id": "554552565",
          "review_id": 554552516,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/bocvhdl4vplzayhhxdx2.jpg",
          "headline": "Nice moisturizer",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Daniella",
          "created_date": 1749133750669
        },
        {
          "id": "554525499",
          "review_id": 554525445,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/xicv2z3xno5wrfahrzhh.jpg",
          "headline": "Acne treatment",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Caurizm",
          "created_date": 1749077340153
        },
        {
          "id": "554513610",
          "review_id": 554513624,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/s9iogrtryfv5ua6ieh8d.jpg",
          "headline": "Safe for all skin types.",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "love",
          "nickname": "Jessica",
          "created_date": 1749057673680
        },
        {
          "id": "554477277",
          "review_id": 554477276,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/vyetlt52agvyi8ugstji.jpg",
          "headline": "Holy grail for adult acne",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Vivian",
          "created_date": 1748984420140
        },
        {
          "id": "554477251",
          "review_id": 554477276,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/jmxzi8d7wf4blv5hfvth.jpg",
          "headline": "Holy grail for adult acne",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Vivian",
          "created_date": 1748984420140
        },
        {
          "id": "554472041",
          "review_id": 554472033,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/dew1nguwsl4wjitw3exq.jpg",
          "headline": "Combo/oily folks - this is our jam!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "After",
          "nickname": "jenniferlynnshops",
          "created_date": 1748978576094
        },
        {
          "id": "554472068",
          "review_id": 554472033,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/qgjahf78gshnnkqnrbyy.jpg",
          "headline": "Combo/oily folks - this is our jam!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Before",
          "nickname": "jenniferlynnshops",
          "created_date": 1748978576094
        },
        {
          "id": "554471792",
          "review_id": 554471658,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/u8tgbi8cwg6ebhrybcya.jpg",
          "headline": "Combo-oily people - this is our jam!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "After",
          "nickname": "jenniferlynnshops",
          "created_date": 1748978254330
        },
        {
          "id": "554471838",
          "review_id": 554471658,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/xoi7b9wwjyoujm3mhanb.jpg",
          "headline": "Combo-oily people - this is our jam!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Before",
          "nickname": "jenniferlynnshops",
          "created_date": 1748978254330
        },
        {
          "id": "554468979",
          "review_id": 554468783,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/fotndm6viv3uahjgngem.jpg",
          "headline": "Effective moisturizer with acne care ingredients",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Gel cream texture",
          "nickname": "Alex",
          "created_date": 1748977527451
        },
        {
          "id": "554420186",
          "review_id": 554420204,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/en2abmiikaoweqp58iwk.jpg",
          "headline": "Absolutely Love it",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Andrea",
          "created_date": 1748898247248
        },
        {
          "id": "554385342",
          "review_id": 554385349,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/p7hz6xcebum3t5lfbkxb.jpg",
          "headline": "I definitely recommend trying it",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Love it",
          "nickname": "Thao",
          "created_date": 1748843761124
        },
        {
          "id": "554385315",
          "review_id": 554385349,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/kk9lndx5xpjxebusxttz.jpg",
          "headline": "I definitely recommend trying it",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Highly recommended",
          "nickname": "Thao",
          "created_date": 1748843761124
        },
        {
          "id": "554141295",
          "review_id": 554141304,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/p90flxxok6luwjwslq0w.jpg",
          "headline": "Useful!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Jess",
          "created_date": 1748527762387
        },
        {
          "id": "554111803",
          "review_id": 554111802,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ktmdkfzcafdq76ufnafk.jpg",
          "headline": "My new obsession",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Obsessed",
          "nickname": "Mia",
          "created_date": 1748461178160
        },
        {
          "id": "554100620",
          "review_id": 554100636,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/tq4mv9ung95zjzkghbrz.jpg",
          "headline": "I love love love it",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Product",
          "nickname": "Jaci",
          "created_date": 1748443028375
        },
        {
          "id": "554077991",
          "review_id": 554078014,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/tyhclpu0odwtpnmmumkd.jpg",
          "headline": "Works great!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Holly",
          "created_date": 1748400990003
        },
        {
          "id": "553962504",
          "review_id": 553962453,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/dv5peq5zabcxx9goetnk.jpg",
          "headline": "Actually works",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Krystyna",
          "created_date": 1748188542245
        }
      ],
      "faceoff_positive": {
        "comments": "If you're battling breakouts and searching for a solution that truly works, let me introduce you to the Dermalogica Acne Biotic Moisturizer. This innovative product has transformed my skincare routine, effectively treating and preventing acne while nurturing my skin's microbiome. Formulated with a powerful prebiotic blend, this moisturizer specifically targets adult acne caused by stress, hormones, and lifestyle factors. The inclusion of 0. 5% salicylic acid not only helps clear breakouts but also combats premature aging, giving my skin a healthier appearance both now and in the future. What's even better? It hydrates my skin while supporting its natural defenses. Ingredients like prebiotic inulin extract, erythritol, xylitol, and glutamic acid work together to enhance my skin's overall health. Plus, the olive-lipid and squalane blend ensures my skin stays moisturized without feeling greasy. Incorporating Dermalogica's Acne Biotic into my daily routine has been a revelation. My skin looks clearer, feels more balanced, and I'm finally embracing a confident, radiant complexion! If you're looking for a moisturizer that does it all, this is it! **gifted by Dermalogica**",
        "headline": "No More Acne!!",
        "rating": 5,
        "ugc_id": 557395303
      },
      "faceoff_negative": {
        "comments": "A pretty good product. It's a nice moisturizer in general. It is a little strange that it has Erythritol as a listed ingredient given the effects it has consuming to much of that ingredient in general. I don't really know how comfortable I would feel using the long term. Gifted by dermalogica",
        "headline": "Confused",
        "rating": 3,
        "ugc_id": 554477865
      },
      "name": "Acne Biotic Moisturizer",
      "native_review_count": 144,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 36,
      "locale": "en_US"
    }
  }
}