{
  "product_id": "pimprod2035162",
  "product_url": "https://www.ulta.com/p/super-skin-toner-with-witch-hazel-coq10-pimprod2035162",
  "extracted_at": "2025-09-23T05:20:14.406854+00:00",
  "product_name": "DIMESuper Skin Toner with Witch Hazel + CoQ10",
  "brand": "DIME",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Toner"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "toner"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "24.00",
  "availability": "in_stock",
  "rating_avg": "4.9",
  "rating_count": "2905",
  "images": [
    "https://media.ulta.com/i/ulta/2603231?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2603231?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2603231_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2603231_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2603231_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2603231_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2603231_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2603231_vid01/thumbs/a12e1049-264d-48a1-baf5-ee3d86156982?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive BackDIME's Super Skin Toner improves the concentration of CoQ10 levels in our skin cells, all while aiding in a tighter and brighter looking complexion!",
  "details": "DetailsBenefitsHelps absorb damage otherwise imparted by free radicalsAids in rejuvenating and moisturizing the skinNourishes and helps in maintaining a healthy pH balanceEWG VERIFIEDKey IngredientsCoQ10: DIME’s Super Skin Toner key ingredient supports the delivery of a topical, supplemental boost of CoQ10 that can help reduce the formation of oxidative stress in older skin and assist in restoring a natural and healthy pH balance.Witch Hazel: The beauty of witch hazel is that it aids in nourishing and moisturizing the skin as it effectively removes excess oil, dirt, and debris. However, witch hazel does not usually over-dry the skin like other astringents, and it can even help seal in moisture.Cucumber Fruit Extract (Cucumis Sativus): Cucumber extract is a superfood for the skin. The juice is composed largely of proteins, lipids, Vitamin C, and a variety of minerals, and possesses moisturizing and emollient properties.Formulated WithoutSulfates: DIME products never contain skin irritating ingredients such as sulfates. Sulfate-free products are gentle on the skin, and can help decrease the chances of an allergic reaction.Parabens: Certain parabens have been linked to hormone disruption. DIME prohibits all parabens, including Ethylparaben, Butylparaben, Isobutylparaben, Isopropylparaben, Methylparaben, and Propylparaben.Fragrance: DIME never uses any form of fragrance, natural or synthetic, in any facial skincare products.Phthalates: Certain phthalates (like Dibutyl Phthalate, aka DBP, or DEHP, and DEP) appear on product labels, but most typically remain unlisted, hiding under the term “fragrance.” Since some phthalates have been linked to hormone disruption, DIME avoids them.Item 2603231How To UseAfter cleansing, saturate a cotton ball or cotton pad with DIME Super Skin Toner. Apply to the face in a circular motion. Avoid the eye area.As a Conscious Beauty brand, DIME features sustainable packaging. Once product is empty, twist off cap, rinse bottle, and toss into recycling bin.IngredientsWater, Witch Hazel, Propanediol, Hyaluronic Acid, CoQ10, Aloe Leaf Extract, Chamomilla Extract, Sage Extract, Cucumber Extract, Blood Orange Extract, Glycerin, Ethoxydiglycol, Potassium Sorbate.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "After cleansing, saturate a cotton ball or cotton pad with DIME Super Skin Toner. Apply to the face in a circular motion. Avoid the eye area.As a Conscious Beauty brand, DIME features sustainable packaging. Once product is empty, twist off cap, rinse bottle, and toss into recycling bin.",
  "ingredients": [
    "Water",
    "Witch Hazel",
    "Propanediol",
    "Hyaluronic Acid",
    "CoQ10",
    "Aloe Leaf Extract",
    "Chamomilla Extract",
    "Sage Extract",
    "Cucumber Extract",
    "Blood Orange Extract",
    "Glycerin",
    "Ethoxydiglycol",
    "Potassium Sorbate"
  ],
  "extended_contents": {},
  "tags": {
    "product_type": [
      "cleanser",
      "toner"
    ],
    "skin_type": [
      "dry",
      "sensitive"
    ],
    "finish": [
      "sheer",
      "gel",
      "oil"
    ],
    "ingredients": [
      "hyaluronic-acid"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "natural",
      "sulfate-free",
      "hydrating",
      "soothing",
      "purifying",
      "repairing"
    ],
    "category": []
  },
  "reviews": {
    "product_id": "pimprod2035162",
    "total_reviews": 2905,
    "reviews": [
      {
        "review_id": 558791479,
        "rating": 3,
        "headline": "Short Lasting",
        "comments": "Though I do love the feel and light scent, I was disappointed in the amount in the bottle.  It certainly did not seem like the amount of liquid fit the visual size of the bottle. Let's just say that it only lasted three weeks.  I will go back to Klairs as it felt eaqually nice, and lasted a couple of months (at least).",
        "nickname": "Mimi",
        "location": "CA",
        "created_date": 1753940934957,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555818326,
        "rating": 1,
        "headline": "putrid",
        "comments": "I don't know if this is the standard or I received a bad bottle, but this toner smells putrid. I couldn't get past the smell to even use it to give it a fair review. If this product can potentially go sour before it's even open, it's not worth my time or money. I'm not easily swayed by smell, but this smelled like sour garbage. I would rate this a 0 if I could.",
        "nickname": "Amber",
        "location": "Maryland",
        "created_date": 1750775340696,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555082202,
        "rating": 1,
        "headline": "INGREDIENT LIST ON SITE IS INCORRECT",
        "comments": "BEWARE! The ingredient list is inaccurate. They left out multiple ingredients. I used the ingredient list here to check multiple sites for acne prone skin before ordering this toner. The items listed here are not concerning. I broke out horribly the day after starting use of this product and continued to break horribly for days. I checked the box and found it contained ingredients I had not been aware of and can trigger breakouts. Dime website is also inaccurate.",
        "nickname": "True Review",
        "location": "Mississippi",
        "created_date": 1749784069424,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549247835,
        "rating": 5,
        "headline": "Worth it!",
        "comments": "I have tried countless toners and all work fine but I never really see a difference. This one however is a game changer. It keeps my pores cleaner and my skin balanced and soft. I used to get gross oily skin by the end of the day but since using this toner, it has really balanced me out and my skin still feels good by the end of the day.",
        "nickname": "CC",
        "location": "Mobile, AL",
        "created_date": 1742309528250,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 524403093,
        "rating": 2,
        "headline": "Expensive witch hazel in a pretty bottle",
        "comments": "The bottle is pretty. Upon first use I coukd only smell witxh hazel. No tingling or anything.",
        "nickname": "Me",
        "location": "Utah",
        "created_date": 1720240587326,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 9
      },
      {
        "review_id": 522636578,
        "rating": 3,
        "headline": "Bad smell, no effect",
        "comments": "There was a funky smell to this toner, and it just didn't work well with my skin. It didn't have much effect and made my skin feel tight after applying.",
        "nickname": "Casey000",
        "location": "NYC",
        "created_date": 1718492097862,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 513251020,
        "rating": 4,
        "headline": "only dime product worth buying",
        "comments": "i really love this toner, it felt good, it made my skin look nice, but i used it all in less than a month. i cant afford to replace this product that often so sadly i wont be re-buying.",
        "nickname": "hannah",
        "location": "sheboygan wi",
        "created_date": 1715123536513,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 510698761,
        "rating": 5,
        "headline": "Wow",
        "comments": "This toner feels AMAZING!! My skin feels so much softer. I also use their hyloronic acid and their dewy moisturizer! The combination has me LOVING my skin!!!",
        "nickname": "Angel",
        "location": "New Braunfels, TX",
        "created_date": 1712432441754,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 508266567,
        "rating": 5,
        "headline": "Love",
        "comments": "Love this product!!",
        "nickname": "Lo",
        "location": "Birmingham, AL",
        "created_date": 1710262950701,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 507747877,
        "rating": 1,
        "headline": "Expensive bottle of witch hazel",
        "comments": "Save your money and just buy witch hazel. I did not see any difference with this product.",
        "nickname": "Susan",
        "location": "Chicagoland",
        "created_date": 1709862217137,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 484429631,
        "rating": 5,
        "headline": "Like it so far",
        "comments": "This is a nice toner that doesn't try my skin out. I've only been using it for a week but I've noticed a difference in how clear and hydrated my face looks. I tend to have dryer skin, even more so in the winter.",
        "nickname": "Audrey",
        "location": "Syracuse, NY",
        "created_date": 1702403733290,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 471713510,
        "rating": 5,
        "headline": "My 1st Toner",
        "comments": "This is my first time trying toner! Idk why i never added this to my skin routine years ago :( ! I have always been skeptical about buying toners but after doing research This one was hands down is number 1 on my list. I really can see a difference after 2 weeks using it day and night! My skin looks glowy and smoother! The little white bumbs are going away on my chin & my blackhead and white heads on my nose are almost invisible! You can see the cotton pad a little dirty even after cleansing and exfoliating.",
        "nickname": "Jessica",
        "location": "Houston, Tx",
        "created_date": 1694400141737,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 431823733,
        "rating": 5,
        "headline": "Perfection in a bottle",
        "comments": "I absolutely love DIME and their products. Every time I try something new I'm never disappointed, including this toner. Great toner made with good ingredients. \n\nEspecially love the packaging it comes in! Not only is it beautiful, it's also super high quality with the glass bottles! Much prefer this over a cheaper plastic bottle. \nAbsolute Perfection.",
        "nickname": "Ashli",
        "location": "DFW, Texas",
        "created_date": 1667144606049,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 430216645,
        "rating": 5,
        "headline": "Nice ingredients and refreshing",
        "comments": "I have no problems with the packaging, unlike previous reviewer. This is a nice toner with CoQ10 and it leaves a refreshing feeling after applying.",
        "nickname": "LK",
        "location": "Baltimore",
        "created_date": 1666207655408,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 429805867,
        "rating": 5,
        "headline": "YES!!",
        "comments": "My skin is thriving since introducing it to this product!!   I have been a fan of this line for a while and so happy I can shop at Ulta for it now!!  I also really like the hyaluronic acid serum...oh and their sunscreen!!!  Its so good and doesn't leave a white residue!",
        "nickname": "",
        "location": "Chicago, IL",
        "created_date": 1666023476410,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 428063490,
        "rating": 2,
        "headline": "Packaging???",
        "comments": "I was excited to try this line.  The bottle is not user friendly and quite heavy.  Once you take out the plastic stopper, you have to shake hard to get liquid out.  Product is ok, not great.  Probably will not purchase again.",
        "nickname": "DA",
        "location": "California",
        "created_date": 1665024331362,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 7
      }
    ],
    "paging": {
      "total_results": 16,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Dry",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        16,
        11,
        44,
        195,
        2639
      ],
      "review_histogram": [
        16,
        11,
        44,
        195,
        2639
      ],
      "rating_count": 2905,
      "review_count": 2905,
      "average_rating": 4.87,
      "recommended_ratio": 0.67,
      "media": [
        {
          "id": "525806619",
          "review_id": 525806762,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/wbwmkkhabkgcfeeoc5ou.jpg",
          "headline": "Great product",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Brittney P.",
          "created_date": 1718928000000
        },
        {
          "id": "525813964",
          "review_id": 525813837,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/zizvebsqjxayng7j4tvo.jpg",
          "headline": "Love for wrinkles!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Calah A.",
          "created_date": 1715904000000
        },
        {
          "id": "525818642",
          "review_id": 525818741,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/fdlzzqvvaqkyliiyeezt.jpg",
          "headline": "Sensitive Skin Friendly Toner",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Meg S.",
          "created_date": 1715126400000
        },
        {
          "id": "525811551",
          "review_id": 525811405,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/z7pbcdn0pwh0vseq0rmh.jpg",
          "headline": "Best Toner Ever!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Amanda T.",
          "created_date": 1713744000000
        },
        {
          "id": "525815304",
          "review_id": 525815350,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/le26trf68kuafeh3adq6.jpg",
          "headline": "I love it!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Lisa G.",
          "created_date": 1713052800000
        }
      ],
      "faceoff_positive": {
        "comments": "As someone who values a good skincare routine, I'm always on the lookout for high-quality products that deliver real results. Dime Beauty Super Skin Toner is one such product. This toner is incredibly effective at removing impurities from the skin and leaving it feeling refreshed and revitalized. What I love most about this toner is its ability to help balance my skin's pH levels. It contains a blend of natural ingredients like witch hazel, green tea, and chamomile that work together to soothe and calm the skin, while also minimizing the appearance of pores. After using it consistently for several weeks, I noticed a significant improvement in the overall tone and texture of my skin. Another thing I appreciate about this toner is its versatility. It can be used as a stand-alone toner, or it can be used as part of a multi-step skincare routine. I like to use it in the morning and evening after cleansing my face, and it helps to prep my skin for the other products I use. I also love that this toner is free from harsh chemicals and artificial fragrances. It's gentle on the skin and doesn't cause any irritation or dryness. And the subtle, natural scent is really pleasant and refreshing. Overall, I highly recommend Dime Beauty Super Skin Toner to anyone looking for a high-quality toner that delivers real results. It's an excellent choice for anyone with oily or combination skin, and it's made with high-quality natural ingredients that are gentle on the skin. Give it a try - your skin will thank you!",
        "headline": "Give it a try - your skin will thank you!",
        "rating": 5,
        "ugc_id": 462665936
      },
      "faceoff_negative": {
        "comments": "I have had problems with my skin for about a year and a half. I went on accutane last year and it cleared everything up. This summer I saw a review for DIME and thought I really should change up my face regimen but ever since i did, my face has been getting worse and worse. I was hoping it would clear up any zits I currently had but these products have done nothing for my zits. I now have little white bumps along my jaw line that are turning Into zits. Not sure if it's the products or what, but all I know is they have done nothing for me.",
        "headline": "Face problems",
        "rating": 2,
        "ugc_id": 433642686
      },
      "native_review_count": 16,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 2889,
      "locale": "en_US"
    }
  }
}