{
  "product_id": "pimprod2041141",
  "product_url": "https://www.ulta.com/p/cleansing-balm-melt-makeup-hydrate-pimprod2041141",
  "extracted_at": "2025-09-23T03:36:13.419248+00:00",
  "product_name": "DIMECleansing Balm to Melt Makeup + Hydrate",
  "brand": "DIME",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wash"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "38.00",
  "availability": "in_stock",
  "rating_avg": "2.3",
  "rating_count": "7",
  "images": [
    "https://media.ulta.com/i/ulta/2616845?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2616845?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2616845_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2616845_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2616845_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2616845_alt04?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive BackDIME Cleansing Balm: Hydrating + Makeup-Melting was designed with two uses in mind. The first is to melt makeup and cleanse impurities. The second is an overnight hydrating mask that nourishes the skin with squalane and shea butter. Each use helps promote more dewy skin and a healthy glow.",
  "details": "DetailsBenefitsMelts away makeupDoubles as an overnight hydrating maskKey IngredientsSqualane: Allows the formula to be applied effortlessly, creating a lightweight feeling and locking in long-lasting moisture. Squalane is a natural emollient with anti-inflammatory properties that can help reduce redness without clogging your pores.Bisabolol: This powerful ingredient has been found to help a variety of skincare concerns, including redness, blemishes, and fighting the signs of aging. Overall, this ingredient is great for calming the skin, reducing redness, and assisting in a healthy and youthful appearance.Formulated WithoutSulfates: DIME products never contain skin-irritating ingredients such as sulfates. Sulfate-free products are gentle on the skin and can help decrease the chances of an allergic reaction.Phthalates: Certain phthalates (like Dibutyl Phthalate, aka DBP, or DEHP, and DEP) appear on product labels, but most typically remain unlisted, hiding under the term “fragrance.” Since some phthalates have been linked to hormone disruption, DIME avoids them.Item 2616845How To UseFor the first step of your double cleanse, apply a quarter-size amount of balm onto dry hands. Rub between your fingers to warm up the product and massage in circular motions on a dry face. Remove with a damp, lukewarm cloth and rinse with water for a refreshing finish. Always cleanse with a DIME cleanser after application. For a deeply hydrating and nourishing mask, apply to clean, dry skin before bed and allow the product to work overnight.As a Conscious Beauty brand, DIME features sustainable packaging. Once product is empty, twist off cap, rinse jar, and toss into recycling bin.IngredientsBisabolol, Butyrospermum Parkii (Shea) Butter, Caprylic/Capric Triglyceride, Cocos Nucifera (Coconut) Oil, Ethylhexyl Olivate, Helianthus Annuus (Sunflower) Extract, Helianthus Annuus (Sunflower) Seed Wax, Hydrogenated Castor Oil, Mangifera Indica Seed Butter, Olea Europaea (Olive) Fruit Unsaponifiables, Oryza Sativa (Rice) Bran Extract, Polyglyceryl-10 Tristearate, Polyglyceryl-3 Cocoate, Polyglyceryl-4 Caprate, Polyglyceryl-6 Caprylate, Polyglyceryl-6 Ricinoleate, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Rhus Verniciflua Peel Wax, Rosmarinus Officinalis (Rosemary) Leaf Extract, Squalane, Theobroma Cacao (Cocoa) Seed Butter, Tocopherol, Water, Triethyl Citrate, Vanillin, Butyl Butyrolactate, Anisaldehyde, Heliotropine, O-Methoxycinnamaldehyde, Maltol, Gamma-Nonalactone, Benzyl Acetate.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "For the first step of your double cleanse, apply a quarter-size amount of balm onto dry hands. Rub between your fingers to warm up the product and massage in circular motions on a dry face. Remove with a damp, lukewarm cloth and rinse with water for a refreshing finish. Always cleanse with a DIME cleanser after application. For a deeply hydrating and nourishing mask, apply to clean, dry skin before bed and allow the product to work overnight.As a Conscious Beauty brand, DIME features sustainable packaging. Once product is empty, twist off cap, rinse jar, and toss into recycling bin.",
  "ingredients": [
    "Bisabolol",
    "Butyrospermum Parkii (Shea) Butter",
    "Caprylic/Capric Triglyceride",
    "Cocos Nucifera (Coconut) Oil",
    "Ethylhexyl Olivate",
    "Helianthus Annuus (Sunflower) Extract",
    "Helianthus Annuus (Sunflower) Seed Wax",
    "Hydrogenated Castor Oil",
    "Mangifera Indica Seed Butter",
    "Olea Europaea (Olive) Fruit Unsaponifiables",
    "Oryza Sativa (Rice) Bran Extract",
    "Polyglyceryl-10 Tristearate",
    "Polyglyceryl-3 Cocoate",
    "Polyglyceryl-4 Caprate",
    "Polyglyceryl-6 Caprylate",
    "Polyglyceryl-6 Ricinoleate",
    "Prunus Amygdalus Dulcis (Sweet Almond) Oil",
    "Rhus Verniciflua Peel Wax",
    "Rosmarinus Officinalis (Rosemary) Leaf Extract",
    "Squalane",
    "Theobroma Cacao (Cocoa) Seed Butter",
    "Tocopherol",
    "Water",
    "Triethyl Citrate",
    "Vanillin",
    "Butyl Butyrolactate",
    "Anisaldehyde",
    "Heliotropine",
    "O-Methoxycinnamaldehyde",
    "Maltol",
    "Gamma-Nonalactone",
    "Benzyl Acetate"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser",
      "moisturizer",
      "lip gloss"
    ],
    "skin_type": [
      "dry",
      "sensitive",
      "acne-prone"
    ],
    "finish": [
      "dewy",
      "sheer",
      "long-wear",
      "oil"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "natural",
      "sulfate-free",
      "hydrating",
      "soothing",
      "purifying"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2041141",
    "total_reviews": 7,
    "reviews": [
      {
        "review_id": 552242425,
        "rating": 1,
        "headline": "Don't waste your money!!!",
        "comments": "I own a plethora of Dime products and I love them all except for this one!! This is terrible!! The texture is gritty with really small balls in it. It's the worst product Ive ever used! This is a definite return!!!",
        "nickname": "JenniC",
        "location": "Benton, AR",
        "created_date": 1745453503480,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541385350,
        "rating": 3,
        "headline": "Very Gritty",
        "comments": "I wanted to like this, as I was looking for an alternative to Beautycounter. However, this has a super gritty, oily feeling, and takes extra effort to remove makeup.",
        "nickname": "Mal G",
        "location": "Gurnee, IL",
        "created_date": 1734493069622,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 538082186,
        "rating": 3,
        "headline": "Better makeup melts out there",
        "comments": "This is like rubbing straight up wax onto your face. \nIt does not melt off, nor is it very good at melting off makup. It reminds me of vaseline in that it does not wash off because it has so much petroleum or similar ingredient in it. \nIts way too dense of a forumla that requires a lot of rubbing and two - three follow up washes with face wash and a wash cloth to get off.",
        "nickname": "Nat",
        "location": "Salt Lake City",
        "created_date": 1731985174698,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 522247902,
        "rating": 1,
        "headline": "Not for me",
        "comments": "I'm not sure if i got a bad batch or what, but the texture of this stuff is GROSS. It's very gritty and the grit isnt uniform in size or exfoliating in any way… it seems unintentional. Not to mention this is a cleansing balm to remove makeup before washing your face and it burns my eyes like crazy and I've never had that issue with any other cleaning balms I've used. I will not be buying again.",
        "nickname": "Slippers",
        "location": "Columbus, OH",
        "created_date": 1717896741092,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 487978861,
        "rating": 1,
        "headline": "Not for me",
        "comments": "It was horrible, did not remove my makeup well, broke me out!",
        "nickname": "MBT",
        "location": "Alabama",
        "created_date": 1704854486601,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 486790603,
        "rating": 2,
        "headline": "Very waxy",
        "comments": "I love cleansing balms and love the ingredients in this one but after trying 3 times I am returning. It just feels like wax on my skin and that doesn't feel clean and refreshing to me.",
        "nickname": "Tori",
        "location": "Raleigh, NC",
        "created_date": 1704511802900,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 481688274,
        "rating": 5,
        "headline": "The Balm is Da Bomb",
        "comments": "Only 2 days in, but I can already tell I'm going to be a long term user.  Does a great job removing makeup off skin (not great with mascara), but in addition my skin it's amazingly soft.",
        "nickname": "Shonda S",
        "location": "TEXAS",
        "created_date": 1700106295549,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 7,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        3,
        1,
        2,
        0,
        1
      ],
      "review_histogram": [
        3,
        1,
        2,
        0,
        1
      ],
      "rating_count": 7,
      "review_count": 7,
      "average_rating": 2.29,
      "recommended_ratio": 0.0,
      "media": [],
      "name": "Cleansing Balm to Melt Makeup + Hydrate",
      "native_review_count": 7,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 0,
      "locale": "en_US"
    }
  }
}