{
  "product_id": "pimprod2051419",
  "product_url": "https://www.ulta.com/p/strand-plumping-styling-cream-pimprod2051419",
  "extracted_at": "2025-09-23T05:16:20.596154+00:00",
  "product_name": "DiviStrand Plumping Styling Cream",
  "brand": "Divi",
  "categories": [
    "Home",
    "Hair",
    "Styling Products",
    "Volume & Texture"
  ],
  "category_keys": [
    "home",
    "hair",
    "styling-products",
    "volume--texture"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "32.00",
  "availability": "in_stock",
  "rating_avg": "3.8",
  "rating_count": "24",
  "images": [
    "https://media.ulta.com/i/ulta/2638787?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2638787?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2638787_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2638787_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2638787_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2638787_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2638787_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2638787_alt06?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganYour styling routine just got upgraded. Formulated for hair that lacks fullness Divi Strand Styling Cream instantly thickens the look of strands for up to 2.8x more volume* while enhancing long-term thickness with continued use. *In independent laboratory testing on hair tresses compared to baseline",
  "details": "DetailsBenefitsFormulated to instantly enhance the visible thickness of each strandBoosts hair fullness when used consistently over timeAdds touchable, high-impact volumeKey IngredientsP+ Vitamin Complex™: Instantly increases the visible thickness of each hair fiber, boosting overall volume.Nutrient Blend: Increases hair thickness over time when used consistently.Volumizing Microemulsion: Enhances volume while minimizing frizz for a smooth, lustrous finish.FeaturesGood for thin, flat or dull hairGood for hair that’s craving instant volume and long-term fullnessGood for hair prone to frizz or heat damageItem 2638787How To UseSpread a small amount on detangled, towel-dried hair, root to ends, and comb through to ensure each strand is saturated. Blow dry and style as desired. Pro Tip: For extra volume, blow dry strands upside down.IngredientsWater, Cetearyl Alcohol, Pisum Sativum (Pea) Peptide, PVP, Behentrimonium Chloride, Hydrolyzed Corn Starch, Silicone Quaternium-8, Cetrimonium Chloride, Coconut Alkanes, Phenoxyethanol, Dipropylene Glycol, Trideceth-10, Starch Hydroxypropyltrimonium Chloride, Niacinamide, Mentha Piperita (Peppermint) Oil, Guar Hydroxypropyltrimonium Chloride, Glycerin, Calcium Pantothenate, Maltodextrin, Sodium Starch Octenylsuccinate, Potassium Sorbate, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Ethylhexylglycerin, Sodium Ascorbyl Phosphate, Coco-Caprylate/Caprate, Phytic Acid, Leuconostoc/Radish Root Ferment Filtrate, Pyridoxine HCl, Tocopheryl Acetate, Citric Acid, Sodium Citrate, Silica, Tocopherol, Limonene.",
  "how_to_use": "Spread a small amount on detangled, towel-dried hair, root to ends, and comb through to ensure each strand is saturated. Blow dry and style as desired. Pro Tip: For extra volume, blow dry strands upside down.",
  "ingredients": [
    "Water",
    "Cetearyl Alcohol",
    "Pisum Sativum (Pea) Peptide",
    "PVP",
    "Behentrimonium Chloride",
    "Hydrolyzed Corn Starch",
    "Silicone Quaternium-8",
    "Cetrimonium Chloride",
    "Coconut Alkanes",
    "Phenoxyethanol",
    "Dipropylene Glycol",
    "Trideceth-10",
    "Starch Hydroxypropyltrimonium Chloride",
    "Niacinamide",
    "Mentha Piperita (Peppermint) Oil",
    "Guar Hydroxypropyltrimonium Chloride",
    "Glycerin",
    "Calcium Pantothenate",
    "Maltodextrin",
    "Sodium Starch Octenylsuccinate",
    "Potassium Sorbate",
    "Melaleuca Alternifolia (Tea Tree) Leaf Oil",
    "Ethylhexylglycerin",
    "Sodium Ascorbyl Phosphate",
    "Coco-Caprylate/Caprate",
    "Phytic Acid",
    "Leuconostoc/Radish Root Ferment Filtrate",
    "Pyridoxine HCl",
    "Tocopheryl Acetate",
    "Citric Acid",
    "Sodium Citrate",
    "Silica",
    "Tocopherol",
    "Limonene"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "hair",
      "haircare"
    ],
    "product_type": [
      "moisturizer"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "matte",
      "sheer",
      "creamy",
      "cream",
      "oil"
    ],
    "color": [
      "purple"
    ],
    "ingredients": [
      "niacinamide",
      "peptides"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "vegan"
    ]
  },
  "reviews": {
    "product_id": "pimprod2051419",
    "total_reviews": 24,
    "reviews": [
      {
        "review_id": 561382328,
        "rating": 5,
        "headline": "Diva. Mousse.  Love this product",
        "comments": "Hairdresser at Ulta( April )used it on my hair. \nOnly mousse that works o. My hair in Florida",
        "nickname": "Linda",
        "location": "Cape Coral Florida",
        "created_date": 1756482843307,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 3
      },
      {
        "review_id": 557400840,
        "rating": 4,
        "headline": "My Baby Fine Hair - Toothpaste",
        "comments": "I LOVE this product, but it SMELLS like Toothpaste. It provided the needed body and worked well, but the smell....",
        "nickname": "Bella",
        "location": "CA",
        "created_date": 1752703438594,
        "bottom_line": "Yes",
        "helpful_votes": 14,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556823834,
        "rating": 1,
        "headline": "Made my hair greasy",
        "comments": "I have used a lot of Divi products and are usually pleased with them. This one however was a disappointment. It made my hair flat and greasy looking",
        "nickname": "Susan",
        "location": "Mexia, Texas",
        "created_date": 1751995765379,
        "bottom_line": "No",
        "helpful_votes": 8,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556055434,
        "rating": 5,
        "headline": "I would buy this product again.",
        "comments": "This made my hair look and feel thicker.",
        "nickname": "Jodi",
        "location": "Montana",
        "created_date": 1751301178335,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555107516,
        "rating": 5,
        "headline": "Amazing for Kinky/Curly Hair",
        "comments": "This product works well in my 4a kinky curly hair. I was skeptical at first because it isn't marketed towards natural hair and I couldn't find reviews on someone with curly hair. I felt the texture in store and its on the thicker side which gave me a hunch that it may work well in my curly hair. I used it as a leave in before my gel for my wash and go, and it works wonderful! My hair is soft and full with it and I've even seen some growth! I understand that  it may not work best for straight hair that well— which it seems like it's marketed to, however I want them to know that it works great in tighter curls. It is a little heavier so if your hair is on the fine-er side it can weight it down- but i find it to be very moisturizing and a great fit for my curls!",
        "nickname": "MayE25",
        "location": "Spokane Washington",
        "created_date": 1749843511169,
        "bottom_line": null,
        "helpful_votes": 18,
        "not_helpful_votes": 1
      },
      {
        "review_id": 553932979,
        "rating": 1,
        "headline": "Had to rewash my hair",
        "comments": "Tried for the 1st time today bc my hair has thinned from weight loss. Once my hair was dry it wasn't exactly lightweight. I don't know how to explain the feel but I couldn't just run my fingers through my hair. It did have some body and fullness but that's useless if I can't touch it. Waste of money",
        "nickname": "CarrieM",
        "location": "Columbus Oh",
        "created_date": 1748096147350,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 3
      },
      {
        "review_id": 553288013,
        "rating": 5,
        "headline": "Amazing",
        "comments": "I have very fine hair. I used one pump and blow dried my hair. I got amazing volume. I will definitely not be without this product!",
        "nickname": "Jaime",
        "location": "Port Charlotte, FL",
        "created_date": 1747186298007,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553116251,
        "rating": 1,
        "headline": "Disappointing",
        "comments": "I have curly hair, and like to increase the volume with my curling products. This left my hair weighed down, even with only using a nickel size amount. I tried it twice, just in case, with two different curling products and same results, weighed down , no volume or thickness.",
        "nickname": "Curlyette",
        "location": "NYC",
        "created_date": 1746816490388,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 1
      },
      {
        "review_id": 553038322,
        "rating": 2,
        "headline": "Left my Hair Feeling Sticky",
        "comments": "I wanted to love this product, I really did. I love following Dani on Instagram. I feel like she try cares about creating products that are a level above and actually work! But this product was not it. I used it on 4 separate occasions because I really wanted to give it a chance. The first time it left my hair feelinf tacky/sticky/gummy, not sure the right word to use but it felt like there was a lot of product left in my hair. There was a slight boost in volume and a very subtle thickening but I couldnt get over the tacky feeling. I used it again and used less product and the result was the same. \n\nI returned it to Ulta. I can't justify the price for a subtle increase in volume. I will stick with the Colorwow Bombshell foam. \n\nI will say Divi has the best dry shampoo ever!",
        "nickname": "Kate",
        "location": "Indiana",
        "created_date": 1746652386951,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 553016409,
        "rating": 3,
        "headline": "Mixed emotions",
        "comments": "I wanted to love this product because my fine thin hair needs it since my go to Bondi Boost Volume & Texture cream has been no where to be found. I tried this product for about 3 weeks and some days it was a 10 and others it dried out my hair. The main problem was it started to build up more on my hot air brush than my hair, which was taking longer and longer to dry. I do not have the time to clean my brush every morning for it to work properly. It was promising, but the build up was a bummer.",
        "nickname": "Kristine",
        "location": "MA",
        "created_date": 1746616580103,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552943246,
        "rating": 2,
        "headline": "Didn't live up to expectations",
        "comments": "I was excited to try this on my baby fine, thin, straight hair which is in a Bob style. Unfortunately, each time I tried it, it literally made my hair fall flat. I varied the amount used but it didn't matter. My hair was softer but not thicker at all. Too bad!",
        "nickname": "Dee Dee",
        "location": "New Jersey",
        "created_date": 1746543878077,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 1
      },
      {
        "review_id": 552587889,
        "rating": 5,
        "headline": "Bought on release day! WORTH IT!!",
        "comments": "I have fine thin hair and I am always looking for something to give volume, add thickness and shine. April 20,2025 I was finally able to make a full price purchase and I am so thankful I did. \nThis product is a lightweight cream and you only need a small amount. I put about a quarter size amount in my palm, rubbed them together and ran my fingers from root to tips. I ended up using too much and i figured the results would be terrible. You cant tell that you over did it. No grease, no frizz just soft luxurious full body thick hair. I couldn't stop running my fingers through my hair and people thought i had a new hair stylist. I had soft, styled, voluminous, thicker shiney hair. \nOne of the best parts is that it has replaced my root spray, foam styler and gloss spray! This saves me so much money and the results look like I used an ultra expensive line of products. \n\nPeople with fine thin lifeless hair PLEASE try this! You will not be disappointed.",
        "nickname": "Morticia",
        "location": "Upstate, NY",
        "created_date": 1745909733093,
        "bottom_line": null,
        "helpful_votes": 18,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552276011,
        "rating": 5,
        "headline": "I love it!",
        "comments": "I bought this on a whim because I have fine/normal - wavy hair. \n\nFirst time I used it, I applied like a nickle amount of product, to my medium hair length Bob.  I was too much and while my hair was voluminous, it weighed it down and felt too heavy. \n\nNext time I applied about a dime amount, started at the scalp and brushed it down. Boom! Perfect amount of product. My hair looks so pretty, bouncy, and fuller and the blowout lasted longer.",
        "nickname": "",
        "location": "Edgewater, NJ",
        "created_date": 1745513859840,
        "bottom_line": "Yes",
        "helpful_votes": 18,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552223545,
        "rating": 5,
        "headline": "It works!",
        "comments": "I've tried many different volumizing products and most do not work on fine, straight hair. The key is knowing how much product to use. The volume is great and my favorite part is that it doesn't feel like there is product in my hair.",
        "nickname": "Leslie",
        "location": "Wisconsin",
        "created_date": 1745421324649,
        "bottom_line": "Yes",
        "helpful_votes": 13,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552166601,
        "rating": 4,
        "headline": "Didn't get results",
        "comments": "I was excited to try based on reviews,  unfortunately didn't meet my expectations based on those reviews. Wish it would have produced results it claims. Smells great! Unfortunately rather pricy will be going back.",
        "nickname": "Martha",
        "location": "IN",
        "created_date": 1745333442087,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 3
      },
      {
        "review_id": 552045294,
        "rating": 2,
        "headline": "Don't believe the hype",
        "comments": "I'm on plenty of meds that made my curls and thickness disappear. I got excited when i read the reviews hoping that it is good as it sounds. Dont believe the hype. Its sticky, dries out your hair, and leaves it a frizzy mess even if well conditioned. Save your money.",
        "nickname": "Kris",
        "location": "Emerald City",
        "created_date": 1745031221663,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551853113,
        "rating": 2,
        "headline": "Too heavy for fine hair",
        "comments": "This product is in my opinion not good for fine or thin hair. I have experimented with using different amounts of product and even a pea sized amount weighs my hair down. I don't find that it adds any plumping, thickening, volume, nothing like that at all. Just heavy, weighed down hair with a filmy residue. One thing I will say is that it does control frizz, but this comes at the expense of any other benefit. Bought this based on the glowing reviews and really regret it.",
        "nickname": "Rose",
        "location": "Spartanburg, SC",
        "created_date": 1744817949901,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 1
      },
      {
        "review_id": 551165274,
        "rating": 5,
        "headline": "Volume, volume, volume!",
        "comments": "This cream doesn't leave your hair sticky or feeling icky.  Only a few pumps and the magic happens. I have flat oily hair and this product has given me the volume I've been looking for!",
        "nickname": "Ashley",
        "location": "Tampa Florida",
        "created_date": 1744052702575,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551164094,
        "rating": 5,
        "headline": "Good even if you already have thick hair, volume city!",
        "comments": "While I already have thick hair I was interested in this product for the volume aspect - my hair can be so heavy that it doesn't keep the volume I want when styling. This product has made a big difference for me without frizz!",
        "nickname": "Anna",
        "location": "Fort Worth, TX",
        "created_date": 1744050933620,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551163602,
        "rating": 5,
        "headline": "My hair LOVES this styling cream!",
        "comments": "I have searched high and low to find a product like this for my blowouts, my hair absolutely loves it! Such a great scent and texture after using it too!!",
        "nickname": "Emily",
        "location": "Dallas, TX",
        "created_date": 1744050369878,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 24,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2051419/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "hairtype",
          "name": "Hair Type",
          "type": "tag",
          "values": [
            {
              "label": "Straight Hair",
              "count": 8
            },
            {
              "label": "Wavy Hair",
              "count": 5
            },
            {
              "label": "Very Curly Hair",
              "count": 1
            }
          ],
          "display_values": [
            "Straight Hair",
            "Very Curly Hair",
            "Wavy Hair"
          ]
        }
      ],
      "rating_histogram": [
        3,
        4,
        1,
        2,
        14
      ],
      "review_histogram": [
        3,
        4,
        1,
        2,
        14
      ],
      "rating_count": 24,
      "review_count": 24,
      "average_rating": 3.83,
      "recommended_ratio": 0.86,
      "media": [],
      "faceoff_positive": {
        "comments": "I have fine thin hair and I am always looking for something to give volume, add thickness and shine. April 20,2025 I was finally able to make a full price purchase and I am so thankful I did. \nThis product is a lightweight cream and you only need a small amount. I put about a quarter size amount in my palm, rubbed them together and ran my fingers from root to tips. I ended up using too much and i figured the results would be terrible. You cant tell that you over did it. No grease, no frizz just soft luxurious full body thick hair. I couldn't stop running my fingers through my hair and people thought i had a new hair stylist. I had soft, styled, voluminous, thicker shiney hair. \nOne of the best parts is that it has replaced my root spray, foam styler and gloss spray! This saves me so much money and the results look like I used an ultra expensive line of products. \n\nPeople with fine thin lifeless hair PLEASE try this! You will not be disappointed.",
        "headline": "Bought on release day! WORTH IT!!",
        "rating": 5,
        "ugc_id": 552587889
      },
      "faceoff_negative": {
        "comments": "I wanted to love this product, I really did. I love following Dani on Instagram. I feel like she try cares about creating products that are a level above and actually work! But this product was not it. I used it on 4 separate occasions because I really wanted to give it a chance. The first time it left my hair feelinf tacky/sticky/gummy, not sure the right word to use but it felt like there was a lot of product left in my hair. There was a slight boost in volume and a very subtle thickening but I couldnt get over the tacky feeling. I used it again and used less product and the result was the same. \n\nI returned it to Ulta. I can't justify the price for a subtle increase in volume. I will stick with the Colorwow Bombshell foam. \n\nI will say Divi has the best dry shampoo ever!",
        "headline": "Left my Hair Feeling Sticky",
        "rating": 2,
        "ugc_id": 553038322
      },
      "name": "Strand Plumping Styling Cream",
      "native_review_count": 24,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 0,
      "locale": "en_US"
    }
  }
}