{
  "product_id": "pimprod2045765",
  "product_url": "https://www.ulta.com/p/travel-size-la-micellaire-botanical-micellar-cleansing-water-pimprod2045765",
  "extracted_at": "2025-09-23T05:29:55.821401+00:00",
  "product_name": "DoreTravel Size La Micellaire Botanical Micellar Cleansing Water",
  "brand": "Dore",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wash"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "12.00",
  "availability": "in_stock",
  "rating_avg": "4.6",
  "rating_count": "50",
  "images": [
    "https://media.ulta.com/i/ulta/2628680?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2628680?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2628680_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2628680_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2628680_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2628680_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2628680_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2628680_vid01/thumbs/6cd38c3a-5402-4db6-be6a-f40dd50749fa?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive BackDoré's La Micellaire Botanical Micellar Cleansing Water is a rinse-free everyday micellar water formulated with antioxidant properties to remove excess oil, dirt, and makeup, while soothing tired, puffy, irritated skin with a gentle burst of hydration. Fragrance-free and suitable for all skin types.",
  "details": "DetailsBenefitsEffectively cleanses and reinforces the skin barrierLeaves your skin feeling hydrated with no stickinessFormulated to cleanse and prep your skin before treatment and moisturizingTested under dermatological and ophthalmological controlSuitable for all skin types and for use around the eyesEWG VERIFIED™Certified Plastic Neutral through Doré’s partnership with rePurpose GlobalLa Micellaire’s bottle is made with 30% post consumer recycled plastic (PCR) and can be recycled through curbside recycling programsFragrance-freeNon-comedogenicMade in FranceKey IngredientsCornflower Water: Effectively cleanses the skin with a mild decongesting and astringent effectDamascena Rose Water: Hydrates and soothes irritated skinAloe Vera: Soothes the skin and reinforces the skin barrierResearch ResultsLa Micellaire has been clinically tested under dermatological control with a diverse group of participants, with ages spanning 20s to 70s, over 28 days of use:86% said skin is perfectly cleansed of sebum and impurities86% said skin is clear82% said skin is soft82% said La Micellaire is a hydrating cleansing micellar water, and is not dryingItem 2628680How To UseSoak a cotton round with La Micellaire, swipe across the skin to cleanse and remove makeup as needed. No rinsing required. Suitable to use on eyes. Use within 6 months of opening.Pro tip:Use as a solo cleanser, a makeup remover or as your first cleansing step in a double cleanse. Use instead of water and harsh soap to clean your makeup brushes.Build a gentle and effective daily skincare routine that's fragrance-free and suitable for all skin types, including sensitive skin with Le Mini Set, Doré's best selling skincare designed in TSA-friendly travel sizes for ease and simplicity while on the go.IngredientsAqua (water/eau), Glycerin, Centaurea Cyanus Flower Water, Xylitylglucoside, Levulinic Acid, Sodium Benzoate, Anhydroxylitol, Sodium Levulinate, Xylitol, Rosa Damascena Flower Water, Sodium Hydroxide, Caprylyl/Capryl Glucoside, Aloe Barbadensis Leaf Extract, Citric Acid, Potassium SorbateAll Doré products are EWG VERIFIED™, which means they meet EWG's strict, scientific standards for transparency and health. Their team of toxicologists, chemists, and epidemiologists scrutinizes every product, empowering you to purchase safer skincare.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Soak a cotton round with La Micellaire, swipe across the skin to cleanse and remove makeup as needed. No rinsing required. Suitable to use on eyes. Use within 6 months of opening.Pro tip:Use as a solo cleanser, a makeup remover or as your first cleansing step in a double cleanse. Use instead of water and harsh soap to clean your makeup brushes.Build a gentle and effective daily skincare routine that's fragrance-free and suitable for all skin types, including sensitive skin with Le Mini Set, Doré's best selling skincare designed in TSA-friendly travel sizes for ease and simplicity while on the go.",
  "ingredients": [
    "Aqua (water/eau)",
    "Glycerin",
    "Centaurea Cyanus Flower Water",
    "Xylitylglucoside",
    "Levulinic Acid",
    "Sodium Benzoate",
    "Anhydroxylitol",
    "Sodium Levulinate",
    "Xylitol",
    "Rosa Damascena Flower Water",
    "Sodium Hydroxide",
    "Caprylyl/Capryl Glucoside",
    "Aloe Barbadensis Leaf Extract",
    "Citric Acid",
    "Potassium SorbateAll Doré products are EWG VERIFIED™",
    "which means they meet EWG's strict",
    "scientific standards for transparency and health. Their team of toxicologists",
    "chemists",
    "and epidemiologists scrutinizes every product",
    "empowering you to purchase safer skincare"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser"
    ],
    "skin_type": [
      "dry",
      "sensitive",
      "all skin types"
    ],
    "finish": [
      "sheer",
      "oil"
    ],
    "color": [
      "brown"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "natural",
      "non-comedogenic",
      "fragrance-free",
      "hydrating",
      "soothing",
      "purifying"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2045765",
    "total_reviews": 50,
    "reviews": [
      {
        "review_id": 558093458,
        "rating": 1,
        "headline": "Not similar to garnier micellar water",
        "comments": "I didnt find this removed makeup or cleansed at all.  Thought it looked a little more elevated than  my usual garnier micellar, but this is similar to washing your face with just water. Doesnt feel like any of my sunscreen or makeup came off",
        "nickname": "Nikol",
        "location": "Chicago",
        "created_date": 1753322347286,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543668621,
        "rating": 1,
        "headline": "Doesn't Work at all",
        "comments": "dont buy",
        "nickname": "not good",
        "location": "atlanta",
        "created_date": 1737434275889,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 2,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        3,
        1,
        1,
        1,
        44
      ],
      "review_histogram": [
        3,
        1,
        1,
        1,
        44
      ],
      "rating_count": 50,
      "review_count": 50,
      "average_rating": 4.64,
      "recommended_ratio": 0.96,
      "media": [],
      "faceoff_positive": {
        "comments": "I have been using le set for several weeks now. These products truly are gentle and effective. I am 43, with fair, sensitive, oily & acne prone skin. I have tried ALL the cleansers & products out there, in search of something both gentle & with the right ingredients that won't contribute to breakouts. Most products left my skin so sensitive and tender! The micellar cleanser is great, even for eye makeup. It is as effective as bioderma sensitive formula, which I have used for many years.The cleanser is the ONLY one I have tried that does not hurt my skin. It does clean thoroughly but I find its texture a bit difficult to work with, as it turns watery and milky very quickly, making it hard to decipher where I have spread it on my face while washing. I do not love the texture. The moisturizer is the best I have ever tried- it is perfect for both day & night as it is so hydrating but lightweight! The moisturizer is my favorite product from Dore. The baume is great- i never need it on my facial skin but I do love it for my lips and cuticles! I also love that Dore sent me the cheek balm from Merit because it is amazing, my new fav beauty product! None of these products cause acne for my reactive skin and they work perfectly with my tretinoin, which I use to manage breakouts and general skin health. I will certainly be a repeat customer :-)",
        "headline": "I have been using le set",
        "rating": 4,
        "ugc_id": 526230065
      },
      "faceoff_negative": {
        "comments": "I bought the set and thought the price point was great. However, the micellar water doesn't remove mascara, and to be honest, I don't really see the need for it. The balm is fine if you need it in a pinch for dry hands. The cleanser is fine, but the moisturizer is in a huge package with very little cream inside. I hacked inside the package to see how many days of moisturizer I had left, and was surprised to see how small the inside container is. Unnecessary packaging. I'd rather get more moisturizer than a pretty (big) pump.",
        "headline": "Just alright",
        "rating": 2,
        "ugc_id": 526229866
      },
      "name": "Travel Size La Micellaire Botanical Micellar Cleansing Water",
      "native_review_count": 2,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 48,
      "locale": "en_US"
    }
  }
}