{
  "product_id": "pimprod2045764",
  "product_url": "https://www.ulta.com/p/travel-size-le-cleanser-gel-milk-daily-gentle-cleanser-pimprod2045764",
  "extracted_at": "2025-09-23T05:30:00.062336+00:00",
  "product_name": "DoreTravel Size Le Cleanser Gel To Milk Daily Gentle Cleanser",
  "brand": "Dore",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wash"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "11.00",
  "availability": "in_stock",
  "rating_avg": "4.7",
  "rating_count": "88",
  "images": [
    "https://media.ulta.com/i/ulta/2628679?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2628679?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2628679_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2628679_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2628679_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2628679_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2628679_vid01/thumbs/01f54742-9dca-4d41-b39e-bb4f709b73f4?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive BackGentle and effective, Doré's Le Cleanser Gel to Milk Daily Facial Cleanser leaves skin perfectly clean and hydrated while thoroughly removing makeup including waterproof mascara and sunscreen without over-drying skin. Fragrance-free and suitable for all skin types including sensitive skin.",
  "details": "DetailsBenefitsNon-foamingLeaves your skin cleansed, nourished and hydratedSafe to use around the eyes without any irritationFormulated to cleanse and prep your skin before treatment and moisturizingTested under dermatological controlSuitable for all skin types including sensitive skinEWG VERIFIED™Plastic Neutral through Doré’s partnership with rePurpose GlobalLe Cleanser’s tube is made with 50% post consumer recycled plastic (PCR) and can be recycled through any recycling program in partnership with PactFragrance-freeNon-comedogenicMade in FranceKey IngredientsWitch Hazel Extract: Acts as an anti-inflammatory and gentle astringentGoji Berry Extract: Brightens and improves skin toneWhite Lily: Repairs skin from UV damage and oxidative stressResearch ResultsLe Cleanser has been clinically tested under dermatological control with a diverse group of participants, with ages spanning 20s to 70s, over 28 days of use:82% agreed makeup, sebum and impurities were removed after use, including eye makeup, without discomfort82% agreed the tightness sensation of dry skin was soothed+20% increase in hydration of dry areasItem 2628679How To UseMassage a quarter size amount of cleanser onto a damp face and neck. Rinse with lukewarm water. Suitable for use on eyes. Use within 6 months of opening.Pro tip:Use as a cleansing mask when applied to dry skin and left to sit for a few minutes before rinsing.Build a gentle and effective daily skincare routine that's fragrance-free and suitable for all skin types, including sensitive skin with Le Mini Set, Doré's best selling skincare designed in TSA-friendly travel sizes for ease and simplicity while on the go.IngredientsCaprylic/Capric Triglyceride, Glycerin, Helianthus Annuus (Sunflower) Seed Oil, Aqua (Water/Eau), Sucrose Laurate, Sucrose Palmitate, Benzyl Alcohol, Centaurea Cyanus Flower Water, Hamamelis Virginiana (Witch Hazel) Leaf Water, Dehydroacetic Acid, Lilium Candidum Flower Extract, Citric Acid, Lycium Barbarum Fruit Extract, Sodium Benzoate, Potassium SorbateAll Doré products are EWG VERIFIED™, which means they meet EWG's strict, scientific standards for transparency and health. Their team of toxicologists, chemists, and epidemiologists scrutinizes every product, empowering you to purchase safer skincare.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Massage a quarter size amount of cleanser onto a damp face and neck. Rinse with lukewarm water. Suitable for use on eyes. Use within 6 months of opening.Pro tip:Use as a cleansing mask when applied to dry skin and left to sit for a few minutes before rinsing.Build a gentle and effective daily skincare routine that's fragrance-free and suitable for all skin types, including sensitive skin with Le Mini Set, Doré's best selling skincare designed in TSA-friendly travel sizes for ease and simplicity while on the go.",
  "ingredients": [
    "Caprylic/Capric Triglyceride",
    "Glycerin",
    "Helianthus Annuus (Sunflower) Seed Oil",
    "Aqua (Water/Eau)",
    "Sucrose Laurate",
    "Sucrose Palmitate",
    "Benzyl Alcohol",
    "Centaurea Cyanus Flower Water",
    "Hamamelis Virginiana (Witch Hazel) Leaf Water",
    "Dehydroacetic Acid",
    "Lilium Candidum Flower Extract",
    "Citric Acid",
    "Lycium Barbarum Fruit Extract",
    "Sodium Benzoate",
    "Potassium SorbateAll Doré products are EWG VERIFIED™",
    "which means they meet EWG's strict",
    "scientific standards for transparency and health. Their team of toxicologists",
    "chemists",
    "and epidemiologists scrutinizes every product",
    "empowering you to purchase safer skincare"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser"
    ],
    "skin_type": [
      "dry",
      "sensitive",
      "all skin types"
    ],
    "finish": [
      "sheer",
      "waterproof",
      "gel",
      "oil",
      "foam"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "non-comedogenic",
      "fragrance-free",
      "hydrating",
      "soothing",
      "purifying"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2045764",
    "total_reviews": 88,
    "reviews": [],
    "paging": {
      "total_results": 0,
      "pages_total": 0,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        4,
        2,
        2,
        3,
        77
      ],
      "review_histogram": [
        4,
        2,
        2,
        3,
        77
      ],
      "rating_count": 88,
      "review_count": 88,
      "average_rating": 4.67,
      "recommended_ratio": 0.93,
      "media": [
        {
          "id": "526229343",
          "review_id": 526229782,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/equ20alnxvr8a2hbuhog.jpg",
          "headline": "JJ",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Joan",
          "created_date": 1707264000000
        }
      ],
      "faceoff_positive": {
        "comments": "I have been using le set for several weeks now. These products truly are gentle and effective. I am 43, with fair, sensitive, oily & acne prone skin. I have tried ALL the cleansers & products out there, in search of something both gentle & with the right ingredients that won't contribute to breakouts. Most products left my skin so sensitive and tender! The micellar cleanser is great, even for eye makeup. It is as effective as bioderma sensitive formula, which I have used for many years.The cleanser is the ONLY one I have tried that does not hurt my skin. It does clean thoroughly but I find its texture a bit difficult to work with, as it turns watery and milky very quickly, making it hard to decipher where I have spread it on my face while washing. I do not love the texture. The moisturizer is the best I have ever tried- it is perfect for both day & night as it is so hydrating but lightweight! The moisturizer is my favorite product from Dore. The baume is great- i never need it on my facial skin but I do love it for my lips and cuticles! I also love that Dore sent me the cheek balm from Merit because it is amazing, my new fav beauty product! None of these products cause acne for my reactive skin and they work perfectly with my tretinoin, which I use to manage breakouts and general skin health. I will certainly be a repeat customer :-)",
        "headline": "I have been using le set",
        "rating": 4,
        "ugc_id": 526230149
      },
      "faceoff_negative": {
        "comments": "I love companies who are EWG verified. It is important to my personal life style. I tried this cleanser in their starter kit and I must say it's truly fragrance free and as natural as you can get. I have VERY hypersensitive, hyper reactive skin. I am falsey allergic to many things due to how sensitive my skin is. My skin is also very dry, year round (I live in Massachusetts of the U.S. for weather example). I like how light and gentle this cleanser is, however it is even more drying for my skin. Despite using the moisturizer, my skin is left very taut and tight. Disappointed.",
        "headline": "I love companies who are",
        "rating": 3,
        "ugc_id": 526229963
      },
      "native_review_count": 0,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 88,
      "locale": "en_US"
    }
  }
}