{
  "product_id": "pimprod2028072",
  "product_url": "https://www.ulta.com/p/slaai-makeup-melting-butter-cleanser-pimprod2028072",
  "extracted_at": "2025-09-23T05:11:53.130320+00:00",
  "product_name": "Drunk ElephantSlaai Makeup-Melting Butter Cleanser",
  "brand": "Drunk Elephant",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wash"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "39.00",
  "availability": "in_stock",
  "rating_avg": "4.4",
  "rating_count": "853",
  "images": [
    "https://media.ulta.com/i/ulta/2588447?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2588447?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2588447_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2588447_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2588447_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2588447_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2588447_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2588447_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2588447_vid01/thumbs/b08fee59-3b76-4449-abaf-27c551421af3?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingDrunk Elephant's Slaai Makeup-Melting Butter Cleanser is an innovative cleansing balm that melts all traces of dirt, makeup, and sunscreen. Gentle enough to be used around the eye area, it quickly transforms from oil to milk upon contact with water.",
  "details": "DetailsBenefitsGently removes dirt, makeup, and sunscreenNourishes and moisturizes, leaving behind a dewy glowGentle enough to be used around the eye areaDesigned to be used on dry skinTransforms from oil to milk upon contact with waterDermatologist TestedKey IngredientsNourishing Fruit Salad Blend: A mix of non-fragrant, soothing fruit extracts (blueberry, kiwi, and strawberry) and replenishing fruit oils (cranberry seed oil, acai fruit oil, and watermelon seed oil) that comforts and moisturizes the skinNourishing Oil Blend: A mix of moisturizing and lightweight oils (marula seed, baobab seed, kalahari melon seed, mongongo, and ximenia) that protects and nurtures the skinBamboo and Charcoal Powder: Gently exfoliate away built-up dead, dry skinFormulated WithoutMade without the Suspicious 6 - the six ingredients Drunk Elephant believes are at the root of almost every skin issue (Essential oils, Silicones, Chemical sunscreens, SLS, Fragrances + dyes, and Drying alcohols)Item 2588447How To UsePM: In the evening, on dry skin, use dry fingertips to massage Slaai over face and eyes. Add water to activate, rinse well with warm water, and pat dry. May also be removed with a soft, damp cloth. In the morning (optional), 1 or 2 times per week, add Drunk Elephant's Bamboo Booster to Slaai for a customized, skin-refining physical exfoliation to aid in the removal of dead skin cells that have accumulated on the surface overnight. Tip: If using retinol, Drunk Elephant recommends avoiding Bamboo Booster, or using with caution, as it can be too much for skin.AM: (optional) 1-2 times per week, add Bamboo Booster to Slaai for a customized, skin-refining physical exfoliation to aid in the removal of dead skin cells that have accumulated on the surface overnight. Avoid the eye area when using the exfoliating booster.IngredientsEthylhexyl Palmitate, Caprylic/Capric Triglyceride, Carthamus Tinctorius (Safflower) Seed Oil, Lauryl Laurate, Polyglyceryl-3 Laurate, Polyhydroxystearic Acid, Helianthus Annuus (Sunflower) Seed Wax, Polyglyceryl-10 Laurate, Sclerocarya Birrea Seed Oil, Euterpe Oleracea Fruit Oil, Actinidia Chinensis (Kiwi) Fruit Extract, Fragaria Ananassa (Strawberry) Seed Extract, Vaccinium Macrocarpon (Cranberry) Seed Oil, Borago Officinalis Seed Oil, Adansonia Digitata Seed Oil, Polyglyceryl-2 Caprate, Citrullus Lanatus (Watermelon) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Schinziophyton Rautanenii Kernel Oil, Vaccinium Angustifolium (Blueberry) Fruit Extract, Ximenia Americana Seed Oil, Tocopherol, Glycerin.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "PM: In the evening, on dry skin, use dry fingertips to massage Slaai over face and eyes. Add water to activate, rinse well with warm water, and pat dry. May also be removed with a soft, damp cloth. In the morning (optional), 1 or 2 times per week, add Drunk Elephant's Bamboo Booster to Slaai for a customized, skin-refining physical exfoliation to aid in the removal of dead skin cells that have accumulated on the surface overnight. Tip: If using retinol, Drunk Elephant recommends avoiding Bamboo Booster, or using with caution, as it can be too much for skin.AM: (optional) 1-2 times per week, add Bamboo Booster to Slaai for a customized, skin-refining physical exfoliation to aid in the removal of dead skin cells that have accumulated on the surface overnight. Avoid the eye area when using the exfoliating booster.",
  "ingredients": [
    "Ethylhexyl Palmitate",
    "Caprylic/Capric Triglyceride",
    "Carthamus Tinctorius (Safflower) Seed Oil",
    "Lauryl Laurate",
    "Polyglyceryl-3 Laurate",
    "Polyhydroxystearic Acid",
    "Helianthus Annuus (Sunflower) Seed Wax",
    "Polyglyceryl-10 Laurate",
    "Sclerocarya Birrea Seed Oil",
    "Euterpe Oleracea Fruit Oil",
    "Actinidia Chinensis (Kiwi) Fruit Extract",
    "Fragaria Ananassa (Strawberry) Seed Extract",
    "Vaccinium Macrocarpon (Cranberry) Seed Oil",
    "Borago Officinalis Seed Oil",
    "Adansonia Digitata Seed Oil",
    "Polyglyceryl-2 Caprate",
    "Citrullus Lanatus (Watermelon) Seed Oil",
    "Prunus Amygdalus Dulcis (Sweet Almond) Oil",
    "Schinziophyton Rautanenii Kernel Oil",
    "Vaccinium Angustifolium (Blueberry) Fruit Extract",
    "Ximenia Americana Seed Oil",
    "Tocopherol",
    "Glycerin"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser",
      "moisturizer"
    ],
    "skin_type": [
      "dry",
      "sensitive"
    ],
    "finish": [
      "dewy",
      "sheer",
      "powdery",
      "oil"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "dermatologist-tested",
      "hydrating",
      "exfoliating",
      "soothing",
      "purifying"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2028072",
    "total_reviews": 853,
    "reviews": [
      {
        "review_id": 559958989,
        "rating": 2,
        "headline": "Takes A Lot",
        "comments": "I find that I have to use so much of this balm to get my everyday makeup off. I also find that it does like nothing for eye products. Youre better off using micell water.",
        "nickname": "Ri",
        "location": "NJ",
        "created_date": 1754947802116,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555848879,
        "rating": 5,
        "headline": "Coming back for more",
        "comments": "I recently tried to switch from DE to P&L. Ive replaced everything with satisfaction EXCEPT this. I like how it feels and I love using as a double cleanse on days I wear makeup. Had to come back for more after finishing a sample size.",
        "nickname": "Elizabeth",
        "location": "Florida",
        "created_date": 1750803664155,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553196380,
        "rating": 5,
        "headline": "Reminds me of a spa",
        "comments": "I have tried several double cleansers. This one is my FAV! It gets the jobs done and has a spa like scent - with no artificial fragrance.",
        "nickname": "Kelly",
        "location": "Orlando, FL",
        "created_date": 1747017548416,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552968701,
        "rating": 5,
        "headline": "Best butter I've ever used!",
        "comments": "I won't lie, I had my doubts about this melting butter. My skin type is combo, aging and extremely sensitive skin. \nThis product has me hooked! Not only did it not cause any reaction on my skin, but after adding water and rinsing, it felt hydrated, not oily and soft! Took off all my makeup including waterproof mascara! Ladies, you must try it! Like a spa at home. Highly recommended ♥️",
        "nickname": "Kim S",
        "location": "Surprise, Az",
        "created_date": 1746566581025,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 545885629,
        "rating": 3,
        "headline": "Ehhh…",
        "comments": "I really wanted to love this product. As I love numerous other Drunk Elephant products. Unfortunately, I simply cannot move past the scent of this cleanser. When I think cleanser I think fresh, clean. This product smells like im smearing chicken fat all my face. \n\nIt is an efficient oil cleanser, but I cant use it. \n\nSadly disappointed…",
        "nickname": "Disheartened in Texas",
        "location": "Texas",
        "created_date": 1738651582180,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 544145307,
        "rating": 1,
        "headline": "Not a fan",
        "comments": "If you dont care about the smell of old grease, then its great",
        "nickname": "Lisa",
        "location": "Boston, Massachusetts",
        "created_date": 1737773022409,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 2
      },
      {
        "review_id": 543195027,
        "rating": 5,
        "headline": "Love it!",
        "comments": "It does exactly what they say it does! I have extremely sensitive skin and haven't had one issue with this product.",
        "nickname": "TheMrsKidd",
        "location": "OKC, OK",
        "created_date": 1736990775502,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537158556,
        "rating": 5,
        "headline": "New favorite",
        "comments": "I love this product takes all my makeup off cleans my face without drying it",
        "nickname": "Kara",
        "location": "Euless Texas",
        "created_date": 1730474165997,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 527323042,
        "rating": 3,
        "headline": "Works great, extremely unpleasant smell",
        "comments": "I wanted to love this. Its a clean product and works really well. Its a nice butter consistency thst melts into an oil texture. Does a great job removing waterproof mascara and eyeliner and washes really clean.\n\nInwas hoping it would leave my skin feeling more moisturized considering its a butter but unfortunately it didnt feel like it added anything beneficial to my routine other then taking off makeup. \n\nIdk of its just me but the smell is extremely strong and i just couldnt get past it. It smells like polyurethane. \n\nNice product just not for me.",
        "nickname": "Alaina",
        "location": "CT",
        "created_date": 1723679906737,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 525466565,
        "rating": 1,
        "headline": "Disappointing",
        "comments": "It has a mild smell, but unfortunately that smell is of rancid oil. It does go on oily and does remove eye makeup, but it does not transform into a milk when water is added and does not rinse cleanly. It left a heavy, oily residue on my face that I had to remove with another cleanser. I had to use hand soap and hot water to get the oily residue of my hands. I will go back to using my $11 cleanser that actually does go on oily, remove makeup, change to a milk with water, and rinse cleanly.",
        "nickname": "Nan",
        "location": "Washington state",
        "created_date": 1721670703711,
        "bottom_line": "No",
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 512970554,
        "rating": 4,
        "headline": "Works well, ingredients are good too...",
        "comments": "Oh how I'm a sucker for 'cute' things: kits, sets, gimmicks (like a tiny tube of bamboo flakes). Did I even need a new cleansing balm? Not really. Clinique's Take the day off has been serving me well for so many years I've lost count. But then I saw this, with its cute 'bamboo booster' and that was it, lost all common sense (yet again!). In all honesty it's not a bad product. It does sting my eyes a little when I use it to remove mascara, and it does remove even the waterproof type, but you have to be very careful not to get it in your eyes or it will BURN! As a cleansing balm, I use it on an evening to remove sunscreen foundation and makeup, and once a week I add a bit of the bamboo booster (bamboo flakes and charcoal powder) to create a scrub. Is it necessary? Not really. If you already have a scrub, that'll do the trick. But I love these little gimmicky things, as I mentioned earlier, so this was right up my street! In hindsight I feel a bit silly...I already have about a dozen face scrubs just lying in my bathroom cabinet. The balm smells like old cooking oil. I do prefer my skincare to be fragrance free, but this one's pushing it! Once I've added water and it all emulsifies, I rinse off and follow with a normal cleanser. Performance-wise it doesn't work quite as well as my Clinique go-to, but not that far behind either. But the ingredients are a vast improvement over that, I have to admit. And that is the main thing in its favor. I likely will purchase it again, only this time for the right reasons!   \n\n-> My 'Ulta Beauty Top 7 must-have list' (My 7 favorite beauty products of all time, focusing mainly on my purchases at Ulta) < - < 1. Hair Loss Treatment: Divine Herbal Hair Oil < 2. Eye Cream: Clinique All about eyes < 3. Lip Gloss: Clarins Lip Comfort Oil < 4. Makeup Remover: Lancome Bi Facil < 5. Pigmentation + Anti-Aging Serum: Divine Herbal Facial Treatment Serum < 6. Eyeliner: Ulta Beauty Gel Eyeliner Pencil < 7. Moisturizer: 'Lush' – Enzymion",
        "nickname": "Selena",
        "location": "Miami, FL",
        "created_date": 1714820433058,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 508618794,
        "rating": 5,
        "headline": "Obsessed, I'll never buy anything else",
        "comments": "I had received a sample from Ipsy and it lasted forever. I had tried several types of make up removing wipes, micellar water, the makeup eraser, absolutely nothing compares. A small amount goes a very long way. It absolutely melts the makeup off of my face! My primer, setting spray, and water proof makeup usually holds up through ANYTHING. I have to fight with make up wipes and micellar water to get everything off and still have stains and spots left behind and my face is red. This leaves NO TRACES. Not only that, but this leaves my face so soft and smelling nice. The packaging is brilliant - love the spoon. The scent is very light. The amount of product is insane. The value is unbeatable, it's so much cheaper and better than your face than makeup wipes.GET THIS. You deserve it.",
        "nickname": "Iris",
        "location": "New mexico",
        "created_date": 1710571038636,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 506506622,
        "rating": 2,
        "headline": "Won't get again",
        "comments": "I recieved this a gift and i wont be buying ever. The smell is really bad and it doesnt take of my mascara like other brands i have tried. Its not worth the price or name brand.",
        "nickname": "Amber",
        "location": "Albany, New York",
        "created_date": 1708369631527,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 499562970,
        "rating": 2,
        "headline": "Bought for the packaging. Hoped I'd like the rest",
        "comments": "I bought this for the packaging. I love remover balms, and to find one with the spatula attached I thought was great. I hoped to love the actual product but I don't. It works well enough and the exfoliating powder is an interesting concept (used once, it was okay) BUT I can not stand the smell. I can't really describe it. It's not a fragrance so much as it just smells  bad. I won't buy this again but I'm likely going to reuse the container",
        "nickname": "CMC",
        "location": "New Hampshire",
        "created_date": 1706461161636,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 3
      },
      {
        "review_id": 496695360,
        "rating": 3,
        "headline": "Quality Control Issues",
        "comments": "The first jar I bought was great. Effectively removes makeup, hydrates and washes off without a residue. The second jar however was terrible. Removes makeup ok but I still have mascara undermy eyes when I wake yo in the morning, which didnt happen with the first jar. It also left a residue on my skin after rinsing well. And when looking at the balm it appears to have separated layers. The top layer being much more yellow and the bottom more pale. Its like its a completely different product from the first jar I bought. Definitely some quality control issues.",
        "nickname": "sttaylor",
        "location": "Daphne",
        "created_date": 1705860512014,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 496592150,
        "rating": 5,
        "headline": "Wonderful for people with sensitive eyes/skin",
        "comments": "So many products for the face aggravate my very sensitive eyes (triggering redness, headaches and more). This is one of only a handful of products that I can still use. Very grateful for the lack of fragrance and for its gentle effectiveness",
        "nickname": "Leilani",
        "location": "San Diego",
        "created_date": 1705813598438,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 486581479,
        "rating": 5,
        "headline": "I love this",
        "comments": "I used to use micellar water in the blue container and it was too oily for my skin so I tried this product snd fell in love!! It is so smooth and removes my makeup with ease! I have very sensitive skin and this didn't irradiate it at all! I definitely recommend this product!",
        "nickname": "Kate",
        "location": "OK, Oklahoma City",
        "created_date": 1704431398866,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 486455886,
        "rating": 5,
        "headline": "Great Product",
        "comments": "My daughter loves this products. It makes her night routine easy and enjoyable",
        "nickname": "Carol",
        "location": "Lakeland Florida",
        "created_date": 1704315996199,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 482348446,
        "rating": 5,
        "headline": "The Greatest Thing That Ever Was!!",
        "comments": "When I bought this, I saw the word 'cleansing' balm on the label, but I didn't realize it was an actual face cleanser, not just a make-up remover! It works SO well, and I don't have to do two things at night when taking my make-up off (make-up remover then cleanse)! Plus, no more oily eyes! It's so easy to use and gentle on the skin! I am in love with this stuff!",
        "nickname": "Luckie",
        "location": "California",
        "created_date": 1700832831504,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 1
      },
      {
        "review_id": 480063902,
        "rating": 4,
        "headline": "Works fairly good",
        "comments": "I am on the hunt to find a new makeup cleanser after finding out the brand I use is not cruelty free, so I decided to try Drunk Elephants Makeup Melting Butter Cleanser. I really like this product because it has a very gentle formula, hasn't irritated my skin, and smells like bananas (at least I think it does). I have acne prone oily skin so finding products that work for my skin is hard, and Drunk Elephants Cleanser hasn't broken me out so I am thrilled about that. I had to rate it 4 stars instead of 5 because it doesn't completely take off all the makeup unless you scrub your face for 5 minutes or more. Nonetheless I am very satisfied because it compares fairly similar to the brand I used to use. I will keep purchasing!",
        "nickname": "Jessica",
        "location": "Ohio",
        "created_date": 1699371634206,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 101,
      "pages_total": 6,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2028072/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "bestuses",
          "name": "Best Uses",
          "type": "tag",
          "values": [
            {
              "label": "Makeup remover",
              "count": 1
            },
            {
              "label": "Makeup removal.",
              "count": 1
            }
          ],
          "display_values": [
            "Makeup removal.",
            "Makeup remover"
          ]
        },
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "Drying",
              "count": 1
            },
            {
              "label": "Smell",
              "count": 1
            }
          ],
          "display_values": [
            "Drying",
            "Smell"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "30's",
              "count": 1
            },
            {
              "label": "Active",
              "count": 1
            },
            {
              "label": "Normal skin",
              "count": 1
            }
          ],
          "display_values": [
            "30's",
            "Active",
            "Casual Dresser",
            "Comfort-seeking",
            "Energetic/Active",
            "Normal skin",
            "Stylish/Fashionista",
            "Trendy/Stylish Dresser",
            "Youthful"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "Granules for exfoliation",
              "count": 1
            },
            {
              "label": "Love the concept",
              "count": 1
            },
            {
              "label": "Scent",
              "count": 1
            },
            {
              "label": "Great for sensitive skin",
              "count": 1
            },
            {
              "label": "Effective",
              "count": 1
            }
          ],
          "display_values": [
            "Effective",
            "Granules for exfoliation",
            "Great for sensitive skin",
            "Love the concept",
            "Scent"
          ]
        },
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Normal",
              "count": 2
            },
            {
              "label": "Oily",
              "count": 2
            },
            {
              "label": "Combination",
              "count": 1
            },
            {
              "label": "Dry",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        38,
        38,
        62,
        102,
        613
      ],
      "review_histogram": [
        38,
        38,
        62,
        102,
        613
      ],
      "rating_count": 853,
      "review_count": 853,
      "average_rating": 4.42,
      "recommended_ratio": 0.83,
      "media": [
        {
          "id": "527648789",
          "review_id": 527648788,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/cngnhacxphhpxnqwq4kz.jpg",
          "headline": "WARNING for ACNEIC SKIN",
          "rating": 2,
          "helpful_votes": 2,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "inflammation after using product",
          "nickname": "Annie",
          "created_date": 1724114506682
        },
        {
          "id": "527648810",
          "review_id": 527648788,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/jdhzjdmb4aiwyzacktze.jpg",
          "headline": "WARNING for ACNEIC SKIN",
          "rating": 2,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "sample product",
          "nickname": "Annie",
          "created_date": 1724114506682
        },
        {
          "id": "512970555",
          "review_id": 512970554,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ppykzwthccocbxywlcvg.jpg",
          "headline": "Works well, ingredients are good too...",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Selena",
          "created_date": 1714820433058
        },
        {
          "id": "488378457",
          "review_id": 488378534,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/vqsqx1ljptjeihsef3lm.jpg",
          "headline": "Drunk elephant melting butter cleanser",
          "rating": 5,
          "helpful_votes": 2,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "shelbym238",
          "created_date": 1704240000000
        },
        {
          "id": "488564629",
          "review_id": 488564734,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/rrasawtebq0sbubsip6b.jpg",
          "headline": "Love",
          "rating": 5,
          "helpful_votes": 2,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "oliviaw286",
          "created_date": 1693440000000
        },
        {
          "id": "488681606",
          "review_id": 488681119,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/mvjpzumdwhwofmv0unae.jpg",
          "headline": "Melts away makeup and sunscreen",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "amys754",
          "created_date": 1692835200000
        },
        {
          "id": "488551279",
          "review_id": 488552025,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/fxjhc68gut0oqgqxince.jpg",
          "headline": "Smooth!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "emmywachter",
          "created_date": 1692835200000
        },
        {
          "id": "488516417",
          "review_id": 488516416,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/did70nfadu35gzoewvek.jpg",
          "headline": "Run",
          "rating": 5,
          "helpful_votes": 1,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "missme4",
          "created_date": 1692835200000
        },
        {
          "id": "488701435",
          "review_id": 488701542,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/tjajubpaaqqd9pofmxxo.jpg",
          "headline": "Everytime: A new",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "JenniJanks",
          "created_date": 1672358400000
        },
        {
          "id": "488701572",
          "review_id": 488701542,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/pf9uqcusypmutedhtyyx.jpg",
          "headline": "Everytime: A new",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "JenniJanks",
          "created_date": 1672358400000
        },
        {
          "id": "488700608",
          "review_id": 488701542,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/vzjthofzqzlii73qa7rg.jpg",
          "headline": "Everytime: A new",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "JenniJanks",
          "created_date": 1672358400000
        }
      ],
      "faceoff_positive": {
        "comments": "This product lives on the shelf in my shower! I use it every time I have on makeup in a day as a first step cleanser. This thick but easily spreadable consistency truly takes away waterproof makeup and more. I first massage my face and often add the exfoliate that comes with it. Then I set my hands and massages the balm cleanser even more. I love this stuff with or without makeup- but with makeup makes this a must use to really cleanse at the end of an old day so a new day and new fresh face takes over!",
        "headline": "Everytime: A new",
        "rating": 5,
        "ugc_id": 488701542
      },
      "faceoff_negative": {
        "comments": "I fell in love with this cleaner. there are a lot of balms out there but this was so easy to apply because of the jar. The price makes it is a luxury, but really a deal because it lasts so long. I recommended to everyone..... then I bought again at Sephora and found the packaging had changed. Not good. this notch clasp thing, not the same. the magnet was brilliant! I would rather use my fingers than fumble through fitting that spatula back on the lid. I hate to sound petty but it really is these small differences that matter. In addition, and I hope Im wrong, but he formula was changed? it does not wash off as easily. It is more waxy and I need a cloth to help wash off. before, water was enough. Please go back to your roots. I can buy Clinique 'wash the day off´ if I want a sticky balm. Thank you for considering my feedback.",
        "headline": "Please go back to original packaging",
        "rating": 3,
        "ugc_id": 488674693
      },
      "name": "Slaai Makeup-Melting Butter Cleanser",
      "native_review_count": 101,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 752,
      "locale": "en_US"
    }
  }
}