{
  "product_id": "pimprod2052213",
  "product_url": "https://www.ulta.com/p/all-inclusive-8-in-1-air-active-heat-multi-styler-pimprod2052213",
  "extracted_at": "2025-09-23T03:16:37.550773+00:00",
  "product_name": "DrybarAll-Inclusive 8-in-1 Air & Active Heat Multi-Styler",
  "brand": "Drybar",
  "categories": [
    "Home",
    "Tools & Brushes",
    "Hair Styling Tools",
    "Hot Brushes"
  ],
  "category_keys": [
    "home",
    "tools-brushes",
    "hair",
    "brushes"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "299.00",
  "availability": "in_stock",
  "rating_avg": "4.8",
  "rating_count": "82",
  "images": [
    "https://media.ulta.com/i/ulta/2643140?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2643140?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2643140_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2643140_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2643140_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2643140_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2643140_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2643140_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2643140_alt07?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2643140_vid01/thumbs/b50b8a9e-e1c6-48c6-a5f4-ab9534cd3cab?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryMeet the All-Inclusive 8-in-1 Air & Active Heat Multi-Styler – Drybar's first tool of its kind with StyleLock Technology to combine BOTH heated airflow and heated styling plates. Take your hair from wet to dry to styled with just one tool.",
  "details": "DetailsBenefitsLong-lasting styles: the unique and powerful blend of air + active heat and ceramic attachments combine to create styles that last.Use on dry hair: extend your blowout by using Active Heat mode to easily restyle or try a new lookLess Damage: StyleLock Technology ™ delivers an optimal ratio of air and heat for reduced heat damage*All-in-One-Tool: Four attachments take hair from wet to dry to style – any way you like!Ultimate Volume: Delivers up to 3X more volume***based on 3rd party testing**than air-dried hairFeaturesStyleLock Technology ™ delivers an optimal ratio of Air + Active heat for reduced thermal damage“Pause” feature easily stops air flow for easy styling and sectioning Customized styling with 4 Heat and 3 Air SettingsRound brush features nylon and tufted bristles for enhanced tension and controlCeramic coated barrels on all attachmentsIncludesDual-Sided Concentrator2” Round BrushFlat Iron1.25” Curling IronStorage BagItem 2643140How To UseRough dry using the Concentrator to get hair 70--80% dry.Choose your styling attachment based on your desired look:Round Brush for volume and liftFlat Iron for sleek, straight stylesCurling Iron for curls or wavesFor WET styling use Air + Active Heat mode to style hair.For DRY styling or touch-ups use Active Heat only (air flow off).Use the Style Set (Pause) button to easily pause airflow between sectioning hair.Turn off device before removing attachment by pressing the release button and using the cool tip.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Rough dry using the Concentrator to get hair 70--80% dry.Choose your styling attachment based on your desired look:Round Brush for volume and liftFlat Iron for sleek, straight stylesCurling Iron for curls or wavesFor WET styling use Air + Active Heat mode to style hair.For DRY styling or touch-ups use Active Heat only (air flow off).Use the Style Set (Pause) button to easily pause airflow between sectioning hair.Turn off device before removing attachment by pressing the release button and using the cool tip.",
  "ingredients": "",
  "extended_contents": {
    "images": [
      "https://content.syndigo.com/asset/42bed02a-b640-4c8d-aaec-25389d4a6db0/480.webp",
      "https://content.syndigo.com/asset/d4919749-870d-46e5-bbea-9fdade2585cf/960.webp",
      "https://content.syndigo.com/asset/5bcbde52-5b35-443f-94e0-93fd927f0872/960.webp",
      "https://content.syndigo.com/asset/9043c3ee-114d-4976-8fed-0fe28f850fcf/960.webp",
      "https://content.syndigo.com/asset/b2e456ad-2d2a-4b51-8362-e0a2608f1b27/960.webp",
      "https://content.syndigo.com/asset/77ad5c50-e970-4974-a859-d4ef3cc2327a/960.webp",
      "https://content.syndigo.com/asset/3cdb579c-64b5-4935-a25e-da868f803591/960.webp",
      "https://content.syndigo.com/asset/b4f2b9e1-5210-4aa3-888a-3e8a2d59542b/960.webp",
      "https://content.syndigo.com/asset/1c7ed775-aaf4-4af0-b080-55ec3ba48219/960.webp",
      "https://content.syndigo.com/asset/a1d6f410-ac48-44a3-ba71-71e5ea8c324f/960.webp",
      "https://content.syndigo.com/asset/242a50fe-7d73-43b2-b043-19e0639ac049/960.webp"
    ]
  },
  "tags": {
    "category": [
      "hair",
      "brushes",
      "tools",
      "haircare"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "matte",
      "long-wear"
    ],
    "brand": [
      "mid-range",
      "premium"
    ],
    "product_type": [],
    "ingredients": [],
    "special_features": []
  },
  "reviews": {
    "product_id": "pimprod2052213",
    "total_reviews": 82,
    "reviews": [
      {
        "review_id": 563540869,
        "rating": 5,
        "headline": "Wow! Must have!!!",
        "comments": "I am beyond thrilled to have this amazing hair tool. I do have Drybar hair dryer but this hair dryer makes my hair even more fuller. I also love the features of the 'hot air curling iron'. It' curls my hair without frizz and makes it super shiny.",
        "nickname": "Mili",
        "location": "Escondido, CA",
        "created_date": 1758115568283,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 562492005,
        "rating": 5,
        "headline": "Love it",
        "comments": "I used to have the double shot oval blow dry tool which I loved cause it helped with wrist strain I would get using a brush and blow dryer and made styling my hair faster and easier. \n\nThis is an improvement and so worth it. At first I got a little annoyed at all the settings cause I prefer simple tools but once you use it, it makes sense. Being able to pause the air flow while you set/clip/unclip hair pieces is a convenient feature I didn't realize I needed. It's a sturdy styling tool and as long as you keep it clean after every use and don't pull on your hair too hard I can see it lasting years like my last hair tool from this brand. I did also notice the hair brush attachment is a little easier to wipe down than my older dryer. I don't think I'll get much use of the other attachments but it's nice to have so many options in one. Overall I'm very happy.",
        "nickname": "Pau",
        "location": "NY",
        "created_date": 1757010382182,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560121054,
        "rating": 5,
        "headline": "Definitely worth it",
        "comments": "I got this as a birthday gift for myself and it was totally worth it. Im a simple girl and i love having all in one kind of appliances. I love this for drying and styling my hair and as a mom who barely has time to get ready, this makes it that much easier!",
        "nickname": "Katie",
        "location": "Ogden",
        "created_date": 1755112316283,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559905343,
        "rating": 5,
        "headline": "Love it!",
        "comments": "I have all of the DryBar tools as well as Dyson Air Straight and Dyson Air Wrap.  This one is the best yet! Most likely will never use the Air Wrap again.  This makes your hair so smooth… it is larger than the Dyson or the other DryBar tools but the results are worth the extra length and weight.",
        "nickname": "Allison",
        "location": "Central Florida",
        "created_date": 1754868422177,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559408588,
        "rating": 2,
        "headline": "Better than Dyson",
        "comments": "I've used Dyson and Shark products, but the Multi-Styler by DryBar is the best tool I've ever used. I have frizz-prone hair that is between wavy and curly. I bought this machine on a whim after I found that my Dyson dryer did little to tame my frizz. \nCONS: Heavy to use, and time consuming. This machine feels slightly heavier to handle than Dyson. Also, between my hair texture and length, it takes me about 45 minutes to an hour to get a relatively frizz-free blow out. I also wish this dryer came with a smaller round brush attachment to blow dry shorter lengths of hair. Temperature is relatively low (only heats up to arround 400 degrees on high heat.) \nPROS: Easy to use. I love how this product works on WET and DRY hair. I can take this product along with me, and I don't have to pack an additional curling iron, thermal brush, and hair straightener because this Multi-Styler also functions as those tools. Each styling component can not only produce air, but it has hot plates that you can shut on/off for convenient styling. I believe that the secret to taming the frizz is the hot plates! Neither Shark nor Dyson have this feature. \nOver all, between price and functionality, I highly reccomend this Multi-Styler over tools made by Dyson and Shark.",
        "nickname": "Em",
        "location": "Boston, MA",
        "created_date": 1754492336471,
        "bottom_line": null,
        "helpful_votes": 16,
        "not_helpful_votes": 4
      },
      {
        "review_id": 558083819,
        "rating": 5,
        "headline": "So far so good!",
        "comments": "I had a hard time deciding on an upgrade for a wet to dry hair tool having not tried Shark or Dyson or any others. I decided I wanted one with a straightening feature, a curling wand, and blowout brush, and didnt need a diffuser since I already have a nice one for my curly hair. This fit the bill! Not only that but I like that there is a heat only setting too. The straightener takes some getting used to, it can be a bit of a mess when its blowing your hair all around but I knew it would be a struggle no matter the device because I have long thick curly hair. Overall I like it and I think it'll get better the more I use it and practice!",
        "nickname": "Sierra Mist",
        "location": "Chicago",
        "created_date": 1753305866536,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556708825,
        "rating": 5,
        "headline": "love it",
        "comments": "The drybar all inclusive hair styler is absolutely awesome. I became a huge fan after using the different attachments. Styles aside, they make hair feel shiny and healthy and smooth. For the styling part, every tool is unique and gives a unique style. Absolutely love it\nComplimentary from Drybar",
        "nickname": "rubi",
        "location": "WA",
        "created_date": 1751779938228,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556610783,
        "rating": 5,
        "headline": "Worth the Splurge",
        "comments": "Im still figuring it all out. So far i love the dryer and round blowout brush. Still learning the curling iron and faltirin opitions. So glad i spent the money bc its well worth it!",
        "nickname": "Robinharris",
        "location": "Macon, Ga",
        "created_date": 1751650228409,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556020263,
        "rating": 3,
        "headline": "Sounded convenient",
        "comments": "Did not work for me. I have fine hair and the tools did not work for my hair. Was big and bulky and too many tools for my counter and was not happy with this purchase. I did return it next day and Ulta handles it great! Love dry bar products but this set did not work at all for me.",
        "nickname": "Shannon",
        "location": "Puyallup, wa",
        "created_date": 1751213620304,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555984965,
        "rating": 5,
        "headline": "Love this!!",
        "comments": "This is the most amazing hair product. I love how slick and sleek my hair gets with this. I use it from wet hair and it takes me only thirty minutes which says a lot since I have very thick long hair. I've been using this evry 3 days. Gifted by dry bar!",
        "nickname": "Bre",
        "location": "Florida",
        "created_date": 1751076069158,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555946152,
        "rating": 5,
        "headline": "Versatile",
        "comments": "This was gifted by drybar and I love it! It's so easy to use and allows for so many different styles and lasts all day. My hair feels silky smooth after use and I don't feel like it gets overly hot to the point it causes damage like similar tools",
        "nickname": "Alyssa",
        "location": "New York",
        "created_date": 1750984129997,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555943538,
        "rating": 5,
        "headline": "Love all the attachments",
        "comments": "I love this product. It works so good. It made my hair so soft and silky. It was super easy to use and the outcome of the tools was perfect in long last night. I love the different attachments and they all work seamlessly and efficient. Gifted by dry bar",
        "nickname": "Molly",
        "location": "Jacksonville Florida",
        "created_date": 1750977550854,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 555939733,
        "rating": 5,
        "headline": "New favorite tool!",
        "comments": "This tool makes styling my hair super easy! It dries and straightens at the same time which saves a lot of time in the morning. My hair feels smoother and looks like I just left the salon. It heats up fast and is really simple to use, so glad this was offered by Drybar!",
        "nickname": "rd17b",
        "location": "USA",
        "created_date": 1750973653141,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 2
      },
      {
        "review_id": 555871526,
        "rating": 5,
        "headline": "Must have !",
        "comments": "This is truly the only hair tool you'll ever need. I've been a fan of the Drybar Triple Shot for months and it used to be my go-to. But this tool has completely taken its place! The flat iron is incredibly effective as it straightens my hair quickly and leaves it silky smooth. The curling iron is beginner-friendly and, best of all, actually holds my curls all day. While I don't reach for the round brush often (since I already have the Triple Shot), it still delivers impressive volume when I do use it. The concentrator attachment is perfect for prepping my hair before styling and helps reduce frizz significantly. Overall, I couldn't be happier. This tool has everything I need in one sleek package. Complimentary from Drybar.",
        "nickname": "Sami",
        "location": "Boston, Ma",
        "created_date": 1750858552325,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 555869809,
        "rating": 5,
        "headline": "Best dryer/ hot tool ever!!",
        "comments": "This made my hair super soft and shinny. It dried a s styled my hair in half the time it usually takes me. I love this!!!",
        "nickname": "Gigi",
        "location": "Texas",
        "created_date": 1750856005115,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 555856851,
        "rating": 5,
        "headline": "Would ditch all my tools for this!",
        "comments": "I revived this product Gifted by drybar and I'm truly obsessed with the styling tool. I've used it as a blowout brush and heated round brush. I've used it as a curling iron as a straightener. I've used it on wet hair, dry hair and I'm just truly impressed. This is an all around tool would be grateful for TRAVEL since it would be the only tool I need. It has a dryer attachment if you simply would like to dry your hair I truly am so impressed with this.",
        "nickname": "Skylar",
        "location": "Seattle",
        "created_date": 1750832718177,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 3
      },
      {
        "review_id": 555856413,
        "rating": 3,
        "headline": "Versatile dryer",
        "comments": "This is a versatile tool with lots of different attachments to choose from for various styles. Some I found easier to work with than others but I don't claim to be the most proficient person when it comes to styling my own hair so do take my opinions with a grain of salt. My favorite attachment was the blowout brush which left my hair soft and voluminous. The other attachments I found took longer to dry my hair than I liked so styling often felt like lengthy and tedious. I also had a hard time getting the cold shot to work despite following the directions on the manual closely. Overall, it's a quality product but maybe not one to reach for if you're in a rush. This product was gifted by drybar in exchange for my honest review.",
        "nickname": "Gracen",
        "location": "Columbia, SC",
        "created_date": 1750830509765,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 2
      },
      {
        "review_id": 555781359,
        "rating": 5,
        "headline": "The Ultimate Hair Styling Tool",
        "comments": "Received this product complimentary from Drybar in exchange of my honest review. Received this product complimentary from Drybar in exchange of my honest review. The All-Inclusive Styler is just like a dream come true kind of hair-styler tool to have at home. What beats than doing my own hair myself when it saves the money and time?  This means I no longer have to drag myself to the hair salon in order to get my hair styled and done there which is actually pretty convenient in my opinion. For the Dual-Sided Concentrator, I use that as a blowdryer and try to get my hair dry about 60-70%. Then, the 2\" Round Brush is used to make my hair appear like it is smoother plus has more volume and more shine. Next, I am using the flat iron attachment to straighten out my bangs and the hair strands on the side trying to make them look even. Lastly, I'm testing out the 1.25\" curling iron to create curls on my pin straight hair. Every attachment is easy to use and suitable for both wet and dry hair styling.",
        "nickname": "Lonnie",
        "location": "NYC",
        "created_date": 1750714386627,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555778356,
        "rating": 5,
        "headline": "In my blowout era",
        "comments": "I've been using the Drybar All-Inclusive Multi-Styler for a week now and I'm genuinely impressed. The two attachments I've been reaching for the most are the round brush and the curling wand. Both are great, but the round brush is easily my go-to. I use it on wet or dry hair, whether it's a wash day or not, and it gives my hair that fresh, bouncy boost that makes it look like I put way more effort in than I did. The technology in this is next level. The heated airflow combined with heated plates built into the attachments makes a big difference. The curling wand feels like a mix between a blow dryer and a hot tool, so I get volume and curl without having to switch between multiple devices. It's fast, easy, and doesn't fry my hair. This is the kind of tool that makes you actually want to style your hair. It's been a solid addition to my routine, especially for in-between wash days when I want to revive my look quickly. In my blowout era and loving it! * Gifted by drybar",
        "nickname": "Jacquelyn",
        "location": "Detroit, MI",
        "created_date": 1750708405481,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555767726,
        "rating": 5,
        "headline": "The BEST",
        "comments": "I am OBSESSED with this drybar hair tool! This is the perfect thing for someone who needs it all but doesn't want a million different devices! I love everything about it, the fact it can be a regular blow dryer, a round brush, curler, straightener, you can use heat or just air, etc! It made my hair way less frizzy than other tools and my hair is so soft after using it! I am so thankful to be gifted by drybar!",
        "nickname": "Taylor",
        "location": "Jersey City",
        "created_date": 1750694021680,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 82,
      "pages_total": 5,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2052213/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "hairtype",
          "name": "Hair Type",
          "type": "tag",
          "values": [
            {
              "label": "Very Curly Hair",
              "count": 1
            }
          ],
          "display_values": [
            "Straight Hair",
            "Very Curly Hair",
            "Wavy Hair"
          ]
        }
      ],
      "rating_histogram": [
        0,
        1,
        3,
        3,
        75
      ],
      "review_histogram": [
        0,
        1,
        3,
        3,
        75
      ],
      "rating_count": 82,
      "review_count": 82,
      "average_rating": 4.85,
      "recommended_ratio": 0.96,
      "media": [
        {
          "id": "555778358",
          "review_id": 555778356,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/kybggbvv5jonsihnbtrp.jpg",
          "headline": "In my blowout era",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Jacquelyn",
          "created_date": 1750708405481
        },
        {
          "id": "555778357",
          "review_id": 555778356,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/vb8x3b5tmvdountszsxq.jpg",
          "headline": "In my blowout era",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Jacquelyn",
          "created_date": 1750708405481
        },
        {
          "id": "555653425",
          "review_id": 555653407,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/kmaw1wlc4rqi2esdnahw.jpg",
          "headline": "So versatile!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Anastasiia",
          "created_date": 1750476516999
        },
        {
          "id": "555653416",
          "review_id": 555653407,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/lt3glzmdejho1duglmef.jpg",
          "headline": "So versatile!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Anastasiia",
          "created_date": 1750476516999
        },
        {
          "id": "555653391",
          "review_id": 555653407,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ocz1qirlzqshncpjhpso.jpg",
          "headline": "So versatile!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Anastasiia",
          "created_date": 1750476516999
        },
        {
          "id": "555609885",
          "review_id": 555609851,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/cor9zkfvdawhdgvhx8sk.jpg",
          "headline": "Easy to use",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Kristina",
          "created_date": 1750436041437
        },
        {
          "id": "555609884",
          "review_id": 555609851,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/uftm46jbf7ebbkec0gx5.jpg",
          "headline": "Easy to use",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Kristina",
          "created_date": 1750436041437
        },
        {
          "id": "555606669",
          "review_id": 555606653,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/bs5f2jbzkfafs3oyoqze.jpg",
          "headline": "All in one",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Puja",
          "created_date": 1750432060317
        },
        {
          "id": "555596013",
          "review_id": 555596012,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/jfeooegru5ripmjljrqt.jpg",
          "headline": "Where has this been all my life",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Janene",
          "created_date": 1750415345408
        },
        {
          "id": "555596445",
          "review_id": 555596012,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/afzgiubhpfu7m3gc8irs.jpg",
          "headline": "Where has this been all my life",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Janene",
          "created_date": 1750415345408
        },
        {
          "id": "555297819",
          "review_id": 555297779,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ndfh799tg22fhqxzbzns.jpg",
          "headline": "Such a great tool!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "drybar tool",
          "nickname": "Kristina",
          "created_date": 1750265538564
        },
        {
          "id": "555297818",
          "review_id": 555297779,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/uui3xqo18zba5x9ezr9l.jpg",
          "headline": "Such a great tool!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "drybar bag",
          "nickname": "Kristina",
          "created_date": 1750265538564
        },
        {
          "id": "555204558",
          "review_id": 555204557,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/iq9h0el2vnla8gljxcmv.jpg",
          "headline": "Love the versatility!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Alesha",
          "created_date": 1750082921050
        },
        {
          "id": "555196534",
          "review_id": 555196521,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/z141iouccwvgszl4h8hg.jpg",
          "headline": "Must try",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Marta",
          "created_date": 1750070701583
        },
        {
          "id": "555189629",
          "review_id": 555189628,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/pcctsmqjxcsbz5ckeiqn.jpg",
          "headline": "Only set you need!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Nash",
          "created_date": 1750051398733
        },
        {
          "id": "555075973",
          "review_id": 555075911,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/t4ohqja2mjr4n8zuhd8t.jpg",
          "headline": "Amazing styler",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Nimsa",
          "created_date": 1749778112193
        },
        {
          "id": "554959310",
          "review_id": 554959293,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ukkcxx617mpg87cjtsba.jpg",
          "headline": "Pretty revolutionary",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Joe",
          "created_date": 1749707246745
        },
        {
          "id": "554959314",
          "review_id": 554959293,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/bjpk530lmjsbzvlo8mht.jpg",
          "headline": "Pretty revolutionary",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Joe",
          "created_date": 1749707246745
        },
        {
          "id": "554959302",
          "review_id": 554959293,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/n79erclqnqfzarr8ufit.jpg",
          "headline": "Pretty revolutionary",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Joe",
          "created_date": 1749707246745
        },
        {
          "id": "554880485",
          "review_id": 554880475,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/heqwthdux3gbrmegfybb.jpg",
          "headline": "8 in 1 MAGIC!!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "ARice",
          "created_date": 1749599317794
        },
        {
          "id": "554878215",
          "review_id": 554878110,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ineqzwvc6p7yug87vzg7.jpg",
          "headline": "Loved it!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Munira",
          "created_date": 1749594242100
        },
        {
          "id": "554871792",
          "review_id": 554871791,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/tsy1ax7fmir7rledbqor.jpg",
          "headline": "Get this asap!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Jackie",
          "created_date": 1749586433916
        },
        {
          "id": "554851495",
          "review_id": 554851494,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/k9gqnw75oqe1ys9ndax1.jpg",
          "headline": "Amazing",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "So many goodies",
          "nickname": "Jessica",
          "created_date": 1749571076289
        },
        {
          "id": "554813834",
          "review_id": 554813772,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/av8yj8oz17w1fudbnmfw.jpg",
          "headline": "Dry bar",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Marium",
          "created_date": 1749505716713
        },
        {
          "id": "554809701",
          "review_id": 554809700,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/dxqsfxgxqvtdmu1bt2mf.jpg",
          "headline": "So many options in one styler!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Julia",
          "created_date": 1749503765253
        },
        {
          "id": "554809693",
          "review_id": 554809700,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ecoa478nba8fash36naj.jpg",
          "headline": "So many options in one styler!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Julia",
          "created_date": 1749503765253
        },
        {
          "id": "554787365",
          "review_id": 554787353,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/jguvu7bl83wp2id3ohls.jpg",
          "headline": "Last Longer",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Heath",
          "created_date": 1749479382095
        }
      ],
      "faceoff_positive": {
        "comments": "I've been using the Drybar All-Inclusive Styler for a few weeks now, and I honestly didn't expect to love it as much as I do. My hair is thick and can be a bit high-maintenance, but this tool actually makes styling feel easy and way less time-consuming. I usually start by rough drying my hair with the dual-sided concentrator until it's about 70% dry. That alone saves time compared to my usual blow dryer, and it gets my hair smooth and ready for styling. Depending on the look I'm going for, I'll switch attachments which is super easy once you get the hang of it. For everyday volume and bounce, the round brush is my go-to. It lifts my roots and gives me that polished, salon-style blowout at home. When I want sleek, straight hair, I use the flat iron attachment on dry hair with just the heat mode (no airflow). It glides through smoothly and doesn't fry my ends like some other tools I've tried. On days I feel like switching it up, the curling iron attachment makes soft, pretty waves that last all day without needing extra hairspray. I really appreciate the \"Pause\" button, too it makes sectioning my hair way easier without the airflow blasting in my face. Overall, this styler feels like a full salon in one tool, and I actually look forward to doing my hair now. Gifted by drybar",
        "headline": "Love love",
        "rating": 5,
        "ugc_id": 555208824
      },
      "faceoff_negative": {
        "comments": "Gifted by Drybar. The Drybar Multi-styler is a great all-in-one concept but there are improvements that can be made. I like the versatility of the hair styler. It has multiple attachments that are easily interchangeable. Switching between attachments is effortless and intuitive. My favorite is the dryer brush. This saves me a lot of time in the morning because I can dry my hair and style it at the same time. It's also very easy to use. I am not adept at holding a blow dryer and a brush at the same time, so this is a perfect solution. The round brush, which gives my hair volume, also blow dries my hair at the same time. The brush grips my hair nicely without tangling. The result is amazing! My hair comes out sleek and voluminous without frizz. The dryer attachment is my next favorite. While it doesn't style my hair while blow drying, it dries my hair very quickly. I use this when I wash my hair at night and need to dry it quickly before bed. The straightener attachment is clunky and hard to use. It takes a lot of strength to push on the handle to open the straightener. It's also very clunky to use. It's large and archaic looking. Similarly, the curling iron attachment is very heavy, clunky and archaic looking. I do appreciate the knob at the top to hold so it is easier to curl. However, I prefer something sleeker and easier to hold. This requires big and strong hands. The entire multi-styler is very heavy. While I like the dryer brush and the dryer, both of which seem to be lighter than the other attachments, they are still very heavy. My arms got a workout while using this! I think this could be a great tool but it needs some work.",
        "headline": "Great concept but could be improved",
        "rating": 3,
        "ugc_id": 555199851
      },
      "name": "All-Inclusive 8-in-1 Air & Active Heat Multi-Styler",
      "native_review_count": 82,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 0,
      "locale": "en_US"
    }
  }
}