{
  "product_id": "pimprod2036289",
  "product_url": "https://www.ulta.com/p/pro-collagen-vitality-eye-cream-pimprod2036289",
  "extracted_at": "2025-09-23T04:55:31.656150+00:00",
  "product_name": "ELEMISPro-Collagen Vitality Eye Cream",
  "brand": "ELEMIS",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Cream"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "eye-cream"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "115.00",
  "availability": "in_stock",
  "rating_avg": "4.7",
  "rating_count": "101",
  "images": [
    "https://media.ulta.com/i/ulta/2605531?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2605531?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2605531_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2605531_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2605531_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2605531_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2605531_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2605531_alt06?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsVeganSustainable PackagingGive BackElemis' Pro-Collagen Vitality Eye Cream is a lifting, brightening and firming eye cream, clinically tested, that combats the visible signs of ageing for a more wide-awake look.",
  "details": "DetailsBenefitsFirmsReplenishesSmoothesResearch ResultsClinically proven to reduce the appearance of fine lines, expression lines and crow's feet around the eye area*Clinically proven to improve the feeling of skin firmness & elasticity around the eye area*Clinically proven to reduce the appearance of dark circles around the eye area*Clinically proven to help lift the appearance of the eyelid*100% agreed after using this product, the eye area around their eyes appeared less fatigued*100% agreed after using this cream, the skin around their eyes felt nourished with moisture*Item 2605531How To UseUse morning and evening after cleansing. Apply a thin layer to the eye contour area. It also layers beautifully under makeup.Precautions: If contact with eyes occurs, rinse thoroughly.IngredientsAqua/Water/Eau, Laminaria Digitata Extract, Coco-Caprylate, Chondrus Crispus (Carrageenan) Extract, Gigartina Stellata Extract, Propanediol, Isononyl Isononanoate, Glycerin, Butyrospermum Parkii (Shea) Butter, Oryza Sativa (Rice) Starch, Carbomer, Phenoxyethanol, Camellia Oleifera Seed Oil, Hydroxyacetophenone, Panthenol, Sodium Polyacrylate, Sodium Hydroxide, Sodium Benzoate, Disodium EDTA, Padina Pavonica Thallus Extract, Sambucus Nigra Flower Extract, Potassium Sorbate, Rhizobian Gum, Sodium Hyaluronate, Crataegus Monogyna Flower Extract, Fragrance (Parfum), Jasminum Sambac (Jasmine) Flower Extract, Lactic Acid, Chlorphenesin, Artemisia Capillaris Flower Extract, Chlorella Vulgaris Extract, Collagen Amino Acids, Citric Acid,Tocopherol, Leuconostoc/Radish Root Ferment Filtrate.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Use morning and evening after cleansing. Apply a thin layer to the eye contour area. It also layers beautifully under makeup.Precautions: If contact with eyes occurs, rinse thoroughly.",
  "ingredients": [
    "Aqua/Water/Eau",
    "Laminaria Digitata Extract",
    "Coco-Caprylate",
    "Chondrus Crispus (Carrageenan) Extract",
    "Gigartina Stellata Extract",
    "Propanediol",
    "Isononyl Isononanoate",
    "Glycerin",
    "Butyrospermum Parkii (Shea) Butter",
    "Oryza Sativa (Rice) Starch",
    "Carbomer",
    "Phenoxyethanol",
    "Camellia Oleifera Seed Oil",
    "Hydroxyacetophenone",
    "Panthenol",
    "Sodium Polyacrylate",
    "Sodium Hydroxide",
    "Sodium Benzoate",
    "Disodium EDTA",
    "Padina Pavonica Thallus Extract",
    "Sambucus Nigra Flower Extract",
    "Potassium Sorbate",
    "Rhizobian Gum",
    "Sodium Hyaluronate",
    "Crataegus Monogyna Flower Extract",
    "Fragrance (Parfum)",
    "Jasminum Sambac (Jasmine) Flower Extract",
    "Lactic Acid",
    "Chlorphenesin",
    "Artemisia Capillaris Flower Extract",
    "Chlorella Vulgaris Extract",
    "Collagen Amino Acids",
    "Citric Acid",
    "Tocopherol",
    "Leuconostoc/Radish Root Ferment Filtrate"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "moisturizer",
      "mask",
      "treatment",
      "eye cream"
    ],
    "skin_type": [
      "mature"
    ],
    "finish": [
      "sheer",
      "creamy",
      "cream",
      "oil"
    ],
    "ingredients": [
      "lactic-acid",
      "collagen",
      "fragrance"
    ],
    "brand": [
      "mid-range",
      "premium"
    ],
    "special_features": [
      "vegan",
      "anti-aging",
      "brightening",
      "purifying"
    ]
  },
  "reviews": {
    "product_id": "pimprod2036289",
    "total_reviews": 101,
    "reviews": [
      {
        "review_id": 561232315,
        "rating": 1,
        "headline": "Smell like stinky feet or bad cheese.",
        "comments": "Can't get passed the bad cheese smell. \nThe color of the cream looks nothing like the picture on the web site. Product looks old and chemicals separating in the jar. I love other Elemis products like the face oils and clean balm and face pads. This eye cream is a big NO.",
        "nickname": "Joan",
        "location": "Moncks Corner",
        "created_date": 1756340618750,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558420284,
        "rating": 5,
        "headline": "Awake & firmer",
        "comments": "I'm absolutely obsessed with this eye cream! The texture is silky and absorbs quickly without feeling greasy or heavy i love to apply before i put my concealer on! It layers beautifully, gifted by elemis",
        "nickname": "Mary819",
        "location": "NC",
        "created_date": 1753724648092,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558167210,
        "rating": 4,
        "headline": "Good for under makeup",
        "comments": "This is good if you need a thicker moisturizer for under your eyes. I think it's good for makeup prep because of this. You don't have to use a lot either! Gifted by Elemis. I think overall I really like this",
        "nickname": "Andrea",
        "location": "Los Ángeles",
        "created_date": 1753422102501,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558164548,
        "rating": 5,
        "headline": "The texture is rich and lightweight",
        "comments": "This Eye Cream is a luxurious treat for my tired eyes. The texture is rich yet lightweight, absorbing quickly without any residue. After just a few uses, my under-eye area looks more hydrated, smooth, and refreshed. It offers a subtle brightening effect, especially in the mornings. A little goes a long way—I haven't seen any difference in fine lines yet, but I plan to keep using it for more noticeable results. Gifted by Elemis",
        "nickname": "Minu",
        "location": "FL",
        "created_date": 1753416286102,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558159934,
        "rating": 5,
        "headline": "Perfect for me",
        "comments": "I've been using Eye Cream Complimentary from elemis for a little while now, and I really like it. The texture is a bit jelly-like, very lightweight, and absorbs quickly without feeling greasy. It has a light, pleasant scent that doesn't linger. I have combination skin, and this worked really well under my eyes — it feels refreshing and hydrating. I've noticed my under-eye area looks a bit smoother and more awake after using it consistently.",
        "nickname": "Olha",
        "location": "Plainfield, IL",
        "created_date": 1753407697343,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558124568,
        "rating": 5,
        "headline": "Beautiful eye cream",
        "comments": "As usual my favorite Elemis marine pro collagen line! I love this eye cream! It goes well with the night cream! I use after washing, serum and then with my night cream. Its a must product for anti-aging and I feel my under eye looks more hydrated and less puffy next morning. Definitely recommend gifted by elemis",
        "nickname": "Sayd",
        "location": "Melville, NY",
        "created_date": 1753374541697,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558108047,
        "rating": 5,
        "headline": "So much moisture!",
        "comments": "This product was Gifted by elemis to me in exchange for my honest review. This eye cream is the thickest I have used so I was unsure what to expect. It does take a while to absorb into the skin under your eyes but once it does my eyes looked less tired and more glowy! It made me feel more comfortable without wearing makeup some days. Although this also worked well when I layered my concealer ontop of it. It made my eyes feel moisturized as well! I've used it for a little over a week and a half and I can't wait to see what other results I get as time goes on!",
        "nickname": "Kaitlyn",
        "location": "Bakersfield, CA",
        "created_date": 1753349971590,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558067898,
        "rating": 5,
        "headline": "Healthy under eyes",
        "comments": "This is a pretty hydrating eye cream. I've liked how after a couple of uses, the skin underneath my eye seems healthier and softer. This was gifted by Elemis but thoughts are my own. I love how this made a great difference after several uses.",
        "nickname": "Tara",
        "location": "USA",
        "created_date": 1753280449326,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558030296,
        "rating": 5,
        "headline": "Hydrating and refreshing",
        "comments": "I have dry skin that needs a lot of extra moisture, and I've been noticing fine lines pop up around my eye area more often. After using this for two weeks, I feel like I've noticed that the skin around my eyes looks and feels plumper and more hydrated. My eyelids look less puffy when I wake up and overall my skin feels nourished and moisturized. I love how lightweight the product is while still feeling rich, and that I don't feel like I have heavy product on when I rest. This was gifted by Elemis in exchange for my honest feedback.",
        "nickname": "Anna",
        "location": "Gig Harbor, WA",
        "created_date": 1753210985696,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558029262,
        "rating": 5,
        "headline": "Wonderful eye cream",
        "comments": "This under eye cream has a silky, lightweight texture that glides on effortlessly and layers beautifully under makeup. It also provides impressive nourishment and hydration, leaving the skin under my eyes plump, smooth and refreshed. I have no issues with this formula even though I have very sensitive eyes. Love how it makes my under-eye area look and feel. Gifted by Elemis.",
        "nickname": "Yana",
        "location": "CA",
        "created_date": 1753209148684,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557982938,
        "rating": 5,
        "headline": "Hydrating",
        "comments": "I received this wye cream complimentary from elemis. It's gentle and soft. It's hydrating and i like to use it under my make up. I wear it day and night and it fills some fine lines and helps me look more awake in the mornings. I give it a good rating",
        "nickname": "PA",
        "location": "Los Angeles",
        "created_date": 1753134498287,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557732837,
        "rating": 5,
        "headline": "I am obsessed with it",
        "comments": "I've been impressed with the Elemis Pro-Collagen Vitality Eye Cream! It's lightweight, absorbs quickly, and delivers visible results. My under-eye area feels smoother, firmer, and more hydrated. With consistent use, I've noticed a reduction in puffiness, fine lines, and dark circles. The formula is powered by algae and floral extracts, and it layers beautifully under makeup. It's a luxury pick, but the results speak for themselves. Perfect for anyone looking to brighten, firm, and refresh tired eyes! .\n\nMy skin type is combo.\n#gifted by Elemis, thank you so much.",
        "nickname": "Shaymaa",
        "location": "SC",
        "created_date": 1752948289630,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557694899,
        "rating": 5,
        "headline": "Lovd",
        "comments": "I've been using the Elemis Pro-Collagen Vitality Eye Cream for a few weeks now, and I've already started noticing a difference. The texture is silky and lightweight, it feels rich enough to hydrate but still absorbs quickly without any greasiness. There's a very light, clean scent that doesn't irritate my eyes at all. My skin is on the normal to dry side, and this has been perfect for keeping the under-eye area feeling smooth and moisturized throughout the day. Since using it, my eyes look less tired, fine lines appear softer, and the whole area just looks more refreshed and awake. It's become a staple in both my morning and evening routines. Gifted by Elemis.",
        "nickname": "Itsrmee",
        "location": "Los Angeles",
        "created_date": 1752942432745,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557603787,
        "rating": 5,
        "headline": "Fabulous eye cream",
        "comments": "Silky, light and creamy this went on fabulous and felt cool. Very hydrating for me especially under my eyes where I need it the most. Helped with my eye bags and sun damage around the corners. Great for the eye lids as well, truly an eye care game changer. Gifted by elemis",
        "nickname": "StacyW",
        "location": "Florida",
        "created_date": 1752928914500,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557503125,
        "rating": 5,
        "headline": "elemis eye balm",
        "comments": "This eye cream from Elemis is a total game changer! From the very first use, I noticed how refreshing and hydrating it felt under my eyes. The texture is silky and lightweight, yet deeply nourishing—perfect for both morning and night. It absorbs beautifully without leaving any residue or pilling under makeup. After a few weeks of consistent use, I've seen a visible improvement in puffiness, fine lines, and dark circles. My under-eye area looks smoother, brighter, and more awake. It's gentle enough for my sensitive skin and gives me that well-rested look even when I'm running on caffeine and chaos. Highly recommend for anyone wanting a luxurious and effective eye cream that actually delivers!  complimentary from elemis",
        "nickname": "elemis eye balm",
        "location": "Chicago",
        "created_date": 1752869873410,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557490405,
        "rating": 5,
        "headline": "Would buy",
        "comments": "Gifted by elemis. This is a fantastic ice cream. It's not too thick. It's not too thin. It absorbs into the skin pretty quickly, as well as pretty hydrated when using it I noticed that there was very minimal creasing with my concealer.",
        "nickname": "Aisy",
        "location": "Whittier, Ca",
        "created_date": 1752858408594,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557481539,
        "rating": 4,
        "headline": "Soothing and effective for fine lines",
        "comments": "Elemis gifted me this product. This concentrated blend of botanical and natural essences is just what my eyes need. My skin is dry, and I struggle with puffiness and dark circles as well as fine lines. Just a touch of this incredibly rich yet lightweight cream tapped around my eye contour area sinks right in, acting as a great primer for smooth make up application. My eyes feel instantly soothed and firmed. My fine lines are much less visible and my eyes look brighter and younger. Over a week of twice daily use, I see improvements in my dark circles. However, this cream has yet to help much with my puffiness. Even so, this is a great everyday eye treatment.",
        "nickname": "Melissa",
        "location": "Baltimore, MD",
        "created_date": 1752842844710,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557464038,
        "rating": 5,
        "headline": "hydrating",
        "comments": "This is the first eye cream that I've used that wasn't sticky or tacky underneath my makeup. Having mature, dry skin, having my thin skin under my eyes moisturized is very important to me. I really like this thin yet hydrating consistency! Can't wait to see long term results! Complimentary from elemis",
        "nickname": "Ltinfluencer_reviews",
        "location": "texas",
        "created_date": 1752803634293,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557446248,
        "rating": 4,
        "headline": "Very nice",
        "comments": "I've been using this eye cream for some time and I can definitely see a difference in how refreshed and hydrated my under-eye area looks. The texture is rich but absorbs nicely, and it works well under makeup. I'm docking one star only because of the high price point—it's effective, but I wish it lasted a bit longer for the cost. Gifted by Elemis",
        "nickname": "Olga",
        "location": "New York",
        "created_date": 1752775594119,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557443804,
        "rating": 5,
        "headline": "Instantly Depuffs and Hydrates",
        "comments": "This eye cream is everything I've always wanted for my under eyes. I apply it to my puffy under eyes in the morning and it quickly works to depuff and hydrate the area. I have been using it for about a week now and notice my under eyes although still dark, are bright and I look much more awake when applying this consistently. Gifted by elemis",
        "nickname": "Ashley",
        "location": "Phoenix, AZ",
        "created_date": 1752773050363,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 101,
      "pages_total": 6,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2036289/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        1,
        1,
        2,
        15,
        82
      ],
      "review_histogram": [
        1,
        1,
        2,
        15,
        82
      ],
      "rating_count": 101,
      "review_count": 101,
      "average_rating": 4.74,
      "recommended_ratio": 0.99,
      "media": [
        {
          "id": "561232263",
          "review_id": 561232315,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/y6jbbtyt021xkn0ka1st.jpg",
          "headline": "Smell like stinky feet or bad cheese.",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Smells like bad cheese.",
          "nickname": "Joan",
          "created_date": 1756340618750
        },
        {
          "id": "558164564",
          "review_id": 558164548,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/da2onim4dtqmq8rzjfii.jpg",
          "headline": "The texture is rich and lightweight",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Minu",
          "created_date": 1753416286102
        },
        {
          "id": "557732839",
          "review_id": 557732837,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ipgmm3urwdiffxaain48.jpg",
          "headline": "I am obsessed with it",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "ELemis Eye cream texture",
          "nickname": "Shaymaa",
          "created_date": 1752948289630
        },
        {
          "id": "557732838",
          "review_id": 557732837,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/dllsh1mzi0vyanhbpivc.jpg",
          "headline": "I am obsessed with it",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Elemis Eye cream",
          "nickname": "Shaymaa",
          "created_date": 1752948289630
        },
        {
          "id": "557481546",
          "review_id": 557481539,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/jsn9srzxpsq0bsrhswpb.jpg",
          "headline": "Soothing and effective for fine lines",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Melissa",
          "created_date": 1752842844710
        },
        {
          "id": "557431016",
          "review_id": 557430892,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/mlyep1apodqrjfxtbptl.jpg",
          "headline": "This eye cream is a miracle worker!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Rye",
          "nickname": "Hoa",
          "created_date": 1752750664043
        },
        {
          "id": "557409341",
          "review_id": 557409349,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/zzdxygf2gzifrgmsstwi.jpg",
          "headline": "Love it",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Amazing",
          "nickname": "Thao",
          "created_date": 1752730747936
        },
        {
          "id": "557409340",
          "review_id": 557409349,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/v9wrfmyv96vpcv4wyyxu.jpg",
          "headline": "Love it",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Perfect",
          "nickname": "Thao",
          "created_date": 1752730747936
        },
        {
          "id": "557409339",
          "review_id": 557409349,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ifw5scuie7lstoquvakw.jpg",
          "headline": "Love it",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Love it",
          "nickname": "Thao",
          "created_date": 1752730747936
        },
        {
          "id": "557209992",
          "review_id": 557209991,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/nhqjkfphn2xtttuukdp1.jpg",
          "headline": "Amazing eye cream",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Jessica",
          "created_date": 1752543270209
        },
        {
          "id": "557075585",
          "review_id": 557075389,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/xnvra5difteakm9lvg5f.jpg",
          "headline": "Smooth and hydrated",
          "rating": 3,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "My",
          "created_date": 1752451391348
        },
        {
          "id": "557027674",
          "review_id": 557027670,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/jtyvx4hd87pomfiycx0e.jpg",
          "headline": "Hydrating and helps with appearance of wrinkles!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Ekaterina",
          "created_date": 1752369362129
        },
        {
          "id": "557027671",
          "review_id": 557027670,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ndcknbfvyfo7itrfk9to.jpg",
          "headline": "Hydrating and helps with appearance of wrinkles!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Ekaterina",
          "created_date": 1752369362129
        },
        {
          "id": "557011153",
          "review_id": 557011156,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ps3mdivfvknrf5dl0ikz.jpg",
          "headline": "Hydrating and nourishing!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Julia",
          "created_date": 1752329591447
        },
        {
          "id": "557011142",
          "review_id": 557011156,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/p46bod9hjtcxnuvzuuhf.jpg",
          "headline": "Hydrating and nourishing!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Julia",
          "created_date": 1752329591447
        },
        {
          "id": "556964254",
          "review_id": 556964244,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/lhksbgya73j8zdxehnkn.jpg",
          "headline": "Really good!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "C",
          "created_date": 1752265435048
        },
        {
          "id": "556887399",
          "review_id": 556887415,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/sxgpgcy6ktujnyiuhy0f.jpg",
          "headline": "Must have for under eyes",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Megan",
          "created_date": 1752124676037
        },
        {
          "id": "556887387",
          "review_id": 556887415,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/zck8jcte5cmcx6km9d2s.jpg",
          "headline": "Must have for under eyes",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Megan",
          "created_date": 1752124676037
        },
        {
          "id": "556887416",
          "review_id": 556887415,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/atf9dye6nflns6sf2xbr.jpg",
          "headline": "Must have for under eyes",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Megan",
          "created_date": 1752124676037
        },
        {
          "id": "556886423",
          "review_id": 556886411,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ntek5tmvjcfnxdv72h0p.jpg",
          "headline": "The texture is super light",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Pro collagen vitality eye cream",
          "nickname": "Aysha",
          "created_date": 1752119803409
        },
        {
          "id": "556878900",
          "review_id": 556878886,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/chvhitajs8ypk9jn2jkn.jpg",
          "headline": "New favorite",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Elemis eye cream",
          "nickname": "Glory",
          "created_date": 1752098000481
        },
        {
          "id": "556878880",
          "review_id": 556878886,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/cgj2mnbyaldkfj5szdm9.jpg",
          "headline": "New favorite",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Elemis eye cream",
          "nickname": "Glory",
          "created_date": 1752098000481
        },
        {
          "id": "556869810",
          "review_id": 556869836,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/tddikrtv6dij5yxhke1x.jpg",
          "headline": "Solid product",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Meg",
          "created_date": 1752085821455
        },
        {
          "id": "556831073",
          "review_id": 556831072,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/djnnotty6uqdbey5ibrs.jpg",
          "headline": "Perfect solution for tired eyes",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Anna",
          "created_date": 1752004202989
        },
        {
          "id": "556783819",
          "review_id": 556783829,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/prjl2auq5ve9msdbjb1q.jpg",
          "headline": "Great cream",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Tatiana",
          "created_date": 1751923196023
        },
        {
          "id": "556774899",
          "review_id": 556774883,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/uvcx2v9ydwn51orba4po.jpg",
          "headline": "Feels so good!",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Cinthia",
          "created_date": 1751909932913
        }
      ],
      "faceoff_positive": {
        "comments": "I did receive this complimentary from Elemis, but I regularly purchase Elemis products and will definitely purchase this once I've finished this one. As someone with dry skin and hollow under eyes, this eye cream has become my holy grail for giving that area the extra love it needs, especially before makeup application. The lightweight formula absorbs quickly without any greasiness, which is perfect when I'm prepping for a full glam look. It really helps plump up my hollow under-eye area and creates such a smooth base for concealer. The hydration genuinely lasts all day, even under makeup. I also use it on my eyelids, and it definitely gives a more awake, lifted appearance. The texture feels luxurious but not heavy, and it layers beautifully under my makeup routine. For someone who needs serious eye area hydration, this delivers without causing irritation or those annoying little bumps some rich eye creams can cause. \n\nYes, it's an investment, but the results and how well it works under makeup make it worth every penny, plus a little goes a long way so this will last me for a while! As I get older, I gravitate towards products where I see results and that my skin loves. My undereye area feels genuinely nourished and looks smoother with consistent use.",
        "headline": "An investment but worth it!",
        "rating": 5,
        "ugc_id": 557441793
      },
      "faceoff_negative": {
        "comments": "Been using Elemis eye cream and I have mix feelings . The cream has a heavy creamy texture but it absorbed fast and easy. I didn't feel it had fragrance so it's good to use with other products in the morning. So far I feel my eye areas get smoother and stay hydrated, but haven't noticed much about fine lines getting better . Gifted by elemis",
        "headline": "Smooth and hydrated",
        "rating": 3,
        "ugc_id": 557075389
      },
      "name": "Pro-Collagen Vitality Eye Cream",
      "native_review_count": 101,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 0,
      "locale": "en_US"
    }
  }
}