{
  "product_id": "pimprod2045656",
  "product_url": "https://www.ulta.com/p/pout-clout-lip-plumping-pen-pimprod2045656",
  "extracted_at": "2025-09-23T04:52:39.183255+00:00",
  "product_name": "e.l.f. CosmeticsPout Clout Lip Plumping Pen",
  "brand": "e.l.f. Cosmetics",
  "categories": [
    "Home",
    "Makeup",
    "Lips",
    "Lip Plumpers"
  ],
  "category_keys": [
    "home",
    "makeup",
    "lips",
    "lip-plumpers"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "9.00",
  "availability": "in_stock",
  "rating_avg": "4.5",
  "rating_count": "5924",
  "images": [
    "https://media.ulta.com/i/ulta/2622915?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2622915?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2622915_sm?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2622915_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2622844cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2622844cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2622844cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2622844cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2622844cm_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2622844cm_vid01/thumbs/71c10746-fdbf-427b-8b49-16f2f51d048e?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsCruelty FreeVegane.l.f.'s Pout Clout Lip Plumping Pen is an all-in-1 lip plumper, gloss, and balm that drenches lips in a sheer wash of color while plumping the look of lips with an invigorating tingle. The click-up design makes it easy to apply, so you can pucker up to glass-like sheen and plumper-looking lips.",
  "details": "DetailsBenefitsTinted 3-in-1 lip plumper, gloss & balm with a cooling tingleInfused with lip-loving ingredients to help visibly plump & moisturize lipsDrenches lips in sheer color & glossy shineNon-retractable click pen design for easy & precise applicationNon-sticky formula with smooth-glide application100% vegan & cruelty-free, e.l.f. is Leaping Bunny Certifiede.l.f. is proud to partner with Fair Trade USA & manufacture products in Fair Trade Certified facilities; look for the Fair Trade Certified seal on your e.l.f. productKey Ingredients1% Maracuja oil to help nourish lipsBlueberry, watermelon & pomegranate fruit extractsFormulated WithoutPhthalatesParabensNonylphenol ethoxylatesTriclosanTriclocarbanHydroquinoneItem 2622915How To UseClick the non-retractable pen as many times as needed to reveal the perfect amount of product (it may take several clicks to get started).Swipe on to plump and nourish lips. Layer to build a hint of sheer color.IngredientsBust A Mauve: Bis-Behenyl/Isostearyl/Phytosteryl Dimer Dilinoleyl Dimer Dilinoleate, Diisostearyl Malate, Hydrogenated Polyisobutene, Bis-Diglyceryl Polyacyladipate-2, Synthetic Wax, Polyglyceryl-2 Triisostearate, Menthone Glycerin Acetal, Silica Dimethyl Silylate, Passiflora Edulis Seed Oil, Microcrystalline Wax (Cera Microcristallina), Punica Granatum Fruit Extract, Citrullus Lanatus (Watermelon) Fruit Extract, Vaccinium Angustifolium (Blueberry) Fruit Extract, Sodium Hyaluronate, Ricinus Communis (Castor) Seed Oil, Fragrance (Parfum), Tocopherol, Hydrogenated Castor Oil, Helianthus Annuus (Sunflower) Seed Oil, Water (Aqua), Butylene Glycol, Ethylhexylglycerin, Phenoxyethanol. May Contain: Titanium Dioxide (CI 77891), Iron Oxides (CI 77491, CI 77492, CI 77499), Red 28 Lake (CI 45410), Yellow 5 Lake (CI 19140), Blue 1 Lake (CI 42090).Ingredients may change or vary from time to time. Please refer to the packaging of the product you receive for the list of ingredients in your particular product.",
  "how_to_use": "Click the non-retractable pen as many times as needed to reveal the perfect amount of product (it may take several clicks to get started).Swipe on to plump and nourish lips. Layer to build a hint of sheer color.",
  "ingredients": [
    "Bust A Mauve: Bis-Behenyl/Isostearyl/Phytosteryl Dimer Dilinoleyl Dimer Dilinoleate",
    "Diisostearyl Malate",
    "Hydrogenated Polyisobutene",
    "Bis-Diglyceryl Polyacyladipate-2",
    "Synthetic Wax",
    "Polyglyceryl-2 Triisostearate",
    "Menthone Glycerin Acetal",
    "Silica Dimethyl Silylate",
    "Passiflora Edulis Seed Oil",
    "Microcrystalline Wax (Cera Microcristallina)",
    "Punica Granatum Fruit Extract",
    "Citrullus Lanatus (Watermelon) Fruit Extract",
    "Vaccinium Angustifolium (Blueberry) Fruit Extract",
    "Sodium Hyaluronate",
    "Ricinus Communis (Castor) Seed Oil",
    "Fragrance (Parfum)",
    "Tocopherol",
    "Hydrogenated Castor Oil",
    "Helianthus Annuus (Sunflower) Seed Oil",
    "Water (Aqua)",
    "Butylene Glycol",
    "Ethylhexylglycerin",
    "Phenoxyethanol. May Contain: Titanium Dioxide (",
    "Iron Oxides (",
    "Red 28 Lake (",
    "Yellow 5 Lake (",
    "Blue 1 Lake ("
  ],
  "extended_contents": {
    "images": [
      "https://content.syndigo.com/asset/bb86c9e6-9faf-4901-8abd-a41a0f48d0ad/480.webp"
    ]
  },
  "tags": {
    "category": [
      "makeup",
      "lips",
      "lip",
      "cosmetics"
    ],
    "finish": [
      "glossy",
      "sheer",
      "creamy",
      "oil"
    ],
    "color": [
      "purple"
    ],
    "ingredients": [
      "synthetic",
      "fragrance"
    ],
    "brand": [
      "mid-range",
      "budget"
    ],
    "special_features": [
      "cruelty-free",
      "vegan"
    ],
    "product_type": [],
    "skin_type": []
  },
  "reviews": {
    "product_id": "pimprod2045656",
    "total_reviews": 5924,
    "reviews": [
      {
        "review_id": 561163339,
        "rating": 4,
        "headline": "so good",
        "comments": "I didn't tingle too much, it was long lasting, and I didn't feel like it went away when I drank water and stuff. My lips felt plump and glossy. The tingle just felt more cool. It just ran out kinda fast I felt like.",
        "nickname": "Isabelle",
        "location": "Medford",
        "created_date": 1756253426823,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560245925,
        "rating": 3,
        "headline": "A beautiful formula, but needs new shades!",
        "comments": "From a formula standpoint, I thought these were excellent. I usually don't care for clicky lip pens like these, but these were super glossy and easy to apply, and had some good pigment as well. They weren't really plumping to be honest, but I did not mind that as I hate super tingly burning lip plumpers. The main issue I had with these is the shades. I got the shade Pinky Out and it was not pink at all on my lips, instead more of a beige. I wish I could find one that I would wear but none of the shades are appealing to me. I would love it if elf released a shade like Rose Envy in the lip oils in this formula. If you find a shade that works for you, I say go for it because the formula is great but the shades just didn't work for me unfortunately.",
        "nickname": "Lavender19",
        "location": "Charlotte, NC",
        "created_date": 1755272241756,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559963124,
        "rating": 5,
        "headline": "Wears like the $28 version",
        "comments": "If I were to give it one critique, I would say the formula is a little sticky and I'm not so sure of it's nourishing benefits. But if you're looking for a cost effective, highly pigmented gloss, then stop shopping and buy this.",
        "nickname": "Kaitlyn",
        "location": "Spokane, WA",
        "created_date": 1754955259695,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559377427,
        "rating": 2,
        "headline": "Not for Me",
        "comments": "Got this as a recommendation from a skincare/makeup influencer I like. I bought it in Toasted, but it made me look washed out. It goes on smooth and has nice color coverage, but it settled in my lines (exactly what I didn't want it to do).",
        "nickname": "Maggie",
        "location": "California",
        "created_date": 1754434760423,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558948229,
        "rating": 4,
        "headline": "FYI, Wicked Cherry is more brown IMO",
        "comments": "I really like the Pout Clout in general. It's comparable to Tarte's Lip Plump. This is the 2nd Pout Clout I've bought. I like the minty tingle, versus burning tingle from other plumping lip balms/sticks. My only issue this time is I don't love the color. Wicked Cherry is more brown looking. When I think of cherry, I think red. In this case I thought it would be a deeper red. However, I'm not returning it because it still feels good on my lips. I'll just wear it at home.",
        "nickname": "ptulip",
        "location": "Georgia",
        "created_date": 1754001209489,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558818506,
        "rating": 5,
        "headline": "I would buy this again",
        "comments": "Truly moisturizing product",
        "nickname": "Frederick",
        "location": "Thousand Palms",
        "created_date": 1753976270110,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558342972,
        "rating": 1,
        "headline": "☹️",
        "comments": "Mine won't push the lipstick up when I press button ☹️",
        "nickname": "Georgia",
        "location": "Maryland",
        "created_date": 1753543174683,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558138847,
        "rating": 5,
        "headline": "Great Product",
        "comments": "I just bought the clear pen and I love it already!",
        "nickname": "Nisha",
        "location": "Auburn,AL",
        "created_date": 1753386190454,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558023701,
        "rating": 5,
        "headline": "Hourglass phantom glossy balm dupe!",
        "comments": "This is an affordable version of the hourglass phantom glossy balm. It glides so smooth, melts in your lips, and have a slight minty feeling which is perfect for summer. I also love the color it gives on my lips. They leave a slight stain after you drink/eat. Will definitely recommend! Got the shade bust a mauve (mlbb shade)",
        "nickname": "Ryle",
        "location": "Reno, NV",
        "created_date": 1753207023446,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556973162,
        "rating": 5,
        "headline": "Surprisingly pigmented!",
        "comments": "Purchased in shade \"Wicked Cherry\" and suprised how pigmented it goes on! It's a perfect warm toned red. I had bought a similar kbeauty plumping lip tint for $15 and this is honestly a great contender. Plumping sensation that doesn't feel like burning but this still is on the \"spicy\" end of the minty cooling sensation in my opinion. No strong flavor or scent. Not sticky, impressive in its defintiely \"glassy\" texture while being very moisturizing and the darker shade even left behind a faint tint. Can't wait to pair this with a brown lip pencil! Be warned that this lip pen like other clicking ones won't push down once it's clicked up, but this is to be expected if you've tried similar products. 0.07 oz seems a little small although a little goes a long way and the color payoff is there, and again you can't beat that price.",
        "nickname": "Jay",
        "location": "Los Angeles, CA",
        "created_date": 1752285643263,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556840191,
        "rating": 4,
        "headline": "I liked it!",
        "comments": "I liked this product! I have wicked cherry and its very smooth and moisturizing but it doesn't plump your lips as well as i thought, it stings a tiny bit and doesn't really plump good. But i still like this product!",
        "nickname": "Allyson",
        "location": "Virginia",
        "created_date": 1752024163546,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556733333,
        "rating": 5,
        "headline": "Love this product!",
        "comments": "I'm obsessed with the shade Lower Cut in the Squirt Plumping Lip Gloss sticks by MAC but can't justify the pricetag for how often I need to repurchase it. I bought this Elf gloss pen in Wicked Cherry and it is close enough to the MAC product that I haven't missed the other lip gloss stick at all. Highly recommend this!",
        "nickname": "Haley",
        "location": "St. George, Utah",
        "created_date": 1751841974437,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556294962,
        "rating": 2,
        "headline": "Doesn't work",
        "comments": "Never plumped my lips did make them soft though",
        "nickname": "syd",
        "location": "Mcdonough Ga",
        "created_date": 1751439540592,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555948245,
        "rating": 5,
        "headline": "A MAGIC WAND FOR YOUR LIPS...",
        "comments": "Oh, the magic of E.L.F lip plumper! It's like a fairy godmother for your lips, transforming them from ordinary to extraordinary with just a few swipes. The moment you glide it on, you can feel the tingling sensation that promises plumper, fuller lips. It's like a little party happening right on your lips!\n\nThe packaging is sleek and chic, making it a stylish addition to any makeup bag. But the real magic lies within. The formula is lightweight, non-sticky, and it glides on like a dream. It's like your lips are getting a luxurious spa treatment every time you apply it.\n\nAnd let's talk about the results! Hello, fuller lips! It's like this lip plumper has a magic wand that it waves over your lips, making them look fuller and more luscious. It's not just a lip plumper, it's a confidence booster in a tube.\n\nBut the best part? It's from E.L.F, a brand that believes in affordable beauty. So not only do you get fabulous, fuller lips, but you also get to keep your wallet happy. It's a win-win!\n\nIn conclusion, the E.L.F lip plumper is a game-changer. It's a little tube of magic that transforms your lips and boosts your confidence. So if you're looking for a lip product that delivers results without breaking the bank, this is the one for you. Your lips (and your wallet) will thank you!",
        "nickname": "♡A♡",
        "location": "Maryland",
        "created_date": 1750990741591,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555787018,
        "rating": 1,
        "headline": "Sticky, no color",
        "comments": "I really love Elf products, I was definitely disappointed with this sticky lip gloss. Reminds me of in my tweens what I had.",
        "nickname": "Candice",
        "location": "Kansas",
        "created_date": 1750729308346,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 555288206,
        "rating": 3,
        "headline": "Nice!",
        "comments": "I received the more expensive, original Tarte version of this in an Ipsy bag last year. I wanted to love it but I didn't. When I saw the wild reviews on this, I thought, \"well, it's cheap enough that I can try it and if I love it I'll be pleasantly surprised but if not I can toss it and not feel a huge loss.\" I was so pleasantly surprised! The feeling is cooling and almost even soothing, especially when being in the sun. The color is nice; not sheer enough that you can't tell it's there yet still sheer enough to be versatile so it can be worn from a no makeup, makeup day time look to a full on night time glam. It leaves my lips so soft after I take it off even hours later that I rub my lips together at night sub consciously thinking, \"wow, I can't remember the last time they were this soft!\" It's not all positive though. I hate the tube! I press the button several times and it dodoesn't seem to advance. I apply it and no, it didn't advance. I also feel like if leave this in my purse and it's hot enough (it gets as hot as 100+ degrees here in the summer) it will melt super easily and make a mess in my purse. I do have to say that I've tried the original, much more expensive Tarte version of this and was not impressed. It was sticky, thick, left weird opaque and streaky color on my lips, and had the same problem with the tube as it didn't advance with the button either. I will never repurchase the Tarte version but can absolutely say I would more than likely buy the elf version in several more colors.",
        "nickname": "guillmel",
        "location": "Lafayette, La",
        "created_date": 1750250990408,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554518952,
        "rating": 3,
        "headline": "Wasn't my favorite",
        "comments": "These are okay lip pens but the clicking noise is so loud! I also wish there were more colors",
        "nickname": "Riley",
        "location": "Texarkana Texas",
        "created_date": 1749066102691,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 554260376,
        "rating": 3,
        "headline": "would probably not buy again",
        "comments": "Doesn't really plum your lips but if you don't care and just want like a lip gloss than go for it",
        "nickname": "Lina",
        "location": "Minnesota",
        "created_date": 1748566272057,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 553603542,
        "rating": 2,
        "headline": "No plumping",
        "comments": "I liked the color, stayed on my lips for hours, cooling feeling on lips, no plumping; which is why i bought it",
        "nickname": "Izzy",
        "location": "WA",
        "created_date": 1747705426925,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553527878,
        "rating": 4,
        "headline": "Great lip",
        "comments": "Honestly, when I bought this, I was expecting something different, but the only reason why I gave it a four star instead of five is because it is very soft. You only wanna do one click so the bomb barely shows above the plastic, or else too much will come off on your lips and itll be a waste of product. Otherwise great pigment and lasted a very long time.",
        "nickname": "Samantha",
        "location": "New Hampshire",
        "created_date": 1747617279422,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 84,
      "pages_total": 5,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2045656/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        74,
        131,
        533,
        1260,
        3926
      ],
      "review_histogram": [
        74,
        131,
        533,
        1260,
        3926
      ],
      "rating_count": 5924,
      "review_count": 5924,
      "average_rating": 4.49,
      "recommended_ratio": 0.72,
      "media": [
        {
          "id": "555787027",
          "review_id": 555787018,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/gedqggguaubfsttewc1a.jpg",
          "headline": "Sticky, no color",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Candice",
          "created_date": 1750729308346
        },
        {
          "id": "555787040",
          "review_id": 555787018,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/erwbarlqkkuzi0cwez8g.jpg",
          "headline": "Sticky, no color",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Candice",
          "created_date": 1750729308346
        },
        {
          "id": "538523144",
          "review_id": 538523138,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/e1l8j60uukhh6ezohojj.jpg",
          "headline": "Best lip product ever !!!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Lip",
          "nickname": "Elavilla23",
          "created_date": 1724090384000
        },
        {
          "id": "538523052",
          "review_id": 538523017,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/va70s8rvymgfoeblxpvh.jpg",
          "headline": "Just Peachy",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Just Peachy Pout",
          "nickname": "LeslieWass",
          "created_date": 1718377422000
        },
        {
          "id": "511759376",
          "review_id": 511759405,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ldxjroyogobgqfmtrvdu.jpg",
          "headline": "buttery smooth",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "pinky out",
          "nickname": "noe_",
          "created_date": 1712610631000
        },
        {
          "id": "510253118",
          "review_id": 510253108,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/rx45y050k4apbtshvtj2.jpg",
          "headline": "Not pink. Light Nude pink",
          "rating": 2,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Light nude pink—not",
          "nickname": "Mrs Santa",
          "created_date": 1711041834000
        },
        {
          "id": "506330066",
          "review_id": 506330123,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/kycsp1clkesxgcuwwmhw.jpg",
          "headline": "Luscious Lips",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Plum On Over",
          "nickname": "Thisbrunetteblogs",
          "created_date": 1707193038000
        },
        {
          "id": "506012706",
          "review_id": 506012217,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/yuxjeuegiquinyya8w7o.jpg",
          "headline": "A new staple, please never discontinue this!!",
          "rating": 5,
          "helpful_votes": 1,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Red My Mind",
          "nickname": "eddx",
          "created_date": 1706835037000
        },
        {
          "id": "506012684",
          "review_id": 506012217,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/aka1ctlrns5ca0qiuxkm.jpg",
          "headline": "A new staple, please never discontinue this!!",
          "rating": 5,
          "helpful_votes": 1,
          "not_helpful_votes": 1,
          "type": "image",
          "caption": "Pinky Out",
          "nickname": "eddx",
          "created_date": 1706835037000
        },
        {
          "id": "506012526",
          "review_id": 506012217,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/lwdtksozrhf5z81vqhzv.jpg",
          "headline": "A new staple, please never discontinue this!!",
          "rating": 5,
          "helpful_votes": 1,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Bust a Mauve",
          "nickname": "eddx",
          "created_date": 1706835037000
        }
      ],
      "faceoff_positive": {
        "comments": "I love these!! I got Bust a Mauve, Red My Mind, and Pinky Out - I thought I'd like Pinky out the best but it's a little too peachy for my preference (I have a light neutral olive skintone)! They're minty and sometimes that bothers me but I don't really smell it when on my lips. They're so comfy and just the gloss I was looking for! I swiped only 1-2 times on the pictures, I prefer a more sheer look :) I can't figure out whether I love the red shade or the mauve shade more 💗",
        "headline": "A new staple, please never discontinue this!!",
        "rating": 5,
        "ugc_id": 506012217
      },
      "faceoff_negative": {
        "comments": "Your colors tend to lean orange.  I would not call this nude pink at all.  Will not repurchase.  Lousy color but nice texture.",
        "headline": "Not pink. Light Nude pink",
        "rating": 2,
        "ugc_id": 510253108
      },
      "native_review_count": 84,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 5840,
      "locale": "en_US"
    }
  }
}