{
  "product_id": "pimprod2026074",
  "product_url": "https://www.ulta.com/p/ultra-repair-wild-oat-hydrating-toner-pimprod2026074",
  "extracted_at": "2025-09-23T05:36:05.996629+00:00",
  "product_name": "First Aid BeautyUltra Repair Wild Oat Hydrating Toner",
  "brand": "First Aid Beauty",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Toner"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "toner"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "24.00",
  "availability": "in_stock",
  "rating_avg": "4.6",
  "rating_count": "310",
  "images": [
    "https://media.ulta.com/i/ulta/2582023?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2582023?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2582023_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2582023_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2582023_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2582023_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2582023_alt05?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeSustainable PackagingGive BackFirst Aid Beauty's Ultra Repair Wild Oat Hydrating Toner is an alcohol free, oatmeal-powered toner that hydrates, relieves and soothes skin.",
  "details": "DetailsKey IngredientsColloidal Oatmeal: Helps calm and relieve dry or distressed skin.Wild Oats: Helps calm and comfort distressed skin.Honey: Helps soothe, soften and moisturize skin.Hyaluronic Acid: Helps boost moisture & reduces the appearance of fine lines & wrinkles.Research ResultsIn an independent clinical study: - 100% experienced an increase in skin hydration immediatelyIn a consumer perception study: - 91% reported their skin felt hydrated, nourished and soothed immediatelyBenefitsHydrates and balances your skinOat milk, Colloidal Oatmeal and Wild Oats are combined with Honey and Hyaluronic Acid to help soothe, relieve redness and hydrate.Skin is left plump and prepped to absorb oils, serums or moisturizers.Item 2582023How To UseStart with clean, dry skin.Apply toner to a cotton pad and swipe over face or pat directly into skin with fingers.Use daily in the AM and/or PM, and follow with serum and/or moisturizer.IngredientsWater/Aqua/Eau, Glycerin, Glycereth-26, Squalane, Sorbitan Oleate, Phenoxyethanol, Ethylhexyl Salicylate, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Colloidal Oatmeal, Mel (Honey, Miel), Saccharomyces/Honey Ferment Filtrate, Chrysanthemum Parthenium (Feverfew) Extract, Sodium Hydroxide, Potassium Sorbate, Avena Sativa (Oat) Kernel Extract, Sodium Benzoate, Citric Acid, Beta-Glucan, Camellia Sinensis Leaf Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Propolis Extract, Sodium Hyaluronate, Xanthan Gum, Ethylhexylglycerin, Tetrasodium EDTA, Chlorphenesin, Benzoic Acid, Sorbic Acid.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Start with clean, dry skin.Apply toner to a cotton pad and swipe over face or pat directly into skin with fingers.Use daily in the AM and/or PM, and follow with serum and/or moisturizer.",
  "ingredients": [
    "Water/Aqua/Eau",
    "Glycerin",
    "Glycereth-26",
    "Squalane",
    "Sorbitan Oleate",
    "Phenoxyethanol",
    "Ethylhexyl Salicylate",
    "Acrylates/C10-30 Alkyl Acrylate Crosspolymer",
    "Colloidal Oatmeal",
    "Mel (Honey",
    "Miel)",
    "Saccharomyces/Honey Ferment Filtrate",
    "Chrysanthemum Parthenium (Feverfew) Extract",
    "Sodium Hydroxide",
    "Potassium Sorbate",
    "Avena Sativa (Oat) Kernel Extract",
    "Sodium Benzoate",
    "Citric Acid",
    "Beta-Glucan",
    "Camellia Sinensis Leaf Extract",
    "Glycyrrhiza Glabra (Licorice) Root Extract",
    "Propolis Extract",
    "Sodium Hyaluronate",
    "Xanthan Gum",
    "Ethylhexylglycerin",
    "Tetrasodium EDTA",
    "Chlorphenesin",
    "Benzoic Acid",
    "Sorbic Acid"
  ],
  "extended_contents": {},
  "tags": {
    "product_type": [
      "cleanser",
      "toner"
    ],
    "skin_type": [
      "dry",
      "mature"
    ],
    "finish": [
      "sheer",
      "oil"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "alcohol-free",
      "anti-aging",
      "hydrating"
    ],
    "category": [],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2026074",
    "total_reviews": 310,
    "reviews": [
      {
        "review_id": 551036699,
        "rating": 5,
        "headline": "works rly well unfortunately",
        "comments": "i really didn't want to like this bc of how expensive it is, but this toner is soo hydrating and made my skin insanely soft. I have eczema prone skin and this was not irritating at all. I also usually have to moisturize 3-4 times over the course of the day (at least in the winter) because of how dry my skin is, but I no longer need to do so after starting to use this toner bc the hydration is so long lasting! hopefully this will last a while bc you only need 3-4 drops for your face and neck, but sadly I will be repurchasing when the time comes",
        "nickname": "x",
        "location": "pnw",
        "created_date": 1743788811789,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 1
      },
      {
        "review_id": 550851394,
        "rating": 1,
        "headline": "eh",
        "comments": "I went through 2 bottle of this toner and i really gave it a fair chance. it just didn't do anything for my face and it didn't mix well with other products.",
        "nickname": "bmar",
        "location": "Albuquerque, NM",
        "created_date": 1743567425507,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 546950442,
        "rating": 5,
        "headline": "Soothing Toner",
        "comments": "I ruined my skin barrier on accident over a year ago, since then my skin was left with sensitivity, mild irritation, redness and dry patches on my face and chest area. (i have sensitive combo skin leaning dry and slight redness in my cheeks) after trying a few products to restore my skin barrier i decided to try this. i tried Paula's choice, tower 28, cauadlie, alpyn ghost berry. Nothing seemed to give me results i was looking for. I LOVE first aid beauty i dont know why i didnt try this first!! I added this to my routine, 3 times a week in the evening after i wash my face. let it sit in for 5 minutes before adding a moisturizing serum or just face lotion. it completely transformed my face. SOOO thankful this changed my skin for the better. My skin isnt burning or feel irritated. after a few months of my skin feeling restored im still keeping this in my routine and i havent experienced any dry patches either. my foundation looks amazing. gave some to my husband and he says he LOVES this stuff after shaving, its very calming for the skin and feels moisturizing. highly recommend!!!!",
        "nickname": "Jessica",
        "location": "Salt Lake City",
        "created_date": 1739904004817,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 1
      },
      {
        "review_id": 545842898,
        "rating": 5,
        "headline": "Love it",
        "comments": "Honestly a game changer. Ive tried other hydrating toners before but this one made my skin so soft and helps my moisturizer absorb.",
        "nickname": "Sara",
        "location": "Ohio",
        "created_date": 1738553754653,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542170505,
        "rating": 4,
        "headline": "It's ok.",
        "comments": "I bought this last year and I wasn't crazy about it, it didn't seem like it was doing anything. Recently my skin is dry from winter and a recent break out that has had me reaching for drying acne products, my skin just feels and looks stripped and i don't like heavy moisturizers when my skin is being break out prone so I decided to give this a shot again and  I really like it. I think. I also just got a red light and started it the same night I started using this toner so it's hard to tell what is doing what, but I do think it is calming and hydrated my stripped skin. Willl continue to use.",
        "nickname": "QueenV",
        "location": "Schaumburg il",
        "created_date": 1735881476676,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 540990226,
        "rating": 5,
        "headline": "Hydration!",
        "comments": "I have VERY acne prone/sensitive skin and this toner has been great for my skin! I've never been able to use a toner without it breaking me out - until now!",
        "nickname": "Logan",
        "location": "Greenville, SC",
        "created_date": 1734149933782,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 529515537,
        "rating": 5,
        "headline": "So good",
        "comments": "I love this toner. Its hydrating and calming on my skin, great to restore moisture after cleansing and even to help with irritation if Ive gone too far with the actives. It absorbs quickly leaving my skin feeling supple and can be layered several times for an extra boost. I also love how much product you get for the price. Its a toner but because of it's consistency I almost consider it more of a serum and compared to other popular calming serums this is such a steal.",
        "nickname": "Ava",
        "location": "Houston",
        "created_date": 1724870973571,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 1
      },
      {
        "review_id": 529326733,
        "rating": 3,
        "headline": "Moisturizing but also irritating",
        "comments": "I used to use this in college and it was amazing! It soothed my skin and made it soft and moisturized. Recently decided to repurchase and the ingredients must have changed or i got a bad batch because it is making my skin burn! Not a horrible burn but a tender/sore feeling.",
        "nickname": "Maddie",
        "location": "York, PA",
        "created_date": 1724852235503,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 527655561,
        "rating": 3,
        "headline": "Meh.",
        "comments": "It's been okay. It stings my skins a little bit which is bizarre, as it's supposed to be sensitive friendly. Smells alright, texture feels a little strange, otherwise does an alright job. Wouldn't buy it again, though.",
        "nickname": "Sarah",
        "location": "Milwaukee",
        "created_date": 1724132771950,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 519177003,
        "rating": 5,
        "headline": "fave toner",
        "comments": "i used the innisfree green tea toner religiously before they reformulated it to make it exfoliating. i prefer hydrating toners since i have sensitive dry skin and i use an exfoliant about once a week. this toner is even better than the innisfree one. it's gentle, non stripping, absorbs well, and has helped me with redness and hydration. i love any skincare with colloidal oatmeal because it's an incredibly gentle and soothing ingredient so this is just great. will def repurchase",
        "nickname": "mimi",
        "location": "houston, tx",
        "created_date": 1717216290500,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 2
      },
      {
        "review_id": 486233855,
        "rating": 1,
        "headline": "Makes skin break out",
        "comments": "Seems like First Aid Beauty has been changing their formulas in everything and it's not for the better. They used to be one of my favorite brands and is supposedly safe for sensitive skin but my skin started breaking out after about a week of use. And this is not an issue I have when trying new products. Highly disappointed.",
        "nickname": "",
        "location": "Lancaster, PA",
        "created_date": 1704110550413,
        "bottom_line": "No",
        "helpful_votes": 17,
        "not_helpful_votes": 0
      },
      {
        "review_id": 481957484,
        "rating": 4,
        "headline": "Great low cost toner",
        "comments": "It's hydrating & feels like it lasts forever! Not super powerful more calming",
        "nickname": "Ray",
        "location": "La quinta",
        "created_date": 1700412511520,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 443845184,
        "rating": 5,
        "headline": "Amazing",
        "comments": "My daughter loves this product we are on out 5th bottle",
        "nickname": "Aracely",
        "location": "Bell Ca",
        "created_date": 1676478038409,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 441788881,
        "rating": 4,
        "headline": "Exactly what I want in a toner",
        "comments": "This toner does exactly what it says- calms and hydrates my skin. The texture is perfect and it sinks right into my skin. I have noticed less redness and agitation in my skin since I have started using this. Chef's kiss!",
        "nickname": "Caseypoz",
        "location": "Baltimore, MD",
        "created_date": 1674698821211,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 440522276,
        "rating": 5,
        "headline": "Great for sensitive skin!",
        "comments": "I read the reviews and decided to try this toner. I have sensitive skin and finding a toner that wouldn't dry out my skin seemed impossible. I'm glad I gave this a try because I love it!! My skin feels so nourished and soft! I highly recommend!",
        "nickname": "Kelly",
        "location": "Ohio",
        "created_date": 1673837189954,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 437813177,
        "rating": 5,
        "headline": "Repurchased repeatedly",
        "comments": "Six bottles in this product is still a must-have in the a.m. and p.m.  Hydrating and soothing to my dry, sensitive skin.  I'm in my 50's and my 20-year old daughter also lists this as a must-have.",
        "nickname": "Fay",
        "location": "Virginia",
        "created_date": 1671286946601,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 426052761,
        "rating": 4,
        "headline": "Amazing for sensitive skin",
        "comments": "If you have sensitive skin, this is a great toner that even hydrates. Though, I didn't notice a huge difference, it's still nice to have in my routine. It DID NOT burn my skin and my skin is very sensitive. I used as directed with a cotton pad and nowadays I use just my fingers. All in all I don't think it noticeably gets rid of acne, but it's a product that could help prevent it.",
        "nickname": "Leah",
        "location": "Purcellville, VA",
        "created_date": 1664135775145,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 420548462,
        "rating": 5,
        "headline": "Amazing!!!",
        "comments": "i have used the FAB ultra repair cream for years (love that product as well) but i wanted to start working on my nightly skin care routine more. i picked this up last time i went shopping and i am so glad i found it. this leaves my skin glowing and smooth whereas other toners have made my skin feel tight and dried out. i have definitely seen a huge difference in my skin since i started using it and couldn't be happier with the results!!",
        "nickname": "Sami",
        "location": "St. Paul, MN",
        "created_date": 1660204253091,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 419323641,
        "rating": 1,
        "headline": "Awful",
        "comments": "Hated it. Burned my skin and made my eyes burn as well.",
        "nickname": "Coco",
        "location": "Los Angeles California",
        "created_date": 1659297034664,
        "bottom_line": "No",
        "helpful_votes": 9,
        "not_helpful_votes": 6
      },
      {
        "review_id": 417745959,
        "rating": 5,
        "headline": "Super calming",
        "comments": "It's the first thing I put on my skin after washing. I have developed really sensitive skin with a little eczema, and this is my essential first layer. I just put a couple drops in my hands and appt it like a serum. Don't waste your product on a cotton ball if you don't need to.",
        "nickname": "Kipanixoxo",
        "location": "Scottsdale",
        "created_date": 1658268856554,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 46,
      "pages_total": 3,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2026074/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Combination",
              "count": 2
            },
            {
              "label": "Dry",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        15,
        2,
        13,
        29,
        251
      ],
      "review_histogram": [
        15,
        2,
        13,
        29,
        251
      ],
      "rating_count": 310,
      "review_count": 310,
      "average_rating": 4.61,
      "recommended_ratio": 0.91,
      "media": [],
      "faceoff_positive": {
        "comments": "This is a great toner. It has replaced another toner I have been using for years. This toner has no perfumes or harsh components, which make it perfect for sensitive skin. I have sensitive and dry skin, so it works wonderfully. It also works really well when worn under makeup. My only complaint will be about the packaging top. It is absolutely not travel friendly. The bottle needs to be kept upright at all times, or the contents will spill. Keeping a bottle upright is pretty much impossible when traveling. I always place the bottle inside a ziplock bag, and I always have considerable spilling (I'm talking about 5 days worth of product). Please, make changes so it does not spill!",
        "headline": "One of the best toners out there",
        "rating": 5,
        "ugc_id": 395616983
      },
      "faceoff_negative": {
        "comments": "Please go back to the old formulation. This is so shady to create a great product with amazing ingredients, then quietly switch the formula to make it worse but cheaper to produce, and bump the fragrance/other ingredients higher up the list.",
        "headline": "Reformulated with more filler",
        "rating": 1,
        "ugc_id": 395616425
      },
      "name": "Ultra Repair Wild Oat Hydrating Toner",
      "native_review_count": 46,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 264,
      "locale": "en_US"
    }
  }
}