{
  "product_id": "pimprod2045852",
  "product_url": "https://www.ulta.com/p/duet-blow-dry-2-in-1-hair-dryer-brush-pimprod2045852",
  "extracted_at": "2025-09-23T03:48:51.949269+00:00",
  "product_name": "ghdDuet Blow Dry 2-In-1 Hair Dryer Brush",
  "brand": "ghd",
  "categories": [
    "Home",
    "Tools & Brushes",
    "Hair Styling Tools",
    "Hot Brushes"
  ],
  "category_keys": [
    "home",
    "tools-brushes",
    "hair",
    "brushes"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "429.00",
  "availability": "in_stock",
  "rating_avg": "3.6",
  "rating_count": "28",
  "images": [
    "https://media.ulta.com/i/ulta/2625285?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2625285?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2625285_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2625285_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2625285_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2625285_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2625285_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2625285_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2625285_alt07?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2625285_vid01/thumbs/379d40c3-23d1-4b77-9809-856735e62b35?w=600&h=337&fmt=auto",
    "https://media.ulta.com/v/ulta/2625285_vid02/thumbs/d0d839d6-5796-469b-a987-77b08f94bc3d?w=600&h=337&fmt=auto"
  ],
  "summary": "Summaryghd's first 2-in-1 hair dryer brush that dries and adds shape at the same time, for the fastest way to create professional smooth and bouncy blow dry delivering 3X more volume with no extreme heat damage.",
  "details": "DetailsBenefits3X more volumeNo frizz50% more shineFeaturesEffortless smooth salon quality blow dry at homePowerful low temperature stylingIncludesCleaning comb and storage bagItem 2625285How To UseEnsure Hair is towel dried and tangle-free before use.Slide power button upwards to turn on. After a few seconds, the fan will ramp up and the product will heat up to the optimal low temperature for styling wet hair. When the light stops flashing and the product beeps, it is ready to use.Loosely dry hair with duet blowdry by brushing through large sections of hair from underneath. Repeat until mostly dry.Divide hair into sections as wide as the barrel of duet blowdry. Place underneath the section and hold for 3 seconds.Lift the product up and away from the head at a slow and steady pace, allowing hair to glide through the bristles. Repeat until dry.For added shape, continue to roll and glide duet blowdry at the ends of the hair.Caution: Do not use this appliance near bathtubs, showers, basins or other vessels containing water. Keep out of reach of children.",
  "how_to_use": "Ensure Hair is towel dried and tangle-free before use.Slide power button upwards to turn on. After a few seconds, the fan will ramp up and the product will heat up to the optimal low temperature for styling wet hair. When the light stops flashing and the product beeps, it is ready to use.Loosely dry hair with duet blowdry by brushing through large sections of hair from underneath. Repeat until mostly dry.Divide hair into sections as wide as the barrel of duet blowdry. Place underneath the section and hold for 3 seconds.Lift the product up and away from the head at a slow and steady pace, allowing hair to glide through the bristles. Repeat until dry.For added shape, continue to roll and glide duet blowdry at the ends of the hair.Caution: Do not use this appliance near bathtubs, showers, basins or other vessels containing water. Keep out of reach of children.",
  "ingredients": "",
  "extended_contents": {},
  "tags": {
    "category": [
      "hair",
      "brushes",
      "tools",
      "haircare"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "sheer",
      "creamy"
    ],
    "brand": [
      "mid-range",
      "premium"
    ],
    "product_type": [],
    "ingredients": [],
    "special_features": []
  },
  "reviews": {
    "product_id": "pimprod2045852",
    "total_reviews": 28,
    "reviews": [
      {
        "review_id": 556422708,
        "rating": 3,
        "headline": "Heavy and too hot but works well",
        "comments": "I wanted to love this, but like other reviews I see here it is heavier and gets very hot. I do my hair once a week and I'be done this for 20 years. I've tried sooo many of these brushes and when I saw that GHD made one I was super excited since I love and have their blow drier and flat iron. Im all about healthy hair! I wont buy this again, because it too expensive for what it is, and im afraid its actually burning my hair. Lets hope they come up with a new design that is lighter and leas hot or easier to handle.",
        "nickname": "BrazilianQ",
        "location": "Millsboro, DE",
        "created_date": 1751574662078,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554820139,
        "rating": 5,
        "headline": "Phenomenal",
        "comments": "Oh. My. Goodness. This thing is amazing. I've tried all of the Shark products, two different Dysons, Drybar, T3, and a few other blow dry brushes… this is *hands down* the BEST one. I have lots of fine hair and this doesnt blow my hair around where my baby hairs go crazy. The airflow is so light and contained yet dries my hair in 2 passes. My hair is silky, smooth, and voluminous. I'm seriously shocked. Try it!!!",
        "nickname": "Kelly",
        "location": "PA",
        "created_date": 1749525204782,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554378827,
        "rating": 5,
        "headline": "Salon quality blowout",
        "comments": "I have very thick hair. Airwrap did not work in my hair. This was easy to use, quick, and gave my hair a salon quality blowout. I wish i could attach a photo. Didnt need to use straightener after. 10/10 recommend.",
        "nickname": "Tiffany",
        "location": "Midland, TX",
        "created_date": 1748820203474,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550896006,
        "rating": 5,
        "headline": "The Best $$$ ever spent on a hair tool!!",
        "comments": "I have purchased the GHD duet 2 in 1 styler, but not a fan of stick straight hair on me.  And if your ends are slighky damaged you will see frizz on the ends.  When i purchased the Duet Blow dry 2 in 1 brush, I couldn't believe what I saw!  I was able to get a salon blow out in 15 min that looked better than any round brush and dryer i have ever used!   I get my hair done in Vegas at Ulta Town Square, and i was so excited to ahow my stlist Jerwin what it could do, ans have him show me what it could do and he was just as impressed as I am.  My husband also loves it because i literalky can do my hair in 15 min from wet to dry. I will never go back to a traditional blow dryer ever!   My daughters love it as i do!!  If you are on the fence, take a wils jump you will never look back!!!",
        "nickname": "ArmyAmber73",
        "location": "Las Vegas, Nevada",
        "created_date": 1743654930736,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 1
      },
      {
        "review_id": 548370658,
        "rating": 5,
        "headline": "Fabulous styling tool for chin-length baby-fine blonde hair.",
        "comments": "I absolutely love this product.  I have always struggled to use a round brush and it gives the same effect.  I don't find it to be heavy at all, as some users are saying.  I use it with the Kevin Murphy BodyBuilder mousse.  I have very fine blonde chin-length bob (my favorite style).  I watched several tutorials of ladies using this blowdry brush with velcro rollers as a finisher.  I tried it today and the result was stunning!!  Actually, I have never been so satisfied with my hair before.  I used the Kevin Murphy Bedroom Hair spray as a finisher.  So silky and voluminous!!",
        "nickname": "Laura",
        "location": "Boulder, Coloroado",
        "created_date": 1741655250901,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547946172,
        "rating": 5,
        "headline": "Love!",
        "comments": "Honestly, if you have thick, frizzy hair you will love this. I tried the dyson and I it did not work well for me. I returned it and then tried this and I'm so glad I did. This worked so much better and faster for me. The bristles are so different from anything else I've seen and they work so well with coarse hair. I think this has mixed reviews because it might be too rough on fine hair.",
        "nickname": "Bella",
        "location": "Los Angeles",
        "created_date": 1741386213957,
        "bottom_line": null,
        "helpful_votes": 14,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547911169,
        "rating": 5,
        "headline": "Salon quality blow dry",
        "comments": "I have thick hair and it takes me a very long time to style with a round brush and blow dryer. And even then it doesnt come out perfect. This tool is magic. It not only dries and styles my hair quickly but gives salon quality blow out. If you are on the fence, i say give it a try. Everyones hair is different, so dont let the negative comments deter you.",
        "nickname": "Ach",
        "location": "Orlando, Florida",
        "created_date": 1741364886958,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 2
      },
      {
        "review_id": 547566036,
        "rating": 5,
        "headline": "Great for a styling a bob",
        "comments": "This product is the perfect size for styling a bob. Other blow dry brushes have a larger barrel, which isn't ideal for shorter hair. It's easy to use and gives me a frizz-free blowout. I wish I had bought it sooner.",
        "nickname": "Bronwynn",
        "location": "NJ",
        "created_date": 1740865941813,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547020892,
        "rating": 1,
        "headline": "Too heavy",
        "comments": "Not recomenden revlons did it for 30 dlls same hair tool",
        "nickname": "Naj 19",
        "location": "Texas",
        "created_date": 1740062693153,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 4
      },
      {
        "review_id": 547020823,
        "rating": 1,
        "headline": "Too heavy",
        "comments": "Not recomenden revlons did it for 30 dlls same hair tool",
        "nickname": "Naj 19",
        "location": "Texas",
        "created_date": 1740062692288,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 545331317,
        "rating": 1,
        "headline": "A huge miss got fine, shoulder length hair",
        "comments": "I have fine, shoulder length hair and even though I read the (mostly) negative reviews, I love GHD so gave this a try.  a big NO.. the wand is heavy, like other people have noted, and that makes is tricky to navigate short hair, but the bigger problem is that it can't grab fine hair.  I used my hand to secure the hair around the barrel but unlike most other similar products, this has a tip that gets very hot and I kept hitting it as I tried to get this to work.  Even when I did manage to get the hair secured,  I wasn't left with body or curls or shiny hair. Just slightly damp frizzy hair.  I knew after a few minutes this was a bust but gave it a go 2 additional times... sorry GHD, but you need to go back to the drawing board for this one...",
        "nickname": "chris",
        "location": "Berkshires, MA",
        "created_date": 1738244878911,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 1
      },
      {
        "review_id": 544299851,
        "rating": 5,
        "headline": "Heavy but works well",
        "comments": "Although the tool is on the heavy side, it works really well. It even works great on day 2 hair. I've used it on my daughter's long thin hair and my thick mid-length hair and works beautifully on both hair types.",
        "nickname": "CT",
        "location": "Naples, FL",
        "created_date": 1737984531849,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 544265263,
        "rating": 5,
        "headline": "Amazing",
        "comments": "I am a novice when it comes to hair. My hair is curly, thick, long and super frizzy. I used to use the Amika blow dry brush and it was a great tool but my hair would still look a bit frizzy with dry ends. I would need to use my beachwaver to finish the look.\nAlthough this tool got mixed reviews I decided to give it a try. I am so happy I did! This is the only time I can get my hair to look smooth and shiney with only one hair tool! It is so easy to use. This has become my my desert island product. I can't live without and if it ever stops working, I would repurchase immediately.",
        "nickname": "Melly",
        "location": "NYC",
        "created_date": 1737899740792,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542702451,
        "rating": 2,
        "headline": "mixed feelings",
        "comments": "i was sooo excited about this tool, and did a lot of research to before buying, given the price. \n\nsome of the reviews i read said it's great for thick hair and a better option than the dyson/shark (i had the shark which didn't work well with my hair type). i have a lot of hair and its curly but my strands are fine. my hair takes a long time to dry.\n\ni used the brush and i really wanted to love it but honestly had a difficult time with it. on a couple of occasions, my hair got so tangled in it that i almost thought i was going to have to cut it off to get the tool out. when i was able to detangle it, so much hair had been pulled out. the barrel gets really hot which is good for styling but not for fingers 😂\n \nfinal thoughts: my results are shiny and my roots are mostly smooth, but this tool doesnt give that pin curl blowout effect that i thought it would from some of the videos i saw - its more of a wave. i'm going to try it one more time and see how i feel now that i have a grasp on how to use it. but ultimately i think im going to return it and stick to the $20 revlon brush i have and just use it at a lower temp with lots of heat protectant lol.",
        "nickname": "Leezy",
        "location": "Boston",
        "created_date": 1736718342593,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542288618,
        "rating": 2,
        "headline": "Too heavy",
        "comments": "I have 1b Asian hair straight with some wave and very frizzy. My hair is thick. This blow dryer looks expensive but not practical. It's super heavy and gets really hot. I'm ok with the hot air but since it's super heavy i sometimes need to rest my hand then the dryer sits on my hair making it very uncomfortable. Surprisingly the result looks real good and the second day as well with no frizz. Unfortunately I still have to return it coz it doesn't do well with my bangs and it's too heavy for me to hold even 10min. I need at least 15-20min to do my hair and this is too tiring.",
        "nickname": "SK",
        "location": "NY",
        "created_date": 1736123285563,
        "bottom_line": "No",
        "helpful_votes": 8,
        "not_helpful_votes": 1
      },
      {
        "review_id": 542234710,
        "rating": 5,
        "headline": "Better then the airwrap for curly hair",
        "comments": "SMOKES the air wrap for a bouncy blowout look. This is the only blowout brush I have used where I didn't have to smooth my roots with a flatiron. Amazing.",
        "nickname": "Gio",
        "location": "Denver",
        "created_date": 1736016386994,
        "bottom_line": null,
        "helpful_votes": 10,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541882068,
        "rating": 5,
        "headline": "This tool is awesome!",
        "comments": "If you are black, Afro Latina , Indian and have wavy or curly hair you want to straighten, you need this. This was everything the dyson wasn't ! This styler was made for coarse hair and I can't sing its praises enough! I'm gonna buy another for B/U!",
        "nickname": "S.",
        "location": "New York",
        "created_date": 1735347730314,
        "bottom_line": "Yes",
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541825583,
        "rating": 4,
        "headline": "Not for all Hair Types but…",
        "comments": "I have always had very thick coarse hair that laughs at a lot of styling tools when it comes to hair styling. This brush is my\nFavorite for coarse thick hair, the heat and tension get it sooo smooth and voluminous. It is bulky which is why I knocked a star, but personally its a learning curve - I have a lotttt of hair and can do my whole head in 30 mins.",
        "nickname": "Flowelle",
        "location": "California",
        "created_date": 1735250464390,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 1
      },
      {
        "review_id": 541660921,
        "rating": 5,
        "headline": "Best blow dryer out there",
        "comments": "I have NO idea where the \" too hot\" reviews are coming from honestly. My daughter and I have long thick curly hair and i keep it on the whole time im doing my hair. Its not even close to hot, its warm yes. If you're using a transformer then not sure. My daughter used to use the dry bar and it got busted twice. Her hair, thick and curly never looked sleek and shiny like it does now. Im still a newbie at this but even with me it blows my mind how good it is.",
        "nickname": "Zcurly",
        "location": "Boston",
        "created_date": 1734910146555,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 536231782,
        "rating": 1,
        "headline": "I would not buy this again",
        "comments": "I am a hairstylist. I love GHD. This brush gets too hot. And when it's that hot, it takes the body completely out of your hair and there is no cool shot. It's very bulky. I returned it.  I am very disappointed as GHD flat irons are wonderful.",
        "nickname": "Allie",
        "location": "Lansing, Illinois",
        "created_date": 1729129186320,
        "bottom_line": "No",
        "helpful_votes": 19,
        "not_helpful_votes": 1
      }
    ],
    "paging": {
      "total_results": 26,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2045852/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "hairtype",
          "name": "Hair Type",
          "type": "tag",
          "values": [
            {
              "label": "Straight Hair",
              "count": 3
            },
            {
              "label": "Wavy Hair",
              "count": 2
            }
          ],
          "display_values": [
            "Straight Hair",
            "Very Curly Hair",
            "Wavy Hair"
          ]
        }
      ],
      "rating_histogram": [
        4,
        5,
        3,
        2,
        14
      ],
      "review_histogram": [
        4,
        5,
        3,
        2,
        14
      ],
      "rating_count": 28,
      "review_count": 28,
      "average_rating": 3.61,
      "recommended_ratio": 0.5,
      "media": [],
      "faceoff_positive": {
        "comments": "I have purchased and tried many drying stylers such as the Dyson Airwrap, BaByliss Compact Hot Air Brush, and (several iterations) of the Revlon One Step Volumizer.  My hair has been damaged by these tools or they just don't do the job I was expecting... Until I found the GHD Duet Blow Dry 2-in-1 Hair Dryer Brush.  \nI have gotten so many compliments on the look of my hair after using it, but I also love the way it makes my hair feels while not using much product at all.  I typically need to used a flat iron after a blowout brush to finish smoothing, however I did not feel the need to do that after using the GHD Duet Blow Dry Brush.  The hybrid of rigid bristles and heated bristles work really well with holding the hair onto the tool as you brush through, and the addition of the hot air efficiently dried the hair in only a few modest passes.  Since there arent any fine nylon bristles like the Dyson Airwrap or the Revlon One Step Volumizer, I genuinely think that the GHD Duet Hair Dryer  Brush will last MUCH longer than competitors since there would be little wear and tear through regular usage.\nThis tool feels substantial in hand, but not too heavy to become fatigued through a styling session.  The size and weight of it might make it not worth taking for a quick trip, however it does come with a nice heat-resistant leatherette case.\nSince I have not used this long term, I can't verify the claims of minimized heat damage.  But that being said, the temperature does seem to be regulated and my hair doesnt feel like it is being tangled or broken while using the tool.  \nLooking forward to this becoming my wash day go-to dryer and styler!",
        "headline": "Ditching my Airwrap and Revlon Volumizer!",
        "rating": 5,
        "ugc_id": 525099537
      },
      "faceoff_negative": {
        "comments": "I really liked this hair dryer brush - was my 1st GHD purchase. I liked that the bristles are such that they won't deform like the DryBar which had been my fave (still love but hate replacing so often) and the bristles actually hold my hair, unlike other fixed bristle hot tools I'd used in the past. I also have the Dyson AirStraight (doesn't keep my hair straight for long) and a L'Oreal tool that uses steam which is also good but I wanted something that would also give my hair some wave if I wanted.\n\nThe tool was great except that it stopped powering on - and it had been less than 10 uses (my hubby is a former electrician who confirmed it wasn't user error). I was about to pack it for our wedding so I'm glad I tried it before leaving :-).\n\nI threw away the packaging after I'd used it a few times and loved it so now hoping I can bring it back to the store for an exchange because I'm hoping I just received a dud product...it worked soooo well until it just stopped working.",
        "headline": "Great until it stopped turning on",
        "rating": 2,
        "ugc_id": 536050464
      },
      "name": "Duet Blow Dry 2-In-1 Hair Dryer Brush",
      "native_review_count": 26,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 2,
      "locale": "en_US"
    }
  }
}