{
  "product_id": "pimprod2032522",
  "product_url": "https://www.ulta.com/p/moon-glow-milky-moisturizing-toning-lotion-pimprod2032522",
  "extracted_at": "2025-09-23T04:38:24.895174+00:00",
  "product_name": "good lightMoon Glow Milky Moisturizing Toning Lotion",
  "brand": "good light",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Face Moisturizer"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "face"
  ],
  "currency": "USD",
  "list_price": "28.00",
  "sale_price": "19.60",
  "availability": "in_stock",
  "rating_avg": "4.7",
  "rating_count": "249",
  "images": [
    "https://media.ulta.com/i/ulta/2597589?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2597589?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597589cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597589cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597589cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597589cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597589cm_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597589cm_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597589cm_alt07?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2597589cm_vid01/thumbs/4da3a6df-d3d1-463b-ba8d-88c2911ae194?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive Backgood light's ultra-light Moon Glow Milky Moisturizing Toning Lotion hydrates and gently exfoliates, leaving your skin balanced, moisturized, and radiant - like the full moon.",
  "details": "DetailsBenefitsSuper hydrating, nourishing, and soothing.pH balancedFor all skin typesGentle for sensitive skinFeaturesgood light is a personal care brand that believes in beauty beyond the binary, creating a new space in the market for those who don't quite shop beauty by gender.Dermatologist testedKey IngredientsMeadowfoam Seed Oil: A fatty acid that hydrates and improves healing in compromised skin barrier function.Snow Mushroom: Holds 1,000x its weight in water particles to penetrate and hydrate.Niacinamide: A form of vitamin B3 that helps minimize pores, reduce redness, regulates oil, and helps reduce the appearance of sun damage.Ceramides: Locks in moisture to protect from dryness and irritation.Item 2597589How To UseAfter cleansing, dispense toning lotion onto your hands and massage into skin to balance the pH and to replenish moisture. Gentle for day and night use.IngredientsWater/Aqua/Eau, Glycerin, Limnanthes Alba (Meadowfoam) Seed Oil, Ceramide NP, Tremella Fuciformis Sporocarp Extract, Niacinamide, Sodium Hyaluronate, Panthenol, Urea, Allantoin, Tocopherol, Avena Sativa (Oat) Kernel Extract, Pelargonium Graveolens Flower Oil, Rose Flower Oil, Citrus Aurantifolia (Lime) Fruit Extract, Dulcis (Orange) Fruit Extract, Citrus Limon (Lemon) Fruit Extract, Cocos Nucifera (Coconut) Fruit Extract, Opuntia Ficus-indica Fruit Extract, Pyrus Malus (Apple) Fruit Extract, Phenoxyethanol, Propanediol, Argania Spinosa Kernel Oil, Canola Oil/Canola/ Huile de colza, Helianthus Annuus, Sodium Lactate, Polyglyceryl-10 Stearate, Carbomer, Pentylene Glycol, Xylitylglucoside, Arginine, Anhydroxylitol, Xylitol, 1, 2-Hexanediol, Citrus Aurantium Myrtus Communis Oil, Ferula Galbaniflua (Galbanum) Resin Oil, Thuja Occidentalis Leaf Extract, Vanilla Planifolia Fruit Extract, Rosa Canina Fruit Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Olea Europaea (Olive) Fruit Oil, Jasminum Officinale (Jasmine) Oil, Citrus Grandis (Grapefruit) Peel Oil, Persea Gratissima (Avocado) Oil, Cedrus Atlantica Bark Oil, Lavandula Angustifolia (Lavender) Oil, Ethylhexylglycerin, Disodium EDTA.",
  "how_to_use": "After cleansing, dispense toning lotion onto your hands and massage into skin to balance the pH and to replenish moisture. Gentle for day and night use.",
  "ingredients": [
    "Water/Aqua/Eau",
    "Glycerin",
    "Limnanthes Alba (Meadowfoam) Seed Oil",
    "Ceramide NP",
    "Tremella Fuciformis Sporocarp Extract",
    "Niacinamide",
    "Sodium Hyaluronate",
    "Panthenol",
    "Urea",
    "Allantoin",
    "Tocopherol",
    "Avena Sativa (Oat) Kernel Extract",
    "Pelargonium Graveolens Flower Oil",
    "Rose Flower Oil",
    "Citrus Aurantifolia (Lime) Fruit Extract",
    "Dulcis (Orange) Fruit Extract",
    "Citrus Limon (Lemon) Fruit Extract",
    "Cocos Nucifera (Coconut) Fruit Extract",
    "Opuntia Ficus-indica Fruit Extract",
    "Pyrus Malus (Apple) Fruit Extract",
    "Phenoxyethanol",
    "Propanediol",
    "Argania Spinosa Kernel Oil",
    "Canola Oil/Canola/ Huile de colza",
    "Helianthus Annuus",
    "Sodium Lactate",
    "Polyglyceryl-10 Stearate",
    "Carbomer",
    "Pentylene Glycol",
    "Xylitylglucoside",
    "Arginine",
    "Anhydroxylitol",
    "Xylitol",
    "2-Hexanediol",
    "Citrus Aurantium Myrtus Communis Oil",
    "Ferula Galbaniflua (Galbanum) Resin Oil",
    "Thuja Occidentalis Leaf Extract",
    "Vanilla Planifolia Fruit Extract",
    "Rosa Canina Fruit Oil",
    "Citrus Aurantium Bergamia (Bergamot) Fruit Oil",
    "Olea Europaea (Olive) Fruit Oil",
    "Jasminum Officinale (Jasmine) Oil",
    "Citrus Grandis (Grapefruit) Peel Oil",
    "Persea Gratissima (Avocado) Oil",
    "Cedrus Atlantica Bark Oil",
    "Lavandula Angustifolia (Lavender) Oil",
    "Ethylhexylglycerin",
    "Disodium EDTA"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "moisturizer"
    ],
    "skin_type": [
      "dry",
      "sensitive",
      "normal",
      "all skin types"
    ],
    "finish": [
      "dewy",
      "sheer",
      "oil",
      "foam"
    ],
    "ingredients": [
      "niacinamide",
      "ceramides"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "dermatologist-tested",
      "hydrating",
      "brightening",
      "soothing",
      "purifying"
    ]
  },
  "reviews": {
    "product_id": "pimprod2032522",
    "total_reviews": 249,
    "reviews": [
      {
        "review_id": 557869687,
        "rating": 5,
        "headline": "cute!!",
        "comments": "I love this toner!! Ive used not only on myself but other people and I see a difference, definitely recommend to others😁",
        "nickname": "Tay",
        "location": "OK",
        "created_date": 1753036562130,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 5
      },
      {
        "review_id": 556863557,
        "rating": 5,
        "headline": "Favorite Product",
        "comments": "I try other Toners and always go back to this one. I don't think I will even bother trying any new toners since this one checks all the boxes and my skin feels smoother and cleaner with this product",
        "nickname": "Kelsey",
        "location": "MI",
        "created_date": 1752076123213,
        "bottom_line": "Yes",
        "helpful_votes": 9,
        "not_helpful_votes": 1
      },
      {
        "review_id": 556022334,
        "rating": 5,
        "headline": "Makes me glow",
        "comments": "One of the best milky toners it is so underrated! I am combo blemish prone I have had no issues with breaking out. This makes my skin feel so smooth and hydrated. I use retinol and I have found that this is gentle enough to use with most exfoliating products. I love it so much I am on my third bottle.",
        "nickname": "Sgt.Strawbeary",
        "location": "Glassboro, NJ",
        "created_date": 1751218825168,
        "bottom_line": null,
        "helpful_votes": 16,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555678360,
        "rating": 5,
        "headline": "Great Product",
        "comments": "I use this toner in combination with a 2% BHA exfoliant and a gel moisturizer from FAB & my skin is arguably the best it's been in years. Its soft, glowy, and I only experience maybe one hormone related pimple a month.  Makeup also looks way smoother now. This toner smells so good & you only need a little, i'vs been using it daily since March and i'm not even half way through the bottle. Highly recommend.",
        "nickname": "Shey",
        "location": "Boston",
        "created_date": 1750537481713,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555546581,
        "rating": 2,
        "headline": "dissapointed",
        "comments": "wanted to love it but its breaking me out. I have sensitive oily acne prone skin for reference.",
        "nickname": "turtleface93",
        "location": "NJ",
        "created_date": 1750369895121,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553531969,
        "rating": 5,
        "headline": "Exceeded my expectations",
        "comments": "I have very sensitive, dry, acne prone skin, and this toner has been amazing. I use it in combination with other toners and serums, one of which includes a different type of active and I was worried at first that combining them would irritate my skin but this did the exact opposite. I had no purging, and my skin has been glowy, bright, and hydrated, days since the start of using this product. Its been nearly a month of twice daily use and the results seem to keep getting better and better. Im eager to try more products from this brand bc my skin loves it.",
        "nickname": "MG",
        "location": "Jacksonville FL",
        "created_date": 1747634976414,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553528094,
        "rating": 5,
        "headline": "Love it!",
        "comments": "It leaves my aging skin slightly dewy and fresh feeling.  I use it as my moisturizer on days i dont need a heavier product and after toner, before moisturizer on more dry days.",
        "nickname": "Av",
        "location": "NC",
        "created_date": 1747617805038,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552581887,
        "rating": 3,
        "headline": "Wanted to love this",
        "comments": "I read nothing but rave reviews for this product and was excited to give it a try when my previous milky toner ran out. Unfortunately it really damaged my skin barrier and caused a lot of irritation and acne. I neglected to see that it contains niacinimide, which i am sensitive to. \n\nThe packaging is nice and the glass bottle feels luxurious. Overall i dont think its a bad product, just didnt work for me.",
        "nickname": "Jude",
        "location": "Chicago, IL",
        "created_date": 1745884504638,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 552581495,
        "rating": 3,
        "headline": "ehh",
        "comments": "i wanted to love it and i did for a few days. seemed to leave my skin feeling nice till i started breaking out. first they started small/unnoticeable but they just got worse. i hadnt added anything new to my routine either.",
        "nickname": "lil b",
        "location": "Houston",
        "created_date": 1745883348712,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550641160,
        "rating": 5,
        "headline": "i'm on my second bottle",
        "comments": "this is one of those products that i will buy again and again.  from the very first use i could tell that i was going to love it.  it's light, absorbs quickly into the skin, and it leaves my skin feeling supple and smooth.  i cannot understate how much more moisturized i feel when i use this stuff, i love it so much.",
        "nickname": "ash",
        "location": "portland",
        "created_date": 1743295484886,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549607682,
        "rating": 5,
        "headline": "AMAZING",
        "comments": "Holy grail",
        "nickname": "Skincare junior",
        "location": "New York NY",
        "created_date": 1742489602837,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 547176594,
        "rating": 5,
        "headline": "The most delicious moisturizing toner🩵☁️",
        "comments": "This product is amazing! I picked it up on a whim and now I use it every morning after cleansing and before moisturizing. Its make your skin supple and moisturized. The scent is mild for me personally, I love that it smells like fruit loops lol. Packaging also gets a 10/10 the glass bottle definitley makes it worth the price. Will be repurchasing once I run out (it lasts forever!)",
        "nickname": "Kim",
        "location": "California",
        "created_date": 1740376987524,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547141630,
        "rating": 5,
        "headline": "BLOWN AWAY",
        "comments": "This product has truly shocked me. I have some staple products that I know give my face a glow like no other, but I can't use them every day because they only give me that glow with a few days between uses. I have used this product every day and night for a week, and EVERY SINGLE DAY my face has been almost unrecognizable. I feel pretty with no makeup on for the first time in my life, my makeup sits better on my face when I do use it, and the glow lasts ALL day, well into the night. Oh my goodness, no wonder it's sold out. You can even get away with no moisturizer with this product (I know because I forgot to put moisturizer on one day, that's how good this feels on my skin). For the record, I live in Florida, and have extremely dry skin which actually over produces oil to overcompensate in the humidity. Usually products like this make me break out, but this feels AMAZING. I never have products make my skin glow and not feel oily, but this one really works. This is not a paid review, I only tried this product because of the reviews I saw, bc I'm a creature of habit. I hate trying new products and am terrified of using my skin to test things out. The reviews were the ONLY reason I tried this and this did not disappoint.",
        "nickname": "Eden",
        "location": "Florida",
        "created_date": 1740276243120,
        "bottom_line": null,
        "helpful_votes": 21,
        "not_helpful_votes": 0
      },
      {
        "review_id": 546110462,
        "rating": 5,
        "headline": "Love it",
        "comments": "Very hydrating on my sentive cobination skin.",
        "nickname": "Nova Kingclue",
        "location": "Covina CA",
        "created_date": 1739042085352,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542617255,
        "rating": 5,
        "headline": "Works well for dry skin",
        "comments": "I was told about this product through a podcast I listen to. I was currently using the Byoma milky toner and liked it, but still felt my skin could be better/more hydrated. I struggle with small dry spots depending on the day and just overall dryness. After trying this - mid winter- my skin has been supple and stays hydrated throughout the day. I was weary about trying just another toner but this one has surpassed my expectations. It has a light scent but it's manageable. I use a lot of the product at once so I only wish it came in a larger size. It's gentle and haven't noticed any skin irritations.",
        "nickname": "Rebecca",
        "location": "Dallas TX",
        "created_date": 1736527136436,
        "bottom_line": "Yes",
        "helpful_votes": 10,
        "not_helpful_votes": 0
      },
      {
        "review_id": 538954552,
        "rating": 5,
        "headline": "Repurchased!",
        "comments": "I hardly ever actually finish a product and if I do it's because I love it so much I can't find a replacement. This is that good- it's my holy grail moisturizing toner and it makes my skin feel so firm but not tight, and so glowy and moisturized! Just bought another one!",
        "nickname": "Madeline",
        "location": "Memphis",
        "created_date": 1733334669939,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 538651530,
        "rating": 5,
        "headline": "Incredible product !",
        "comments": "I cannot be without this toner ! Just ordered my third bottle, I use it daily and absolutely love it! It has helped so much with my skin, it does not iritate it at all (i have sensitive acne prone skin with rosacea) and leaves it feeling so smooth! I have not been breaking out as much since using this, in fact this product helps to keep my skin at bay when it comes to breakouts and random pimples. Cannot recommend it enough!",
        "nickname": "Sandra K.",
        "location": "Albany, NY",
        "created_date": 1732643083848,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537256496,
        "rating": 5,
        "headline": "I love this product",
        "comments": "Very light toner, makes my skin look and feel amazing, I definitely notice that my skin looks rougher when I run out and don't have a back up bottle.",
        "nickname": "Shelbs",
        "location": "Green Bay, WI",
        "created_date": 1730662419662,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 536106446,
        "rating": 5,
        "headline": "Amazing stuff",
        "comments": "This is the best toner you could buy. Love that they use clean ingredients. Its very gentle if u have sensitive skin but still removes dirt, excess oils, etc. its a must buy, along with the other skin care products they have < 3",
        "nickname": "Mel",
        "location": "California",
        "created_date": 1729020908698,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 535582298,
        "rating": 5,
        "headline": "A must have toner!!",
        "comments": "This product has immensely improved my skin clarity (tone, brightness, fading pigmentation) along with leaving the skin feeling extremely hydrated and smooth.",
        "nickname": "Jordan",
        "location": "Conway, SC",
        "created_date": 1728328136388,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 79,
      "pages_total": 4,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2032522/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Dry",
              "count": 3
            },
            {
              "label": "Combination",
              "count": 2
            },
            {
              "label": "Normal",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        7,
        3,
        11,
        8,
        220
      ],
      "review_histogram": [
        7,
        3,
        11,
        8,
        220
      ],
      "rating_count": 249,
      "review_count": 249,
      "average_rating": 4.73,
      "recommended_ratio": 0.94,
      "media": [],
      "faceoff_positive": {
        "comments": "I've been using this toner daily as of a few months ago and I've noticed a change in my skin texture which is typically oily t-zone, dry elsewhere. Very few products create a noticeable change in my skin and this is absolutely one of them. I love that it does not dry me out like other toners. I also love the intention behind this brand. But honestly, the product just works. Recommend.",
        "headline": "My skin is so smooth!",
        "rating": 5,
        "ugc_id": 410130208
      },
      "faceoff_negative": {
        "comments": "so i purchased because i needed a new toner and i loved the glass bottle. i used it everyday in my routine. my skin, which was once glowing everyday, stopped glowing. i thought was skin was getting immune to my routine and it was \"too much moisture\" but no. i assume because this toner says to gently \"exfoliate\", that's what irritated my skin. it made me question my other products, but once i removed this my skin was back to glowing and feeling smooth THE NEXT DAY. i use the vitamin E aqua boost essence lotion etc from the body shop which i'm pretty sure has fragrance and it doesn't bother my skin. it makes it super dewy + glow btw. i have more dry to combination skin, so if you have dry skin, would not recommend for daily use. i'm going to try using it minimally in my routine and see if that's better. you're not supposed to chemically exfoliate everyday, so i found it quite rough. it also would burn my skin.",
        "headline": "broke my skin barrier",
        "rating": 2,
        "ugc_id": 433957933
      },
      "name": "Moon Glow Milky Moisturizing Toning Lotion",
      "native_review_count": 79,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 170,
      "locale": "en_US"
    }
  }
}