{
  "product_id": "pimprod2032521",
  "product_url": "https://www.ulta.com/p/cosmic-dew-gel-foam-water-cleanser-pimprod2032521",
  "extracted_at": "2025-09-23T03:40:59.432552+00:00",
  "product_name": "good lightCosmic Dew Gel To Foam Water Cleanser",
  "brand": "good light",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wash"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "22.00",
  "sale_price": "15.40",
  "availability": "in_stock",
  "rating_avg": "4.8",
  "rating_count": "150",
  "images": [
    "https://media.ulta.com/i/ulta/2597588?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2597588?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597588cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597588cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597588cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597588cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597588cm_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597588cm_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2597588cm_vid01/thumbs/443d3fed-47d5-45c6-86b3-f704f1bf378a?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive Backgood light's Cosmic Dew Gel To Foam Water Cleanser is a celestial gel-to-foam cleanser that gently removes all dirt, impurities, and makeup leaving behind a balanced, healthy, otherworldly glow.",
  "details": "DetailsBenefitsDoubles as a moisture maskSoothes rednessIncreases moistureGentle for sensitive skinFor all skin typesVeganFeaturesgood light is a personal care brand that believes in beauty beyond the binary, creating a new space in the market for those who don't quite shop beauty by gender.Dermatologist testedKey IngredientsGlycerin: Hydrates, heals, and improves skin barrier function against irritants.Laminaria Japonica: A hydrating seaweed that wards off environmental stressors, plumps, and rejuvenates.Fructooligosaccharides: A prebiotic extract that supports the microbiome and reduces skin sensitivity.Hyaluronic Acid: Hydrates the skin, regulates inflammation, soothes redness, and increases moisture.Item 2597588How To UseAs a daily cleansing ritual, gently massage into skin with water, and in a circular motion wash away impurities. For a skin-soothing reset, apply to dry skin as a moisture mask for 2-3 minutes and rinse thoroughly. Gentle for day and night use.IngredientsWater/Aqua/Eau, Disodium Cocoamphodiacetate, Disodium Laureth Sulfosuccinate, Glycerin, Acrylates Copolymer, Potassium Cocoyl Glycinate, Laminaria Japonica Extract, Hydrolyzed Hyaluronic Acid, Tocopherol, Fructooligosaccharides, Eclipta Prostrata Leaf Extract, Beta-Glucan, Lithospermum Erythrorhizon Root Extract, Sodium Chloride, 1, 2-Hexanediol, Decylene Glycol, Tromethamine, Sodium Benzoate, Hexylene Glycol, Dipropylene Glycol, Hydrogenated Lecithin, Citric Acid, Ethylhexylglycerin.",
  "how_to_use": "As a daily cleansing ritual, gently massage into skin with water, and in a circular motion wash away impurities. For a skin-soothing reset, apply to dry skin as a moisture mask for 2-3 minutes and rinse thoroughly. Gentle for day and night use.",
  "ingredients": [
    "Water/Aqua/Eau",
    "Disodium Cocoamphodiacetate",
    "Disodium Laureth Sulfosuccinate",
    "Glycerin",
    "Acrylates Copolymer",
    "Potassium Cocoyl Glycinate",
    "Laminaria Japonica Extract",
    "Hydrolyzed Hyaluronic Acid",
    "Tocopherol",
    "Fructooligosaccharides",
    "Eclipta Prostrata Leaf Extract",
    "Beta-Glucan",
    "Lithospermum Erythrorhizon Root Extract",
    "Sodium Chloride",
    "2-Hexanediol",
    "Decylene Glycol",
    "Tromethamine",
    "Sodium Benzoate",
    "Hexylene Glycol",
    "Dipropylene Glycol",
    "Hydrogenated Lecithin",
    "Citric Acid",
    "Ethylhexylglycerin"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser"
    ],
    "skin_type": [
      "dry",
      "sensitive",
      "normal",
      "all skin types"
    ],
    "finish": [
      "dewy",
      "sheer",
      "gel",
      "foam"
    ],
    "ingredients": [
      "hyaluronic-acid"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "dermatologist-tested",
      "hydrating",
      "soothing",
      "purifying"
    ]
  },
  "reviews": {
    "product_id": "pimprod2032521",
    "total_reviews": 150,
    "reviews": [
      {
        "review_id": 563551124,
        "rating": 5,
        "headline": "This product makes my face feel happy",
        "comments": "After using this cleanser my face feels so soft and so clean. It is so gentle and sudses well. It is my favorite product in my daily skin care routine.",
        "nickname": "Kelly",
        "location": "VA",
        "created_date": 1758133049948,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559256744,
        "rating": 5,
        "headline": "Go to!",
        "comments": "Love this cleanser so much, started using it religiously for a little over a year now and it does the job, literally have no complaints.",
        "nickname": "Pascati",
        "location": "Long Island, NY",
        "created_date": 1754343785244,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556084632,
        "rating": 5,
        "headline": "Good cleanser",
        "comments": "My go to! It is a good gentle cleanser. Doesn't leave my skin feeling stripped. Only con is that sometimes the hole where the product comes out can be very tiny. The first one I ever bought had a really tiny hole and I thought that was normal but the other ones that I bought had a bigger hole and it was a little easier to squeeze out.",
        "nickname": "Emmy",
        "location": "Tallahassee FL",
        "created_date": 1751335431338,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 545845892,
        "rating": 5,
        "headline": "My GO. TO.",
        "comments": "I adore this cleanser. Its great for my sensitive skin that can get dry, I live in a cold area. This cleanser is gentle, feels good on my skin, and works really well with my routine.",
        "nickname": "Katy T.",
        "location": "Wisconsin",
        "created_date": 1738568280217,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 545711461,
        "rating": 5,
        "headline": "BEST FACE WASH EVER",
        "comments": "I've been ising this face wash for the last 2 years and it has completely changed my skin. Its hydrating, gentle, and makes my skin feel so soft! My boyfriend loves it I always come back to buy MORE!",
        "nickname": "Love it!",
        "location": "New York, NY",
        "created_date": 1738301234150,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 545711473,
        "rating": 5,
        "headline": "BEST FACE WASH EVER",
        "comments": "I've been ising this face wash for the last 2 years and it has completely changed my skin. Its hydrating, gentle, and makes my skin feel so soft! My boyfriend loves it I always come back to buy MORE!",
        "nickname": "Love it!",
        "location": "New York, NY",
        "created_date": 1738301233363,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543662599,
        "rating": 3,
        "headline": "I don't recommend",
        "comments": "Honestly I really wanted to love this, but nope. If you have very sensitive skin especially, don't recommend. My skin will be super dry the rest of the day after i use this and that rarely happens with so many face washes I've tried as someone with eczema and hyper sensitive skin. I stick by and recommend The Niacinamide face wash by naturium instead",
        "nickname": "Hwasa",
        "location": "New England",
        "created_date": 1737415338400,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 2
      },
      {
        "review_id": 538963276,
        "rating": 5,
        "headline": "Don't sleep on this!",
        "comments": "This is genuinely one of my favorite cleansers; and I have tried many.\nI have acne-prone combination skin and this cleanser goes deep enough to deal with the oils and sebum in my skin but is still creamy enough to feel non-stripping.\nVery happy with this product.",
        "nickname": "RMM",
        "location": "MI",
        "created_date": 1733346219883,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 536208362,
        "rating": 5,
        "headline": "hands down my favorite cleanser",
        "comments": "I absolutely love this cleanser. It always leaves my face feeling so smooth and soft without drying it out. It lathers pretty well especially if you use a cotton pad or soft cloth. I've traveled with it several times and haven't had any issues with the packaging failing during flights. I use less than a dime size and it lasts me a decent amount.",
        "nickname": "Mandii",
        "location": "Maryland",
        "created_date": 1729106434389,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 536106379,
        "rating": 5,
        "headline": "Love love love",
        "comments": "My favorite cleanser. Its gentle on the skin while still removing makeup, oils, and dirt. Have been using over a year. Love all the goodlight skin products.",
        "nickname": "Mel",
        "location": "California",
        "created_date": 1729020781077,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 526613432,
        "rating": 5,
        "headline": "Great 2nd step cleanser. Packaging could be improved.",
        "comments": "Ive purchased around 6 of these at this point. It doubles as a moisturizing rinse off mask! Towards the end of the product, its difficult to extract from container but thats similar to most cleansers or lotions. Also, dont leave this dispenser side down or product could ooze out.",
        "nickname": "Care",
        "location": "New York",
        "created_date": 1722962134416,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 507688506,
        "rating": 4,
        "headline": "Good Cleanser, Bad Packaging",
        "comments": "As far as \"fragrance-free\" cleansers go, this one actually smells pretty nice- unlike others that have almost triggered my gah reflex. It lathers a little, so if you like your face wasj sudsy, this one's for you. It cleans without stripomg, my face does not feel dry. Its overall a solid product! What I will talk about is the packaging- the little needle stopper inside the cap that keeps the insides from coming out, somehow broke into and got stuck in the dispensing hole?! I was struggling to get the product out obviously, and frustrated, I removed the broken plastic piece and of course, now there was nothing holding the cleanser back. This would have been okay, had I not traveled with it. Good thing I had the foresight to put it inside a ziploc bag, because the cleanser spilled its contents EVERYWHERE. It wasted so much!!Anyway. This cleanser is solid, just be careful with the packaging. Unsure if I'll repurchase but if I do, I'll most likely funnel it into another bottle.",
        "nickname": "tsuntsot",
        "location": "San Francisco Bay",
        "created_date": 1709779715463,
        "bottom_line": null,
        "helpful_votes": 10,
        "not_helpful_votes": 2
      },
      {
        "review_id": 507686034,
        "rating": 4,
        "headline": "good product with a few downsides",
        "comments": "great gentle cleanser. doesn't dry my skin out after use, and it gets my makeup off (aside from a bit of more stubborn eye makeup) but i do notice i have to use quite a bit of it to get it to lather. and i kind hate the packaging, u rlly gotta squeeze to get the product out. plus the product tends to goop up and dry around the lid/spout which is gross.",
        "nickname": "Arz",
        "location": "Dallas, TX",
        "created_date": 1709776325936,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 506986239,
        "rating": 2,
        "headline": "Wanted to love",
        "comments": "I really wanted to love this cleanser, but it just required me to use so much of the product to get a good lather and remove my makeup. I'm sure it works well if you don't use a brow freeze but for me it just isn't doable. Returned.",
        "nickname": "Sarah",
        "location": "Columbus, OH",
        "created_date": 1708972999374,
        "bottom_line": "No",
        "helpful_votes": 7,
        "not_helpful_votes": 14
      },
      {
        "review_id": 494053800,
        "rating": 5,
        "headline": "Best consistency cleanser",
        "comments": "Love this so much",
        "nickname": "",
        "location": "Long Island",
        "created_date": 1705588679120,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 474593976,
        "rating": 2,
        "headline": "It's a no for me",
        "comments": "I bought this along with another cleanser as I needed to find a new cleanser/face wash. Out of the 2 I purchased, I was really excited to try this one. I spot tested it in several areas before using it on my whole face and had no reactions so I figured I was good to go. I liked that the good light cosmic dew cleanser gave a good lather when I rubbed it between my hands and massaged it on my face. I also liked that had a better smell than the other cleanser and it felt better on my face and rinsing off, the other cleanser made my face feel a bit squeaky, if that makes sense. BUT this good light cosmic dew cleanser broke me out terribly where the other one did not. I'm really disappointed as I loved everything about it except it made my skin worse than it was before I used it. It took awhile to get my skin back to normal. I have combo, more on the oily side, very sensitive skin for reference.",
        "nickname": "Sydnie",
        "location": "Undisclosed",
        "created_date": 1696038164545,
        "bottom_line": null,
        "helpful_votes": 8,
        "not_helpful_votes": 11
      },
      {
        "review_id": 470486013,
        "rating": 1,
        "headline": "MADE IT WORSE!",
        "comments": "I started using this product because of the fantastic reviews, and it simply did not live up to its expectations. It didn't help my acne AT ALL, and it even broke me out. I have combination skin and my forehead and nose doubled in visible pores. Terrible.",
        "nickname": "Maddie",
        "location": "Jax FL",
        "created_date": 1693271285839,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 12
      },
      {
        "review_id": 470349544,
        "rating": 4,
        "headline": "Not bad",
        "comments": "I bought this face wash during a sale, as I've been trying to replace all my skincare with cleaner items and this sounded like it had potential. I don't expect much lather from the clean brands so that isn't an issue for me, but this isn't a cleanser that I could rely on at night to wash the day away. It does not remove makeup well at all, and there are clean brands that make cleansers that absolutely will. This has become my go-to morning cleanser while I use it up. It doesn't irritate my skin or cause any issues, and a little goes a long way. I'm on the fence about whether or not I'd repurchase, though.",
        "nickname": "Nikki",
        "location": "Covington, GA",
        "created_date": 1693107335612,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 468285925,
        "rating": 5,
        "headline": "Not bad",
        "comments": "Worked well for my skin. Doesnt lather as much as i thought it would. Does not strip moisture but leaves a clean feeling. Smell is okay… could be better.",
        "nickname": "Jeans",
        "location": "Houston",
        "created_date": 1691971479714,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 468065252,
        "rating": 5,
        "headline": "GREAT face wash, esp for combo skin!",
        "comments": "My simple and effective skin care routine for about 3 months now includes; washing face daily with Good Light Cosmic Dew Cleanser for at least 1 minute. Immediately after, I apply & pat in with my hands Good Molecules Hyaluronic Essence, Good Molecules Hyaluronic Serum & Good Molecules Super Peptide Serum. I then finish off with Cetaphil Oil Free Hydrating Face Moisterizer. My skin HAS NEVER, EVER LOOKED OR FELT THIS GOOD, SERIOUSLY! NO ACNE flareups for first time in my life! This face wash is gentle, cleans face, removes oil, dirt & makeup, doesn't strip skin barrier, NO reaction, combo skin approved, face glows and super hydrated!! Great product!",
        "nickname": "Conner",
        "location": "ohio",
        "created_date": 1691736223284,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 1
      }
    ],
    "paging": {
      "total_results": 57,
      "pages_total": 3,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2032521/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Dry",
              "count": 3
            },
            {
              "label": "Normal",
              "count": 3
            },
            {
              "label": "Combination",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        1,
        5,
        3,
        9,
        132
      ],
      "review_histogram": [
        1,
        5,
        3,
        9,
        132
      ],
      "rating_count": 150,
      "review_count": 150,
      "average_rating": 4.77,
      "recommended_ratio": 0.88,
      "media": [],
      "faceoff_positive": {
        "comments": "I've always been someone who thought \"doesn't matter what cleanser I use, it's going to be washed off anyways,\" and I do still believe that to an extent. I would usually just alternate to a different cleanser once the one I was currently using ran out...but I don't think I'll be doing that when this beauty runs dry!   I LOVE this cleanser (and all of the good light products I've tried). It's effective, I feel clean after using it, but not stripped or dry. I think that my favorite thing about this cleanser, however, is that you barely have to use any!!! Just a little pea-sized amount is perfect to clean your whole face. I feel that with other cleansers I need a whole pump or two! Great ingredients, efficacy, allows me to be frugal/buy less frequently, AND I just love this company so much. Incredible products with a meaningful mission. I am die-hard for this cleanser, the toner, and the new moon balm. I also love the serum, but haven't used it as frequently as the others. I also plan to try the new \"order of the eclipse\" moisturizing cream. I recommend this company to anybody who will listen to me hah.  Only thing I have that's a slight negative for this cleanser is the instructions say you can use it as a hydrating mask - I have found this to be untrue. I tried it once and my skin didn't feel any different. This was the only time using this product that my skin felt stripped, so opposite of hydrating. Just felt like I used a bunch of the product for no reason and was hard to get off since a little goes a long way with this stuff. Still,  barely a negative, though!",
        "headline": "Effective Yet Gentle Cleanser",
        "rating": 5,
        "ugc_id": 417629013
      },
      "faceoff_negative": {
        "comments": "I bought this along with another cleanser as I needed to find a new cleanser/face wash. Out of the 2 I purchased, I was really excited to try this one. I spot tested it in several areas before using it on my whole face and had no reactions so I figured I was good to go. I liked that the good light cosmic dew cleanser gave a good lather when I rubbed it between my hands and massaged it on my face. I also liked that had a better smell than the other cleanser and it felt better on my face and rinsing off, the other cleanser made my face feel a bit squeaky, if that makes sense. BUT this good light cosmic dew cleanser broke me out terribly where the other one did not. I'm really disappointed as I loved everything about it except it made my skin worse than it was before I used it. It took awhile to get my skin back to normal. I have combo, more on the oily side, very sensitive skin for reference.",
        "headline": "It's a no for me",
        "rating": 2,
        "ugc_id": 474593976
      },
      "name": "Cosmic Dew Gel To Foam Water Cleanser",
      "native_review_count": 57,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 93,
      "locale": "en_US"
    }
  }
}