{
  "product_id": "pimprod2052203",
  "product_url": "https://www.ulta.com/p/vita-c-brightening-eye-cream-pimprod2052203",
  "extracted_at": "2025-09-23T05:37:55.078902+00:00",
  "product_name": "goopVita-C Brightening Eye Cream",
  "brand": "goop",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Cream"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "eye-cream"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "58.00",
  "availability": "in_stock",
  "rating_avg": "4",
  "rating_count": "486",
  "images": [
    "https://media.ulta.com/i/ulta/2642501?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2642501?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2642501_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2642501_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2642501_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2642501_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2642501_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2642501_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2642501_alt07?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeThis silky Vita-C Brightening Eye Cream from goop delivers depuffing, color-correcting, brightening benefits right away—and firming, smoothing, lifting results down the line.",
  "details": "DetailsBenefitsColor-correcting for all skin tones for a no-makeup liftBrightens the look of dark circlesDepuffs, firms, moisturizesSmooths the look of wrinkles.Unique gel-cream texture won’t clog poresDelivers antioxidant protectionKey IngredientsVitamin C: combined with niacinamide (vitamin B3) and colorless carotenoids sourced from tomatoes - brightens, smooths texture, and protects skinPhytomimetic Vitamin A: a nonirritating plant-based retinoid alternative, helps smooth the look of wrinkles and lift skinCaffeine: helps depuffAmino Acids & Glycerin: moisturize beautifully without clogging poresMicro-Illuminating Pearls: help visibly color-correct dark circles, no matter your skin toneResearch ResultsAfter four weeks:**100% agreed the eye area felt hydrated97% agreed the eye area looked brighter and less dull94% agreed the eye area looked more even in tone94% agreed the product helped blur fine lines and wrinkles91% agreed fine lines and wrinkles were less visible**Based on a four-week third-party consumer-perception study of 33 women between the ages of 32 and 63.Item 2642501How To UseGently pat onto clean skin beneath and around the eyes a.m. and p.m. The cream is a brilliant first step before makeup, great on its own, and amazing layered into a routine.IngredientsAqua/Water/Eau, Glycerin, Hydrogenated Ethylhexyl Olivate, Coconut Alkanes, Niacinamide, Propanediol, Cetyl Alcohol, Mica (Ci 77019), Barium Sulfate, Cetyl Phosphate, Capryloyl Glycerin/Sebacic Acid Copolymer, Tetrahexyldecyl Ascorbate, Caffeine, Solanum Lycopersicum (Tomato) Fruit/Leaf/Stem Extract, Bidens Pilosa (Black-jack) Extract, Adansonia Digitata (Baobab) Pulp Extract, Tocopherol, Simmondsia Chinensis (Jojoba) Seed Oil, Astrocaryum Murumuru (Murumuru) Seed Butter, Gossypium Herbaceum (Cotton) Seed Oil, Arginine, Hydrogenated Olive Oil Unsaponifiables, Linum Usitatissimum (Linseed) Seed Oil, Squalane, Diheptyl Succinate, Citric Acid, Potassium, Sorbate, Sodium Levulinate, Coco-caprylate/caprate, Titanium Dioxide (Ci 77891), Iron Oxide (Ci 77491), Guar Hydroxypropyltrimonium Chloride, Sodium Benzoate, Silica, Xanthan Gum.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Gently pat onto clean skin beneath and around the eyes a.m. and p.m. The cream is a brilliant first step before makeup, great on its own, and amazing layered into a routine.",
  "ingredients": [
    "Aqua/Water/Eau",
    "Glycerin",
    "Hydrogenated Ethylhexyl Olivate",
    "Coconut Alkanes",
    "Niacinamide",
    "Propanediol",
    "Cetyl Alcohol",
    "Mica (Ci 77019)",
    "Barium Sulfate",
    "Cetyl Phosphate",
    "Capryloyl Glycerin/Sebacic Acid Copolymer",
    "Tetrahexyldecyl Ascorbate",
    "Caffeine",
    "Solanum Lycopersicum (Tomato) Fruit/Leaf/Stem Extract",
    "Bidens Pilosa (Black-jack) Extract",
    "Adansonia Digitata (Baobab) Pulp Extract",
    "Tocopherol",
    "Simmondsia Chinensis (Jojoba) Seed Oil",
    "Astrocaryum Murumuru (Murumuru) Seed Butter",
    "Gossypium Herbaceum (Cotton) Seed Oil",
    "Arginine",
    "Hydrogenated Olive Oil Unsaponifiables",
    "Linum Usitatissimum (Linseed) Seed Oil",
    "Squalane",
    "Diheptyl Succinate",
    "Citric Acid",
    "Potassium",
    "Sorbate",
    "Sodium Levulinate",
    "Coco-caprylate/caprate",
    "Titanium Dioxide (Ci 77891)",
    "Iron Oxide (Ci 77491)",
    "Guar Hydroxypropyltrimonium Chloride",
    "Sodium Benzoate",
    "Silica",
    "Xanthan Gum"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "moisturizer",
      "mask",
      "treatment",
      "eye cream"
    ],
    "skin_type": [
      "oily",
      "mature"
    ],
    "finish": [
      "matte",
      "sheer",
      "creamy",
      "cream",
      "gel",
      "oil"
    ],
    "ingredients": [
      "niacinamide",
      "sulfate-free"
    ],
    "brand": [
      "mid-range",
      "premium"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "anti-aging",
      "brightening"
    ]
  },
  "reviews": {
    "product_id": "pimprod2052203",
    "total_reviews": 486,
    "reviews": [
      {
        "review_id": 555313409,
        "rating": 5,
        "headline": "This is my favorite eye cream of all time!",
        "comments": "I love how lightweight yet moisturizing this eye cream is. It is the perfect base to my makeup and always leaves me looking more well rested and awake than I actually am. I have no idea how this magical potion works, but it is incredible.",
        "nickname": "Lindsey",
        "location": "CA",
        "created_date": 1750282516601,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 1,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        13,
        25,
        103,
        130,
        215
      ],
      "review_histogram": [
        13,
        25,
        103,
        130,
        215
      ],
      "rating_count": 486,
      "review_count": 486,
      "average_rating": 4.05,
      "recommended_ratio": 1.0,
      "media": [],
      "faceoff_positive": {
        "comments": "How exciting to be a part of a new product launch! Thank you Influenster and Goop Beauty for the opportunity. The name Goop immediately made me think of the hand cleaner.THIS is certainly NOT THAT! ha,ha. Firstly, let me say how much I appreciate the absence of fragrance.All too often skincare products wreak of rose or some other strong scent. The Goop Glow Vita-C Brightening Eye Cream looks like a moisturizer,but is described as a gel cream. The texture is rich and creamy and not at all sticky. I used this product as part of my AM & PM skincare routine. I did not experience any irritation at all from the product.This eye cream includes many beneficial products to help not only moisturize,but to diminish the appearance of fine lines. Personally, I did not encounter an instant or remarkable depuffing. What I will say is that it certainly offers ample moisturizing to last you throughout your day. A great eye cream to prep your face for makeup. I used a jade roller with a small amount from the lid. You do not need alot of product as a little goes a long way. Also, I felt that the longer that I used the product and was consistent with the product application the more noticeable the results were. As a woman over forty having a product that helps moisturize and blur those fine lines is welcomed in my skincare routine. Overall, my eyes felt hugged and potected and that is a win to me.",
        "headline": "A gel cream hug for your eyes",
        "rating": 4,
        "ugc_id": 558551956
      },
      "faceoff_negative": {
        "comments": "I received this product for free from Influenster and Goop in exchange for my honest review.\n                    First thing first, I liked the look of the Goopglow Vita-C Brightening Eye Cream; it's both simple and eye-catching. One con regarding the packaging is that there is no protective film for the product itself, and when it arrived from the mail half of the product had spilled out.\n                    The consistency of the cream was fantastic. Not too thin and not too greasy. I appreciate that the eye cream did not have a scent at all, which made using this product 2x a day for two weeks relatively easy. Sometimes when a face product has a pungent smell, it can be a deal breaker.\n                    Overall with these types of eye creams with consistent use for months, results start to be more noticeable, and I, unfortunately, don't see a difference. I don't have prominent fine lines or puffy under eyes, but I do have very dark circles that are very noticeable in person. I honestly feel it has not helped brighten my under eyes. Lastly, I feel like the eye cream took a long time to absorb into the skin.\n                    The first photo is the before and the second one is after 2 weeks of use.",
        "headline": "Not For Me!",
        "rating": 2,
        "ugc_id": 558552523
      },
      "name": "Vita-C Brightening Eye Cream",
      "native_review_count": 1,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 485,
      "locale": "en_US"
    }
  }
}