{
  "product_id": "pimprod2040562",
  "product_url": "https://www.ulta.com/p/eyeshadow-singles-pimprod2040562",
  "extracted_at": "2025-09-23T03:53:07.071252+00:00",
  "product_name": "HALF MAGICEyeshadow Singles",
  "brand": "HALF MAGIC",
  "categories": [
    "Home",
    "Makeup",
    "Eyes",
    "Eyeshadow"
  ],
  "category_keys": [
    "home",
    "makeup",
    "eyes",
    "eyes"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "14.00",
  "availability": "in_stock",
  "rating_avg": "4.2",
  "rating_count": "200",
  "images": [
    "https://media.ulta.com/i/ulta/2611628?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2611628?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611628_sm?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611628_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611628_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611628_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611628_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611628cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611628cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611628cm_alt03?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingHALF MAGIC's Eyeshadow Singles are richly pigmented and available in four finishes - silky matte, glossy metallic, crystal shimmer, and sparkle duochrome.",
  "details": "DetailsBenefitsSumptuous one-swipe colorVelvety & buildable pigmentsTested for eye safetyFeaturesModular pans designed to fit in a customizable magnetic \"Forever\" Palette100% compostable & recyclable PaperFoam compactItem 2611628How To UseFor a more subtle application, use a brush to apply a wash of color. For highest impact looks, apply the shadows directly with your fingers. Mix and match colors to create a beauty colorscape that is uniquely you.IngredientsCalcium Aluminum Borosilicate, Dimethicone/Vinyl Dimethicone Crosspolymer, Silica, Phenyl Trimethicone, Caprylic/Capric Triglyceride, Ethylhexylglycerin, Titanium Dioxide (CI 77891), Iron Oxides (CI 77499), Red 40 (CI 16035), Yellow 5 (CI 19140).Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "For a more subtle application, use a brush to apply a wash of color. For highest impact looks, apply the shadows directly with your fingers. Mix and match colors to create a beauty colorscape that is uniquely you.",
  "ingredients": [
    "Calcium Aluminum Borosilicate",
    "Dimethicone/Vinyl Dimethicone Crosspolymer",
    "Silica",
    "Phenyl Trimethicone",
    "Caprylic/Capric Triglyceride",
    "Ethylhexylglycerin",
    "Titanium Dioxide (",
    "Iron Oxides (",
    "Red 40 (",
    "Yellow 5 ("
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "makeup",
      "eyes",
      "eye",
      "cosmetics"
    ],
    "product_type": [
      "eyeshadow"
    ],
    "skin_type": [
      "oily"
    ],
    "finish": [
      "matte",
      "glossy",
      "sheer",
      "medium coverage",
      "creamy",
      "foam"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2040562",
    "total_reviews": 200,
    "reviews": [
      {
        "review_id": 562232009,
        "rating": 5,
        "headline": "Love this eyeshadow",
        "comments": "Looks so good on so glad I found it.",
        "nickname": "Sarah",
        "location": "GA",
        "created_date": 1756940634871,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 561060103,
        "rating": 3,
        "headline": "Own three singles and plan to buy more",
        "comments": "I absolutely adore the eyeshadow singles and find myself reaching for them almost everytime I do my eyeshadow. It is super blendable and easily applied, looks best when applied with fingertips for maximum glitter application. It does tend to fallout but I personally have little qualms about that because I'm obsessed with glitter.",
        "nickname": "Rin",
        "location": "Chicago, IL",
        "created_date": 1756086842518,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560549503,
        "rating": 1,
        "headline": "BAD FALLOUT",
        "comments": "Awful! Glitter will be all over your face, color fades and just leaves glitter.",
        "nickname": "",
        "location": "TENNESSEE",
        "created_date": 1755782130522,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560467013,
        "rating": 3,
        "headline": "Trying to love this",
        "comments": "It looked gorgeous in the many reels that popped up on my feed promoting this eyeshadow and I was very excited to purchase it! While it does look nice in the right lighting, its hard to feel as excited about it due to the fact that whenever I swirl it on my eyes and apply to my eyelids, it just doesn't show up very pigmented. I end up having to pile it on and only in the right lighting do I see the shimmer, which is definitely pretty but just falls short of expectations. This could be because the lighting you see on social media is way different than everyday lighting. The lady at the brow salon complimented my eye makeup, she liked it! lol But all in all, still trying to get the most out of this item when I use it. Oh and the eco-friendly packaging is well intended, but falls apart and if you're like me, then it is at risk of bumping into your other products in your makeup bag or falling out of its packaging and crumbling, so do be careful with it! There was another review here saying to just take the pan out and put it into a magnetic palette, but not everyone has one of those, so it is a bit of an inconvenience. Might return this but it is awfully pretty in the right lighting, so we will see.",
        "nickname": "Amber",
        "location": "Los Angeles, CA",
        "created_date": 1755631438751,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560140144,
        "rating": 5,
        "headline": "I love love love it!!!",
        "comments": "I love this eyeshadow, very pretty! I will definitely get this in more colors!",
        "nickname": "Christina",
        "location": "Texas",
        "created_date": 1755147115263,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560002896,
        "rating": 5,
        "headline": "Beautiful",
        "comments": "Beautiful color. Didn't need to use a sticky primer. There is chunky glitter so becareful.",
        "nickname": "JJ",
        "location": "Chicago",
        "created_date": 1755023795272,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559898911,
        "rating": 2,
        "headline": "Packaging is terrible, product is good",
        "comments": "I get the eco friendly vibe but the packaging is like cardboard material and unfortunately dossolved from the moisture in my bathroom. Ive akways kept my makeup on the bathroom vanity and this had never happened to any product before. The packaging turns soggy and ruins it for me, the actual eyeshadow is not bad, pretty and easy to use but would not re purchase due to the packaging. Going to try and return but i did throw the box away as i liked the eyeshadow so we will see",
        "nickname": "Olivia",
        "location": "California",
        "created_date": 1754853142273,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 559789331,
        "rating": 2,
        "headline": "BAD FALLOUT",
        "comments": "The color will be gone and glitter will end up all around your eyes in less than 3 hrs. Very glittery!",
        "nickname": "HERITAGE",
        "location": "TN",
        "created_date": 1754601349519,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559003380,
        "rating": 5,
        "headline": "Beautiful, Elegant, Versatile",
        "comments": "I bought Wet Pebble months ago after being disappointed with another brand's single eyeshadow release. A YouTuber recommended this in a \"one and done\" review series. This immediately became my favorite eyeshadow - it went with every single lipstick, it was neutral enough for my neutral, light-medium olive complexion, it gives the perfect luxurious wet look sheen, and it doesn't give fall out. While Wet Pebble could easily be a good one and done shade, I like putting it over a darker matte brown eyeshadow pencil and pairing with a smoky black eyeliner. The shade seems universally flattering for all eye colors too! I just wish they would either make more colors in this finish and restock Glamourust so I could finally try that shade too.",
        "nickname": "Avery",
        "location": "New York",
        "created_date": 1754012648629,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558649066,
        "rating": 2,
        "headline": "When will i learn not to believe social media hype",
        "comments": "Color looks nothing like the smooth chrome color they portray on social media. Its glitter..chunks of glitter. Not good at call for contact wearers.",
        "nickname": "",
        "location": "Ny",
        "created_date": 1753842972069,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558393416,
        "rating": 5,
        "headline": "WOW",
        "comments": "As a hooded eyelid girlie I just do not wear shadow or liner what so ever but O.M.G you guys!!! How can something be subtle and extravagant at the same time?!? You did it Half Magic!! Weightless application, doesn't move at all, doesn't collect in the crease and doesn't transfer up I am obsessed",
        "nickname": "justine",
        "location": "NY",
        "created_date": 1753670580355,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558370986,
        "rating": 5,
        "headline": "Favorite eyeshadows",
        "comments": "Normally I'm not the type to buy eyeshadow singles, but these are the exception. The formulas are super creamy so there's no fallout, the pigment is beautiful, and the glitter and color shift is stunning. I've bought 3 already and I'm itching to buy a 4th. If you're thinking about getting one, get it!!",
        "nickname": "Kat",
        "location": "Arizona",
        "created_date": 1753622523568,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558177100,
        "rating": 4,
        "headline": "Shimmer Shadow",
        "comments": "I got this when it was on sale to try it and I was a little suprised by the flimsy packaging, I appreciate trying to be as environmentally friendly as possible but it is not easy to use. The shadows have a pretty shimmer wish they were a little more glittery,",
        "nickname": "Jackie",
        "location": "Columbus, OH",
        "created_date": 1753430899786,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558071699,
        "rating": 5,
        "headline": "Loved it",
        "comments": "This was so effortless and beautiful, truly ai one and done!",
        "nickname": "Jenna",
        "location": "Los Angeles",
        "created_date": 1753285961754,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558062691,
        "rating": 5,
        "headline": "I love Half Magic",
        "comments": "I have almost all the colors in this product. I love the sparkle and color change of them. It's great to use alone or if you want to use a base shade and then layer for different color effects. Plus the price is great too.",
        "nickname": "Renae",
        "location": "Az",
        "created_date": 1753272967036,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558042057,
        "rating": 5,
        "headline": "Whimsical and Fun",
        "comments": "I am a natural makeup girl but, as soon as I swatched \"blushing lizard\" in store I just HAD to buy it. It looks a bit intimidating in the pan but on the eyes it's a soft mauve with blue sparkles that catch the light. If you want people to suspect you're secretly a mermaid, then I would buy this immediately.",
        "nickname": "Pris",
        "location": "California",
        "created_date": 1753220369245,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557875805,
        "rating": 3,
        "headline": "Blushing Lizard - mega fallout",
        "comments": "I love the color, but it could be more pigmented. Especially considering the huge amount of fallout that happens. I usually put on my face makeup before shadow, but I literally can't do that with this shadow. I won't be buying any more shadows from this brand, even though the colors are very nice.",
        "nickname": "Amanda",
        "location": "Raleigh, NC",
        "created_date": 1753047565883,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557796927,
        "rating": 5,
        "headline": "Beautiful!",
        "comments": "I saw this eyeshadow in an ad and I was not disappointed! Easily applied with a finger. Goes on sheer for a sparkly wash, or builds to a beautiful sparkle! Exactly what I was hoping for!!!",
        "nickname": "Chrissy",
        "location": "SD",
        "created_date": 1752979989979,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557745734,
        "rating": 2,
        "headline": "Not as Expected",
        "comments": "I have fair skin with a cool undertones. This eyeshadow looked some much better on the models.  I tried it separately, over a primer, and as a highlight. Nothing looked good. Within an hour the glitter was all over my face.  Did not matter if I applied with my fingers or brush. Setting spray helped with the flaking.",
        "nickname": "Blrandy",
        "location": "Jacksonville, Alabama",
        "created_date": 1752952083184,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557466748,
        "rating": 2,
        "headline": "Horrible Packaging",
        "comments": "I love glitter so I absolutely love Half Magic and most all their products despite them being a bit higher, but this was a complete miss. The packaging is first of all extremely small, even for an eyeshadow single. It is made from the same material as egg cartons are. It was hard to open at first and immediately broke the closure part. Then I set it on the nightstand where a small bit of water was left from a drink and it just deformed right away and was stuck together. Got absolutely no use from the product and is the worst design idea. Just a waste.",
        "nickname": "Adri",
        "location": "Texas",
        "created_date": 1752814755189,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 118,
      "pages_total": 6,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2040562/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        12,
        16,
        21,
        30,
        121
      ],
      "review_histogram": [
        12,
        16,
        21,
        30,
        121
      ],
      "rating_count": 200,
      "review_count": 200,
      "average_rating": 4.16,
      "recommended_ratio": 0.83,
      "media": [
        {
          "id": "558042072",
          "review_id": 558042057,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/lzqppxeyywgjzfprq6cs.jpg",
          "headline": "Whimsical and Fun",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Pris",
          "created_date": 1753220369245
        },
        {
          "id": "558042084",
          "review_id": 558042057,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/w7bqx51knfpftru1nr4p.jpg",
          "headline": "Whimsical and Fun",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Pris",
          "created_date": 1753220369245
        },
        {
          "id": "471227219",
          "review_id": 471227291,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/cmntjzyruir1ijwfx9yq.jpg",
          "headline": "Eyeshadow Single",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Pretty Robot Single Eyeshadow (picture doesn't do the color justice).",
          "nickname": "Cydni",
          "created_date": 1692217330000
        }
      ],
      "faceoff_positive": {
        "comments": "This eyeshadow single comes in a little foam case, kind of like a takeout container, which I think is so interesting. I like that it's compostable. The eyeshadow itself is small, but a little goes a long way. It's very iridescent and could double as a highlighter if you wanted.The shadow also blends very easily. I think it's great!",
        "headline": "Eyeshadow Single",
        "rating": 5,
        "ugc_id": 471227291
      },
      "faceoff_negative": {
        "comments": "It looked gorgeous in the many reels that popped up on my feed promoting this eyeshadow and I was very excited to purchase it! While it does look nice in the right lighting, its hard to feel as excited about it due to the fact that whenever I swirl it on my eyes and apply to my eyelids, it just doesn't show up very pigmented. I end up having to pile it on and only in the right lighting do I see the shimmer, which is definitely pretty but just falls short of expectations. This could be because the lighting you see on social media is way different than everyday lighting. The lady at the brow salon complimented my eye makeup, she liked it! lol But all in all, still trying to get the most out of this item when I use it. Oh and the eco-friendly packaging is well intended, but falls apart and if you're like me, then it is at risk of bumping into your other products in your makeup bag or falling out of its packaging and crumbling, so do be careful with it! There was another review here saying to just take the pan out and put it into a magnetic palette, but not everyone has one of those, so it is a bit of an inconvenience. Might return this but it is awfully pretty in the right lighting, so we will see.",
        "headline": "Trying to love this",
        "rating": 3,
        "ugc_id": 560467013
      },
      "native_review_count": 118,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 82,
      "locale": "en_US"
    }
  }
}