{
  "product_id": "pimprod2001979",
  "product_url": "https://www.ulta.com/p/look-into-my-eyes-retinol-propolis-eye-mask-pimprod2001979",
  "extracted_at": "2025-09-23T04:26:27.980425+00:00",
  "product_name": "Hey HoneyLook Into My Eyes Retinol and Propolis Eye Mask",
  "brand": "Hey Honey",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Masks"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "masks"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "58.00",
  "availability": "in_stock",
  "rating_avg": "4.5",
  "rating_count": "100",
  "images": [
    "https://media.ulta.com/i/ulta/2538769?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2538769?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2538769_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2538769_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2538769_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2538769_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2538769cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2538769cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2538769cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2538769cm_alt04?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHey Honey Look Into My Eyes Retinol and Propolis Eye Mask is an advanced age defying leave on eye mask with Propolis and Retinol that combats lines and wrinkles, brightens and hydrates the under-eye area.",
  "details": "DetailsBenefitsA rich and softening eye mask designed to improve skin's texture, elasticity and overall appearance of the eyesRegenerating and age-defying with RetinolBrightens and boosts radianceMelts easily into the delicate eye areaThe encapsulated form of Retinol has a slow release mechanism which is activated by the fingertips when applied gently to the skinThe stable ester derivative of vitamin C offers additional antioxidant activity by protecting the skin against free-radical damage that may accelerate the signs of premature agingGreat for anti-aging and all skin typesMade with over 90% natural ingredientsClean beautyCruelty freeKey IngredientsBee Propolis aids in tissue regeneration and repairs at an accelerated rateSqualene is a rich emollient that protects the skin's lipid barrierRetinol eliminates fine lines and wrinklesVitamin C targets dark circles and brightens, lightens and tightens the under-eye areaCoconut Oil delivers a natural glow and radiant appearanceFormulated WithoutParabensSulfatesSLS and PhthalatesItem 2538769How To UseGently massage a small amount to the under-eye and crow's feet area. Leave on for a few minutes. Massage remaining product into the skin until absorbed.IngredientsAqua (Water), Caprylic/Capric Triglyceride, Cetearyl Ethylhexanoate, Propanediol, Squalane, Hydrogenated Coconut Oil, Isononyl Isononanoate, Tapioca Starch, Cetearyl Alcohol, Arachidyl Alcohol, Dipalmitoyl Hydroxyproline, Hydroxypropyl Starch Phosphate, Propolis Extract, Honey Extrac Phenoxyethanol, Glyceryl Stearate, PEG-100 Stearate, Acrylamide/sodium acryloyldimethyltaurate copolymer, Cetearyl Glucoside, Arachidyl Glucoside, Retinol, Glycine Soja (Soybean) Sterol, C13-14 Isoparaffin, Caprylyl Glycol, Triethanolamine, Chlorphenesin, Disodium EDTA, Laureth-7, Ascorbyl Tetraisopalmitate, Polymethyl Methacrylate, Propolis Extract, Butylphenyl Methylpropional, Caramel, Tricaprylin, Glycerin, Hexyl Cinnamal, Linalool, BHT, Behenyl Alcohol LimoneneHydroxycitronellal, Sodium Hyaluronate, Parfum (Fragrance).Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Gently massage a small amount to the under-eye and crow's feet area. Leave on for a few minutes. Massage remaining product into the skin until absorbed.",
  "ingredients": [
    "Aqua (Water)",
    "Caprylic/Capric Triglyceride",
    "Cetearyl Ethylhexanoate",
    "Propanediol",
    "Squalane",
    "Hydrogenated Coconut Oil",
    "Isononyl Isononanoate",
    "Tapioca Starch",
    "Cetearyl Alcohol",
    "Arachidyl Alcohol",
    "Dipalmitoyl Hydroxyproline",
    "Hydroxypropyl Starch Phosphate",
    "Propolis Extract",
    "Honey Extrac Phenoxyethanol",
    "Glyceryl Stearate",
    "PEG-100 Stearate",
    "Acrylamide/sodium acryloyldimethyltaurate copolymer",
    "Cetearyl Glucoside",
    "Arachidyl Glucoside",
    "Retinol",
    "Glycine Soja (Soybean) Sterol",
    "C13-14 Isoparaffin",
    "Caprylyl Glycol",
    "Triethanolamine",
    "Chlorphenesin",
    "Disodium EDTA",
    "Laureth-7",
    "Ascorbyl Tetraisopalmitate",
    "Polymethyl Methacrylate",
    "Propolis Extract",
    "Butylphenyl Methylpropional",
    "Caramel",
    "Tricaprylin",
    "Glycerin",
    "Hexyl Cinnamal",
    "Linalool",
    "BHT",
    "Behenyl Alcohol LimoneneHydroxycitronellal",
    "Sodium Hyaluronate",
    "Parfum (Fragrance)"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "mask",
      "treatment",
      "eye cream"
    ],
    "skin_type": [
      "mature",
      "all skin types"
    ],
    "finish": [
      "dewy",
      "sheer",
      "oil"
    ],
    "ingredients": [
      "retinol",
      "fragrance"
    ],
    "brand": [
      "mid-range",
      "premium"
    ],
    "special_features": [
      "cruelty-free",
      "natural",
      "anti-aging",
      "brightening"
    ]
  },
  "reviews": {
    "product_id": "pimprod2001979",
    "total_reviews": 100,
    "reviews": [
      {
        "review_id": 547393521,
        "rating": 1,
        "headline": "Avoid if Acne prone",
        "comments": "Contains coconut oil, Starch, soja bean oil & fragrance. nope.",
        "nickname": "",
        "location": "california",
        "created_date": 1740517017310,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 545709182,
        "rating": 2,
        "headline": "This does nothing to treat dark circles",
        "comments": "I have neen using thie eye mask for a few months now and i am not noticing anything new.  No changes at all so i wasted my money and i hope that you read this and dont don't dl the same.  \n\nNow it is super moisturizing, but moisture with my problem I just have dark circles under my eyes.  It is very thick.",
        "nickname": "JC",
        "location": "Orlando FL",
        "created_date": 1738291906592,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 2
      },
      {
        "review_id": 447383884,
        "rating": 5,
        "headline": "I've used this cream for +1 year",
        "comments": "This eye cream doesn't feel too thick or thin. It's absorbs well into the skin and doesn't sit on the skin like other eye creams. It doesn't leave a sticky or tacky finish. This cream works well under eye makeup. It has also helped lessen the appearance of my VERY dark circles.",
        "nickname": "Stephanie",
        "location": "Chandler Arizona",
        "created_date": 1678341494710,
        "bottom_line": null,
        "helpful_votes": 14,
        "not_helpful_votes": 0
      },
      {
        "review_id": 402155009,
        "rating": 5,
        "headline": "A must have",
        "comments": "Been using this for a couple years now. Helps my puffiness and has great hydration qualities..this will remain a staple in my skin care routine.",
        "nickname": "mandy",
        "location": "California",
        "created_date": 1647231400555,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 1
      },
      {
        "review_id": 386279290,
        "rating": 3,
        "headline": "hype",
        "comments": "don't understand the hype",
        "nickname": "ah",
        "location": "maine",
        "created_date": 1635691357661,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 3
      },
      {
        "review_id": 348348405,
        "rating": 1,
        "headline": "HEAVY FRAGRANCE",
        "comments": "I wanted to love this because roof the great reviews - but I could only attempt to try it like three times. The strong fragrance burned my eyes like crazy. Definitely would try again if they removed the perfum.",
        "nickname": "Mel",
        "location": "Arizona",
        "created_date": 1622435985105,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 346629731,
        "rating": 1,
        "headline": "Didn't work for me",
        "comments": "Waited so long for this to be restocked because of all the good reviews and unfortunately did absolutely nothing for me. It feels a bit heavy upon application... i will say it does absorb well but have seen absolutely no changes might as well not even apply anything at all. Will be returning.",
        "nickname": "Babydoll",
        "location": "East LA",
        "created_date": 1622000981768,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 343258340,
        "rating": 5,
        "headline": "o-m-g",
        "comments": "oh how I love this product!!! so creamy, absorbs well, super hydrating, and let me tell you... this container will last you all year!!! pls pls try. my dry, sensitive eyes love this",
        "nickname": "hannah",
        "location": "mn",
        "created_date": 1620011024553,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 341219967,
        "rating": 4,
        "headline": "Hydrating so far",
        "comments": "I use this  in conjugation with lamer under eye balm and skii rna eye cream. As for how it lightens dark circles I can't say bc I haven't used it long enough. It definitely  moisturizers and doesn't cause any irritation( I have sensitive skin and a lot of things don't work for me). I purchased when Ulta had the  half off deal and thought for the price and the amount you get it was a steal. I'll continue To use to see if there is any long term benefits(fine line diminish or less darkness). If you need a moisturizer this will do. It absorbs enough to use pre makeup application.",
        "nickname": "Bella",
        "location": "Pa",
        "created_date": 1617979014346,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 340236786,
        "rating": 1,
        "headline": "Painful eye pimples",
        "comments": "Has anyone else developed tiny eye pimples from this? I have sensitive skin, and these tiny pimples filled with pus started to form after using — they hurt. I stopped after about a week of use and they disappeared.",
        "nickname": "Not impressed",
        "location": "Nc",
        "created_date": 1617448612804,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 2
      },
      {
        "review_id": 340005354,
        "rating": 4,
        "headline": "Amazing product overall",
        "comments": "I can see a noticable difference in just one application.  My eyes are visibly brighter on the under eye.  Reduced appearance of dark circles and fine lines!  The only reason that I took off a star is because the ingredients are a little strong, and make my eyeballs feel a little dry and red.  However, for the results that I am seeing so far, I am willing to deal with that.",
        "nickname": "Bad Mermaid",
        "location": "Michigan",
        "created_date": 1617235447156,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 325547264,
        "rating": 5,
        "headline": "WOW!",
        "comments": "Amazing! Honestly! I never write reviews on here but this mask has really exceeded my expectations. I'm 33 and my dark circles and under eye bags are my worst enemy. The only thing that worked in my twenties was First Aid Beauty 5 in 1 eye cream. Now that I'm in my thirties I was starting to think I couldn't shake it anymore. I've even had fat injections to my under eyes. Both my mother and father have terrible bags and dark circles at a young age so I know I'm prone to them. It's been about a week and I can see a difference already, my bags have diminishes significantly and my dark circles are starting to lighten up. Miracle Jar for sure. As for the price... I don't mind it at all because it works and it's so thick and creamy a little goes a long way so I know it will last me probably longer than my other skincare items. Never heard of Hey Honey before this but I'm so glad they made this. I will definitely check out their other skincare items. Thank you!",
        "nickname": "Radiant Thirties",
        "location": "Long Island, New York",
        "created_date": 1611070496383,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 324617950,
        "rating": 2,
        "headline": "No Thanks",
        "comments": "I've been using this product for more than a month, and haven't seen any visible changes to my under eye area. It's fairly thin and watery and doesn't absorb very well. While it's expensive, there is a lot in the container. I'm not sure what ingredient is affecting me, but I'm sensitive to something in the eye cream and my eyes water for a bit after I apply it. I'll likely use it until it's gone, but I won't be purchasing it again.",
        "nickname": "King Pancake",
        "location": "CA",
        "created_date": 1610512241238,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 324434140,
        "rating": 4,
        "headline": "Not sure it's worth the price",
        "comments": "Seems to be working well to help with the darkness under my eyes but it doesn't seem to be doing much for the crows feet",
        "nickname": "Rach",
        "location": "Strongsville, oh",
        "created_date": 1610312864162,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 321322570,
        "rating": 5,
        "headline": "The Best eye cream",
        "comments": "I am 30 years old and recently found my forever eye cream. I have spent so much money finding \"the one\" and nothing worked. I have really bad eye circles so it took a month of everyday application for me to see the difference but now that I have, WOW. I am no longer embarrassed to walk around without concealer.\nThis cream has really changed my life.",
        "nickname": "Brenda",
        "location": "Los Angeles, CA",
        "created_date": 1608414008518,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 298469562,
        "rating": 5,
        "headline": "BUY IT!!",
        "comments": "I got this in my Ipsy bag and I LOVE IT! It's made such a noticeable difference, I've always had dark circles around my eyes that were so bad people thought I was anemic, since I've used this they're GONE!! Going to buy more when the sample runs out.",
        "nickname": "Carly",
        "location": "FL",
        "created_date": 1598982391238,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 284538765,
        "rating": 5,
        "headline": "Such an underrated product",
        "comments": "This eyecream changed my life. I had a deluxe size sample from ipsy. After I used that I was hooked. I went out and got the full size. It is pretty pricy for the size but well worth every penny since it does an incredible job. First couple of weeks into my deluxe size one I saw no difference and I didn't care for it but kept using it. After a month into the product I couldn't believe the results. It softened my fine lines under my eyes. Pump them and gave them a beautiful bright youthful look. I got undereye fillings last year. So this eye cream gave me the exact  bright young look that eye filler did. I am forever buying this product!!",
        "nickname": "kreysa",
        "location": "Texas",
        "created_date": 1595434362176,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 283905195,
        "rating": 5,
        "headline": "favorite eye product!",
        "comments": "I really love this product. It helps get rid of my dark circles and helps prevent aging. I am a 19 year old college student and I am always staying up late and not getting enough sleep. I also wanted to start using anti-aging products early on the help prevent as much aging as possible. I started to get little wrinkles by my eyes that aren't super noticeable and this product has really helped with them. I have purchased this product several times and always love it!",
        "nickname": "emma",
        "location": "Missouri",
        "created_date": 1594760126691,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 283667846,
        "rating": 2,
        "headline": "But the smell?",
        "comments": "This seemed to be a pretty good eye cream but unfortunately I couldn't get passed the perfume smell especially with it right by the eyes. Constantly made my eyes water. 2 stars is all I could give.",
        "nickname": "Nikki",
        "location": "NJ",
        "created_date": 1594400367961,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 275618445,
        "rating": 1,
        "headline": "Messy",
        "comments": "It separates in the container and it does not mix back up well. So there is an oily substance in the container that will leak out (yes, it was fully closed). I will return when the stores open back up. If it was repackaged in a squeeze tube or pump this product would probably be amazing. But the little container is just a disaster",
        "nickname": "pamprw",
        "location": "Jacksonville, FL",
        "created_date": 1588689279950,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 26,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2001979/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "Does not absorb well",
              "count": 1
            },
            {
              "label": "Watery",
              "count": 1
            },
            {
              "label": "Can be pore clogging",
              "count": 1
            }
          ],
          "display_values": [
            "Can be pore clogging",
            "Does not absorb well",
            "Watery"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "Hydrating",
              "count": 1
            },
            {
              "label": "No irritation",
              "count": 1
            }
          ],
          "display_values": [
            "Hydrating",
            "No irritation"
          ]
        }
      ],
      "rating_histogram": [
        8,
        3,
        1,
        9,
        79
      ],
      "review_histogram": [
        8,
        3,
        1,
        9,
        79
      ],
      "rating_count": 100,
      "review_count": 100,
      "average_rating": 4.48,
      "recommended_ratio": 0.67,
      "media": [],
      "faceoff_positive": {
        "comments": "Amazing! Honestly! I never write reviews on here but this mask has really exceeded my expectations. I'm 33 and my dark circles and under eye bags are my worst enemy. The only thing that worked in my twenties was First Aid Beauty 5 in 1 eye cream. Now that I'm in my thirties I was starting to think I couldn't shake it anymore. I've even had fat injections to my under eyes. Both my mother and father have terrible bags and dark circles at a young age so I know I'm prone to them. It's been about a week and I can see a difference already, my bags have diminishes significantly and my dark circles are starting to lighten up. Miracle Jar for sure. As for the price... I don't mind it at all because it works and it's so thick and creamy a little goes a long way so I know it will last me probably longer than my other skincare items. Never heard of Hey Honey before this but I'm so glad they made this. I will definitely check out their other skincare items. Thank you!",
        "headline": "WOW!",
        "rating": 5,
        "ugc_id": 325547264
      },
      "faceoff_negative": {
        "comments": "I've been using this product for more than a month, and haven't seen any visible changes to my under eye area. It's fairly thin and watery and doesn't absorb very well. While it's expensive, there is a lot in the container. I'm not sure what ingredient is affecting me, but I'm sensitive to something in the eye cream and my eyes water for a bit after I apply it. I'll likely use it until it's gone, but I won't be purchasing it again.",
        "headline": "No Thanks",
        "rating": 2,
        "ugc_id": 324617950
      },
      "name": "Look Into My Eyes Retinol and Propolis Eye Mask",
      "native_review_count": 26,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 74,
      "locale": "en_US"
    }
  }
}