{
  "product_id": "pimprod2017385",
  "product_url": "https://www.ulta.com/p/honestly-bright-eyes-tinted-eye-cream-pimprod2017385",
  "extracted_at": "2025-09-23T04:08:28.599258+00:00",
  "product_name": "Honest BeautyHonestly Bright Eyes Tinted Eye Cream",
  "brand": "Honest Beauty",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Cream"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "eye-cream"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "24.00",
  "availability": "in_stock",
  "rating_avg": "4.1",
  "rating_count": "52",
  "images": [
    "https://media.ulta.com/i/ulta/2570958?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2570958?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2570958_sm?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2570957cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2570957cm_alt04?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHonest Beauty's Bright Eyes Tinted Eye Cream blends seamlessly into the skin to help diffuse dark circles with a subtle tint, instantly brightening the eye area. Infused with Squalane & Hyaluronic Acid, this formula delivers 24 hours of hydration for healthy, well-rested vibes. Packaging may vary.",
  "details": "DetailsBenefitsInstantly diffuses dark circlesBrightens and hydratesDermatologist TestedVegan + Cruelty freeEGW Certified100% tree-free paper cartonMade With:Illuminating Pearl: brightenHyaluronic Acid + Squalane: hydrate + moisturizeSubtle Tint/Pigment: diffuse dark circlesFeaturesRECYCLING INFORMATION:Plastic Tube: 51% PCR.Carton: Tree free paper & recyclable. Recycled as paper.HOW TO RECYCLE:Remove cap and pump from the tube.Discard the cap and pump.Toss cap and pump into the waste bin.Cleanout tube.Curious to learn more, check out Your Local Recycling Center. For US only.Formulated WithoutParabensPEGsPhthalatesFragrancesMineral OilItem 2570958How To UseApply a small amount under each eye. Gently dab into skin as you would apply concealer.Precautions: Avoid direct contact with eyes. If contact occurs, flush thoroughly with water. In case of irritation, discontinue use and consult your doctor.IngredientsWater (Aqua/Eau), Propanediol, Squalane, Glycerin, Polyglyceryl-4 Isostearate, Pyrus Malus (Apple) Fruit Extract, Coco-Caprylate/Caprate, Disteardimonium Hectorite, Jojoba Esters, Sodium PCA, Tocopherol, Sodium Acetylated Hyaluronate, Hydrolyzed Sodium Hyaluronate, Trisodium Ethylenediamine Disuccinate, 1,2-Hexanediol, Caprylhydroxamic Acid, Tin Oxide, Mica (CI 77019), Titianium Dioxide (CI 77891), Iron Oxides (CI 77491, CI 77492, CI 77499).",
  "how_to_use": "Apply a small amount under each eye. Gently dab into skin as you would apply concealer.Precautions: Avoid direct contact with eyes. If contact occurs, flush thoroughly with water. In case of irritation, discontinue use and consult your doctor.",
  "ingredients": [
    "Water (Aqua/Eau)",
    "Propanediol",
    "Squalane",
    "Glycerin",
    "Polyglyceryl-4 Isostearate",
    "Pyrus Malus (Apple) Fruit Extract",
    "Coco-Caprylate/Caprate",
    "Disteardimonium Hectorite",
    "Jojoba Esters",
    "Sodium PCA",
    "Tocopherol",
    "Sodium Acetylated Hyaluronate",
    "Hydrolyzed Sodium Hyaluronate",
    "Trisodium Ethylenediamine Disuccinate",
    "2-Hexanediol",
    "Caprylhydroxamic Acid",
    "Tin Oxide",
    "Mica (",
    "Titianium Dioxide (",
    "Iron Oxides ("
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "moisturizer",
      "mask",
      "treatment",
      "eye cream"
    ],
    "finish": [
      "sheer",
      "long-wear",
      "cream",
      "oil"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "dermatologist-tested",
      "brightening"
    ],
    "skin_type": [],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2017385",
    "total_reviews": 52,
    "reviews": [
      {
        "review_id": 532969099,
        "rating": 5,
        "headline": "Wow!!",
        "comments": "I was looking for a product for my dark circles to help with coverage but without looking like i have makeup on! Wow i love this! It looks like im not wearing makeup and it keeps my under eye hydrated. I put eye cream under and this on top",
        "nickname": "Sandy",
        "location": "MI",
        "created_date": 1726229012611,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 513727175,
        "rating": 5,
        "headline": "Just what I was looking for.",
        "comments": "Concealer is usually awful for me, but I really love the Trinny London BFF eye cream. It's just expensive and I go through it quicker than other items and I wanted an easier to buy alternative to her products. I tried this after seeing some good reviews and I really like it. It doesn't crease up or look streaky/pale/cakey and the consistency is similar to the stuff I was using before. If you like Trinny London BFF eye, this is basically the same thing imo!",
        "nickname": "Megan",
        "location": "Tampa, FL",
        "created_date": 1715704385893,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 488503716,
        "rating": 5,
        "headline": "One of the brand's best products",
        "comments": "I have a hard time getting under-eye concealer to look natural, but this is a really easy alternative for me. It's color correcting and moisturizing, and it blends really well. I'll be repurchasing when my tube runs out.",
        "nickname": "Erin",
        "location": "Minneapolis",
        "created_date": 1704905204381,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 468178225,
        "rating": 5,
        "headline": "Amazing",
        "comments": "I love love this brand ! Please dont ever discontinue this i buy this as much as possible beacuase it works on me i have combination skin and this is it ! FYI this is not a concealer dont expect for full coverage .so if you do have dark circles get a concealer or sleep better ;) it does works on me i do see the difference it is not too heavy and it does hydrate my eye area ..its a hit or miss to me ? Was a hit !",
        "nickname": "Ana",
        "location": "New York",
        "created_date": 1691857037431,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 3
      },
      {
        "review_id": 441134751,
        "rating": 5,
        "headline": "great for what it's for",
        "comments": "I don't understand the negative reviews on this product. If you are buying this expecting it to function as a concealer of course you will be disappointed, this is a tinted eye cream not a concealer. I was looking everywhere for something like this and this is the only product of it's kind! clean ingredients, hydrating, with natural easily blending and setting tint that blurs fine lines and discoloration around the eye. It has a natural glowy finish so it doesn't look obvious I have makeup on. This is the type of product you wear when you don't want a lot of makeup on but just want to look a bit more polished with no fuss or hassle. I have very dark circles around my eyes with fine lines and this looks amazing on me just dabbing it on with my finger, also a little good a long way. The color is also a match for my medium skin tone and yellow/olive undertones.",
        "nickname": "jc",
        "location": "Santa rosa CA",
        "created_date": 1674115470882,
        "bottom_line": null,
        "helpful_votes": 30,
        "not_helpful_votes": 0
      },
      {
        "review_id": 440172924,
        "rating": 1,
        "headline": "Personally Won't Buy Again",
        "comments": "I hated this product with a passion. I thought it would have been good for me but it didn't work. I think maybe it was due to me having a more oily skin type?  It just was terrible to use, it flakes off my skin and wasn't consistent with its coverage. These could have been due to my skincare prep as well, but I personally would not recommend this product to anyone with oilier skin or a more hydrating skincare/prep routine before makeup.",
        "nickname": ":)",
        "location": "Chicago IL",
        "created_date": 1673506847133,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 6
      },
      {
        "review_id": 434589558,
        "rating": 1,
        "headline": "Would not recommend",
        "comments": "I was excited about trying this product but it did nothing for me. The cream rubs on extremely light almost like water and then dries up on your skin.",
        "nickname": "A",
        "location": "Florida",
        "created_date": 1668872331253,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 434095009,
        "rating": 3,
        "headline": "Meh, okay",
        "comments": "I didn't find that this concealer worked better than my derma e vitamin c concealer. It didn't brighten up my dark circle, even with the glitter/mica. I found the shimmer to be annoying around the eye area. I have natural dark circles so on the weekends I like a liquid concealer to keep the area light as during the work week I have to use my tarte cc balm concealer which can feel heavy sometimes. I returned it and will be sticking to my derma e one as it feel less heavy than this one due to the shimmer.",
        "nickname": "ultafan",
        "location": "new england",
        "created_date": 1668575580750,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 9
      },
      {
        "review_id": 426587596,
        "rating": 5,
        "headline": "Great for Dark Circles!",
        "comments": "I'm a guy who doesn't really want to commit to full on concealer and this is an absolute game changer. Initially, I thought it was very pigmented but as you blend it in it turns very matte and natural looking. My under eyes are purpleish and the pigment really neutralizes the discoloration. Overall, a pleasant surprise will be purchasing again!",
        "nickname": "Wren",
        "location": "Los Angeles, CA",
        "created_date": 1664316466462,
        "bottom_line": null,
        "helpful_votes": 10,
        "not_helpful_votes": 0
      },
      {
        "review_id": 420981291,
        "rating": 5,
        "headline": "Really surprised by this product",
        "comments": "I normally stay away from putting any kind of makeup or tint near my under eyes because it always creases in my fine lines. But I decided to give this product a go because I love the other products I have from this brand. It did not disappoint!! I put it on every morning after my moisturizer and spf. It does such a nice job blending in and almost melting into your skin that it's undetectable but your eyes look brighter and more awake. Plus you are getting skincare benefits. I highly recommend!",
        "nickname": "Sadie",
        "location": "Colorado Springs",
        "created_date": 1660517026647,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 408325227,
        "rating": 4,
        "headline": "Needs SPF",
        "comments": "I wish this had SPF 30 so I can replace my Bright Eyes Supergoop! Concealer when summer comes for those of us who need spf to conceal natural dark circles so they dont get burned when enjoying some sun.",
        "nickname": "ultafan",
        "location": "new england",
        "created_date": 1652412839284,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 1
      },
      {
        "review_id": 400408031,
        "rating": 2,
        "headline": "Bad",
        "comments": "While it feels and smells inoffensive and it is easily applied, it simply doesn't work. I put this stuff under my eyes and it hardly did anything to cover the dark purple there. I threw it out the same day I received it, very disappointed.",
        "nickname": "Shannon",
        "location": "Fort Pierce FL",
        "created_date": 1645932943092,
        "bottom_line": "No",
        "helpful_votes": 4,
        "not_helpful_votes": 14
      },
      {
        "review_id": 399302912,
        "rating": 5,
        "headline": "The best",
        "comments": "I'm 42 and this does wonders for my under eyes . I absolutely love this. Really brightens and diffuses my shadows",
        "nickname": "Steph",
        "location": "Ohio",
        "created_date": 1644955346145,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 395767313,
        "rating": 4,
        "headline": "Great if you have deep hallows",
        "comments": "I got the shade sandstone and I'm around nc20. The shade match is really good. It has enough coverage that I feel ok going without makeup on weekdays. It also adds lasting hydration and gets rid of my undereye lines w use. I have deep undereye hallows bc it's just how my face is shaped. This is one of those products that bounces light in such a way that the hallow is filled in. So that's a wonderful bonus. \n\nPSA. You need to tap this in as per instructions, not swipe. It's skincare+ makeup in one so swiping separates the pigment out from the squaline and stuff making it spread weird. If you tap instead it will all blend in. \n\n1 star off bc if I blend too far up into my lashline it makes my eyes itch. But also I have sensitive eyes and most things that transfer there make them itch. When I started applying this lower, it didn't itch anymore.",
        "nickname": "Nickname",
        "location": "VA",
        "created_date": 1643559124901,
        "bottom_line": null,
        "helpful_votes": 12,
        "not_helpful_votes": 0
      },
      {
        "review_id": 388986591,
        "rating": 5,
        "headline": "Eye cream YES",
        "comments": "Great ingredients for an eye cream with just enough color correcting before makeup.  It is really skin care hence the name eye cream is fitting.  I love it after my serum and before my sunscreen.  Will continue to buy.",
        "nickname": "BrownCurls",
        "location": "California",
        "created_date": 1637995989337,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 385744124,
        "rating": 3,
        "headline": "Mixed",
        "comments": "I have mixed emotions with this product. I understand the whole makeup no makeup look but this has zero coverage. So if you're looking for coverage this isn't the product. However it does brighten up the under eyes which is where I apply it. The consistency is more on the watery side and it looks weird when mixing. Nice lightweight product but not for someone who's looking for coverage",
        "nickname": "Olga",
        "location": "Texas",
        "created_date": 1635342290310,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 2
      },
      {
        "review_id": 340127156,
        "rating": 2,
        "headline": "Weird texture",
        "comments": "Started off great... a week later, the consistency totally changed to like an unbalanced formula. Not worth the money",
        "nickname": "Not worth the money",
        "location": "Mooney",
        "created_date": 1617377206802,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 318395915,
        "rating": 5,
        "headline": "This is definitely going to be an essential!! Love it.",
        "comments": "Loved it! Looks like I'm wearing concealer:)",
        "nickname": "Ali",
        "location": "Visalia",
        "created_date": 1606964833712,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 308333954,
        "rating": 3,
        "headline": "NOT FOR FAIR SKINTONES!",
        "comments": "I am so soooooooo disappointed in the marketing of this eye cream—being that Honesty Beauty claimed that the shade 'Sandstone' is for Fair to MEDIUM skin tones (more like only medium). Because this is definitely not for fair skintones or people with pink or neutral skin undertones, it is for medium skin tones with yellow or orange undertones.... I love Honesty Beauty and their parent company, The Honest Company; they do clean, healthy, organic, natural products SO WELL and at SUCH A FAIR PRICE! I have tried so many of their incredible products from their body oil, shampoo, condition, cream blushes, facial spray, the face balm, etc. But, this eye cream was NOT INCREDIBLE. Not only is the marketing misleading and a bummer for lighter skintones, but the eye cream created a film-like layer to the skin and pilled up by the end of the day, making look dry and flakey, but when you touched the \"flakes\" they were soft and moisturuzed. Lol. It was such an oxymoron- I looked dull & flakey, but my skin was actually very hydrated... I had orange, crumbling under eyes for the two days I tried this out.... My search for the perfect tinted eye cream continues.... To the Honest Beauty Team—please rework this formula and make a much lighter, more moisturizing under eye (with SPF) please♡ Still love the brand though and what they are do and stand for! Just would not recommend this item as I returned it.",
        "nickname": "Jada",
        "location": "New York, New York",
        "created_date": 1603173798380,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 1
      },
      {
        "review_id": 307080134,
        "rating": 4,
        "headline": "Smooth eye coverage",
        "comments": "This is a nice under eye and eyelid cream. It blends well with light tapping motion. It feels light on the skin but yet provides nice coverage. I mis-read the description prior to purchase and thought this product included sun protection but I still like the feel of the product.",
        "nickname": "On-line shopper",
        "location": "Tucson. AZ",
        "created_date": 1602470477133,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 1
      }
    ],
    "paging": {
      "total_results": 22,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2017385/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "bestuses",
          "name": "Best Uses",
          "type": "tag",
          "values": [
            {
              "label": "Mothers",
              "count": 4
            },
            {
              "label": "Hygiene",
              "count": 3
            }
          ],
          "display_values": [
            "First Aid",
            "Hygiene",
            "Infants",
            "Mothers",
            "Preemies",
            "Toddler"
          ]
        },
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "Poor Quality",
              "count": 3
            },
            {
              "label": "Heavy / Bulky",
              "count": 1
            }
          ],
          "display_values": [
            "Complicated Use",
            "Difficult To Clean",
            "Heavy / Bulky",
            "Poor Quality"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "First Time Parent",
              "count": 4
            },
            {
              "label": "Parent of Two or More Children",
              "count": 2
            }
          ],
          "display_values": [
            "Child Care Professional",
            "First Time Parent",
            "Grandparent",
            "Medical Professional",
            "Parent of Multiples (Twins etc)",
            "Parent of Two or More Children"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "Convenient Use",
              "count": 11
            },
            {
              "label": "Portable",
              "count": 2
            },
            {
              "label": "Easy To Clean",
              "count": 1
            }
          ],
          "display_values": [
            "Convenient Use",
            "Easy To Clean",
            "Portable",
            "Sturdy Construction"
          ]
        },
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Combination",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        2,
        3,
        6,
        19,
        22
      ],
      "review_histogram": [
        2,
        3,
        6,
        19,
        22
      ],
      "rating_count": 52,
      "review_count": 52,
      "average_rating": 4.08,
      "recommended_ratio": 0.83,
      "media": [
        {
          "id": "329280433",
          "review_id": 329280402,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/dajz0pf5bvalwucvx4qs.jpg",
          "headline": "Great product",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Blended in",
          "nickname": "MrsB",
          "created_date": 1613091731416
        },
        {
          "id": "329280448",
          "review_id": 329280402,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/mwcdgyzasnalg0x5o5ha.jpg",
          "headline": "Great product",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "The cream on my hand",
          "nickname": "MrsB",
          "created_date": 1613091731416
        },
        {
          "id": "327976636",
          "review_id": 327976610,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/xtsvwaxymcvmva9zqlji.jpg",
          "headline": "Really good",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Elicia",
          "created_date": 1612744550678
        },
        {
          "id": "327976629",
          "review_id": 327976599,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ywiggqovtz9w6kzive67.jpg",
          "headline": "Really good",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Elicia",
          "created_date": 1612744539722
        },
        {
          "id": "327976627",
          "review_id": 327976626,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/powxjgleqzedwvbbnwlq.jpg",
          "headline": "Really good",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Elicia",
          "created_date": 1612744536313
        },
        {
          "id": "327729978",
          "review_id": 327730006,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/kdvmiiehwzycucygdvnl.jpg",
          "headline": "Perfect product!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "The left side was with the product and the right was without.",
          "nickname": "KenNoBarbie",
          "created_date": 1612500251567
        },
        {
          "id": "326708744",
          "review_id": 326708743,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/gyi8f6aesqn2yhpoqwg4.jpg",
          "headline": "Absolutely love!",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 1,
          "type": "image",
          "nickname": "Keana",
          "created_date": 1611888549307
        },
        {
          "id": "324899488",
          "review_id": 324899480,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/bxi9emfadqmdzzyxalyj.jpg",
          "headline": "Color Correcting & Moisturizing!",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "MarinaKitten",
          "created_date": 1610673397629
        },
        {
          "id": "324898125",
          "review_id": 324898157,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/wtka6yt8sk0ipyn1ku01.jpg",
          "headline": "Great concept, but coverage is too sheer",
          "rating": 3,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Very sheer coverage, thus very slight difference in under eye darkness in the before and after shots",
          "nickname": "Kathleen",
          "created_date": 1610671430984
        },
        {
          "id": "324416811",
          "review_id": 324416822,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/gxtyuxjrayfper6npvnq.jpg",
          "headline": "Honest Beauty is Honestly Awesome",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Honest Beauty Natural Light Product Shot",
          "nickname": "Krisztina",
          "created_date": 1610288030911
        },
        {
          "id": "324416824",
          "review_id": 324416822,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/fwoozwpdqbvskbcnwlro.jpg",
          "headline": "Honest Beauty is Honestly Awesome",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "one week after using honestly beauty tinted eye cream in sandstone - no makeup and glowing skin",
          "nickname": "Krisztina",
          "created_date": 1610288030911
        },
        {
          "id": "324416830",
          "review_id": 324416822,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/tm71o3twztmrqrpdinzh.jpg",
          "headline": "Honest Beauty is Honestly Awesome",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Honest Beauty / Nature",
          "nickname": "Krisztina",
          "created_date": 1610288030911
        },
        {
          "id": "324416741",
          "review_id": 324416822,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/qcftcpdpnebtny7aytfm.jpg",
          "headline": "Honest Beauty is Honestly Awesome",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Honest Beauty /  Mood",
          "nickname": "Krisztina",
          "created_date": 1610288030911
        },
        {
          "id": "324416823",
          "review_id": 324416822,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ppk8utjboujs0mrhv4yb.jpg",
          "headline": "Honest Beauty is Honestly Awesome",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Honest Beauty Eye Cream fits in my to-go box perfectly",
          "nickname": "Krisztina",
          "created_date": 1610288030911
        },
        {
          "id": "324416836",
          "review_id": 324416822,
          "uri": "//res.cloudinary.com/powerreviews/video/upload/v1610288031/prod/erhnttxurqmhy78cygcj.mp4",
          "headline": "Honest Beauty is Honestly Awesome",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "video",
          "caption": "Real Life! Women are not perfect! But Honestly Beauty is helping us grow and glow",
          "nickname": "Krisztina",
          "created_date": 1610288030911
        },
        {
          "id": "324239700",
          "review_id": 324239492,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/mdvn9iga0ogs5gsbqduc.jpg",
          "headline": "Honest beauty",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Nikkiphoenix24",
          "created_date": 1610147863913
        },
        {
          "id": "324239701",
          "review_id": 324239492,
          "uri": "//res.cloudinary.com/powerreviews/video/upload/v1610147868/prod/w9mrobp9mcw2ltk87vzs.mp4",
          "headline": "Honest beauty",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "video",
          "nickname": "Nikkiphoenix24",
          "created_date": 1610147863913
        },
        {
          "id": "322913797",
          "review_id": 322913796,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/nqaiwejfi5nrezxyzios.jpg",
          "headline": "More so skincare than makeup",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "JustMe",
          "created_date": 1609641932605
        },
        {
          "id": "322913806",
          "review_id": 322913796,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/rnklnq0ivpsdq9c42jc4.jpg",
          "headline": "More so skincare than makeup",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "JustMe",
          "created_date": 1609641932605
        },
        {
          "id": "322526266",
          "review_id": 322526230,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/xcxeybe0xpwcz2muhjca.jpg",
          "headline": "Natural Look!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Angieq",
          "created_date": 1609460490822
        },
        {
          "id": "321978027",
          "review_id": 321978037,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/z1sbpmankfucb67hgcjj.jpg",
          "headline": "Eye cream and concealer all in one",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "comes in a tube",
          "nickname": "thecheapsubscriber",
          "created_date": 1608945374314
        }
      ],
      "faceoff_positive": {
        "comments": "I love a multitasking skincare/makeup product, and this one does not disappoint! It's a tinted eye cream, and just like a tinted moisturizer, it has the power of the eye cream, but with a hint of color just like a concealer. I also like the fact that it comes in a tube instead of a jar - that way you don't have to touch everything in order to scoop out just a tiny bit of it. \nAt first I though the shade I got (sandstone) was not going to work (it appeared too light out of the tube), but once I applied to my dark circles in my medium complexion, I noticed that it worked perfectly to neutralize my panda eyes. \nAs an eye cream, I don't know if it does anything other than just moisturize the area (there are other eye creams out there with ingredients like vitamin c or others to help minimize dark circles over time; this one seems to be just a moisturizer). But the real magic is in the tinted part of it since it lets you skip one or more steps in the morning (concealer / foundation). \nThis will be a new skincare staple in my morning routine and I highly recommend it especially if you are like me with giant hereditary dark circles that make you look just like a panda every day, no matter how much sleep you get.",
        "headline": "Eye cream and concealer all in one",
        "rating": 5,
        "ugc_id": 321978037
      },
      "faceoff_negative": {
        "comments": "I love the concept of an eye cream with color correction. Multi-tasking products are always welcome in my routine as I wish to simplify my routine and also there are days where I want a more natural, no-makeup makeup look. A pro is that the eye cream itself is very hydrating and when I put it under my eye it is like my under eyes had a drink of cool water. It feels very refreshing and hydrating and works well to moisturize my under eye without feeling heavy or greasy.  I was hoping there would be a bit more coverage in this eye cream, making it more like a concealer, but because the eye cream itself is quite watery, the coverage is extremely sheer. It barely offers any coverage at all, though it is marketed as a \"color corrector\" more so than a concealer I suppose. It does have a yellow tint so that slightly cancels out my dark/blue/brown under eye tones, but overall as you can see in my before and after photos, there is barely any difference in my under eyes' dark circles. I think this would be more useful of a product if it offered more coverage and pigmentation. Overall, I will continue to use this product and layer concealer over it as needed (and will try mixing it with my concealers as a way to make a concealer more hydrating and natural), but would not repurchase as I would want something with more coverage.",
        "headline": "Great concept, but coverage is too sheer",
        "rating": 3,
        "ugc_id": 324898157
      },
      "name": "Honestly Bright Eyes Tinted Eye Cream",
      "native_review_count": 22,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 30,
      "locale": "en_US"
    }
  }
}