{
  "product_id": "pimprod2051198",
  "product_url": "https://www.ulta.com/p/illusion-priming-moisturizer-pimprod2051198",
  "extracted_at": "2025-09-23T04:15:27.288728+00:00",
  "product_name": "HOURGLASSIllusion Priming Moisturizer",
  "brand": "HOURGLASS",
  "categories": [
    "Home",
    "Makeup",
    "Face",
    "Face Primer"
  ],
  "category_keys": [
    "home",
    "makeup",
    "face",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "58.00",
  "availability": "in_stock",
  "rating_avg": "4.8",
  "rating_count": "52",
  "images": [
    "https://media.ulta.com/i/ulta/2637720?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2637720?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637720_sm?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637720_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637720_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637720_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637720_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637720_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637720_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637720_alt07?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2637720_vid01/thumbs/30a70ee3-8892-4433-9bc6-cd9b059172e2?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsCruelty FreeHOURGLASS Illusion Priming Moisturizer is a priming moisturizer that instantly nourishes and hydrates for soft, supple skin that’s perfectly prepped for makeup application.",
  "details": "DetailsFeaturesCreates a perfect canvas for makeup applicationClinically proven to visibly reduce fine lines and wrinklesImproves the look, feel, and wear of foundationLuxurious texture absorbs quickly into skinFeels fresh and lightweightSkin feels more moisturized and nourishedProvides soft, supple skinResearch ResultsClinically proven to reduce the appearance of fine lines and wrinkles.INSTANT100% said this product applies evenly and melts into skin96% said skin feels fresh and hydratedAFTER 12 HOURS96% said skin feels moisturized90% said skin feels nourishedAFTER 2 WEEKS90% said skin feels smoother, softer and suppleFormulated WithoutParabensPhthalatesTalcMineral oilGlutenItem 2637720How To UseSmooth desired amount onto skin with fingertips.ARTISTRY TIPS: Use alone for a boost of hydration, or under makeup to extend wear.IngredientsWater/Aqua, Caprylic/Capric Triglyceride, Dicaprylyl Carbonate, Squalane, Propylene Glycol Dibenzoate, Butylene Glycol, Propanediol, Disteardimonium Hectorite, Niacinamide, Lauryl Peg-10 Tris(Trimethylsiloxy)Silylethyl Dimethicone, Polyglyceryl-2 Isostearate, Magnesium Sulfate, Coco-Caprylate/Caprate, Polyglyceryl-6 Polyricinoleate, Rosa Damascena Flower Water, Sorbitan Isostearate, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Ethylhexylglycerin, Adenosine, 1,2-Hexanediol, Sodium Hyaluronate, Tocopherol, Hyaluronic Acid, Hydrolyzed Hyaluronic Acid, Hydrolyzed Sodium Hyaluronate, Hydroxypropyltrimonium Hyaluronate, Potassium Hyaluronate, Sodium Hyaluronate Crosspolymer, Sodium Acetylated Hyaluronate, Ceramide Np.Ingredient lists and claims may change or vary from time to time as part of our commitment to innovation and maintaining global compliance. Please refer to the ingredient list on the product packaging you receive to ensure the ingredients are suitable for your personal use.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Smooth desired amount onto skin with fingertips.ARTISTRY TIPS: Use alone for a boost of hydration, or under makeup to extend wear.",
  "ingredients": [
    "Water/Aqua",
    "Caprylic/Capric Triglyceride",
    "Dicaprylyl Carbonate",
    "Squalane",
    "Propylene Glycol Dibenzoate",
    "Butylene Glycol",
    "Propanediol",
    "Disteardimonium Hectorite",
    "Niacinamide",
    "Lauryl Peg-10 Tris(Trimethylsiloxy)Silylethyl Dimethicone",
    "Polyglyceryl-2 Isostearate",
    "Magnesium Sulfate",
    "Coco-Caprylate/Caprate",
    "Polyglyceryl-6 Polyricinoleate",
    "Rosa Damascena Flower Water",
    "Sorbitan Isostearate",
    "Prunus Amygdalus Dulcis (Sweet Almond) Oil",
    "Ethylhexylglycerin",
    "Adenosine",
    "2-Hexanediol",
    "Sodium Hyaluronate",
    "Tocopherol",
    "Hyaluronic Acid",
    "Hydrolyzed Hyaluronic Acid",
    "Hydrolyzed Sodium Hyaluronate",
    "Hydroxypropyltrimonium Hyaluronate",
    "Potassium Hyaluronate",
    "Sodium Hyaluronate Crosspolymer",
    "Sodium Acetylated Hyaluronate",
    "Ceramide Np.Ingredient lists and claims may change or vary from time to time as part of our commitment to innovation and maintaining global compliance. Please refer to the ingredient list on the product packaging you receive to ensure the ingredients are suitable for your personal use"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "makeup",
      "face",
      "cosmetics"
    ],
    "product_type": [
      "moisturizer",
      "primer"
    ],
    "skin_type": [
      "mature"
    ],
    "finish": [
      "sheer",
      "creamy",
      "oil"
    ],
    "ingredients": [
      "hyaluronic-acid",
      "niacinamide",
      "ceramides",
      "sulfate-free"
    ],
    "brand": [
      "mid-range",
      "premium"
    ],
    "special_features": [
      "cruelty-free",
      "anti-aging"
    ]
  },
  "reviews": {
    "product_id": "pimprod2051198",
    "total_reviews": 52,
    "reviews": [
      {
        "review_id": 554102286,
        "rating": 2,
        "headline": "Not what I expected.",
        "comments": "The product seemed great in the store in my hand. However, when used with makeup in my face, it separated the makeup and felt cakey.",
        "nickname": "Jenn",
        "location": "Langhorne, PA",
        "created_date": 1748445883460,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 4
      },
      {
        "review_id": 552779168,
        "rating": 4,
        "headline": "Very Pretty and Effective Primer",
        "comments": "**purchased with my own money**\n\nI purchased this product with my own money from Ulta. I am a licensed Esti as well as freelance makeup artist, so I have used a good amount of products in my 20+ year career.\n\nFor reference, I have drier skin with pores in my t-zone that are more visible than anywhere else. My t-zone also gets a bit oily throughtout the day, but nothing to the extent that I  must powder or look super greasy. I will, however, have to powder in the summer. It just is what it is, no matter what I use. \n\nThis product feels really pretty and extremely comfortable on the skin once it dries down. I've tested it for about two+ weeks now and it plays well with all of my other products used, even my mineral spf. However, I do not use this as a primary moisturizer, as I do not think it's hydrating enough for my dry skin on its own. I'm ok with that because this works beautifully to prime and, as previously stated, it sits well on top of all of my other skincare. I apply this last over my normal AM routine and then I apply my makeup. I have found this has meshed well with both my water and silicone based foundations, tinted moisturizers and concealers. I also believe that it makes a substantial difference in the way my makeup looks and extends the wear-time. My skin/makeup still looks really pretty at the end of the day. \n\nI could actually see all skin types enjoying this because it doesn't feel like a moisturizing cream or lotion, it feels more like a primer. It's hard to explain, but it's a hybrid that's leaning more on the primer side . I would say that it feels more like a putty-like lotion-primer than moisturizer, so if you lean dry like me and think you can skip a step, you may be disappointed. When I say putty-like, it's not stiff. It is NOT a bad thing. I just don't want anyone thinking it's going to feel like a cream and spread like a cream. It does not spread like a traditional lotion or moisturizer, again, it's stiffer (but not in a bad way). I wish I could explain the texture a bit better, but it's difficult to describe.\n\nOverall, I do find myself reaching for this more frequently. I think with summer coming, I may have to use my stick primer on my nose to control the oils, but I'll have to determine that when it's warmer. It is typical for me though with any primer in the summer so thats why I mention it. That's not a deal breaker for me when considering repurchase this product (which I will do).\n\nI did knock a star off because I feel the cost is a bit excessive for what it is. I also don't go by the bottle design. While it may look pretty on a vanity or in IG pictures, just like people, it's what's inside that counts. \n\nI hope this review is helpful to those on the fence. I saw there were many incentivized reviews so I thought I'd write one up as someone who purchased  it.",
        "nickname": "shersj",
        "location": "NJ",
        "created_date": 1746232687059,
        "bottom_line": null,
        "helpful_votes": 19,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552544285,
        "rating": 1,
        "headline": "pore city",
        "comments": "I loved the feel and glow of this but it made my pores look HUGE. No bluring what so ever. which was kind of the point for me.",
        "nickname": "maddie",
        "location": "philadelphia, pa",
        "created_date": 1745802888848,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 4
      },
      {
        "review_id": 552247035,
        "rating": 5,
        "headline": "Primer and moisturizer in one",
        "comments": "I'm obsessed with this primer! I love how it's a primer and a moisturizer in one.  It hydrates my skin, leaves it looking and feeling soft and plump, and is the perfect ex t base to put my makeup on.  I notice my makeup and skin look so much fresher when I use this primer.  My makeup looks fresh and doesn't crease or dry out.  This was gifted by Hourglass.",
        "nickname": "Michelle",
        "location": "California",
        "created_date": 1745469365424,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552184894,
        "rating": 5,
        "headline": "New favorite primer",
        "comments": "Loving the Hourglass Illusion Priming moisturizer. The texture is so luxurious and it absorbs beautifully into the skin. My skin feels soft, hydrated, and smooth with use. Foundation looks gorgeous with this primer! I love it. Gifted by Hourglass cosmetics.",
        "nickname": "tawni",
        "location": "Wisconsin",
        "created_date": 1745353129733,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 2
      },
      {
        "review_id": 552147970,
        "rating": 4,
        "headline": "Pretty good",
        "comments": "The Hourglass Illusion Priming Moisturizer is ideal for those seeking a hydrating primer that imparts a luminous glow. It's particularly beneficial for individuals with normal to dry skin types. However, those with oily skin may want to test it first to ensure compatibility. Gifted by HourGlass",
        "nickname": "Nelllieeee",
        "location": "Los Angeles",
        "created_date": 1745303122668,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552144373,
        "rating": 5,
        "headline": "I love it",
        "comments": "I absolutely love this primer! I have so many products from Hourglass and they're always such high quality, so I wasn't surprised this primer blew me away. It helps my makeup look so smooth and put together, and it feels like I just got a facial! Gifted by hourglasscosmetics",
        "nickname": "Mona",
        "location": "Charlotte",
        "created_date": 1745287662706,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552132448,
        "rating": 5,
        "headline": "Makes makeup last longer",
        "comments": "I love this primer! It is so moisturizing and leaves my skin soft and supple. It's so important to have nice moisturized skin if you want your makeup to apply nicely, and this does just that. It makes my makeup last so much longer too! This product was gifted to me by hourglass cosmetics.",
        "nickname": "Brooke",
        "location": "Orlando, FL",
        "created_date": 1745262970618,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552087853,
        "rating": 5,
        "headline": "10/10 recommend",
        "comments": "Gifted by Hourglass This is such a great primer! I have combo dry skin and this has been such a beautiful new addition to my makeup routine. It really helps to provide moisture to my skin and sinks in beautifully . It feels amazing and makes the products I apply over it go on so much smoother . They also wear longer as well I find.",
        "nickname": "Alisa",
        "location": "Tx",
        "created_date": 1745160032090,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552068226,
        "rating": 5,
        "headline": "Super great under makeup",
        "comments": "This moisturizer is perfect to go under makeup. It's a little thick, but just enough to be tacky for makeup to sit on really nicely. It keeps my skin looking hydrated throughout the whole day. I received this complimentary from Hourglass.",
        "nickname": "Ally",
        "location": "New York, NY",
        "created_date": 1745091633212,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551864455,
        "rating": 5,
        "headline": "So rich and beautiful!",
        "comments": "This primer has such a luxurious feel to it, I'm obsessed! It's definitely hydrating and creamy, it has a richness to it that I love, but doesn't leave my skin feeeling greasy at all. It helped my foundation glide on like butter! Gifted by hourglass.",
        "nickname": "Jeanne",
        "location": "United States",
        "created_date": 1744834969292,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 2
      },
      {
        "review_id": 551863947,
        "rating": 5,
        "headline": "This is the best!",
        "comments": "a favorite in my routine. This priming moisturizer instantly melts into the skin, providing intense hydration and creating a smooth canvas for makeup application. Infused with a powerful blend of plant-based squalane, niacinamide, and a hyaluronic rose complex featuring Damascus rosewater and 11 types of hyaluronic acid, it nourishes the skin while visibly reducing fine lines and wrinkles \n\nThe lightweight formula absorbs quickly, leaving my skin feeling soft and supple without any greasy residue. It enhances the longevity of my makeup, keeping it fresh throughout the day. As someone with combination skin, I appreciate how it balances hydration without causing excess shine.​\n\nOverall, the Hourglass Illusion Priming Moisturizer delivers on its promises, providing both skincare benefits and makeup enhancement. It's a luxurious addition to any beauty routine, especially for those seeking a radiant, well-prepped complexion.complimentary from hourglasscosmetics",
        "nickname": "Parisa",
        "location": "California",
        "created_date": 1744834073659,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551812710,
        "rating": 5,
        "headline": "Would repurchase",
        "comments": "This is such a great product to prep for your make up. I love how at least my skin hydrated, but not looking oily or greasy. The packaging is so luxurious and looks beautiful. The texture of it is a very creamy texture, but it's not too thick, which I really like. Gifted by hourglass cosmetics.",
        "nickname": "Zia",
        "location": "Houston",
        "created_date": 1744806603877,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 551788655,
        "rating": 5,
        "headline": "Lovely primer",
        "comments": "The Illusion priming moisturizer gifted by Hourglass has a lovely texture that hydrates yet feels so light on skin. Love a multi-use product and this moisturizes, primes skin for makeup, and plumps fine lines. Even the packaging is sleek and upscale looking. Great product!",
        "nickname": "Jen",
        "location": "New York, NY",
        "created_date": 1744769309706,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551780655,
        "rating": 5,
        "headline": "Great foundation I definitely plan on buying it!",
        "comments": "I received this Illusion Luminous Glow Foundation complimentary from Hourglass Cosmetics to sample for my honest opinion. I love the way this foundation blended so easily into my skin. I felt it didn't leave me looking dried out or washed out. I had great coverage and the tone was perfect for my olive skin.",
        "nickname": "Amanda",
        "location": "Boston,MA",
        "created_date": 1744750254264,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551688807,
        "rating": 4,
        "headline": "nice",
        "comments": "gifted by hourglass in exchange for a review! this primer/moisturizer is lovely. at first i thought the consistency was too slippery to act as a primer but after a while it dries down a bit and my makeup looks great with it!",
        "nickname": "hima",
        "location": "FL",
        "created_date": 1744629398904,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551630042,
        "rating": 5,
        "headline": "Great for Dry Skin",
        "comments": "I don't normally use primers before my base makeup, I find that my dry skin works well with just sunscreen. This has been a nice luxurious extra step for me as it feels just like moisturizer and that is what I prefer, gifted by Hourglass",
        "nickname": "Waf",
        "location": "San Francisco",
        "created_date": 1744483426437,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551382839,
        "rating": 5,
        "headline": "A must for skin prep before makeup!",
        "comments": "This is so perfect for skin prep before makeup!! I have incredibly dry skin and this makes my skin so dewy and hydrated. Other moisturizers will peel up once I apply makeup and this doesn't at all! Skin prep makes all the difference when it comes to your makeup! This will definitely be a repurchase for me! Complimentary from hourglasscosmetics",
        "nickname": "Nikki",
        "location": "Texas",
        "created_date": 1744322961025,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551339744,
        "rating": 5,
        "headline": "Amazing!",
        "comments": "this priming moisturizer is amazing! I love how it transforms my dry and dull skin and gives me a smooth and flawless base to apply my makeup over. My makeup went on so well and stayed all day and didn't settle into the dry spots on my face. I love this product! I was gifted by Hourglass.",
        "nickname": "Joanne",
        "location": "Texas",
        "created_date": 1744287797114,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551321458,
        "rating": 5,
        "headline": "Love love love",
        "comments": "This is probably one of my new favorite undiscovered products by hourglass. I love that it really does prep your skin super well before putting on your foundation and it really does shine through in your make up routine. Complimentary from hourglass cosmetics.",
        "nickname": "Taylor",
        "location": "San Antonio, Tx",
        "created_date": 1744238817117,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 52,
      "pages_total": 3,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2051198/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        1,
        1,
        0,
        3,
        47
      ],
      "review_histogram": [
        1,
        1,
        0,
        3,
        47
      ],
      "rating_count": 52,
      "review_count": 52,
      "average_rating": 4.81,
      "recommended_ratio": 0.98,
      "media": [
        {
          "id": "551242746",
          "review_id": 551242743,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ddotc61idl7iuzaq5vdh.jpg",
          "headline": "Thick and moisturizing",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Svetta",
          "created_date": 1744153915612
        },
        {
          "id": "551147534",
          "review_id": 551147480,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/yhzcbknc3nuchclderbj.jpg",
          "headline": "Leaves a Smooth Finish",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Jodine",
          "created_date": 1744037848847
        },
        {
          "id": "551147463",
          "review_id": 551147480,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/sabxyzkcdap283higdw0.jpg",
          "headline": "Leaves a Smooth Finish",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Jodine",
          "created_date": 1744037848847
        },
        {
          "id": "551147515",
          "review_id": 551147480,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/eelayusmvsdc4euhfw1g.jpg",
          "headline": "Leaves a Smooth Finish",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Jodine",
          "created_date": 1744037848847
        },
        {
          "id": "551109289",
          "review_id": 551109304,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/kyqryipahbhfsutxr1vr.jpg",
          "headline": "Great priming moisturizer!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Joann",
          "created_date": 1743964981532
        },
        {
          "id": "551109305",
          "review_id": 551109304,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/mwdqcj7xvdjjtkdynkky.jpg",
          "headline": "Great priming moisturizer!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Joann",
          "created_date": 1743964981532
        },
        {
          "id": "551029278",
          "review_id": 551029257,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/anr713yopthpujverhl6.jpg",
          "headline": "Great product",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Tatiana",
          "created_date": 1743780390126
        },
        {
          "id": "551028453",
          "review_id": 551028546,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/mbodmzdi7x7yhpcvhvfv.jpg",
          "headline": "Great!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Amanda",
          "created_date": 1743779104848
        }
      ],
      "faceoff_positive": {
        "comments": "**purchased with my own money**\n\nI purchased this product with my own money from Ulta. I am a licensed Esti as well as freelance makeup artist, so I have used a good amount of products in my 20+ year career.\n\nFor reference, I have drier skin with pores in my t-zone that are more visible than anywhere else. My t-zone also gets a bit oily throughtout the day, but nothing to the extent that I  must powder or look super greasy. I will, however, have to powder in the summer. It just is what it is, no matter what I use. \n\nThis product feels really pretty and extremely comfortable on the skin once it dries down. I've tested it for about two+ weeks now and it plays well with all of my other products used, even my mineral spf. However, I do not use this as a primary moisturizer, as I do not think it's hydrating enough for my dry skin on its own. I'm ok with that because this works beautifully to prime and, as previously stated, it sits well on top of all of my other skincare. I apply this last over my normal AM routine and then I apply my makeup. I have found this has meshed well with both my water and silicone based foundations, tinted moisturizers and concealers. I also believe that it makes a substantial difference in the way my makeup looks and extends the wear-time. My skin/makeup still looks really pretty at the end of the day. \n\nI could actually see all skin types enjoying this because it doesn't feel like a moisturizing cream or lotion, it feels more like a primer. It's hard to explain, but it's a hybrid that's leaning more on the primer side . I would say that it feels more like a putty-like lotion-primer than moisturizer, so if you lean dry like me and think you can skip a step, you may be disappointed. When I say putty-like, it's not stiff. It is NOT a bad thing. I just don't want anyone thinking it's going to feel like a cream and spread like a cream. It does not spread like a traditional lotion or moisturizer, again, it's stiffer (but not in a bad way). I wish I could explain the texture a bit better, but it's difficult to describe.\n\nOverall, I do find myself reaching for this more frequently. I think with summer coming, I may have to use my stick primer on my nose to control the oils, but I'll have to determine that when it's warmer. It is typical for me though with any primer in the summer so thats why I mention it. That's not a deal breaker for me when considering repurchase this product (which I will do).\n\nI did knock a star off because I feel the cost is a bit excessive for what it is. I also don't go by the bottle design. While it may look pretty on a vanity or in IG pictures, just like people, it's what's inside that counts. \n\nI hope this review is helpful to those on the fence. I saw there were many incentivized reviews so I thought I'd write one up as someone who purchased  it.",
        "headline": "Very Pretty and Effective Primer",
        "rating": 4,
        "ugc_id": 552779168
      },
      "faceoff_negative": {
        "comments": "The product seemed great in the store in my hand. However, when used with makeup in my face, it separated the makeup and felt cakey.",
        "headline": "Not what I expected.",
        "rating": 2,
        "ugc_id": 554102286
      },
      "name": "Illusion Priming Moisturizer",
      "native_review_count": 52,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 0,
      "locale": "en_US"
    }
  }
}