{
  "product_id": "pimprod2047201",
  "product_url": "https://www.ulta.com/p/true-skin-serum-concealer-pimprod2047201",
  "extracted_at": "2025-09-23T05:33:53.008055+00:00",
  "product_name": "ILIATrue Skin Serum Concealer",
  "brand": "ILIA",
  "categories": [
    "Home",
    "Makeup",
    "Face",
    "Concealer"
  ],
  "category_keys": [
    "home",
    "makeup",
    "face",
    "concealer"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "32.00",
  "availability": "in_stock",
  "rating_avg": "4.5",
  "rating_count": "2056",
  "images": [
    "https://media.ulta.com/i/ulta/2629175?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2629175?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629175_sm?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629175_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629175_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629175_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629175_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629175cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629175cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2629175cm_vid01/thumbs/5ba2a300-2c35-4e35-aa02-661a37d46b1c?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganGive BackILIA True Skin Serum Concealer with Vitamin C combines smoothing skincare benefits with weightless medium coverage for a your-skin-but-better look.",
  "details": "DetailsBenefitsNatural finishMedium coverageBrighteningBlends seamlesslyMakeup + skincare in one easy step20 shadesFormulated without fragrance, silicone or gluten2023 Allure's Readers' Choice AwardKey IngredientsStabilized Vitamin C - Helps visibly brighten, reduce fine lines, and promote a more even skin toneMastic - Helps refine the appearance of skin throughout the dayPersian Silk Tree Bark - Potent skin protector that supports smooth, supple skinItem 2629175How To UseFor best results, use immediately after ILIA True Skin Serum Foundation. Apply three dots of concealer below the eye and around any areas you would like to even out skin tone. Blend with your fingertips or complexion brush. Finish by gently pressing product into skin with your ring finger.IngredientsAloe Barbadensis Leaf Juice, Tetradecane, Hydrogenated Polydecene, Glycerin, Disteardimonium Hectorite, Polyglyceryl-3 Diisostearate, Decyl Isostearate, Isostearyl Isostearate, Isostearic Acid, Silica, Propanediol, Sorbitan Sesquiisostearate, Polyglyceryl-6 Polyricinoleate, Gluconolactone, Lauroyl Lysine, Albizia Julibrissin Bark Extract, Magnesium Sulfate, Sodium Chloride, Zinc Stearate, Hydrogenated Lecithin, Tetrahexyldecyl Ascorbate, Sodium Benzoate, Dodecane, Caprylic/Capric Triglyceride, Hexadecane, Pistacia Lentiscus (Mastic) Gum, Calcium Gluconate, Ethylhexylglycerin, Darutoside, Phenethyl Alcohol. May Contain: CI 77891 (Titanium Dioxide), CI 77491, CI 77492, CI 77499 (Iron Oxides).Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "For best results, use immediately after ILIA True Skin Serum Foundation. Apply three dots of concealer below the eye and around any areas you would like to even out skin tone. Blend with your fingertips or complexion brush. Finish by gently pressing product into skin with your ring finger.",
  "ingredients": [
    "Aloe Barbadensis Leaf Juice",
    "Tetradecane",
    "Hydrogenated Polydecene",
    "Glycerin",
    "Disteardimonium Hectorite",
    "Polyglyceryl-3 Diisostearate",
    "Decyl Isostearate",
    "Isostearyl Isostearate",
    "Isostearic Acid",
    "Silica",
    "Propanediol",
    "Sorbitan Sesquiisostearate",
    "Polyglyceryl-6 Polyricinoleate",
    "Gluconolactone",
    "Lauroyl Lysine",
    "Albizia Julibrissin Bark Extract",
    "Magnesium Sulfate",
    "Sodium Chloride",
    "Zinc Stearate",
    "Hydrogenated Lecithin",
    "Tetrahexyldecyl Ascorbate",
    "Sodium Benzoate",
    "Dodecane",
    "Caprylic/Capric Triglyceride",
    "Hexadecane",
    "Pistacia Lentiscus (Mastic) Gum",
    "Calcium Gluconate",
    "Ethylhexylglycerin",
    "Darutoside",
    "Phenethyl Alcohol. May Contain:"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "makeup",
      "face",
      "cosmetics"
    ],
    "product_type": [
      "serum",
      "foundation"
    ],
    "finish": [
      "sheer",
      "medium coverage",
      "creamy"
    ],
    "ingredients": [
      "sulfate-free"
    ],
    "brand": [
      "clean-beauty",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "natural",
      "brightening"
    ],
    "skin_type": []
  },
  "reviews": {
    "product_id": "pimprod2047201",
    "total_reviews": 2056,
    "reviews": [
      {
        "review_id": 562887132,
        "rating": 3,
        "headline": "Yes",
        "comments": "The testers in the store do not match the \nColors . They may be old",
        "nickname": "Chris",
        "location": "Buffalo NY",
        "created_date": 1757113053156,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559893551,
        "rating": 1,
        "headline": "not good",
        "comments": "this concealer is actually horrible. its too wet, doesnt dry down fully, creases horribly, oxidizes and just does not look good. even with powder it wont set down",
        "nickname": "charlotte",
        "location": "new york",
        "created_date": 1754841643993,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 554381876,
        "rating": 4,
        "headline": "THIS IS IT",
        "comments": "paired it with the ilia serum foundation and it's perfect. Not usually a concealer girly but I developed some melasma (in the process of treating) from hormones breastfeeding and I needed something extra in addition to foundation to cover those spots in the meantime. This completely covers it oh my upper lip and mooostly covers it oh my cheeks -definitely not noticeable to anyone but me unless you were an inch from my face. All the better covered when I use the serum foundation first but even on its own I feel the melasma is hidden enough that I feel confident leaving the house. Also, I never was one to put concealer under my eyes but dang this really brightens up my face and I wish I'd started using it under my eyes sooner! \n\nThe serum + concealer stay on all day so far for me. And gives you such a dewy glow! 4 stars only because it's hard to wash it all off - I had to wash my fade multiple times to get it clean. This may just be the serum, not sure if it's the concealer too or both. Still a great product and will keep using!! Just have to cleanse really well.",
        "nickname": "Hayley",
        "location": "PCB, FL",
        "created_date": 1748828911659,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553284663,
        "rating": 4,
        "headline": "Beautiful formula but the color match is off",
        "comments": "I bought this in the shade Suma which it says is light with cool undertones and the photo shows this looking the same color as my Tarte shape tape concealer in 16N. This is so orange and dark! I think the formula is amazing but either I got a mislabeled batch or their color descriptions are just very off. It looks way darker and warm toned in the tube, I swatched it on my hand and it looks like a bad fake tan for my skin tone. Now I have to return this and try again for the right shade which I never have to do. Their serum skin tint however is very true to the description and photos",
        "nickname": "B",
        "location": "NJ",
        "created_date": 1747176526149,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553027385,
        "rating": 5,
        "headline": "Yes",
        "comments": "This was so good i love it",
        "nickname": "Shey",
        "location": "Midland tx",
        "created_date": 1746635118004,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550917299,
        "rating": 1,
        "headline": "Not that good",
        "comments": "Wanted to love this concealer but it looks cakey and emphasizes my texture. Not enough coverage and it oxidized. It also has a weird smell. Not worth the price.",
        "nickname": "H",
        "location": "New york",
        "created_date": 1743698614644,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 1
      },
      {
        "review_id": 549812730,
        "rating": 5,
        "headline": "Love this product.",
        "comments": "Great product !!",
        "nickname": "Jill",
        "location": "Gainesville,Ga",
        "created_date": 1742922454183,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549761516,
        "rating": 5,
        "headline": "Great product!",
        "comments": "I have been purchasing this product for a couple years now. I love the texture and how creamy it goes on your skin. A downside is that there isn't much in the bottle. You have to purchase it a lot because it runs out quickly and it's really expensive.",
        "nickname": "Yscott",
        "location": "Greenville, SC",
        "created_date": 1742823242034,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 548863105,
        "rating": 2,
        "headline": "Wanted to love it but it sucked",
        "comments": "As someone with really pigmented eyebags, I found this concealer to be very light, with almost no coverage. If you are looking for a concealer that is SUPER light, this is an okay one because it is still a little oily. For the price, I believe it is not worth it.",
        "nickname": "Unknown",
        "location": "Florida",
        "created_date": 1742130784678,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 548718937,
        "rating": 3,
        "headline": "Patchy & Oxidizes",
        "comments": "I used the shade match to pick my shade and unfortunately, the shade oxidizes and turns orange. I have not found the best way to blend this out, but I do use my fingers to tap it in. It looks very cakey under my eyes but provides nice natural coverage for blemishes. I would recommend this if you like light coverage and can find a shade that actually matches. I do not think this is the best for the under-eye area.",
        "nickname": "",
        "location": "MA",
        "created_date": 1741963282107,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547465058,
        "rating": 2,
        "headline": "bummer!",
        "comments": "this was thicker than i thought it would be. the color match was a huge miss. either too warm or too pink. and it did not do my drier skin any favors. PASS.",
        "nickname": "claire",
        "location": "maine",
        "created_date": 1740666026529,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547110655,
        "rating": 5,
        "headline": "I hate foundation",
        "comments": "I hate wearing makup on my face. But I needed concealer pretty bad, and I fell in love. Very lightweight and covers face smoothly. Best concealer I've purchased. Does not cover a lot but it does work if you like light coverage that does not cake on your face.",
        "nickname": "Anna",
        "location": "Los Angeles, CA",
        "created_date": 1740204169200,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 546106533,
        "rating": 1,
        "headline": "emphasized wrinkles i didn't even know i had",
        "comments": "I bought this concealer because it is a \"serum\" concealer and I thought it would work for my dry skin, but I was very wrong. It clinged to every dry patch I have no matter how well I moisturized, it emphasized wrinkles that I didn't even know I had, it creased almost immediately, it looked super cakey and did not want to blend.",
        "nickname": "gyf2003",
        "location": "Virginia",
        "created_date": 1739035207425,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 542658429,
        "rating": 4,
        "headline": "Nice product",
        "comments": "I like this concealer.  It has nice consistency but I feel it does not cover up my under-eye issues as much as I would like it to, hence the 4 stars. When I use it under my eyes I end up having to use a different concealer to cover the hollows.   I am using it as a base for eye shadow.  I might have to try another color.",
        "nickname": "Jan",
        "location": "Northern NJ",
        "created_date": 1736620716297,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 533432130,
        "rating": 1,
        "headline": "Disappointing",
        "comments": "I adore the skin tint, but this concealer was a let down. It is super drying and accentuates any textural issues. My undereyes looked better using only the skin tint. Returning.",
        "nickname": "MishyMash",
        "location": "Marysville, WA",
        "created_date": 1726550110191,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 1
      },
      {
        "review_id": 532171500,
        "rating": 1,
        "headline": "fair girls stay away",
        "comments": "was super excited to try this concealer but sadly even the lighest shade is 2 shades too dark and pulls orange on me. if youre super fair and cool toned, id skip this one ^^",
        "nickname": "Lili",
        "location": "Springfield, MO",
        "created_date": 1725608775465,
        "bottom_line": null,
        "helpful_votes": 19,
        "not_helpful_votes": 1
      }
    ],
    "paging": {
      "total_results": 16,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        42,
        58,
        131,
        369,
        1456
      ],
      "review_histogram": [
        42,
        58,
        131,
        369,
        1456
      ],
      "rating_count": 2056,
      "review_count": 2056,
      "average_rating": 4.53,
      "recommended_ratio": 0.71,
      "media": [],
      "faceoff_positive": {
        "comments": "Now First of all I want to thank wonderful Gigi from Ilia team for helping me find my shade and being so kind And actually finding my exact shade match! I am having a greenish, greyish, yellowish olive skin tone, difficult to find a shade match to. Neutrals make me pink, warms and goldens make me orange. But this shade is a perfect match that makes me Me! Now a little about my skin - I have combination skin - with very oily and very dry areas. I don't use a foundation on a daily basis, only a cc cream which has 0-2 coverage and an extremely limited shade range. So I needed a multitasking, lightweight, extremely natural looking product, that would replace this cc, blur my pores, even out my skin tone, sometimes spot conceal and match my shade! I was very lucky with the shade, now lets discuss the texture of this product. The texture of my concealer is like lightweight, whipped moussey cream. Veeery lightweight.  Airy I would say. And I was so happy when I swatched it for the first time, but so devastated when I applied it on my skin! It brought up the texture of my skin that I didn't notice before, looked dry and patchy and very cakey! I was sooo disappointed as I had had high hopes for this concealer. I watched girls apply it and look glowing, flawless and natural and was so puzzled! Why mine looks different? Is my product faulty?  Now the most important part, which will allow you to understand that it wasn't the concealer to blame - when I ordered this concealer, my skin was very dehydrated. I have dry areas and very oily areas - but dehydration was all over after corona and concealer looked cakey all over.  I don't know what I was excepting with my thirsty-after-corona skin, maybe I wasn't aware of How dehydrated my skin became.  With a transparent  cc cream looking like moisturizer its different to tell. I didn't know back then my regular moisturizer wasn't enough any more. And if this concealer had looked good on me, it wouldn't show me how dehydrated my skin actually was.  So I took it as a sign and took my time to recover my skin barrier and get rid of dehydration. After achieving it, but still not having high hopes (but being in love with the shade) I gave this concealer one more try. And WOW! I looked FLAAWLESSS! The first thing I noticed - concealer hid tiny wrinkles I get on my cheeks, around my nose area when I smile. They looked unnoticeable only and only when I had no make up on. They became more prominent even with CC cream. But this concealer actually melted into my skin and even concealed the texture! The concealer itself looks velvet matte on me for the first two hours. Then my natural oils make this concealer more glowy, but absolutely seamless - it doesn't break up or separate at all, it looks incredible - like my skin is just fresh and glossy. I apply it with a sponge from one Clinique powder  ( it acts like a beauty blender) and this concealer applied all over my skin - blurs my pores and uneven skin tone like a dream!  And looks absolutely natural, which is my goal as minimal makeup and  \"nothing is better than beauty of naked skin\" gal.  Can I use it for spot concealing? Yes, press it into skin with a sponge and the coverage will be just perfect! Does it erase the signs of sleepless nights under my eyes? Perfectly in just two layers - and oh how wonderfully it layers! I feel like layers just dissolve one into another leaving just more pigment there, but no product itself! Even after hours of wear, never looking cakey. I use it on the go and I don't need any other complexion products. Now you wouldn't expect from a product like this an insane wear time, on my oily-combo skin it lasts to midday, then it melt away just a little bit and I touch it up a little, but I'm not concerned about it because they way it wear off is beaaaatiful. It just melts more and more into the skin, not separating, not drying up, nothing. Its like it just becomes transparent over time, leaving your skin healthier and more perfect. So I can easily go even without touch ups and be sure that I look as fresh as in the morning! Am I happy with my purchase? Very! Because the health of your skin is the most important thing and this concealer can just indicate for me the moment when my skin is in need of a little more moisture - and I'm grateful to it for this feature! It also accommodates all my needs, so if you are a fussy makeup lover like me, you're  gonna love it! I would recommend it to anyone, who takes basic care of their skin and I am very glad I took proper care of mine and gave it a second chance, cause now I can't  be without it! Thank you Ilia! (A photo of me after approx 3-4 hours of wear)",
        "headline": "This will be the most detailed review for this concealer pro",
        "rating": 4,
        "ugc_id": 527301471
      },
      "faceoff_negative": {
        "comments": "First off, the pluses. This concealer has a fantastic texture, great staying power, and it's very versatile.  It can me used as a minimalist base, spot coverage, under eye concealer, an eyelid primer, or even a brightening contour.  As always, I love the skincare actives. Personally, I don't use the concealer all that much.  On a day to day basis, I just layer an extra bit of the skin tint where I have redness, dark spots, scars etc and around my eyes. I do use the concealer if I'm skipping a base, or if I'm attending an event when there will probably be a lot of photos taken.   Which is where the color options come into play for me.  I have tried four concealers, and I'm not convinced there is a good option for medium NEUTRAL skin tones (I wear shade ST9 or SF6, or Beyond C in Tone 2).  I believe I lie somewhere in the 1.75- 2.75 range, and all of these seem to have a yellow base to me.   At the suggestion of customer service, I went all the way down to Suma 1.5, which matches the tone of my skin perfectly, but if I use anything more than the tiniest bit of it, it really artificially lightens my skin tone and makes my face look a lot lighter than my body. Not a huge deal given the frequency with which I use it, but I would admittedly probably use it more if there was something close to my tone in the right depth. I think for anyone who doesn't have this specific shade issue, the product itself is a very good one compared to other concealers on the market. At customer services",
        "headline": "Great concealer, not my favorite color choices",
        "rating": 3,
        "ugc_id": 527301789
      },
      "native_review_count": 16,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 2040,
      "locale": "en_US"
    }
  }
}