{
  "product_id": "pimprod2047219",
  "product_url": "https://www.ulta.com/p/fullest-volumizing-mascara-pimprod2047219",
  "extracted_at": "2025-09-23T03:57:38.916348+00:00",
  "product_name": "ILIAFullest Volumizing Mascara",
  "brand": "ILIA",
  "categories": [
    "Home",
    "Makeup",
    "Eyes",
    "Mascara"
  ],
  "category_keys": [
    "home",
    "makeup",
    "eyes",
    "mascara"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "29.00",
  "availability": "in_stock",
  "rating_avg": "4.1",
  "rating_count": "788",
  "images": [
    "https://media.ulta.com/i/ulta/2629298?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2629298?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629298_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629298_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629298_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629298_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629298_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629298_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2629298_vid01/thumbs/019c4c2e-6f58-44cd-901a-54a596b23962?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeGive BackAward-winning ILIA Fullest Volumizing Mascara delivers weightless fluffy volume from root to tip without flaking or smudging.",
  "details": "DetailsBenefitsViolin-shaped brush with flexible nylon micro-bristlesThickens + definesBuildable, nourishing formulaFlake + smudge-resistantRemoves easily with cleanserSafe for sensitive eyes + contact lensesFormulated without fragranceNew lighter, mono-material tube reduces carbon emissions by 39% and waste by up to 22%**Compared to previous packaging, based on Life Cycle Assessment data from Bluebird Climate2021 Refinery29 Beauty Innovator AwardKey IngredientsArginine (Keratin) - Haircare hero that supports visibly fuller lashesProvitamin B5 - Nourishes to promote thicker-looking lashesWeightless Wax Blend - Adds full, flexible body without the weightResearch Results100% agreed it made their lashes look fuller and more voluminous100% agreed it didn't feel heavy on their lashes97% agreed it didn't flake or crumble94% agreed it didn't smudgeIn a consumer perception test with 32 participantsItem 2629298How To UseWipe off any excess product from the brush. Nestle the brush into the base of lashes and glide upwards, wiggling from side to side. Apply several coats for more volume and definition. Use the tip of the brush to separate and define hard-to-reach lashes.IngredientsAqua/Water/Eau, Cera Alba/Beeswax/Cire d'abeille, Synthetic Beeswax, Glyceryl Stearate, Glycerin, Cera Carnauba/Copernicia Cerifera (Carnauba) Wax/Cire de Carnauba, Dimer Dilinoleyl Dimer Dilinoleate, Stearic Acid, Palmitic Acid, Ethylhexyl Polyhydroxystearate, Polyglyceryl-6 Polyricinoleate, Jojoba Esters, Acacia Senegal Gum, Panthenol, Benzyl Alcohol, Caprylyl Glycol, Sodium Hydroxide, Xanthan Gum, Caprylhydroxamic Acid, Arginine, Lauric Acid, Myristic Acid, Arachidic Acid, Oleic Acid, Tocopherol. May Contain: CI 77499 (Iron Oxide).Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Wipe off any excess product from the brush. Nestle the brush into the base of lashes and glide upwards, wiggling from side to side. Apply several coats for more volume and definition. Use the tip of the brush to separate and define hard-to-reach lashes.",
  "ingredients": [
    "Aqua/Water/Eau",
    "Cera Alba/Beeswax/Cire d'abeille",
    "Synthetic Beeswax",
    "Glyceryl Stearate",
    "Glycerin",
    "Cera Carnauba/Copernicia Cerifera (Carnauba) Wax/Cire de Carnauba",
    "Dimer Dilinoleyl Dimer Dilinoleate",
    "Stearic Acid",
    "Palmitic Acid",
    "Ethylhexyl Polyhydroxystearate",
    "Polyglyceryl-6 Polyricinoleate",
    "Jojoba Esters",
    "Acacia Senegal Gum",
    "Panthenol",
    "Benzyl Alcohol",
    "Caprylyl Glycol",
    "Sodium Hydroxide",
    "Xanthan Gum",
    "Caprylhydroxamic Acid",
    "Arginine",
    "Lauric Acid",
    "Myristic Acid",
    "Arachidic Acid",
    "Oleic Acid",
    "Tocopherol. May Contain:"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "makeup",
      "eyes",
      "eye",
      "cosmetics"
    ],
    "product_type": [
      "mascara"
    ],
    "skin_type": [
      "dry",
      "sensitive"
    ],
    "finish": [
      "dewy",
      "sheer",
      "medium coverage"
    ],
    "ingredients": [
      "synthetic"
    ],
    "brand": [
      "clean-beauty",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "hydrating"
    ]
  },
  "reviews": {
    "product_id": "pimprod2047219",
    "total_reviews": 788,
    "reviews": [
      {
        "review_id": 555669830,
        "rating": 5,
        "headline": "Love it",
        "comments": "By far my favorite mascara, have tried many others and continuously go back to this one",
        "nickname": "Lindsey",
        "location": "Birmingham, AL",
        "created_date": 1750521183685,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555081757,
        "rating": 1,
        "headline": "Don't waste your money!",
        "comments": "Overpriced! thought i was buyibg their another mascera which is good but this a waste of money. It just makes you look like a raccoon",
        "nickname": "kaylee",
        "location": "kentucky",
        "created_date": 1749782488917,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554824854,
        "rating": 5,
        "headline": "A MUST for sensitive eyes",
        "comments": "I was skeptical at first but this has been the first mascara I found that doesnt hurt my eyes, is actually fragrance free, AND gives great length and definition. While the applicator can be a bit bulky and for best results two coats are a must, the formula is more than worth it. It is so gentle on my sensitive skin and after 3 weeks of nonstop use, it remains flattering and comfortable to wear.",
        "nickname": "Izzy",
        "location": "Phoenix, AZ",
        "created_date": 1749544663320,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553191676,
        "rating": 1,
        "headline": "You are better off with supermarket mascara",
        "comments": "Wanted to like it as I love their lip glosses/tints, but this was a clumpy mess. The clumps got in my eyes, and it was very uncomfortable. Now, I am not sure if it was old or that's the way it is normally.",
        "nickname": "Lee",
        "location": "Los Angeles",
        "created_date": 1747004172034,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552828337,
        "rating": 2,
        "headline": "I wanted to love it",
        "comments": "Pros it washes off easily \nCons super clumpy, bleeds onto my face if I sweat which is a possibility every day with my activity levels, hard to apply cleanly as it gets all over my lids with this brush or formula. \nI will try the limitless and see if I get better results. Sad I didn't return this.",
        "nickname": "Sarah",
        "location": "Tacoma WA",
        "created_date": 1746371906051,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 546855006,
        "rating": 3,
        "headline": "Returned",
        "comments": "I returned this product, it didn't do much but put extra color on my lashes",
        "nickname": "M",
        "location": "Portland, OR",
        "created_date": 1739865772568,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543686743,
        "rating": 5,
        "headline": "The BEST",
        "comments": "I have tried EVERYTHING from Cover Girl to Chanel and i have to day this is tge BEST mascara i have used.  The brush is the important part in a mascara and this one gets every single lash even the little ones!! It is buildable without looking clumpy. I love it !!!!",
        "nickname": "Makeup Girl",
        "location": "New Orleans. LA",
        "created_date": 1737484333942,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542200720,
        "rating": 5,
        "headline": "The best",
        "comments": "I have some seriously long eyelashes and this mascara helps take them to the next level. I dont find that it clumps or smudges at all. I was hesitant to stray from Tarte Big Ego mascara but I was turned on to this because its clean beauty. It doesnt smudge, flake or clump on my eyelashes and I find it very easy to wash off/remove, which is fine, I dont personally like waterproof mascaras. I do use a mascara primer and pretty much always have, maybe thats the secret to keeping all that from happening? But I truly think this is just a wonderful product and I would recommend to someone and will be repurchasing",
        "nickname": "Chelle",
        "location": "PA",
        "created_date": 1735940089524,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542160897,
        "rating": 2,
        "headline": "Not for me!",
        "comments": "Was really excited for this mascara, but everytime I use it its super clumpy and I have to brush out my lashes afterward. The formula is nice is looks good after all my work, but I feel like i should have to brush out clumps everytime. There are way better mascaras out there.",
        "nickname": "Laura",
        "location": "Houston, TX",
        "created_date": 1735860610136,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541947072,
        "rating": 5,
        "headline": "Thick lashes!",
        "comments": "Gives me thick black lashes that are longer looking but not too long.  I like it better than the ilia lengthening mascara that I use to separate my lashes if it gets clumpy.",
        "nickname": "Momomiss",
        "location": "NY",
        "created_date": 1735480128440,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537394068,
        "rating": 1,
        "headline": "Don't buy",
        "comments": "This is the most frustrating mascara I've ever used. I keep trying it hoping to change my mind but it's insanely clumpy and smudges instantly after applying slowly leaving a mess around my eyes. You would think the smudging means it's easy to remove but that's also not true",
        "nickname": "",
        "location": "Virginia",
        "created_date": 1730904266130,
        "bottom_line": "No",
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 537255678,
        "rating": 5,
        "headline": "great stuff!",
        "comments": "It darkens my lashes and they look so good! also stays on all day. no smudging.",
        "nickname": "Beth",
        "location": "Chicago, IL",
        "created_date": 1730661316040,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537110946,
        "rating": 2,
        "headline": "So so mascara",
        "comments": "giving this product three stars. I really had high hopes for this mascara, it does lengthen and make lashes fuller the product is very wet though, and it gets all over my eyelids. It smudges as soon as you blink.",
        "nickname": "grace",
        "location": "Pittsburgh, PA",
        "created_date": 1730388672793,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 536599899,
        "rating": 2,
        "headline": "Not worth price",
        "comments": "The mascara doesnt do much, just makes my eyelashes darker. No additional volume or lift. The brush is also an awkward size and shape so its so easy to hit my eyelid. It takes a while to dry too, but it smears if you get It under your eye. Just not worth how much It costs… disappointed",
        "nickname": "Annie",
        "location": "Cleveland OH",
        "created_date": 1729734542458,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 536434224,
        "rating": 3,
        "headline": "Just not worth the price",
        "comments": "I bought this since its a cleaner ingredient mascara but it just is not worth the price. Didnt do anything for my lashes except maje them black and add a little length.",
        "nickname": "Kae",
        "location": "MO",
        "created_date": 1729461550140,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 534769807,
        "rating": 1,
        "headline": "Spend your $$ on a better mascara",
        "comments": "Main complaint is how much this mascara burned my eyeballs. I would rarher pour an entire bottle of the most spicy shampoo money can buy, and pour a bottle of THAT into each of my eye sockets before ever using this mascara again.",
        "nickname": "Jennycakes",
        "location": "Alaska",
        "created_date": 1727483196054,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 532946405,
        "rating": 2,
        "headline": "Expectations were too high",
        "comments": "I had really high hopes about this mascara from reading the reviews. I like how the mascara has cleaner ingredients and is easy to remove. However, this mascara smudges on my eyelids. My mascara looks completely different from the time I apply to the time I take it off. Wish it didn't smudge or weigh my lashes down throughout the day",
        "nickname": "Dani P",
        "location": "NY",
        "created_date": 1726193558033,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 17,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        75,
        54,
        59,
        159,
        441
      ],
      "review_histogram": [
        75,
        54,
        59,
        159,
        441
      ],
      "rating_count": 788,
      "review_count": 788,
      "average_rating": 4.06,
      "recommended_ratio": 0.29,
      "media": [],
      "faceoff_positive": {
        "comments": "As a beauty enthusiast, I've tried my fair share of mascaras. But let me tell you, the ILIA Fullest Volumizing Mascara is a game-changer! From the moment I swiped it on, I knew I had found my new lash BFF.  The formula is lightweight and glides on effortlessly without feeling heavy or clumpy. One coat gives a natural look, but two coats? Oh, honey! That's where the magic happens. My lashes go from \"meh\" to \"wowza!\" in seconds. And the best part? No clumps, no spider legs—just beautifully separated, defined lashes.  But let's talk results. My lashes practically touch my eyebrows (okay, maybe not that extreme, but you get the idea). The volumizing effect is unreal! And the length? I've got the kind of lashes that usually play hide-and-seek, but ILIA coaxed them out of hiding. They're longer, fluttery, and oh-so-flirty.  Worried about smudging? Fear not! This mascara doesn't flake or smudge. I've worn it from morning meetings to late-night karaoke sessions, and my lashes stayed put. Plus, it's a breeze to remove—no tugging, no raccoon eyes.  In summary, the ILIA Fullest Volumizing Mascara is a must-try for anyone who wants va-va-voom lashes without sacrificing clean beauty. Trust me, you won't be disappointed!  Disclaimer: I received a full-size sample of the ILIA Fullest Volumizing Mascara from PinchMe, but my love for it is 100% genuine.",
        "headline": "A Lash Transformation",
        "rating": 5,
        "ugc_id": 527309595
      },
      "faceoff_negative": {
        "comments": "I was super excited to try this new product, the  fullest volumizing mascara but I have to say that personally I do not like this at all. I've tried it about 5 times now and it's so different than the original and doesn't even come close to how great the original is.  The brush is extremely large specially compared to the original mascara. It makes it incredibly difficult to put the mascara on my lashes and no matter how hard I try, the mascara gets all over my eye lids which I've never had that issue with any other mascara in the past but specifically the original mascara from Ilia which I've been using for 3-4 years now. The original mascara I can easily apply in just a few seconds with one, sometimes 2 layers but this new one I have to keep applying  over and over, like 4 times at least to get the mascara onto my lashes. Even with all the layers of mascara I don't see any extra volume with my lashes.  I'm a quick makeup face woman, I don't use alot, I like it quick and easy and to just be done. This takes much longer than I'm used to and afterwards I have to clean all the mascara off my eyelids which I find to be a waste as well as just straight up annoying and time consuming.  My last complaint is whenever I wash the original mascara off in the shower or over the sink, I've never had any issues with the mascara not coming off my skin (under/around my eyes specifically). I wash with my face wash and it's all gone, done, complete and clean. This new stuff is so hard to completely get off! I do the exact same thing I always do when washing my face and when I'm done I look like a raccoon! No matter how well I think I've cleaned around my eyes or scrubbed/rubbed (which isn't good in that area!) it's still there around my eyes!  I wasn't expecting this mascara to be so much different than the original but it is! I will not be getting this mascara again and wish I had just stuck with the original! Waste of money and product.",
        "headline": "I'll stick with the original!",
        "rating": 1,
        "ugc_id": 527311022
      },
      "name": "Fullest Volumizing Mascara",
      "native_review_count": 17,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 771,
      "locale": "en_US"
    }
  }
}