{
  "product_id": "pimprod2047202",
  "product_url": "https://www.ulta.com/p/bright-start-retinol-alternative-brightening-eye-cream-pimprod2047202",
  "extracted_at": "2025-09-23T03:26:57.877853+00:00",
  "product_name": "ILIABright Start Retinol Alternative Brightening Eye Cream",
  "brand": "ILIA",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Cream"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "eye-cream"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "46.00",
  "availability": "in_stock",
  "rating_avg": "4.5",
  "rating_count": "1310",
  "images": [
    "https://media.ulta.com/i/ulta/2629360?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2629360?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629360_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629360_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629360_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629360_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629360_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629360_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629360_alt07?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2629360_vid01/thumbs/cb9f2f55-a969-4484-9991-e2eef501e6cc?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganGive BackILIA Bright Start Retinol Alternative Brightening Eye Cream is a morning ritual must-have, depuffing tired eyes and layering seamlessly under makeup.",
  "details": "DetailsBenefitsWeightlessly hydratesBrightens with light-reflecting pearlPlant-based retinol alternative smooths over timeCooling ceramic tip helps depuffPerfect prep step before makeupSafe for sensitive eyes and skinDermatologist + ophthalmologist-testedFormulated without fragrance or silicone2023 Allure Best of Beauty AwardKey IngredientsSea Fennel Extract - Sustainably sourced retinol alternative that visibly brightens, firms, and smooths without the drawbacks of traditional retinol, which can be too harsh for sensitive skinUpcycled Avocado Extract - Zero-waste active that reduces the look of dark circles and puffinessCaffeine + Peptides - Skincare powerhouses that visibly depuff and revive tired eyesResearch ResultsClinically proven to hydrate skin and reduce dark circles*83% said the appearance of fine lines and wrinkles was reduced***100% said concealer applied more smoothly**93% said under eyes felt smoother***91% said under eyes were brightened****In a 6-week instrumental study of 30 women ages 39-65.**In a clinical study of 52 women ages 39-65. Results after 4 weeks, ***after 6 weeks.Item 2629360How To UseSqueeze the tube to apply a small amount below your eyes. Switch to the cooling side of the ceramic tip. Move in slow arcs from the outer corner of the eye in, and up along the brow bone. Gently pat with fingers to help any excess absorb. Wear alone or under ILIA True Skin Serum Concealer with Vitamin C.IngredientsAqua/Water/Eau, Caprylic/Capric Triglyceride, Persea Gratissima (Avocado) Oil, Propanediol, Glycerin, Pentylene Glycol, Cetearyl Alcohol, Candelilla/Jojoba/Rice Bran Polyglyceryl-3 Esters, Jojoba Oil/Macadamia Seed Oil Esters, Brassica Campestris/Aleurites Fordi Oil Copolymer, Silica, Glyceryl Stearate, Sodium Polyacryloyldimethyl Taurate, Behenyl Alcohol, Caffeine, Moringa Oil/Hydrogenated Moringa Oil Esters, Sodium Stearoyl Lactylate, Mica, Hydroxyacetophenone, Caprylyl Glycol, 1,2-Hexanediol, Squalene, Caprylic/Capric/Succinic Triglyceride, Xanthan Gum, Citric Acid, Sodium Phytate, Phytosteryl Macadamiate, Persea Gratissima (Avocado) Fruit Extract, Crithmum Maritimum Extract, Phytosterols, Tocopherol, Acetyl Hexapeptide-8, Sodium Citrate, CI 77891 (Titanium Dioxide), CI 77491 (Iron Oxide).Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Squeeze the tube to apply a small amount below your eyes. Switch to the cooling side of the ceramic tip. Move in slow arcs from the outer corner of the eye in, and up along the brow bone. Gently pat with fingers to help any excess absorb. Wear alone or under ILIA True Skin Serum Concealer with Vitamin C.",
  "ingredients": [
    "Aqua/Water/Eau",
    "Caprylic/Capric Triglyceride",
    "Persea Gratissima (Avocado) Oil",
    "Propanediol",
    "Glycerin",
    "Pentylene Glycol",
    "Cetearyl Alcohol",
    "Candelilla/Jojoba/Rice Bran Polyglyceryl-3 Esters",
    "Jojoba Oil/Macadamia Seed Oil Esters",
    "Brassica Campestris/Aleurites Fordi Oil Copolymer",
    "Silica",
    "Glyceryl Stearate",
    "Sodium Polyacryloyldimethyl Taurate",
    "Behenyl Alcohol",
    "Caffeine",
    "Moringa Oil/Hydrogenated Moringa Oil Esters",
    "Sodium Stearoyl Lactylate",
    "Mica",
    "Hydroxyacetophenone",
    "Caprylyl Glycol",
    "2-Hexanediol",
    "Squalene",
    "Caprylic/Capric/Succinic Triglyceride",
    "Xanthan Gum",
    "Citric Acid",
    "Sodium Phytate",
    "Phytosteryl Macadamiate",
    "Persea Gratissima (Avocado) Fruit Extract",
    "Crithmum Maritimum Extract",
    "Phytosterols",
    "Tocopherol",
    "Acetyl Hexapeptide-8",
    "Sodium Citrate"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "moisturizer",
      "mask",
      "treatment",
      "eye cream"
    ],
    "skin_type": [
      "sensitive",
      "mature"
    ],
    "finish": [
      "sheer",
      "creamy",
      "cream",
      "oil"
    ],
    "ingredients": [
      "peptides"
    ],
    "brand": [
      "clean-beauty",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "anti-aging",
      "brightening"
    ]
  },
  "reviews": {
    "product_id": "pimprod2047202",
    "total_reviews": 1310,
    "reviews": [
      {
        "review_id": 562506296,
        "rating": 4,
        "headline": "Keep going back again and again...even with the price tag",
        "comments": "I've used this product off and on for about a year or so. It's not a miracle cure but when I've switched to other brands I always miss Ilia. It's a great moisturizer that's light enough to use on the lids but provides noticeable smoothness. For me, it brightens better and more naturally than any undereye makeup/concealer I've used. This is perfect on its own for me. The price is what keeps me trying other things! Every time I go to replenish it's such a painful purchase but, for me, it's worth it.",
        "nickname": "Courtney",
        "location": "IL",
        "created_date": 1757038256207,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556276910,
        "rating": 1,
        "headline": "Bummer",
        "comments": "I usually LOVE ilia products, but this was a huge bummer. This is essentially the ilia moisturizer in a little package. I didnt notice any sort of dark circle coverage or brightening really past it just being a simple moisturizer but for that price? Absolutely not.",
        "nickname": "Jodie",
        "location": "Illinois",
        "created_date": 1751429145360,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537466335,
        "rating": 3,
        "headline": "Not my fav...",
        "comments": "While this product does brighten somewhat, I find that it doesn't absorb as well as other eye creams. I find Origin's Ginzing Refreshing Eye Cream to be superior all around.",
        "nickname": "Ali",
        "location": "MD",
        "created_date": 1731003788554,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 2
      }
    ],
    "paging": {
      "total_results": 3,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        19,
        36,
        69,
        266,
        920
      ],
      "review_histogram": [
        19,
        36,
        69,
        266,
        920
      ],
      "rating_count": 1310,
      "review_count": 1310,
      "average_rating": 4.55,
      "recommended_ratio": 1.0,
      "media": [],
      "faceoff_positive": {
        "comments": "Stepping into the world of skincare, I recently discovered the transformative wonder that is the ILIA Bright Start Retinol Alternative Brightening Eye Cream. It's not just another eye cream; it's an absolute game-changer!  Let me start by saying that this product has indeed earned its five-star rating, and it's easy to see why. The ILIA Bright Start Eye Cream is nothing short of magical. Its impact on my under-eye area is nothing less than a rejuvenating fairy tale come true.  The texture of this cream is like a dream – smooth, luxurious, and delightfully lightweight. As I applied it, it instantly melted into my skin, leaving no greasy residue, making it perfect for day and night use.  Now, let's talk results. ILIA's Bright Start Eye Cream is, in my opinion, the holy grail for combating dark circles, fine lines, and puffiness. The formula, enriched with bakuchiol (a natural alternative to retinol) and vitamin C, is a powerhouse for brightening and rejuvenating the delicate skin around the eyes. After consistent use, I noticed a significant reduction in those stubborn dark circles that have been my nemesis for years. My eyes now appear more awake and youthful.  But what sets this eye cream apart is the commitment of ILIA to clean beauty. It's vegan, cruelty-free, and formulated without any harmful ingredients. Knowing that I'm treating my skin to a product that's both effective and safe adds an extra layer of satisfaction.  The packaging is sleek, elegant, and eco-friendly, reflecting ILIA's dedication to sustainability. This eye cream comes in a recyclable tube, making it an environmentally responsible choice.  The ILIA Bright Start Retinol Alternative Brightening Eye Cream is the stuff of skincare dreams. It combines effective ingredients, ethical practices, and luxurious indulgence, all in one little tube. If you're searching for an eye cream that genuinely delivers on its promises, look no further. This is it, the ultimate secret weapon to brighter, more youthful-looking eyes. Five stars, no doubt",
        "headline": "ILIA Bright Start Retinol Alternative Brightening Eye Cream:",
        "rating": 5,
        "ugc_id": 527294905
      },
      "faceoff_negative": {
        "comments": "I love Ilia as a brand. I love their ingredients, I love the fact that they feature senior models in their ads, I love their ingredients, and in general, I've never had an issue with their products. So, when I went on the hunt for a good daytime eye cream, I was excited to see that their eye treatment got reviews and seemed to have plenty of skin-friendly ingredients. I will admit that I was initially concerned about the presence of retinol and including it in a product that I would use daily (I typically use retinol only 1 to 2x per week); but I figured if Ilia created something meant to be used daily, that retinol would be formulated to be safe for daily use. HOWEVER, all that being said… About a week after I began using this eye cream, I noticed that my eyeshadow primers that I was using were BURNING when I applied them. No other product was causing this reaction. Just my primer. At first I blamed the primer and got rid of it; and tried a different one, one that I have never had any issues with in the past. Same problem: I experienced a SEARING HOT BURNING sensation the moment I applied this product. It just then occurred to me that is very likely due to this Ilia eye cream, and it's retinol content. I am so disappointed. I love Ilia, but some of us are just too sensitive for daily applications of retinol; and I hope come out with a new product without it.",
        "headline": "Retinol daily = BAD IDEA (burning sensation)",
        "rating": 1,
        "ugc_id": 527296371
      },
      "name": "Bright Start Retinol Alternative Brightening Eye Cream",
      "native_review_count": 3,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 1307,
      "locale": "en_US"
    }
  }
}