{
  "product_id": "pimprod2051769",
  "product_url": "https://www.ulta.com/p/rice-toner-pimprod2051769",
  "extracted_at": "2025-09-23T05:04:37.861973+00:00",
  "product_name": "I'm FromRice Toner",
  "brand": "I'm From",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Toner"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "toner"
  ],
  "currency": "USD",
  "list_price": "28.00",
  "sale_price": "19.60",
  "availability": "in_stock",
  "rating_avg": "4.9",
  "rating_count": "504",
  "images": [
    "https://media.ulta.com/i/ulta/2642147?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2642147?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2642147_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2642147_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2642147_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2642147_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2642147_alt05?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeGive BackI'm From Rice Toner is a deeply hydrating Korean toner that nourishes, brightens, and protects. Formulated with Yeoju rice and rice bran extracts, it balances moisture levels, smooths texture, and defends against environmental stress for radiant, healthy-looking skin.",
  "details": "DetailsBenefitsHydrates and locks in moistureBrightens dull, uneven skin toneSmooths and refines skin textureProtects against free radical damagePreps skin for enhanced absorption of skincareKey IngredientsYeoju Rice Extract - Boosts hydration, prevents moisture loss, and softens skinRice Bran Extract - Rich in antioxidants to shield skin from environmental stressNiacinamide - Visibly brightens and improves skin tonePanthenol (Pro-Vitamin B5) - Calms and strengthens the skin barrierGlycerin - Attracts moisture for long-lasting hydration and smoothnessItem 2642147How To UseBefore use, shake well to mix the water and emulsion layers.After cleansing, dispense on a cotton pad and wipe off or press onto dry areas.IngredientsRice extract, Methylpropanediol, Triethylhexanoin, Hydrogenated poly (C6-14 olefin), Niacinamide, Pentylene glycol, Common Purslane extract, Rice bran extract, Japanese elm bark extract, Amaranthus caudatus seed extract, Hydrogenated lecithin, Distilled water, Polyglyceryl-10-myristate, Butylene glycol, Adenosine, Cellulose gum, Ethylhexylglycerin, 1,2-Hexanediol.",
  "how_to_use": "Before use, shake well to mix the water and emulsion layers.After cleansing, dispense on a cotton pad and wipe off or press onto dry areas.",
  "ingredients": [
    "Rice extract",
    "Methylpropanediol",
    "Triethylhexanoin",
    "Hydrogenated poly (C6-14 olefin)",
    "Niacinamide",
    "Pentylene glycol",
    "Common Purslane extract",
    "Rice bran extract",
    "Japanese elm bark extract",
    "Amaranthus caudatus seed extract",
    "Hydrogenated lecithin",
    "Distilled water",
    "Polyglyceryl-10-myristate",
    "Butylene glycol",
    "Adenosine",
    "Cellulose gum",
    "Ethylhexylglycerin",
    "2-Hexanediol"
  ],
  "extended_contents": {
    "images": [
      "https://content.syndigo.com/asset/886a92f3-ce3a-4526-b7f7-f2b943a8e63b/480.webp",
      "https://content.syndigo.com/asset/73da8474-72cf-4049-92de-e3c7875cdadf/480.webp"
    ]
  },
  "tags": {
    "product_type": [
      "cleanser",
      "toner"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "matte",
      "dewy",
      "sheer",
      "long-wear",
      "creamy"
    ],
    "ingredients": [
      "niacinamide"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "hydrating",
      "brightening",
      "purifying"
    ],
    "category": []
  },
  "reviews": {
    "product_id": "pimprod2051769",
    "total_reviews": 504,
    "reviews": [
      {
        "review_id": 560372402,
        "rating": 1,
        "headline": "Made me break out",
        "comments": "I bought this because of the positive reviews but i think they are not verified purchases. This toner broke me out really bad and fast. I stopped using it and slowly went back to normal.",
        "nickname": "Gaby",
        "location": "Houston, TX",
        "created_date": 1755463582975,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 560348851,
        "rating": 1,
        "headline": "it burns!!",
        "comments": "gave me werid bumps and always left my skin red",
        "nickname": "t",
        "location": "indy",
        "created_date": 1755403600967,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 559183905,
        "rating": 5,
        "headline": "I love this!",
        "comments": "You don't have to wait for results, they are immediate. My skin feels so soft and plump at the same time. My pores appear smaller as well. I highly recommend this toner.",
        "nickname": "Amy",
        "location": "Salt Lake City, UT",
        "created_date": 1754185655437,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 559143490,
        "rating": 5,
        "headline": "More Purchases Will Be Made From This Line!",
        "comments": "I was pleasantly pleased with this toner! It made my skin smooth and helped decrease the size of the pores ony nose...Ha! Ha!\nIt is not greasy at all but instead refreshing on my skin. I will definitely be buying more products from this line!!",
        "nickname": "Penny",
        "location": "Frisco, TX",
        "created_date": 1754083276640,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 1
      },
      {
        "review_id": 557848573,
        "rating": 5,
        "headline": "Glowy skin",
        "comments": "This is top 2 tones i've tried so far it makes my skin glowy, great buy!",
        "nickname": "Ib",
        "location": "Boston",
        "created_date": 1752993677699,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 1
      },
      {
        "review_id": 556917380,
        "rating": 5,
        "headline": "Awesome toner for sense tube skin",
        "comments": "This toner has helped my skin a lot and is great for ensetuve skin",
        "nickname": "Shay",
        "location": "Charlotte",
        "created_date": 1752167073746,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 5
      },
      {
        "review_id": 555818764,
        "rating": 5,
        "headline": "Mixon Method must have",
        "comments": "I am a skin flooding Mixon Method ride or die girlie and this is one of my must have staples to my line up. It goes 2nd to last right before my milky Thayers because it's a legit hydrating milky toner. I have and will continue to repurchase this product because my skin is glowing. Highly recommend following with the \"I'm From\" rice cream as well because that was a game changer.",
        "nickname": "Amber",
        "location": "Maryland",
        "created_date": 1750776085291,
        "bottom_line": null,
        "helpful_votes": 17,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 7,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        2,
        0,
        0,
        21,
        481
      ],
      "review_histogram": [
        2,
        0,
        0,
        21,
        481
      ],
      "rating_count": 504,
      "review_count": 504,
      "average_rating": 4.94,
      "recommended_ratio": 1.0,
      "media": [],
      "faceoff_positive": {
        "comments": "✨Luminous & Radiant Skin With Rice Toner✨ Toners are my favorite skincare essential and a must have for me in my daily routine. I love it's watery consistency, helps to prep and hydrate my skin as my first step. I can't do without toners and it works best for my combo sensitive skin. Toners have multi functional benefits from prepping, as a good skin conditioner, can be used as a toner pad, very versatile and mostly are lightweight. One of the key ingredient I like in toner is fermented rice water which does wonder to your skin by rejuvenates and brightens your skin complexion. I'm From Rice Toner has it all, except it takes a little more time to see brightening of your skin. Why Rice Water in Toner ? Rice contains \"pitera\" along with many vitamins like vitamin E, anti oxidants, minerals and ferulic acid. All these ingredients are great for tightening and brightening your skin, soothes sensitive skin and improves different skin conditions. Acts as natural sunscreen to protect skin from UV exposure, treats sunburns and fading sun spots. It also a well aging elixir by reducing fine lines & wrinkles therefore reversing the signs of ageing. It balances sebum production, minimizes enlarged pores by shrinking large open pores. My thoughts: A non slip and very hydrating toner without fragrance that instantly perks up my skin that leaves a dewy complexion. Love how fast it absorbs into my skin and the watery rice substance is just perfect not overly greasy. Perfect to use together with the rice serum and cream that adds further benefits by repairing, restoring and strengthening the skin barrier. If you don't have the other duo is fine, using it together with a barrier serum or cream still works the best. I like using this before a retinal treatment to prevent skin sensitivity or reactions coz rice has hydrating properties that pairs well with vitamin A. It also further enhances the effectiveness of vitamin A in targeting pigmentations, wrinkles and improves skin elasticity. I love how glowy my skin appearance looks now, softer & smoother skin texture. Indeed a superb conditioning toner you need to try it for yourself. In the aspect of brightening of my skin I have yet to see significant results. Thus far, I am happy with how fast it soothes my skin redness / irritations, immediately provides intensive moisture to the dryer parts of my skin & see improvement in my skin clarity.",
        "headline": "Love how fast it absorbs into my skin and the watery rice su",
        "rating": 5,
        "ugc_id": 556911779
      },
      "faceoff_negative": {
        "comments": "I bought this because of the positive reviews but i think they are not verified purchases. This toner broke me out really bad and fast. I stopped using it and slowly went back to normal.",
        "headline": "Made me break out",
        "rating": 1,
        "ugc_id": 560372402
      },
      "name": "Rice Toner",
      "native_review_count": 7,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 497,
      "locale": "en_US"
    }
  }
}