{
  "product_id": "pimprod2037962",
  "product_url": "https://www.ulta.com/p/i-waken-eye-serum-dark-circles-pimprod2037962",
  "extracted_at": "2025-09-23T04:15:11.987962+00:00",
  "product_name": "INDIE LEEI-Waken Eye Serum for Dark Circles",
  "brand": "INDIE LEE",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Serums"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "serums"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "48.00",
  "availability": "in_stock",
  "rating_avg": "4.3",
  "rating_count": "85",
  "images": [
    "https://media.ulta.com/i/ulta/2604496?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2604496?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2604496_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2604496_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2604496_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2604496_alt04?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryIndie Lee I-Waken Eye Serum nourishes delicate eye areas and reduces the appearance of dark circles.",
  "details": "DetailsBenefitsHelps prompt long-lasting hydrationHelps leave skin with a smoother and firmer appearanceKey IngredientsHorse Chestnut, Mountain Ash Bud and Witch Hazel help address dark circlesAntioxidant Spirulina and Blackcurrant Leaf extracts hydrate and conditionHyaluronic Acid provides continuous moisture, binding up to 1,000 times its weight in waterResearch ResultsIn a clinical test of 32 subjects:97% said this product delivered lightweight moisture in the under-eye area91% found that this product brightened dull and tired-looking eyes90% agreed that this product reduces the appearance of dry fine lines90% agreed that this product helps reduce the appearance of visible signs of aging around the eyes100% of subjects saw 31% improvement in the hydration of the under-eye area after four weeks of use.Item 2604496How To UseGently apply to the eye contour morning and evening to hydrate and rejuvenate.Precautions: For external use only. Avoid contact with the eyes. If irritation develops, discontinue use and consult your doctor.IngredientsWater (Aqua), Propanediol, Maltodextrin, Dicaprylyl Ether, Polyglyceryl-6 Distearate, Glycerin, Squalane, Simmondsia Chinensis (Jojoba) Seed Oil, Caprylic/Capric Triglyceride, Cetyl Alcohol, Pyrus Sorbus (Mountain Ash) Bud Extract, Ribes Nigrum (Black Currant) Fruit Extract, Arnica Montana Flower Extract, Spirulina Maxima Extract, Aesculus Hippocastanum (Horse Chestnut) Seed Extract, Centaurea Cyanus (Cornflower) Flower Extract, Hamamelis Virginiana (Witch Hazel) Leaf Extract, Chamomilla Recutita (Matricaria) Flower Extract, Tocopherol, Galactaric Acid, Phytic Acid, Jojoba Esters, Glyceryl undecylenate, Polyglyceryl-3 Beeswax, Hydrolyzed Hyaluronic Acid, Sodium Dehydroacetate, Carrageenan, Sclerotium Gum, Gluconolactone, Potassium Sorbate, Sodium Benzoate99% natural origin of totalShipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Gently apply to the eye contour morning and evening to hydrate and rejuvenate.Precautions: For external use only. Avoid contact with the eyes. If irritation develops, discontinue use and consult your doctor.",
  "ingredients": [
    "Water (Aqua)",
    "Propanediol",
    "Maltodextrin",
    "Dicaprylyl Ether",
    "Polyglyceryl-6 Distearate",
    "Glycerin",
    "Squalane",
    "Simmondsia Chinensis (Jojoba) Seed Oil",
    "Caprylic/Capric Triglyceride",
    "Cetyl Alcohol",
    "Pyrus Sorbus (Mountain Ash) Bud Extract",
    "Ribes Nigrum (Black Currant) Fruit Extract",
    "Arnica Montana Flower Extract",
    "Spirulina Maxima Extract",
    "Aesculus Hippocastanum (Horse Chestnut) Seed Extract",
    "Centaurea Cyanus (Cornflower) Flower Extract",
    "Hamamelis Virginiana (Witch Hazel) Leaf Extract",
    "Chamomilla Recutita (Matricaria) Flower Extract",
    "Tocopherol",
    "Galactaric Acid",
    "Phytic Acid",
    "Jojoba Esters",
    "Glyceryl undecylenate",
    "Polyglyceryl-3 Beeswax",
    "Hydrolyzed Hyaluronic Acid",
    "Sodium Dehydroacetate",
    "Carrageenan",
    "Sclerotium Gum",
    "Gluconolactone",
    "Potassium Sorbate",
    "Sodium Benzoate99% natural origin of total"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "serum",
      "mask",
      "treatment",
      "eye cream"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "matte",
      "sheer",
      "long-wear",
      "creamy",
      "oil"
    ],
    "ingredients": [
      "hyaluronic-acid",
      "natural"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "natural"
    ]
  },
  "reviews": {
    "product_id": "pimprod2037962",
    "total_reviews": 85,
    "reviews": [],
    "paging": {
      "total_results": 0,
      "pages_total": 0,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        3,
        8,
        7,
        8,
        59
      ],
      "review_histogram": [
        3,
        8,
        7,
        8,
        59
      ],
      "rating_count": 85,
      "review_count": 85,
      "average_rating": 4.32,
      "recommended_ratio": 0.38,
      "media": [],
      "faceoff_positive": {
        "comments": "I have been using the i-waken eye serum for awhile. I hadn't noticed much of a difference under my eyes but my husband said he did and honestly the serum just feels so refreshing so I kept using it. My husband starting using it a few weeks ago (he has always had a little puffiness and redness under his eyes) and literally within days it went away. Puffiness gone. Redness gone. Amazing! If he doesn't use the serum for a few days I can tell because he starts to get red and puffy again. I wish I had good before and after pictures. Anyway, we'll definitely continue to purchase! Totally worth the price since one little bottle lasts forever!",
        "headline": "Magic",
        "rating": 5,
        "ugc_id": 308932936
      },
      "faceoff_negative": {
        "comments": "I never write reviews, but MAN, I loved this product before the new changes (and yes there are multiple!) - first the new applicator makes me waste so much more product. It pours out which is so frustrating. You only need a little bit. Second, I guess because it pours out there's always so much under my eyes, but I NEVER experienced it peeling before this new applicator/change in formula. It has so much excess that it peels off and it's gross. I used to be able to use this under my makeup easily, now I basically have to wash it off. It's definitely not the same as it was. I'm so bummed because I really loved it before but I'll be trying something new from here on out.",
        "headline": "Why must good things change?!",
        "rating": 1,
        "ugc_id": 471302772
      },
      "name": "I-Waken Eye Serum for Dark Circles",
      "variant_names": [
        "I-Waken Eye Serum"
      ],
      "native_review_count": 0,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 85,
      "locale": "en_US"
    }
  }
}