{
  "product_id": "pimprod2052149",
  "product_url": "https://www.ulta.com/p/oat-makeup-removing-cleansing-balm-mini-pimprod2052149",
  "extracted_at": "2025-09-23T04:43:31.056041+00:00",
  "product_name": "INKEYOat Makeup Removing Cleansing Balm Mini",
  "brand": "INKEY",
  "categories": [
    "Home",
    "Skin Care",
    "Travel Size Skin Care"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "travel-size-skin-care"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "7.00",
  "availability": "in_stock",
  "rating_avg": "4.2",
  "rating_count": "1053",
  "images": [
    "https://media.ulta.com/i/ulta/2641812?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2641812?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641812_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641812_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641812_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641812_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641812_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641812_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641812_alt07?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive BackINKEY Oat Makeup Removing Cleansing Balm is a soft, rich balm removes makeup, SPF and impurities for skin that feels instantly hydrated, nourished and looks more glowing.",
  "details": "DetailsBenefitsMelt away makeup in one swipeThis best-selling balm effectively dissolves all visible traces of makeup including waterproof and long-wear, while soothing and comforting dry, tight, and sensitive skinThe non-stripping, non-drying formula leaves skin deeply cleansed, nourished and hydratedThis product is an Allure Best of Beauty award winnerKey IngredientsOat Kernel Oil 3%: Effectively removes impurities and supports skin's moisture levelsColloidal Oatmeal: Visibly reduces redness and soothes dry, tight and sensitive skinResearch Results95% agree make-up was removed in one cleanse****4-week independent clinical study of 22 people under dermatological & ophthalmological controlClinically proven to cleanse without drying the skin* Clinically proven to maintain skin moisture levels*4-week independent clinical study of 22 peopleItem 2641812How To UseSuggested Usage:-For daily use-Use a quarter-sized amount.-Gently massage onto dry skin-For eye makeup removal apply to closed eyes-Add a splash of warm water to emulsify-Rinse thoroughlyINKEY Tip: Oat Cleansing Balm doubles as a nourishing face mask that's clinically proven to increase moisture levels when worn for 10 minutes. Apply to the face and neck for a boost of extra hydration.IngredientsPrunus Amygdalus Dulcis (Sweet Almond) Oil, Cetearyl Alcohol, PEG-6 Caprylic/Capric Glycerides, Avena Sativa (Oat) Kernel Oil, Candelilla Cera (Cire de candelilla), Silica, Sorbitan Stearate, Tribehenin, PEG-60 Almond Glycerides, Avena Sativa (Oat) Kernel Flour, Aqua (Water/Eau), Benzyl Alcohol, Phenoxyethanol, Lecithin, 1,2-Hexanediol, Ascorbyl Palmitate, Tocopherol, Biosaccharide Gum-4, Helianthus Annuus (Sunflower) Seed Oil.",
  "how_to_use": "Suggested Usage:-For daily use-Use a quarter-sized amount.-Gently massage onto dry skin-For eye makeup removal apply to closed eyes-Add a splash of warm water to emulsify-Rinse thoroughlyINKEY Tip: Oat Cleansing Balm doubles as a nourishing face mask that's clinically proven to increase moisture levels when worn for 10 minutes. Apply to the face and neck for a boost of extra hydration.",
  "ingredients": [
    "Prunus Amygdalus Dulcis (Sweet Almond) Oil",
    "Cetearyl Alcohol",
    "PEG-6 Caprylic/Capric Glycerides",
    "Avena Sativa (Oat) Kernel Oil",
    "Candelilla Cera (Cire de candelilla)",
    "Silica",
    "Sorbitan Stearate",
    "Tribehenin",
    "PEG-60 Almond Glycerides",
    "Avena Sativa (Oat) Kernel Flour",
    "Aqua (Water/Eau)",
    "Benzyl Alcohol",
    "Phenoxyethanol",
    "Lecithin",
    "2-Hexanediol",
    "Ascorbyl Palmitate",
    "Tocopherol",
    "Biosaccharide Gum-4",
    "Helianthus Annuus (Sunflower) Seed Oil"
  ],
  "extended_contents": {},
  "tags": {
    "product_type": [
      "cleanser",
      "moisturizer",
      "lip gloss"
    ],
    "skin_type": [
      "dry",
      "sensitive"
    ],
    "finish": [
      "dewy",
      "sheer",
      "long-wear",
      "waterproof",
      "oil"
    ],
    "brand": [
      "mid-range",
      "budget"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "spf",
      "hydrating",
      "soothing",
      "purifying"
    ],
    "category": [],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2052149",
    "total_reviews": 1053,
    "reviews": [
      {
        "review_id": 563195891,
        "rating": 5,
        "headline": "Saved my rosacea skin!",
        "comments": "Best to use if you have dry scensitive skin! I've been using this as a double cleanser with the vanicream cleasener with my other skin care products and my skin looks 5 years younger and I have glass skin. This definitely deserves more love!",
        "nickname": "Kier",
        "location": "Seattle",
        "created_date": 1757570730398,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 561103282,
        "rating": 1,
        "headline": "No idea how a cleansing balm could be this bad",
        "comments": "I did not have high expectations, I just wanted an oil-based cleanser that will do the job and remove my makeup. Didn't do research beforehand, just picked this up in store because of its size + cost. This not only doesn't remove your makeup, but it's impossible to wash off and just. stays in your skin. After using this, I follow up using a water-based cleanser (laroche posay, cerave, or senka whip) and it DOESNT LEAVE. Please spare your money!!!",
        "nickname": "J",
        "location": "Maryville",
        "created_date": 1756172555465,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560582459,
        "rating": 4,
        "headline": "I would buy this product again...the tube is big and easy to",
        "comments": "It cleanses well and is moisturizing",
        "nickname": "Ann",
        "location": "Panama City Beach",
        "created_date": 1755828194694,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560576812,
        "rating": 3,
        "headline": "Not My Pick",
        "comments": "I think this is best for super dry skin and heavy makeup. It took me two extra washes with my normal cleanser to get the greasy feeling off.",
        "nickname": "myramarie13",
        "location": "California",
        "created_date": 1755815240109,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560380406,
        "rating": 1,
        "headline": "Does nothing",
        "comments": "This product doesn't remove makeup nor does it emulsify. I have to do 3 washes just to get this crap off.",
        "nickname": "Amanda",
        "location": "texas",
        "created_date": 1755482388965,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559315489,
        "rating": 1,
        "headline": "Not good",
        "comments": "This product does not remove make up. It might smear it around your face and leave a thick oily film, but it's definitely not removing anything.",
        "nickname": "Sj",
        "location": "San Antonio",
        "created_date": 1754403975586,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559200024,
        "rating": 5,
        "headline": "Changed my skin",
        "comments": "This product has helped with my oily skin and cleared my breakouts",
        "nickname": "Victoria",
        "location": "Tracy,CA",
        "created_date": 1754230807068,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558361152,
        "rating": 4,
        "headline": "Give it a shot!",
        "comments": "Ive tried the burts bee's cleansing oil and the DHC deep cleansing oil, and INKEY is significantly better and more bang for your buck! I also find that it removes my stubborn waterproof make up like magic compared to the other two i mentioned. Yes, it does leave a weird blurry film in your eyes but NOTHING like the dhc cleansing oil which leaves me blind. I always recommend you double cleanse, and opt for a cleanser meant for oily skin when using an oil cleanser. It also helps with the weird blurry film most people experience with oil cleansers. Anyways just give it a try because the price is unbeatable imo!",
        "nickname": "alondra",
        "location": "fort worth, tx",
        "created_date": 1753593193834,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 2
      },
      {
        "review_id": 557870972,
        "rating": 2,
        "headline": "You deserve better than this",
        "comments": "I love skincare without added fragrance but this product smells absolutely rancid, like those dusty sticks of Crisco at the back of grandma's pantry. The consistency is thick and glue-y, is difficult to spread and work over the skin, and feels dreadful. Does it remove makeup and sunscreen, like an oil cleanser should? Yes, and for that I'll go ahead and give it two stars, since it is technically functional (but ONLY if you double-cleanse -- if you don't follow this up with a water-based cleanser, you're going to have an unpleasant greasy film left behind). We all deserve better than this. Please do yourself a favor and buy literally any other oil cleanser instead of this one.",
        "nickname": "Rosemary",
        "location": "Seattle, WA",
        "created_date": 1753038988131,
        "bottom_line": "No",
        "helpful_votes": 4,
        "not_helpful_votes": 2
      },
      {
        "review_id": 557861516,
        "rating": 1,
        "headline": "Waste of money",
        "comments": "This does ABSOLUTELY NOTHING for removing makeup or washing the face period. Save your money and get something else. Oil comes out before product because it will separate in the bottle. Feels more like an useless lubricant when applied. Very greasy feeling on the face and hard to wash off. Hate that I can't return it because it's past the 30 days.",
        "nickname": "Tam Lewis",
        "location": "Aubrey, Tx",
        "created_date": 1753022015950,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 2
      },
      {
        "review_id": 557514132,
        "rating": 5,
        "headline": "LOVED IT !!!!❤️",
        "comments": "I've never used a cleanser that melts away my stubborn makeup like this one does seriously, no more scrubbing or makeup wipes needed! 😭✨ The texture is so soothing, and it leaves my skin feeling incredibly soft, clean, and refreshed. I'm obsessed. If you're tired of harsh removers or leftover residue, this is the game changer you've been looking for!",
        "nickname": "O",
        "location": "Texas",
        "created_date": 1752900490162,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 1
      },
      {
        "review_id": 557514184,
        "rating": 5,
        "headline": "LOVED IT !!!!❤️",
        "comments": "I've never used a cleanser that melts away my stubborn makeup like this one does seriously, no more scrubbing or makeup wipes needed! 😭✨ The texture is so soothing, and it leaves my skin feeling incredibly soft, clean, and refreshed. I'm obsessed. If you're tired of harsh removers or leftover residue, this is the game changer you've been looking for!",
        "nickname": "O",
        "location": "Texas",
        "created_date": 1752900489726,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557206217,
        "rating": 1,
        "headline": "Not eye friendly",
        "comments": "Not good for removing eye make up and even after double cleansing with this I still end up having make up on.",
        "nickname": "Cin",
        "location": "Cleveland OH",
        "created_date": 1752533746627,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 556867772,
        "rating": 2,
        "headline": "I wanted to love this",
        "comments": "I liked the rich feel of it, felt like it would melt all my makeup but sometimes just oil would come out and then it was almost impossible to rinse off! There was always a film and it never removed all of my makeup, I always had racoon eyes. I ended up using this on my legs after I would shave lol",
        "nickname": "Nena",
        "location": "Philadelphia",
        "created_date": 1752082943457,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 14,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        84,
        54,
        69,
        236,
        610
      ],
      "review_histogram": [
        84,
        54,
        69,
        236,
        610
      ],
      "rating_count": 1053,
      "review_count": 1053,
      "average_rating": 4.17,
      "recommended_ratio": 0.6,
      "media": [],
      "faceoff_positive": {
        "comments": "I LOVE this cleansing balm! I have tried a lot of cleansing balms over the years, many that are much more expensive than this one. Hands down, The Inkey List Oat Cleansing Balm is my holy grail cleanser! I have very dry, acne prone skin and I use Tretinoin regularly so I need a routine that hydrates from beginning to end and doesn't strip my skin. Usually I use this as my first cleanser in the evening when I am wearing sunscreen - it does a beautiful job of breaking down my skincare, including sunscreen and it removes the dirt and oil from the day effectively. If I do not wear sunscreen, I will use just this on its own without a second cleanser following. I love how hydrating it is. Immediately after washing my face, my skin feels hydrated and still plump - not stripped and parched like other products I have used in the past. Unlike other hydrating cleansers I have tried, this product does not leave a film like feeling on the skin, it just feels naturally hydrated and so smooth and soft. Since using this product as my primary cleanser, my acne has decreased - I feel like the gentleness of the product, combined with the effectiveness of it is the reason for this. There is no residual skincare residue or remaining dirt and oil on my face after cleansing. I never feel stripped and dry, my skin is smooth and the base is ideal for applying the rest of my products. Because I use very drying prescription acne products, I will occasionally have dry flakey patches of skin that I need to gently remove. If I apply this balm directly on dry skin, it effectively removes any dry patches gently, without any irritation like a wet facecloth would cause. I can't say enough good things about this cleanser! If you have dry skin, you need to try this! It's a game changer and I hope it is never discontinued because I love it!!",
        "headline": "My holy grail cleanser!!",
        "rating": 5,
        "ugc_id": 554431952
      },
      "faceoff_negative": {
        "comments": "I'm convinced either everyone else who's reviewed this positively has never tried other, much better cleansing balms, or that I've received a faulty unit. I honestly disliked everything about this product. The packaging feels and looks cheap and is really difficult to squeeze, especially when you've already got wet or greasy hands and you need some extra product. The texture of the \"balm\" (not sure it's the right word for it) is somewhat gritty, and it never melted properly, like superior quality products do. It's honestly not good at removing makeup, and needs to be worked over the skin for a long time before it properly manages to remove anything, especially mascara, with the risk of irritating the delicate skin of the eye area. Plus, it doesn't \"wash off\" with water - as in, you need a cleanser to wash off the considerable amount of grease left even after generously rinsing with water, compared (again) with superior quality cleansing balms or oils like Heimish or Elizabeth Arden, which leave you with a \"clean\" feeling after rinsing off with water. What I hated the most is that the balm, the water and my makeup often clumped together and went INTO my eyes, living stringy disgusting (and STINGING!) strands that I then had to literally fish out, often painfully. After a week of using I was already so done with it that I couldn't wait to finish it and throw it away, but honestly I don't have the money to throw away a product without using it if it's not majorly irritating my skin, and it's not like I was going to foist it on anyone else. The tube was super difficult to use at the end and hardly any product was coming out, even though there was probably still a good 15-20 ml in there, but I finally gave up and moved onto greener pastures. Not worth the 10-11€ that I spent on it and wouldn't recommend it to anyone (in fact would strongly recommend against it). Peace and love ‚úå",
        "headline": "Horrible, inefficient product",
        "rating": 1,
        "ugc_id": 554478649
      },
      "name": "Oat Makeup Removing Cleansing Balm Mini",
      "variant_names": [
        "Oat Cleansing Balm",
        "Oat Cleansing Balm Mini"
      ],
      "native_review_count": 14,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 1039,
      "locale": "en_US"
    }
  }
}