{
  "product_id": "pimprod2052117",
  "product_url": "https://www.ulta.com/p/omega-water-cream-oil-free-moisturizer-pimprod2052117",
  "extracted_at": "2025-09-23T04:44:36.286706+00:00",
  "product_name": "INKEYOmega Water Cream Oil-Free Moisturizer",
  "brand": "INKEY",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Face Moisturizer"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "13.00",
  "availability": "in_stock",
  "rating_avg": "4.4",
  "rating_count": "821",
  "images": [
    "https://media.ulta.com/i/ulta/2641991?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2641991?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641991_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641991_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641991_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641991_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641991_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641991_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641991_alt07?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeSustainable PackagingGive BackINKEY Omega Water Cream Oil-Free Moisturizer is a silky face moisturizer with Niacinamide. Clinically proven increase skin hydration and help minimize excess oiliness in the skin.",
  "details": "DetailsBenefitsOil free hydrationThis water-based cream helps to improve the appearance of pores for a smooth, more even skin toneSpecially formulated with 5% Niacinamide and a barrier-supporting omega fatty acid complex this unique formula provides lightweight hydration to oily and blemish-prone skin typesKey IngredientsCeramide Complex 0.2%: Optimizes hydration & improves skin's appearance with Omega 3, 6 and 9Niacinamide 5%: Visibly brightens while minimizing appearance of excess oil with Vitamin B3Betaine 3%: Reinforces the skin's barrier and helps deliver hydrationResearch ResultsClinically proven to increase skin hydration levels*Clinially proven to help balance oil*100% Said skin feels deeply hydrated*95% Said skin tone looks more even**4-week independent consumer trial of 22 people under dermatological controlItem 2641991How To UseSuggested Usage:-Use AM and PM-Squeeze a quarter size amount onto your fingertips-Massage into face and neck-Always finish with SPF if using in your AM routineIngredientsWater (Aqua / Eau), Dicaprylyl Carbonate, Glycerin, Niacinamide, Propanediol, Betaine, Polyglyceryl-4 Isostearate, Coco-Caprylate/Caprate, Magnesium Sulfate, Glycosphingolipids, Glycolipids, Sodium Benzoate, Disteardimonium Hectorite, Oleic Acid, Potassium Sorbate, Citric Acid, Polyglycerin-3.",
  "how_to_use": "Suggested Usage:-Use AM and PM-Squeeze a quarter size amount onto your fingertips-Massage into face and neck-Always finish with SPF if using in your AM routine",
  "ingredients": [
    "Water (Aqua / Eau)",
    "Dicaprylyl Carbonate",
    "Glycerin",
    "Niacinamide",
    "Propanediol",
    "Betaine",
    "Polyglyceryl-4 Isostearate",
    "Coco-Caprylate/Caprate",
    "Magnesium Sulfate",
    "Glycosphingolipids",
    "Glycolipids",
    "Sodium Benzoate",
    "Disteardimonium Hectorite",
    "Oleic Acid",
    "Potassium Sorbate",
    "Citric Acid",
    "Polyglycerin-3"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "moisturizer",
      "oil"
    ],
    "skin_type": [
      "oily",
      "acne-prone"
    ],
    "finish": [
      "sheer",
      "creamy",
      "cream",
      "oil"
    ],
    "ingredients": [
      "niacinamide",
      "sulfate-free"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "oil-free",
      "spf"
    ]
  },
  "reviews": {
    "product_id": "pimprod2052117",
    "total_reviews": 821,
    "reviews": [
      {
        "review_id": 561388420,
        "rating": 3,
        "headline": "Not for me!",
        "comments": "The item was very lightweight on the face however  my skin is normal to dry and I ended up breaking out. I don't know if it's because I'm currently trying to find a new face cream and had already tried a different one before this. Either way I just returned it. I have heard good things but for me it just wasn't right.",
        "nickname": "Emile",
        "location": "Staten Island",
        "created_date": 1756493008389,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 561383186,
        "rating": 4,
        "headline": "Light",
        "comments": "I was looking for a very light feeling moisturizer and this here does the job great",
        "nickname": "KF",
        "location": "Dallas",
        "created_date": 1756484427639,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559849919,
        "rating": 5,
        "headline": "MOST UNDERHYPED MOISTURIZER OF ALL TIME",
        "comments": "Guys!!!!!!! I've found the moisturizer of my dreams. My skin drinks it up, it never feels heavy, and I am always glowing (not greasy). I pair it with the Inky List hyaluronic acid serum every morning. With every other moisturizer, I feel myself getting oily throughout the day, but that does not happen with this one. I've you've got oily or combination skin, just do yourself a favor and try it. You cannot beat the price tag either.",
        "nickname": "Hope",
        "location": "Louisiana",
        "created_date": 1754698865850,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 559794733,
        "rating": 2,
        "headline": "Causing breakouts",
        "comments": "I hate to say it, but this stuff is definitely making me break out. I really wanted to like this, the texture is very unique, and I've had other inky products that work well. I do have sensitive break out prone skin, mostly around my chin, but since using this I've been breaking out on my forehead which never happens. I'm going to hold on to it and try again in the winter.",
        "nickname": "Liz",
        "location": "Vancouver WA",
        "created_date": 1754611320274,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558356025,
        "rating": 5,
        "headline": "I love this moisturizer",
        "comments": "I purchased this moisturizer on a whim from the salesperson. I didn't have high hopes. I wanted to work on my skin so I decided to give it a try. I was pleasantly surprised. My skin feels and look clean. I have this glow. I have beepn only using it for a week and half. I have been getting constant compliments. I love it.",
        "nickname": "Arnita",
        "location": "Raleigh NC",
        "created_date": 1753571770231,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557860000,
        "rating": 5,
        "headline": "PERFECT FOR OILY SKIN",
        "comments": "i got this moisturizer recently. I have oily skin and i always get this oily layer on top of my skin even after applying a little bitty bit of moisturizers so my skin care always feels futile but with THIS  moisturizer? I only feel my face squeaky clean. It really does feel like water! Lightweight from the moment it touches your skin. And about its mousturizing job? Great! I dont feel dry at ALL or OVER moisturized it's wonderful!! I can't recommend it enough. I just wish it came in a bigger bottle",
        "nickname": "Soni",
        "location": "Lancaster, PA",
        "created_date": 1753019808755,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557860409,
        "rating": 5,
        "headline": "PERFECT FOR OILY SKIN",
        "comments": "i got this moisturizer recently. I have oily skin and i always get this oily layer on top of my skin even after applying a little bitty bit of moisturizers so my skin care always feels futile but with THIS  moisturizer? I only feel my face squeaky clean. It really does feel like water! Lightweight from the moment it touches your skin. And about its mousturizing job? Great! I dont feel dry at ALL or OVER moisturized it's wonderful!! I can't recommend it enough. I just wish it came in a bigger bottle",
        "nickname": "Soni",
        "location": "Lancaster, PA",
        "created_date": 1753019808318,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 7,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        47,
        19,
        46,
        158,
        551
      ],
      "review_histogram": [
        47,
        19,
        46,
        158,
        551
      ],
      "rating_count": 821,
      "review_count": 821,
      "average_rating": 4.4,
      "recommended_ratio": 1.0,
      "media": [],
      "faceoff_positive": {
        "comments": "This is by far the best moisturizer I have found for my skin. I was looking for a low-cost moisturizer that keeps my skin hydrated all day and contains niacinamide to help control my acne. About a year ago, I discovered the Omega Water Cream. It checks all the boxes for me. The only caveats (and there are two): It leaves my face shiny--something I really dislike. I hate makeup, but I feel like I have to use a clear powder over it, especially when I follow it up with sunscreen. I know that glowy skin is a trend right now, so I don't blame The Inkey List for this choice, especially since, because of the niacinamide, I notice a lot less oil production throughout the day. The other caveat is the SIZE! This bottle only lasts me a month! That is great for a trial period for a new product, but I am totally wasting plastic by buying these in bulk! PLEASE PLEASE PLEASE manufacture a larger size!!!",
        "headline": "The Best Cream Out There",
        "rating": 4,
        "ugc_id": 554428531
      },
      "faceoff_negative": {
        "comments": "This is not a face cream for me. Even when it's dried up on my skin, it leaves a slightly shiny layer. I can see the different on the skin around my ears where I'm usually not that detailed. Then after some time, the layers of cosmetic products on my face start to pill. This didn't happen once, but multiple times and I got noticed about pilling on my face also by other people, which is not the most pleasant thing to experience. Last, but not least, my skin is itchy and when scratched, quite dry and damaged. And I have realized that it's this particular product because now I don't put other cosmetic on my neck and decolt than my face cream. I had purchased 100 ml product size package, used it for about month to adjust to it, but I finally decided to throw it away. It was really not a match for me at all. Too bad and maybe the next time I'll start with a smaller package when trying a new product.",
        "headline": "Shiny, pilling and making my skin itchy",
        "rating": 1,
        "ugc_id": 554480161
      },
      "name": "Omega Water Cream Oil-Free Moisturizer",
      "native_review_count": 7,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 814,
      "locale": "en_US"
    }
  }
}