{
  "product_id": "pimprod2004105",
  "product_url": "https://www.ulta.com/p/beautyprep-face-cleanser-pimprod2004105",
  "extracted_at": "2025-09-23T03:22:00.095078+00:00",
  "product_name": "jane iredaleBeautyPrep Face Cleanser",
  "brand": "jane iredale",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wash"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "32.00",
  "availability": "in_stock",
  "rating_avg": "4.2",
  "rating_count": "186",
  "images": [
    "https://media.ulta.com/i/ulta/2545040?w=500&h=500"
  ],
  "detailed_images": [],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingOptimize the benefits of the mineral makeup you love with jane iredale's high-performance BeautyPrep Face Cleanser, designed to help makeup go on smoother and last longer.",
  "details": "DetailsBenefitsA micellar cleansing water that uses an antioxidant- and vitamin-rich liposome formula.Removes dirt, oil and impurities without drying out the skin.Makeup remover and moisturizing facial wash in one.Ideal for daily use with BeautyPrep Face Toner and BeautyPrep Moisturizer as part of a high-performance skincare regimenKey IngredientsCucumber Seed Extract and Cucumber Fruit Extract hydrates, soothes and protects.Algae Extract soothes, nourishes and hydrates.Item 2545040How To UseThis micellar cleanser may be used with or without water. Moisten a cotton pad with a small amount of cleanser then gently wipe face to cleanse. Do not rinse after use.IngredientsAqua/Water/Eau, Cucumis Sativus (Cucumber) Seed Extract*, Cucumis Sativus (Cucumber) Fruit Extract, Leuconostoc/Radish Root Ferment Filtrate, Glycerin, Sodium Lauroyl Oat Amino Acids, Spirulina Platensis (Algae) Extract, Alcohol.*Ingredients From Organic Farming.99.99% of the total ingredients are from natural origin 5.75% of the total ingredients are from Organic Farming Natural Cosmetic certified by Ecocert Greenlife according to Ecocert Standard.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "This micellar cleanser may be used with or without water. Moisten a cotton pad with a small amount of cleanser then gently wipe face to cleanse. Do not rinse after use.",
  "ingredients": [
    "Aqua/Water/Eau",
    "Cucumis Sativus (Cucumber) Seed Extract*",
    "Cucumis Sativus (Cucumber) Fruit Extract",
    "Leuconostoc/Radish Root Ferment Filtrate",
    "Glycerin",
    "Sodium Lauroyl Oat Amino Acids",
    "Spirulina Platensis (Algae) Extract",
    "Alcohol.*Ingredients From Organic Farming.99.99% of the total ingredients are from natural origin 5.75% of the total ingredients are from Organic Farming Natural Cosmetic certified by Ecocert Greenlife according to Ecocert Standard"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "sheer",
      "creamy",
      "oil"
    ],
    "color": [
      "red"
    ],
    "ingredients": [
      "organic",
      "natural"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "organic",
      "natural",
      "hydrating",
      "purifying"
    ]
  },
  "reviews": {
    "product_id": "pimprod2004105",
    "total_reviews": 186,
    "reviews": [
      {
        "review_id": 328992675,
        "rating": 3,
        "headline": "Ok",
        "comments": "This is an ok product. It doesn't provide the moisture like I'm use to with my other brand but it does clean. However, Think I'm going to switch back to the neutrogena brand because it helps with my sensitive dry skin.",
        "nickname": "Hannap",
        "location": "Florence",
        "created_date": 1612985009517,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 293391870,
        "rating": 5,
        "headline": "Love this product!!",
        "comments": "Great cleanser and it removes every last bit of my makeup! It even removes all of my eye makeup which I have a hard time finding cleansers that do!",
        "nickname": "Chelsi",
        "location": "Flowood, ms",
        "created_date": 1597780249743,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 2,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "Great cleanser",
              "count": 1
            },
            {
              "label": "Removes ALL makeup",
              "count": 1
            }
          ],
          "display_values": [
            "Great cleanser",
            "Removes ALL makeup"
          ]
        }
      ],
      "rating_histogram": [
        10,
        17,
        16,
        24,
        119
      ],
      "review_histogram": [
        10,
        17,
        16,
        24,
        119
      ],
      "rating_count": 186,
      "review_count": 186,
      "average_rating": 4.21,
      "recommended_ratio": 0.86,
      "media": [],
      "faceoff_positive": {
        "comments": "I started with the mini beauty prep set last week and LOVE these products. My regular routine was CeraVe cleanser and lotion (with a drop of clinique acne solutions -all over clearing treament on top) then my Jane Iredale makeup, which never cause breakouts, but as I've recently turned 40 they seem to dry my skin out too much. In general, I prefer to use healthier ingredients and cruelty-free product lines, but had never found products that keep my skin as clear as the CeraVe. So when Jane Iredale's BeautyPrep three step came out I was excited, but hesitant to invest since the CeraVe is pretty inexpensive. So... while I was preparing myself to invest in the BeautyPrep, I looked online for comparable healthy/green products. I found TataHarper products and was enchanted by their marketing and promises. I purchased their trial set and unfortunately after two weeks my skin was a total wreck, I was breaking out everywhere and inflamed all over. It was a painful setback. I was grateful to be able to return their products and went back to my old CeraVe routine. My skin was recovering slowly and I was still unhappy with the drying/dulling result.... So last week I finally purchased the Jane Iredale BeautyPrep minis began using them. I am still using the CeraVe if I feel like I need extra cleansing from on a heavier than usual makeup day or a day when I have car line duty at school. I still put on the drop of clinique after the BeautyPrep lotion, but I think I may be able to wean myself off of that soon too.... The result? my skin is looking so amazingly clear and looks/feels dewy fresh!! I am even seeing improvement in the skin on my neck and chest which has had a few areas of light rosacea-like patches. I am thrilled and I mean really really thrilled with these three products. These products are just perfect. I pray that they be available for the rest my life!!",
        "headline": "Best Ever! (After a bit of a journey)",
        "rating": 5,
        "ugc_id": 407027356
      },
      "faceoff_negative": {
        "comments": "I have been using Jane iredale products since last 7-8 years and love her products. Find the products a bit pricy but worth it. I have limited budget and save up for buying her products.recently, I bought cleanser, toner and the face cream. I find that cleanser is too mild. I use ultrasonic brush to remove my make up but I find that cleanser does not work well with it. I stopped using it and started using Jane iredale toner only and would apply the Jane iredale cream after. Within few hours, my face gets very very oily. I keep blotting it with blotting paper but my face stays oily. So, in last few weeks, I have stopped using Jane iredale cleanser and toner. However, I like the cream.",
        "headline": "Face cleanser",
        "rating": 2,
        "ugc_id": 407022549
      },
      "name": "BeautyPrep Face Cleanser",
      "native_review_count": 2,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 184,
      "locale": "en_US"
    }
  }
}