{
  "product_id": "pimprod2004104",
  "product_url": "https://www.ulta.com/p/magic-mitt-pimprod2004104",
  "extracted_at": "2025-09-23T04:28:41.025220+00:00",
  "product_name": "jane iredaleMagic Mitt",
  "brand": "jane iredale",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Makeup Remover"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "makeup"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "22.00",
  "availability": "in_stock",
  "rating_avg": "4.7",
  "rating_count": "324",
  "images": [
    "https://media.ulta.com/i/ulta/2545039?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2545039?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2545039cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2545039cm_alt02?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable Packagingjane iredale's Magic Mitt is a knitted micro-fiber cloth that relies only on water and tiny micro-fibers to penetrate and wash away oil and grime.",
  "details": "DetailsBenefitsQuickly and completely removes makeup using water only.Promotes the health of the skin because it does not affect the acid mantle. When this beneficial barrier is intact, it aids the skin in protecting itself from harmful and invasive bacteria.Made from a new generation of specially knitted micro-fibers that are many times thinner than a human hair and able to penetrate oil films.Breaks the surface tension of the oils that bond makeup to the skin while the fibers gently exfoliate.The combination of warm water and micro-fibers turn the makeup into an emulsion that is easily swept away by the mitt. It will even remove mascara!Item 2545039How To UseWash Magic Mitt in warm water with hand-soap until all makeup residue is gone. Rinse thoroughly and hang it up to dry. Do not store in anything that does not allow it to dry completely. Because these unique micro-fibers slough off all organic residue and dry completely, they ensure that nothing is left on the Mitt to harbor bacteria or fungi.IngredientsKnitted Micro-Fiber.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Wash Magic Mitt in warm water with hand-soap until all makeup residue is gone. Rinse thoroughly and hang it up to dry. Do not store in anything that does not allow it to dry completely. Because these unique micro-fibers slough off all organic residue and dry completely, they ensure that nothing is left on the Mitt to harbor bacteria or fungi.",
  "ingredients": [
    "Knitted Micro-Fiber"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "makeup",
      "cosmetics"
    ],
    "product_type": [
      "cleanser"
    ],
    "skin_type": [
      "dry",
      "combination"
    ],
    "finish": [
      "sheer",
      "oil"
    ],
    "color": [
      "red"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "organic"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2004104",
    "total_reviews": 324,
    "reviews": [
      {
        "review_id": 551388190,
        "rating": 4,
        "headline": "Don't use with tubing mascara!",
        "comments": "Overall i like the wash cloth, fits my hand well and cleans well. However DO NOT USE WITH TUBING MASCARA. Yes it got it all off but now the light pink is stained black with the mascara that i cannot get to wash out! So it looks moldly after one use. Wish i had known this and i wouldnt have used it on tubing mascara. Wish i could get a replacement and start over",
        "nickname": "Liz",
        "location": "Richmond VA",
        "created_date": 1744336057530,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 522763446,
        "rating": 5,
        "headline": "10/10 FANTASTIC!",
        "comments": "I've used lots of brushes/cloths over the last 25 years. This is 100% the BEST. I'm buying a couple more for travel, gym bag etc. Get's EVERYTHING off with my cleanser, all the little crevices, including around my eyes. Dries super fast. perfect shape.",
        "nickname": "shayna",
        "location": "greenville, sc",
        "created_date": 1718724042204,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 471011321,
        "rating": 5,
        "headline": "Yes, it works!",
        "comments": "It seemed too simple to be true but in fact the claims for this product are real. It easily removes makeup, including mascara, then rinses clean and dries overnight. It's a win-win product: good for your skin (it doesn\"t break the natural barrier, good for the environment (no wipes clogging the landfill), and good for your wallet ( no need to buy expensive name- brand cleansers- sorry, Ulta).",
        "nickname": "Hazel",
        "location": "Atlanta",
        "created_date": 1693761944389,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 470854883,
        "rating": 5,
        "headline": "Amazing",
        "comments": "Though skeptical, I decided to try this mitt. Couldn't have been more surprised at how well it works in removing makeup (including mascara), then rinses sparkling clean and dries overnight. It's a win all around: good for your skin (doesn't break the natural barrier), good for the environment (no more makeup wipes clogging landfills), and good for your wallet ( no more need to purchase expensive facial cleansers - sorry, Ulta!). I'm a tough sell but this simple product has really impressed me.",
        "nickname": "Hazel",
        "location": "Atlanta",
        "created_date": 1693582539752,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 429632192,
        "rating": 5,
        "headline": "Best Way to Remove Your Makeup",
        "comments": "I love the magic mitt, it works amazingly well and saves me money on buying makeup removing wipes. It is easy to clean as well. If you came here wondering if this actually works, let me assure you it does. It works great on removing my eye makeup too.",
        "nickname": "Beks",
        "location": "Prattville, Alabama",
        "created_date": 1665783323247,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 385901748,
        "rating": 5,
        "headline": "I will be getting every woman on my list one for the holiday",
        "comments": "I use this at night followed by a gentle toner, retinol treatment and moisturizer.  I feel like it is not just gentler than my regular eye makeup remover on a cotton round, but it actually seems to get ALL the eye makeup off-- it's awesome!  I was worried that it would get stained or gross quickly, but I wash it right after using it, and I guess stuff doesn't have time to set.  People have literally told me that my skin is GLOWING, and it's not like I never exfoliated before.  This product is just GREAT!  Can't wait to gift them to everyone I know!!!",
        "nickname": "Elizabeth",
        "location": "Chicago, IL",
        "created_date": 1635450583046,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 345110432,
        "rating": 5,
        "headline": "The BEST!!",
        "comments": "I have used these off and on for years.  Due to COVID and mask wearing I have a nasty case of maskne....this cloth has brought my skin back to its natural mantle and I am finally seeing some healing of the affected area! Yay!!!",
        "nickname": "Anner",
        "location": "Vermont",
        "created_date": 1621521893214,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 278277781,
        "rating": 5,
        "headline": "❤️❤️❤️",
        "comments": "Awesome product",
        "nickname": "Clau",
        "location": "Murrieta",
        "created_date": 1590867156348,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 263682776,
        "rating": 5,
        "headline": "Love this mitt, have used for years",
        "comments": "I was so happy Ulta started carrying Jane Iredale. I have used these magic mitts for many years. They are great for gently exfoliating my face and lips while in the shower. I lost mine recently and had to order a new one and it's just as good as the one i got a few years ago from another store, glad the manufacturing hasn't changed (that i can tell). I don't love it for removing mascara, it works but I find it to be a pain to clean.",
        "nickname": "Kea",
        "location": "Sea Haven",
        "created_date": 1576937999467,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 232415581,
        "rating": 5,
        "headline": "Great for exfoliation",
        "comments": "These are much better, in my opinion, than the other makeup remover cloths. Those pull at my skin, especially around my eyes, but these don't. These glide across, exfoliate, they are easy to rinse and quick to dry. I don't typically use them to remove tons of makeup, I prefer to use them in the morning for exfoliation. My favorite cloth, so glad Ulta is carrying them!",
        "nickname": "Kea",
        "location": "Sea Haven",
        "created_date": 1552299091924,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 231534677,
        "rating": 1,
        "headline": "Waste of money",
        "comments": "I bought this mitt from a medi-spa that sells Jane Iredale products and was disappointed. After using, my face did not feel washed and in the end I threw the mitt in the garbage.",
        "nickname": "JA",
        "location": "East Aurora, NY",
        "created_date": 1551658195417,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 11,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "bestuses",
          "name": "Best Uses",
          "type": "tag",
          "values": [
            {
              "label": "face cleaner",
              "count": 1
            },
            {
              "label": "makeup removal",
              "count": 1
            }
          ],
          "display_values": [
            "face cleaner",
            "makeup removal"
          ]
        },
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "You need a place to hang it",
              "count": 1
            }
          ],
          "display_values": [
            "You need a place to hang it"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "43yrs old",
              "count": 1
            },
            {
              "label": "don't always wear makeup",
              "count": 1
            }
          ],
          "display_values": [
            "43yrs old",
            "Casual Dresser",
            "Comfort-seeking",
            "Energetic/Active",
            "Stylish/Fashionista",
            "Trendy/Stylish Dresser",
            "Youthful",
            "don't always wear makeup"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "cleans better than my current eye makeup remover",
              "count": 1
            },
            {
              "label": "easy to fly with (no liquid component)",
              "count": 1
            },
            {
              "label": "good for the enviroment",
              "count": 1
            },
            {
              "label": "light exfoliation",
              "count": 1
            },
            {
              "label": "super gentle",
              "count": 1
            }
          ],
          "display_values": [
            "cleans better than my current eye makeup remover",
            "easy to fly with (no liquid component)",
            "good for the enviroment",
            "light exfoliation",
            "super gentle"
          ]
        }
      ],
      "rating_histogram": [
        5,
        8,
        8,
        24,
        279
      ],
      "review_histogram": [
        5,
        8,
        8,
        24,
        279
      ],
      "rating_count": 324,
      "review_count": 324,
      "average_rating": 4.74,
      "recommended_ratio": 0.94,
      "media": [],
      "faceoff_positive": {
        "comments": "I was very skeptical as to how this product would work considering it is simply a washcloth with no chemicals, creams, etc. to assist in removing makeup. I heard of this product on a makeup blog and decided to give it a try on a whim because the writer was so enthusiastic about her Magic Mitt. When my Magic Mitt first arrived (sooner than I had expected), it was packaged so nicely and included very cute personal touches even though I only ordered this one product. I could not wait to use it and had on a full face – concealer, foundation, powder, eyeliner, and tons of mascara. It was a true test. I normally use a disposable makeup remover wipe (like Neutrogena or something similar), and the Magic Mitt worked just as good at removing my face makeup and, after about 90 seconds of use, removed my eye makeup better than the remover wipes! Although the Magic Mitt took a bit more elbow grease to remove my heavy eye makeup, I was AMAZED! There was no \"raccoon eye\" that normally happens and my face was soft and smooth after use. I feel good using this product because there are no harsh chemicals or additives and I am a complete convert. After one month, this product has already paid for itself as I do not have to keep buying more and more remover wipes. In fact, I love my Magic Mitt so much I just ordered one for my sister who has very sensitive skin that is prone to breakouts (I have drier skin and very rarely get any pimples or blackheads). I can't wait for her to try her Magic Mitt! Cleaning the mitt is simple – I just rub on some bar soap, scrub the mitt against itself until the makeup is washed off (about 30 seconds) and hang to dry. I HIGHLY recommend this product and if you are skeptical – go for it, it is worth every penny and more!",
        "headline": "Amazing Product!",
        "rating": 5,
        "ugc_id": 407022486
      },
      "faceoff_negative": {
        "comments": "This product does what it says. Removes your make up, and it does it well with only water. However, I still need to cleanse my face and this adds an extra step. While I love the feel and outcome of using this, it's just an extra step for me. Also like the fact that it is reusable to reduce waste, but a lot of work to wash out each eve. Checked \"yes\" I would recommend because is a good product.",
        "headline": "Removes Make up Well",
        "rating": 3,
        "ugc_id": 407015996
      },
      "name": "Magic Mitt",
      "native_review_count": 11,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 313,
      "locale": "en_US"
    }
  }
}