{
  "product_id": "",
  "product_url": "https://www.ulta.com/p/retinol-firming-eye-cream-xlsImpprod18731171",
  "extracted_at": "2025-09-23T05:02:40.472347+00:00",
  "product_name": "Kate Somerville+Retinol Firming Eye Cream",
  "brand": "Kate Somerville",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Cream"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "eye-cream"
  ],
  "currency": "USD",
  "list_price": "50",
  "sale_price": "99.00",
  "availability": "in_stock",
  "rating_avg": "3.6",
  "rating_count": "54",
  "images": [
    "https://media.ulta.com/i/ulta/2531105?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2531105?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2531105cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2531105cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2531105cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2531105cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2531105cm_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2531105cm_alt06?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryEye creams without actives are doing almost nothing. That’s why Kate Somerville's +Retinol Firming Eye Cream is formulated with clinic-stabilized Retinol and Hyaluronic Acid to visibly firm, brighten, and hydrate the delicate skin around the eyes, while the metal applicator helps with depuffing.",
  "details": "DetailsBenefitsHydrate, firm + brighten eye areaSoften look of fine lines + dark spotsEnhance skin smoothnessResearch ResultsAfter just 1 use:100% of women showed improvement in the appearance of coarse wrinkles/crow's feet around the eye area100% of women showed improvement in the appearance of fine lines/crow's feet around the eye area100% of women showed improvement in skin moisturization around the eye area91% of women showed improvement in the appearance of skin elasticity around the eye areaAfter 4 weeks:100% of women showed improvement in the appearance of coarse wrinkles & crow's feet around the eye area100% of women showed improvement in moisturization around the eye area97% of women showed improvement in the appearance of fine lines/crow's feet around the eye area94% of women showed improvement in the appearance of skin firmness around the eye area94% of women showed improvement in the appearance of skin elasticity around the eye area*Results based on independent Clinical StudyKey IngredientsRetinol : Relaxes the appearance of fine lines and wrinkles, increases skin elasticity and firmness, smooths texture, enhances skin clarity and reduces the appearance of dark spots.Bio Retinol (from Babchi Edible Seeds) : Helps reverse improve the visible signs of aging, supports hydration, visible softening of wrinkles, improved skin clarity and firmness and reduction in rough skin texture.A natural blend of Bidens Pilosa Extract (aka Spanish Needles) + Cotton and Linseed Seed Oils : Helps smooth the appearance of wrinkles and improve skin elasticity and density.Hyaluronic Acid : Increases hydration and helps smooth the appearance of skin.Lime Pearl : Loosens keratinized cells and helps improve skin cell turnoverItem 2531105How To UseGood for: Morning + EveningHow often: DailyApplication: Gently pat small amount around the eye area. Gold applicator tip will \"bend\" to help massage product into the delicate eye area. Can also be used on upper brow area.Kate's Tip: Most retinols can only be used in the evening, but you can use +Retinol Firming Eye Cream in the day. Just be sure to wear sunscreen before going out in the sunlight.IngredientsWater/Aqua/Eau, Dimethicone, Propanediol, Glycerin, Polysilicone-11, Synthetic Fluorphlogopite, Butylene Glycol, Polymethylsilsesquioxane, Ethyl Linoleate, Lauryl Polyglyceryl-3 Polydimethylsiloxyethyl Dimethicone, Retinol, Hydroxypinacolone Retinoate, Bidens Pilosa Extract, Bakuchiol, Hydrolyzed Hyaluronic Acid, Microcitrus Australasica Fruit Extract, Oryza Sativa (Rice) Bran Extract, Terminalia Chebula Fruit Extract, Glycine Soja (Soybean) Extract, Elaeis Guineensis (Palm) Oil, Gossypium Herbaceum (Cotton) Seed Oil, Helianthus Annuus (Sunflower) Seed Oil, Linum Usitatissimum (Linseed) Seed Oil, Adenosine, Aloe Barbadensis Leaf Juice Powder, Rosmarinus Officinalis (Rosemary) Leaf Extract, Tocopherol, Dimethyl Isosorbide, HDI/Trimethylol Hexyllactone Crosspolymer, Polyacrylamide, Phenoxyethanol, Ethylhexyl Hydroxystearate, PEG-12 Dimethicone, C13-14 Isoparaffin, Caprylyl Glycol, Decyl Glucoside, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Hexylene Glycol, Ethylhexylglycerin, Aminomethyl Propanol, Laureth-7, Xanthan Gum, Disodium EDTA.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Good for: Morning + EveningHow often: DailyApplication: Gently pat small amount around the eye area. Gold applicator tip will \"bend\" to help massage product into the delicate eye area. Can also be used on upper brow area.Kate's Tip: Most retinols can only be used in the evening, but you can use +Retinol Firming Eye Cream in the day. Just be sure to wear sunscreen before going out in the sunlight.",
  "ingredients": [
    "Water/Aqua/Eau",
    "Dimethicone",
    "Propanediol",
    "Glycerin",
    "Polysilicone-11",
    "Synthetic Fluorphlogopite",
    "Butylene Glycol",
    "Polymethylsilsesquioxane",
    "Ethyl Linoleate",
    "Lauryl Polyglyceryl-3 Polydimethylsiloxyethyl Dimethicone",
    "Retinol",
    "Hydroxypinacolone Retinoate",
    "Bidens Pilosa Extract",
    "Bakuchiol",
    "Hydrolyzed Hyaluronic Acid",
    "Microcitrus Australasica Fruit Extract",
    "Oryza Sativa (Rice) Bran Extract",
    "Terminalia Chebula Fruit Extract",
    "Glycine Soja (Soybean) Extract",
    "Elaeis Guineensis (Palm) Oil",
    "Gossypium Herbaceum (Cotton) Seed Oil",
    "Helianthus Annuus (Sunflower) Seed Oil",
    "Linum Usitatissimum (Linseed) Seed Oil",
    "Adenosine",
    "Aloe Barbadensis Leaf Juice Powder",
    "Rosmarinus Officinalis (Rosemary) Leaf Extract",
    "Tocopherol",
    "Dimethyl Isosorbide",
    "HDI/Trimethylol Hexyllactone Crosspolymer",
    "Polyacrylamide",
    "Phenoxyethanol",
    "Ethylhexyl Hydroxystearate",
    "PEG-12 Dimethicone",
    "C13-14 Isoparaffin",
    "Caprylyl Glycol",
    "Decyl Glucoside",
    "Acrylates/C10-30 Alkyl Acrylate Crosspolymer",
    "Hexylene Glycol",
    "Ethylhexylglycerin",
    "Aminomethyl Propanol",
    "Laureth-7",
    "Xanthan Gum",
    "Disodium EDTA"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "moisturizer",
      "mask",
      "treatment",
      "eye cream"
    ],
    "skin_type": [
      "mature"
    ],
    "finish": [
      "sheer",
      "creamy",
      "powdery",
      "cream",
      "oil"
    ],
    "ingredients": [
      "hyaluronic-acid",
      "retinol",
      "synthetic"
    ],
    "brand": [
      "mid-range",
      "premium"
    ],
    "special_features": [
      "natural",
      "anti-aging"
    ]
  },
  "reviews": {
    "product_id": "xlsImpprod18731171",
    "total_reviews": 54,
    "reviews": [
      {
        "review_id": 554754094,
        "rating": 1,
        "headline": "Burns eye area",
        "comments": "Not effective. Burns eye area.",
        "nickname": "ZJ",
        "location": "Fishers, IN",
        "created_date": 1749448501731,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 543677451,
        "rating": 2,
        "headline": "Burns!",
        "comments": "This burned my eyelids and made them water like crazy. I hope I can return this because it is not good for me. I would sample this before you actually buy it. I have been using it for a week and don't see any improvement at all? It's not even that Moisturizing.",
        "nickname": "Marjorie",
        "location": "NYC",
        "created_date": 1737466359857,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 5
      },
      {
        "review_id": 542074207,
        "rating": 5,
        "headline": "THIS IS THE REAL DEAL",
        "comments": "Listen, you get what you pay for! Yes, it's expensive but if you get quick results, then it's worth it! I have used many other high end brands and this has given me the best results almost immediately. I recognized a difference in less than 7 days. I am 40 and have neglected my under eye for too long. I also love the same product for my face. I will say that if you are sensitive, this may be too strong to use every day. I can only use it 4 days out of 7 in a week or I start to get red bumps from irritation, but I do not get any burning when using it. Thank you, Ulta for carrying Kate Somerville products!",
        "nickname": "SNBoo",
        "location": "Dayton, OH",
        "created_date": 1735691735235,
        "bottom_line": null,
        "helpful_votes": 12,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542045653,
        "rating": 5,
        "headline": "Best Eye Cream Ever",
        "comments": "I'm 47. This is the best eye cream I've ever used and I've tried a lot of high end eye creams.",
        "nickname": "BeachBum",
        "location": "Santa Cruz California 🌊",
        "created_date": 1735640569852,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 538627475,
        "rating": 5,
        "headline": "Hard to Impress",
        "comments": "I started using this about 6 months ago. I like to apply this after my serums, let it set for several minutes and then apply my undereye night moisturizer. I'm in my early 40's and im beginning to develop minimal small fine lines under my eyes. This retinol not omly works but lasts for ever. Im still on my first tube.",
        "nickname": "Skincare Lover",
        "location": "Texas",
        "created_date": 1732592684065,
        "bottom_line": null,
        "helpful_votes": 20,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537140550,
        "rating": 5,
        "headline": "Invest in Your Under Eyes 👀",
        "comments": "Use it. It works. Yes, its expensive. Plastic surgery is way more expensive, 😂😂.",
        "nickname": "BeachBum",
        "location": "Santa Cruz California 🌊",
        "created_date": 1730448416952,
        "bottom_line": null,
        "helpful_votes": 22,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537140595,
        "rating": 5,
        "headline": "Invest in Your Under Eyes 👀",
        "comments": "Use it. It works. Yes, its expensive. Plastic surgery is way more expensive, 😂😂.",
        "nickname": "BeachBum",
        "location": "Santa Cruz California 🌊",
        "created_date": 1730448416307,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 509910268,
        "rating": 2,
        "headline": "Stings my sensitive skin, but nice applicator",
        "comments": "After going through the whole tube and using this eye cream twice daily, I did not notice a difference compared to my previous eye regimen. From day one, the product stung my skin, but I wanted to see if it was \"worth it,\" so I kept going through the whole tube. I did like the gold applicator: it felt cool--and relieved some of the sting/burn--and smoothed the product on without tugging at the skin. I'm 49 and have fine lines. I also have genetically inherited dark circles. I can't say there was any improvement, just maintenance. I will go back to using Eminence Organics eye products and the cheap (but just as effective without the burning) RoC retinol eye cream until another miracle cream comes along.",
        "nickname": "Laura",
        "location": "Santa Cruz, CA",
        "created_date": 1711568718392,
        "bottom_line": "No",
        "helpful_votes": 11,
        "not_helpful_votes": 0
      },
      {
        "review_id": 482150153,
        "rating": 5,
        "headline": "Best Eye Cream",
        "comments": "This is by far the best Eye Cream I've ever used. I turned 46 yesterday and I will continue to purchase this cream until the end of time!!",
        "nickname": "BeachBum",
        "location": "Santa Cruz CA 🌊",
        "created_date": 1700620333658,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 454449646,
        "rating": 1,
        "headline": "No difference",
        "comments": "It didn't make skin under eyes worse but also after finishing entire tube ,using it daily there was no visible improvements.",
        "nickname": "Kelly",
        "location": "Acton MA",
        "created_date": 1682091682395,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 418334888,
        "rating": 3,
        "headline": "Firming Eye cream",
        "comments": "I wanted to live this ! It's very moisturizing and doesn't irritate the skin but I haven't noticed a difference and I've seen better results from products half the price.",
        "nickname": "Candi",
        "location": "Daphne Al",
        "created_date": 1658536852968,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 1
      },
      {
        "review_id": 401809664,
        "rating": 3,
        "headline": "Horrible Reaction",
        "comments": "I literally had this on for less than 1 minute. It burned on contact but I gave it a few seconds. Big mistake. I washed it off and found my under eyes were pink. I applied my normal cream and went to bed. I didn't recognize myself in the morning. My eyes were swollen, dry, red, itchy and burned. I looked 30 years older and was in terrible discomfort. I hydrated like crazy for a week and I still have leftover damage. And weird bumps are now showing up. This stuff was poison for my eyes. Buyer beware.",
        "nickname": "Jeni",
        "location": "Michigan",
        "created_date": 1647037255906,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 400004513,
        "rating": 5,
        "headline": "Super Smooth Eye Cream",
        "comments": "I first tried this eye cream as a that was in a sample bag of Ulta freebies.  I didn't use it for a long time, thinking it wouldn't be any different than the other dozen eye creams I tried this past year… but I was wrong!!  This one IS different!!  It leaves my wrinkly eyes super smooth and it makes the skin around my eyes feel really silky.  I did notice a bit of drying / patchiness at first but after a little over a week that completely stopped.  After years of searching for an exceptional eye cream - I've found it.  LOVE THIS!",
        "nickname": "Michat",
        "location": "New Mexico",
        "created_date": 1645648282915,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 396006253,
        "rating": 5,
        "headline": "This saved my eyes",
        "comments": "I will never be without this. At 43, my face is aging very well. No wrinkles. But I started getting all these lines in my eye area. This product transformed my eyes. No more lines. Retinol is trying so I only use this at night and I apply another eye cream on top for moisture but this stuff is incredible. I was super elated to get it half off. Wish I could have afforded to buy more than 1",
        "nickname": "LianaR",
        "location": "Southern Maryland",
        "created_date": 1643823740209,
        "bottom_line": "Yes",
        "helpful_votes": 7,
        "not_helpful_votes": 1
      },
      {
        "review_id": 374602192,
        "rating": 1,
        "headline": "Allergic Ophthalmologic Reaction!!",
        "comments": "How can just a tiny amount of this product cause red, itchy bumps around and IN my eyes!  I'm an RN and very careful about these things but this product was the worst!  Tried to isolate if the reaction was absolutely due to this eye cream but second try and the same thing happened.  My eyes became dry and scratchy & had to see an ophthalmologist for steroid cream!  Have used retinol for years w/no reactions so very surprised at what occurred.  Will only use SAMPLES from now on for any new skincare product to insure no reactions before buying full sizes.  Be careful with this - it may be in the cosmetic category but for me was incredibly caustic.",
        "nickname": "Doogiesmom",
        "location": "New Orleans",
        "created_date": 1628264304554,
        "bottom_line": "No",
        "helpful_votes": 19,
        "not_helpful_votes": 2
      },
      {
        "review_id": 333812871,
        "rating": 1,
        "headline": "Allergic Reaction",
        "comments": "Within 2 days of using product the area around my eyes swelled up and then a day later dry patches showed up. The worst is the item came with 3 free samples for my face which I used so now my entire face is swollen and I have flaky skin. My skin looks horrible! My wrinkles are even more prominent. \nI really wanted to like this product and now I'm afraid to try anything else.",
        "nickname": "Kris",
        "location": "Chesapeake, VA",
        "created_date": 1615351518891,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 3
      },
      {
        "review_id": 321389202,
        "rating": 5,
        "headline": "Plumpness is back",
        "comments": "This product was amazing. I got it during one of the ulta days sales. After a week of using the product I saw that my skin hydrated and supple which is obviously necessary for wrinkle prevention. I also use it on my forehead and around my mouth.",
        "nickname": "Xoxoxcaroqxoxo",
        "location": "Oakland, Ca",
        "created_date": 1608483985144,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 315265600,
        "rating": 3,
        "headline": "Mixed feelings",
        "comments": "I have tried everything under the sun for my dark circles. Even this. Nothing has work. Even sleep doesn't work (in case you're thinking it's sleep). Gave it to my mom to used since I was switching/trying something different again and vuala! She loves it! Swears by it. It improved her wrinkles, bags and color. Too expensive for her so she would not purchase it. So this is why my 3 star. Didn't do anything for me but for my mom it did.",
        "nickname": "Laura",
        "location": "Chicago",
        "created_date": 1605500247870,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 2
      },
      {
        "review_id": 280938466,
        "rating": 2,
        "headline": "Don't use with exfoliating acids",
        "comments": "I used it for 5 days and it burned my under eye area. It hurts so I stopped using it. I read another review that says I shouldn't use with AHA's and I was so that's probably where I went wrong. I can't give up AHA's so I'll give this up.",
        "nickname": "Kassy",
        "location": "Hayward, CA",
        "created_date": 1592793013535,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 280564062,
        "rating": 1,
        "headline": "BURNED MY FACE",
        "comments": "I used it around my eyes and put the rest of the amount I had squeezed out on my forehead and neck. Then I went to sleep. Woke up with red bumps all over my face and neck, and a day later it's still scratching! I bought this 9 months ago (September 2019), and it's been kept in a box in my closet - so out of sunlight and heat, and closed. I dont know if it's a bad batch or what - but I'm definitely returning this, and I hope that no one else experienced this. I read one review just now from someone else who experienced the same thing, and she also bought it around that time. Whatever the reason - it should not be happening.",
        "nickname": "Keren",
        "location": "Pittsburgh, PA",
        "created_date": 1592311534756,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 54,
      "pages_total": 3,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/xlsImpprod18731171/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "bestuses",
          "name": "Best Uses",
          "type": "tag",
          "values": [
            {
              "label": "Loose Skin",
              "count": 2
            },
            {
              "label": "Wrinkles",
              "count": 2
            },
            {
              "label": "Use at night",
              "count": 1
            },
            {
              "label": "Tired Eyes",
              "count": 1
            },
            {
              "label": "Last step before sunscreen.",
              "count": 1
            },
            {
              "label": "Let skin products absorb fully before makeup.",
              "count": 1
            },
            {
              "label": "Moisturize then dab around eyes & orbital bone.",
              "count": 1
            }
          ],
          "display_values": [
            "Dark Circles",
            "Last step before sunscreen.",
            "Let skin products absorb fully before makeup.",
            "Loose Skin",
            "Moisturize then dab around eyes & orbital bone.",
            "Puffiness",
            "Tired Eyes",
            "Use at night",
            "Wrinkles"
          ]
        },
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "None",
              "count": 1
            },
            {
              "label": "Does not moisturize",
              "count": 1
            },
            {
              "label": "None!",
              "count": 1
            }
          ],
          "display_values": [
            "Does not moisturize",
            "None",
            "None!"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "Brand Buyer",
              "count": 2
            },
            {
              "label": "Almost 40 and not a wrinkle in sight",
              "count": 1
            },
            {
              "label": "Aged 45, medium complexion, combination to dry",
              "count": 1
            },
            {
              "label": "40+",
              "count": 1
            },
            {
              "label": "30s",
              "count": 1
            },
            {
              "label": "Dark circles",
              "count": 1
            },
            {
              "label": "Olive skin",
              "count": 1
            },
            {
              "label": "Caring for myself, not others opinions.",
              "count": 1
            },
            {
              "label": "Happy, almost 47 yr, in April, young woman.",
              "count": 1
            },
            {
              "label": "Living with MS & Crohn's Disease.",
              "count": 1
            },
            {
              "label": "Porcelain/cool undertones. Easily burns.",
              "count": 1
            },
            {
              "label": "Sensitive skin.",
              "count": 1
            }
          ],
          "display_values": [
            "30s",
            "40+",
            "Aged 45, medium complexion, combination to dry",
            "Almost 40 and not a wrinkle in sight",
            "Brand Buyer",
            "Budget Shopper",
            "Caring for myself, not others opinions.",
            "Casual Dresser",
            "Comfort-seeking",
            "Dark circles",
            "Energetic/Active",
            "Happy, almost 47 yr, in April, young woman.",
            "Living with MS & Crohn's Disease.",
            "Olive skin",
            "Porcelain/cool undertones. Easily burns.",
            "Sensitive skin.",
            "Stylish/Fashionista",
            "Trendy/Stylish Dresser",
            "Youthful"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "Effective",
              "count": 2
            },
            {
              "label": "Easy to apply",
              "count": 1
            },
            {
              "label": "Texture is smooth and non-greasy",
              "count": 1
            },
            {
              "label": "Under eye area is smoother and looks younger",
              "count": 1
            },
            {
              "label": "Won't sting you eyes",
              "count": 1
            },
            {
              "label": "Gentle",
              "count": 1
            },
            {
              "label": "Lightweight",
              "count": 1
            },
            {
              "label": "Soothing",
              "count": 1
            },
            {
              "label": "Does not clog pores",
              "count": 1
            },
            {
              "label": "Product lasts several months",
              "count": 1
            },
            {
              "label": "Reduces puffiness",
              "count": 1
            },
            {
              "label": "Cool applicator",
              "count": 1
            },
            {
              "label": "Doesn't irritate skin",
              "count": 1
            },
            {
              "label": "Easy to use",
              "count": 1
            },
            {
              "label": "Fast results",
              "count": 1
            },
            {
              "label": "I can see an difference right away!",
              "count": 1
            },
            {
              "label": "Super smoothing",
              "count": 1
            },
            {
              "label": "Gentle for daily use on sensitive skin.",
              "count": 1
            },
            {
              "label": "Smoothe texture to pat around eyes.",
              "count": 1
            },
            {
              "label": "anti-aging",
              "count": 1
            },
            {
              "label": "dark circles",
              "count": 1
            },
            {
              "label": "fine lines",
              "count": 1
            }
          ],
          "display_values": [
            "Cool applicator",
            "Does not clog pores",
            "Doesn't irritate skin",
            "Easy to apply",
            "Easy to use",
            "Effective",
            "Fast results",
            "Gentle",
            "Gentle for daily use on sensitive skin.",
            "Good Value",
            "I can see an difference right away!",
            "Lightweight",
            "Organic",
            "Product lasts several months",
            "Reduces puffiness",
            "Smells Great",
            "Smoothe texture to pat around eyes.",
            "Soothing",
            "Super smoothing",
            "Texture is smooth and non-greasy",
            "Under eye area is smoother and looks younger",
            "Won't sting you eyes",
            "anti-aging",
            "dark circles",
            "fine lines"
          ]
        },
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Combination",
              "count": 1
            },
            {
              "label": "Oily",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        9,
        5,
        10,
        3,
        27
      ],
      "review_histogram": [
        9,
        5,
        10,
        3,
        27
      ],
      "rating_count": 54,
      "review_count": 54,
      "average_rating": 3.63,
      "recommended_ratio": 0.62,
      "media": [
        {
          "id": "268384449",
          "review_id": 268384447,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ihjrkpphtrdinqa0xhbd.jpg",
          "headline": "Works almost instantly! Will purchase again!",
          "rating": 5,
          "helpful_votes": 1,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Gotta get up super close to even try to see any eye wrinkles now! Even at almost 47yrs & I love it!",
          "nickname": "Rudie (My mom nicknamed me.)",
          "created_date": 1584036296006
        },
        {
          "id": "268384448",
          "review_id": 268384447,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/yr2rb3s5uh2xxpx98nbp.jpg",
          "headline": "Works almost instantly! Will purchase again!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Fast working in just a week with noticable improvement in fine lines.",
          "nickname": "Rudie (My mom nicknamed me.)",
          "created_date": 1584036296006
        },
        {
          "id": "268384415",
          "review_id": 268384447,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/rftlhlapbaoyekujvro8.jpg",
          "headline": "Works almost instantly! Will purchase again!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Very pleased with how I'm aging using reputable products.",
          "nickname": "Rudie (My mom nicknamed me.)",
          "created_date": 1584036296006
        },
        {
          "id": "268384458",
          "review_id": 268384447,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ni0n6gdj6vp1hfsyothj.jpg",
          "headline": "Works almost instantly! Will purchase again!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Package bought these power house products together.",
          "nickname": "Rudie (My mom nicknamed me.)",
          "created_date": 1584036296006
        },
        {
          "id": "259075936",
          "review_id": 259075897,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/zzxtojblq2sprrvrl936.jpg",
          "headline": "We not be purchasing again",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Same price, less product.",
          "nickname": "LUcy",
          "created_date": 1571340262625
        }
      ],
      "faceoff_positive": {
        "comments": "Let me first say that I almost never leave reviews even when I like a product. Yes, I'm that lazy. But being stuck in my house from this crazy pandemic, I really have nothing better to do. With that out of the way, I have to say that I was skeptical about this product. Especially with such sketchy reviews with this either working like a miracle serum for some or doing absolutely nada for others. I really like Kate Somerville, but know nothing is as good as it is ever touted to be. So, with this being 50% off, I thought I'd take a chance. \n\nAll I can say is I'm speechless. This stuff is amazing. Not sure what is in it or why it worked so well with my skin, but I immediately saw a difference. I know it's not going to be permanent, because nothing is except for a botched facelift. I've walked into the bathroom like 15 times to keep checking the results. I'm bummed I didn't take a mortgage out on my house to buy stock in this.\n\nBe prepared for a burn though. I think someone mentioned that in the reviews. It didn't give me a chemical burn, but I did feel a warm sensation. The serum is thick and sticky as well, so only a small amount is needed and make sure to really pat it in and let it dry.\n\nI have what you considered \"mature\" skin, so ANY changes are noticeable for me as I need as much help as I can get. I'm curious if the negative reviews are from the younger generation. At any rate, I'm kicking myself for stocking up on toilet paper and fruit roll ups for my kids, when I should've bought out this product when it was 50% off. Ces't la vie. \n\nOh! My daughter works for S*phora (shhhhhh…I like Ulta better) and she says she's seen some amazing results with this, but I still didn't believe her until I tried it myself. She also said that about Cover FX's blurring primer and the only thing that blurred was my husband's eyesight from looking at the giant pores on my face all day. So take it for what it's worth. Looks like this will be a love hate relationship for most.",
        "headline": "Crack For Your Eyes!",
        "rating": 5,
        "ugc_id": 268792835
      },
      "faceoff_negative": {
        "comments": "After going through the whole tube and using this eye cream twice daily, I did not notice a difference compared to my previous eye regimen. From day one, the product stung my skin, but I wanted to see if it was \"worth it,\" so I kept going through the whole tube. I did like the gold applicator: it felt cool--and relieved some of the sting/burn--and smoothed the product on without tugging at the skin. I'm 49 and have fine lines. I also have genetically inherited dark circles. I can't say there was any improvement, just maintenance. I will go back to using Eminence Organics eye products and the cheap (but just as effective without the burning) RoC retinol eye cream until another miracle cream comes along.",
        "headline": "Stings my sensitive skin, but nice applicator",
        "rating": 2,
        "ugc_id": 509910268
      },
      "name": "+Retinol Firming Eye Cream",
      "native_review_count": 54,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 0,
      "locale": "en_US"
    }
  }
}