{
  "product_id": "pimprod2046256",
  "product_url": "https://www.ulta.com/p/cicaplast-balm-b5-uv-soothing-therapeutic-multi-purpose-cream-spf-50-pimprod2046256",
  "extracted_at": "2025-09-23T03:34:09.871415+00:00",
  "product_name": "La Roche-PosayCicaplast Balm B5 UV Soothing Therapeutic Multi-Purpose Cream SPF 50",
  "brand": "La Roche-Posay",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Face Moisturizer"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "face"
  ],
  "currency": "USD",
  "list_price": "20.99",
  "sale_price": "15.74",
  "availability": "in_stock",
  "rating_avg": "4.7",
  "rating_count": "227",
  "images": [
    "https://media.ulta.com/i/ulta/2625718?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2625718?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2625718_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2625718_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2625718_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2625718_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2625718_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2625718_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2625718_vid01/thumbs/fb2ebf66-4c26-455f-9585-a871db98c062?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsVeganHSA/FSA eligibleLa Roche-Posay Cicaplast Balm B5 UV Soothing Therapeutic Multi Purpose Cream with shea butter relieves dry skin and irritation, while helping protect skin exposed to the sun.",
  "details": "DetailsBenefitsProvides immediate and long-lasting, all-day hydration for cracked, chapped, and chafed skinBroad spectrum SPF 50 helps protect skin from the sunKey IngredientsTribioma, helps restore the skin's natural barrierShea Butter, known for its soothing and restoringMadecassoside, used as a therapeutic agent in wound healingFormulated WithoutFragranceParabensItem 2625718How To UseApply balm as needed to cleansed, dry skin. Can be applied to face, body, hands and lips.Precautions: Avoid the eye area.IngredientsWater, Glycerin, Propanediol, Petrolatum, Butyloctyl Salicylate, Panthenol, Dimethicone, Butyrospermum Parkli (Shea) Butter, Stearetn-20, Cellulose, Ethylhexyl Methoxycrylene, Polymnia Sonchitolia Root Juice, Oryza Sativa (Rice) Bran Wax, Steareth-2, Sorbitan Isostearate, Madecassoside, Triethoxycaprylyisilane, Alpha-Glucan Oligosaccharide, Mannose, Ammonium Polyacryloyldimethyl Taurate, Hydroxyacetophenone, Hydroxyethyl Acrylate/ Sodium Acryloy Dimethy, Taurate Copolymer, Nydroxyethy Cellulose, Capryly! Glycol, Citric Acid, Trisodium Ethylenediamine Disuccinate, Lactobacillus, Maltodextrin, Pentylene Glycol, Polynydroxysteric Acid, Polysorbate 60, C12-22 Alkyl Acrylate/ Hydroxyethylacrylate Copolymer, Chlorphenesin.",
  "how_to_use": "Apply balm as needed to cleansed, dry skin. Can be applied to face, body, hands and lips.Precautions: Avoid the eye area.",
  "ingredients": [
    "Water",
    "Glycerin",
    "Propanediol",
    "Petrolatum",
    "Butyloctyl Salicylate",
    "Panthenol",
    "Dimethicone",
    "Butyrospermum Parkli (Shea) Butter",
    "Stearetn-20",
    "Cellulose",
    "Ethylhexyl Methoxycrylene",
    "Polymnia Sonchitolia Root Juice",
    "Oryza Sativa (Rice) Bran Wax",
    "Steareth-2",
    "Sorbitan Isostearate",
    "Madecassoside",
    "Triethoxycaprylyisilane",
    "Alpha-Glucan Oligosaccharide",
    "Mannose",
    "Ammonium Polyacryloyldimethyl Taurate",
    "Hydroxyacetophenone",
    "Hydroxyethyl Acrylate/ Sodium Acryloy Dimethy",
    "Taurate Copolymer",
    "Nydroxyethy Cellulose",
    "Capryly! Glycol",
    "Citric Acid",
    "Trisodium Ethylenediamine Disuccinate",
    "Lactobacillus",
    "Maltodextrin",
    "Pentylene Glycol",
    "Polynydroxysteric Acid",
    "Polysorbate 60",
    "C12-22 Alkyl Acrylate/ Hydroxyethylacrylate Copolymer",
    "Chlorphenesin"
  ],
  "extended_contents": {
    "images": [
      "https://content.syndigo.com/asset/1af179d0-c63e-4b6f-9d3e-c1b6eaf80d45/480.webp",
      "https://content.syndigo.com/asset/a6c08a89-4b63-4e0b-b8a0-a80e202fb34d/480.webp",
      "https://content.syndigo.com/asset/773bd3e0-b8e7-4331-ad1f-1095eef55378/960.webp",
      "https://content.syndigo.com/asset/0a152d27-c9be-4087-8fb1-9a86408a1229/240.jpg",
      "https://content.syndigo.com/asset/b434d6f8-ca9c-4141-af3a-8b8ec6843b34/240.jpg",
      "https://content.syndigo.com/asset/82b51def-86fd-4bd4-af2d-0faf991220b9/240.jpg",
      "https://content.syndigo.com/asset/b8e91068-3cff-40d0-93d5-3be02e5fec29/240.jpg",
      "https://content.syndigo.com/asset/5527daa9-c929-49e2-8337-cf4c20d090c3/1464.webp",
      "https://content.syndigo.com/asset/5527daa9-c929-49e2-8337-cf4c20d090c3/240.webp",
      "https://content.syndigo.com/asset/b6944aea-2d41-4752-920c-c2fa7f20469a/480.webp"
    ]
  },
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "moisturizer",
      "sunscreen",
      "lip gloss"
    ],
    "skin_type": [
      "dry",
      "sensitive"
    ],
    "finish": [
      "sheer",
      "long-wear",
      "cream"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "vegan",
      "natural",
      "spf",
      "soothing",
      "repairing"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2046256",
    "total_reviews": 227,
    "reviews": [
      {
        "review_id": 557249708,
        "rating": 3,
        "headline": "White Cast and takes a while to blend",
        "comments": "Super hydrating but it is thick. I found it tends to pill on me. However it never bothered my sensistive combination skin. So SPF with no breakouts or irritation is a win! \nAs a zinc sunscreen it doesn't blend easily, probably won't repurchase the SPF version. Threw it in my purse to have as a sunscreen option on the go. I only use this when my skin is VERY dry or for something like the gym where I'm not as worried if it isn't blended as well and there are some white streaks on my face.",
        "nickname": "Shelby",
        "location": "California",
        "created_date": 1752611319274,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 551902606,
        "rating": 5,
        "headline": "Sooths the irritated skin with hormonal acne",
        "comments": "I have hormonal acne, and this cream, used along with other products from the line, really helped me to achieve a better akin texture. I apply it before going to bed making sure I massage it to be abosrved completely. I also use it during the day but not as often",
        "nickname": "Laura",
        "location": "Utah",
        "created_date": 1744912786427,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 548936364,
        "rating": 4,
        "headline": "Great at moisturizing & sun protection, might break you out",
        "comments": "This product with added spf unfortunately broke me out (face). however so, I would still recommend it elsewhere for sun protection.",
        "nickname": "Jess",
        "location": "Sacramento, CA",
        "created_date": 1742235285639,
        "bottom_line": null,
        "helpful_votes": 10,
        "not_helpful_votes": 1
      },
      {
        "review_id": 547074782,
        "rating": 5,
        "headline": "Great for hands",
        "comments": "I use this product only on my hands Ive tried it on my face but it leaves white marks however it does dry quickly & doesnt leave the skin feeling oily on my hands its perfect on the go I dont see much of white cast on hands",
        "nickname": "Jackie < 3",
        "location": "Los Angeles",
        "created_date": 1740119919849,
        "bottom_line": null,
        "helpful_votes": 8,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542831162,
        "rating": 5,
        "headline": "Sunscreen",
        "comments": "I use this everyday and it makes my skin super dewy and hydrated!",
        "nickname": "Jambigs",
        "location": "Detroit, MI",
        "created_date": 1736821398381,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541588022,
        "rating": 5,
        "headline": "Amazing!",
        "comments": "This is a great SPF/moisturizer combo. As someone who hates sunscreen and almost never wears it, I wanted to start wearing it on my face\nat least and this is the one. I used this over my usual moisturizer and it did not pill nor did it feel greasy. I definitley recommend this to those who like a thicker cream! Another plus is that it does not burn or irritate your eyes like other sunscreens. 5 stars, 10/10!",
        "nickname": "GG",
        "location": "NV",
        "created_date": 1734757407270,
        "bottom_line": null,
        "helpful_votes": 17,
        "not_helpful_votes": 0
      },
      {
        "review_id": 526931688,
        "rating": 3,
        "headline": "Don't use with makeup",
        "comments": "Really excited that LRP came out with this because it is a super nice, soothing sunscreen that doesnt cause breakouts or irritation. However, this is a horrible product to wear under makeup. After letting the sunscreen set into my skin for a while, I tried applying my makeup multiple times. The result was separation: the sunscreen was causing my makeup to separate and made it look spotty and weird. It's never happened with other suncare products I've used in the past. So when I want to wear makeup, I'll go back to Vanicream, but this LRP sunscreen is really nice for the no-makeup days.",
        "nickname": "GStar",
        "location": "Florida",
        "created_date": 1723464751784,
        "bottom_line": null,
        "helpful_votes": 44,
        "not_helpful_votes": 3
      }
    ],
    "paging": {
      "total_results": 7,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        0,
        0,
        11,
        45,
        171
      ],
      "review_histogram": [
        0,
        0,
        11,
        45,
        171
      ],
      "rating_count": 227,
      "review_count": 227,
      "average_rating": 4.7,
      "recommended_ratio": 0.5,
      "media": [],
      "faceoff_positive": {
        "comments": "I recently tried La Roche-Posay Cicaplast Balm UV, and it has quickly become a staple in my skincare routine. This product is nothing short of amazing for anyone with sensitive or compromised skin. Here's why I love it:\n\nEffective Skin Repair:\nThis balm is incredibly effective at repairing and soothing irritated skin. I had some redness and dryness due to a recent dermatological procedure, and the Cicaplast Balm UV helped accelerate the healing process. Within a few days of consistent use, my skin felt significantly more comfortable and looked visibly healthier.\n\nSPF Protection:\nOne of the standout features is the inclusion of SPF 50. It's rare to find a healing balm that also offers such high sun protection. This dual function makes it perfect for daytime use, as it shields sensitive skin from harmful UV rays while promoting recovery. Knowing that my skin is protected from the sun's damaging effects gives me peace of mind.\n\nGentle and Non-Irritating:\nMy skin can be quite reactive, but this balm is incredibly gentle. It contains no fragrances or parabens, and it didn't cause any irritation or breakouts. The texture is rich but not greasy, and it absorbs well, leaving my skin feeling soft and hydrated without any heavy residue.\n\nMulti-Use Versatility:\nI've found this balm to be versatile enough for various uses. Whether it's for healing minor cuts, soothing dry patches, or even as a protective layer on chapped lips, the Cicaplast Balm UV does it all. It's become my go-to product for any skin issue that needs a bit of extra care.\n\nQuality Ingredients:\nLa Roche-Posay is known for its commitment to high-quality, dermatologist-tested products, and the Cicaplast Balm UV is no exception. It contains ingredients like Panthenol (Vitamin B5) and Madecassoside, which are renowned for their soothing and repairing properties.\n\nConclusion:\nOverall, La Roche-Posay Cicaplast Balm UV is a fantastic product that lives up to its promises. It provides excellent skin repair with the added benefit of high SPF protection, all while being gentle and suitable for sensitive skin. I highly recommend it to anyone looking for a reliable, multipurpose balm to incorporate into their skincare regimen.",
        "headline": "Great Stuff",
        "rating": 5,
        "ugc_id": 522280637
      },
      "faceoff_negative": {
        "comments": "I've always heard great things about the La Roche Posay Cicaplast Balm B5 but never got around to trying it so I was estatic to get a hold of the UV version through Influenster. Long story short, it just makes me want to try the original version even more. \n\nI think this is a good, soothing cream for sensitive or irritated skin. My skin barrier was damaged while I was testing it out (unrelated) and the test side of my face experienced no stinging or irritation at all. I was so tempted to slap it on the control side of my face before the end of my test week because my face had gotten so irritated that my usual sunscreen felt unbearable.  \n\nHowever, I don't think this kind of formula works as a sunscreen. First of all, it leaves a white cast even on my fair skin. While the white cast does disappear over time, that's only if you use a thumbs length amount of product. If you use the recommended amount of sunscreen (1/2 tsp or 2 finger lengths for the face and neck) then that white cast is here to stay for hours. And using the recommended amount of sunscreen only creates more problems. The product is very emollient so that much sunscreen just sits on top of each other, slipping and sliding throughout the day. I can easily scrape it off with one swipe of my finger. And later in the day, any rubbing of my face (such as adjusting my glasses) causes the balm to pill.  \n\nI will not be using this as my main sunscreen. With the way this formula works, I would feel better protected if I used it as a spot treatment on irritated parts of my face during the day.",
        "headline": "Makes me want the SPF-less version",
        "rating": 3,
        "ugc_id": 522280577
      },
      "name": "Cicaplast Balm B5 UV Soothing Therapeutic Multi-Purpose Cream SPF 50",
      "native_review_count": 7,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 220,
      "locale": "en_US"
    }
  }
}