{
  "product_id": "pimprod2043466",
  "product_url": "https://www.ulta.com/p/mela-b3-uv-daily-moisturizer-sunscreen-spf-30-pimprod2043466",
  "extracted_at": "2025-09-23T04:31:42.645323+00:00",
  "product_name": "La Roche-PosayMela B3 UV Daily Moisturizer Sunscreen, SPF 30",
  "brand": "La Roche-Posay",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Face Moisturizer"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "face"
  ],
  "currency": "USD",
  "list_price": "34.99",
  "sale_price": "26.24",
  "availability": "in_stock",
  "rating_avg": "4.5",
  "rating_count": "922",
  "images": [
    "https://media.ulta.com/i/ulta/2620363?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2620363?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2620363_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2620363_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2620363_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2620363_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2620363_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2620363_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2620363_vid01/thumbs/7f48e04d-12a3-495c-9e70-6efa348dccd9?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsHSA/FSA eligibleLa Roche-Posay Mela B3 UV Daily Moisturizer Sunscreen helps protect skin against sun damage while improving the appearance of dark spots.",
  "details": "DetailsBenefitsDaily anti-aging Moisturizer with SPF 30Allergy TestedNon-comedogenicKey IngredientsMelasyl, a new and exclusive ingredient, and Niacinamide work together to help visibly correct stubborn dark spots while respecting the natural tone of all skin.Formulated WithoutOxybenzoneParabensItem 2620363How To UseStep 1: Apply generously 15 minutes before sun exposure.Step 2: Reapply at least every 2 hours.IngredientsWater, C15-19 Alkane, Niacinamide, Glycerin, Butylene Glycol, Silica, Titanium Dioxide, Butyrospermum Parkii (Shea) Butter, Tin Oxide, Potassium Hydroxide, Carbomer, Arachidyl Alcohol, Arachidyl Glucoside, Behenyl Alcohol, 2-Mercaptonicotinoyl Glycine, Sodium Dilauramidoglutamide Lysine, Sodium Thiosulfate, Ammonium Acryloyldimethyltaurate/Vp Copolymer, Hydroxyacetophenone, Capryloyl Salicylic Acid, Caprylyl Glycol, Citric Acid, Trisodium Ethylenediamine Disuccinate, Xanthan Gum, Pentylene Glycol, Poly C10-30 Alkyl Acrylate, Polyglyceryl-4 Caprate, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate, Phenoxyethanol, Red 4, Mica, Fragrance (F.I.L. V70035830/1).",
  "how_to_use": "Step 1: Apply generously 15 minutes before sun exposure.Step 2: Reapply at least every 2 hours.",
  "ingredients": [
    "Water",
    "C15-19 Alkane",
    "Niacinamide",
    "Glycerin",
    "Butylene Glycol",
    "Silica",
    "Titanium Dioxide",
    "Butyrospermum Parkii (Shea) Butter",
    "Tin Oxide",
    "Potassium Hydroxide",
    "Carbomer",
    "Arachidyl Alcohol",
    "Arachidyl Glucoside",
    "Behenyl Alcohol",
    "2-Mercaptonicotinoyl Glycine",
    "Sodium Dilauramidoglutamide Lysine",
    "Sodium Thiosulfate",
    "Ammonium Acryloyldimethyltaurate/Vp Copolymer",
    "Hydroxyacetophenone",
    "Capryloyl Salicylic Acid",
    "Caprylyl Glycol",
    "Citric Acid",
    "Trisodium Ethylenediamine Disuccinate",
    "Xanthan Gum",
    "Pentylene Glycol",
    "Poly C10-30 Alkyl Acrylate",
    "Polyglyceryl-4 Caprate",
    "Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate",
    "Phenoxyethanol",
    "Red 4",
    "Mica",
    "Fragrance (F.I.L. V70035830/1)"
  ],
  "extended_contents": {
    "images": [
      "https://content.syndigo.com/asset/6289ae2b-6adc-4127-8e55-d9589e286a19/480.webp",
      "https://content.syndigo.com/asset/2d6d29c1-0ba7-4402-828f-04d30e3fbfaa/480.webp",
      "https://content.syndigo.com/asset/5833710c-900d-47bd-9dcc-f0428482462a/960.webp",
      "https://content.syndigo.com/asset/173f94ca-77fc-4e6e-bec1-5cb9c9a5970e/960.webp",
      "https://content.syndigo.com/asset/ad91563e-db4a-4ca7-8470-5d0173a93d04/960.webp",
      "https://content.syndigo.com/asset/88aea95f-3ff1-4a0f-af26-59b304220340/480.webp",
      "https://content.syndigo.com/asset/f02b1d4c-96f1-4653-bef8-acacdea63236/1464.webp",
      "https://content.syndigo.com/asset/f02b1d4c-96f1-4653-bef8-acacdea63236/240.webp",
      "https://content.syndigo.com/asset/e05880a1-84b0-488d-9a66-958d6d00bfd5/240.png",
      "https://content.syndigo.com/asset/09d77b14-c021-4f8e-91cb-9736f78245d6/240.jpg",
      "https://content.syndigo.com/asset/be732e0b-14fc-4625-8895-4f96a6970761/240.png",
      "https://content.syndigo.com/asset/432e6e65-aace-41af-8054-c61cbab352b7/240.jpg",
      "https://content.syndigo.com/asset/b6944aea-2d41-4752-920c-c2fa7f20469a/480.webp"
    ]
  },
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "moisturizer",
      "sunscreen"
    ],
    "skin_type": [
      "mature"
    ],
    "finish": [
      "sheer"
    ],
    "ingredients": [
      "niacinamide",
      "salicylic-acid",
      "fragrance",
      "sulfate-free"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "natural",
      "hypoallergenic",
      "non-comedogenic",
      "spf",
      "anti-aging"
    ]
  },
  "reviews": {
    "product_id": "pimprod2043466",
    "total_reviews": 922,
    "reviews": [
      {
        "review_id": 550822915,
        "rating": 1,
        "headline": "I would not purchase this item again.",
        "comments": "I used this product for 3 days and was not outside.  On the 4th day I discovered a rash on my face, almost like small blisters under the skin.  It appeared in the exact spots where I applied the cream. I immediately stopped. Five days later my face is beginning to clear.",
        "nickname": "Susan",
        "location": "Hagerstown, MD",
        "created_date": 1743521383394,
        "bottom_line": "No",
        "helpful_votes": 7,
        "not_helpful_votes": 2
      },
      {
        "review_id": 549734506,
        "rating": 4,
        "headline": "Like the benefits",
        "comments": "I have oily skin so hard to find a good sunscreen.  This leaves my skin nice, no breakouts, and hoping it lightens my melasma. Haven't been using long enough to really tell. I like it though!",
        "nickname": "Mal",
        "location": "Cleveland",
        "created_date": 1742762569191,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541586029,
        "rating": 3,
        "headline": "Comedogenic",
        "comments": "This product disappointed me. I tried it for about a week, and I woke up to three new acne spots, which was strange because the website claims it is non-comedogenic. However, when I looked into the ingredients, I was disheartened to find that it contains shea butter, which can clog pores, especially for those with oily skin. I really wanted to love it, but unfortunately, I can't.",
        "nickname": "Yems",
        "location": "Chicago IL",
        "created_date": 1734750845629,
        "bottom_line": null,
        "helpful_votes": 12,
        "not_helpful_votes": 0
      },
      {
        "review_id": 536479652,
        "rating": 4,
        "headline": "DOES NOT DO WELL UNDER MAKEUP",
        "comments": "AVOID WEARING UNDER MAKEUP - PILLING \nI always wear makeup under foundation/concealer and i usually keep my base routine super simple (e.g. water-based serum plus sunscreen). I applied this sunscreen under my makeup twice already and both times my foundation pilled and separated. I applied the foundation using a puff sponge. Now, I will only apply this sunscreen on no makeup days and will use as a hand sunscreen as well.",
        "nickname": "Sharon",
        "location": "Norfolk, VA",
        "created_date": 1729532628681,
        "bottom_line": "Yes",
        "helpful_votes": 15,
        "not_helpful_votes": 5
      },
      {
        "review_id": 533244896,
        "rating": 5,
        "headline": "I would buy this product again",
        "comments": "I love it",
        "nickname": "",
        "location": "Texas",
        "created_date": 1726501731905,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 527278052,
        "rating": 4,
        "headline": "Sunscreen to Protect & Prevent",
        "comments": "Introducing Mela B3 UV Daily Sunscreen featuring Melasyl, the multi-patented La Roche-Posay ingredient that was 18 years in the making. Also contains 5% Niacinamide. When used daily and reapplied as needed, this power packed combination corrects dark spots and skin discoloration while respecting the natural complexion of all skin tones. \n#Sunscreen #melasyl #niacinamide  #larocheposay  #loveyourskinloveyourlife #browngirlapproved #skincare",
        "nickname": "Loveyourskinloveyourlife",
        "location": "Detroit, Michigan",
        "created_date": 1723657450204,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 11
      }
    ],
    "paging": {
      "total_results": 6,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        12,
        16,
        89,
        210,
        595
      ],
      "review_histogram": [
        12,
        16,
        89,
        210,
        595
      ],
      "rating_count": 922,
      "review_count": 922,
      "average_rating": 4.48,
      "recommended_ratio": 0.5,
      "media": [],
      "faceoff_positive": {
        "comments": "Hey there! So, I recently got my hands on the La Roche-Posay Mela B3 UV Sunscreen, and boy, am I excited to tell you all about it. You know, finding the perfect sunscreen that not only protects your skin but also tackles those pesky dark spots and uneven skin tone can be quite a challenge. But fear not, my friend, because I think I may have found a winner with this one.\n\nLet's dive right in, shall we?\n\n**Why Sunscreen is Essential**\n\nBefore we get into the nitty-gritty of the product, let's talk about why sunscreen is an absolute must-have in your skincare routine. I mean, who doesn't want to protect their precious skin from the harmful effects of the sun, right?\n\nUV rays, both UVA and UVB, can wreak havoc on your skin, causing premature aging, sunburn, and even increasing the risk of skin cancer. Yikes! But hey, no need to panic, because sunscreen is here to save the day.\n\n**Introducing La Roche-Posay Mela B3 UV Sunscreen**\n\nNow, let's talk about the star of the show - the La Roche-Posay Mela B3 UV Sunscreen. This daily protective and corrective SPF 30 sunscreen not only shields your skin from the sun's harmful rays but also helps prevent and improve the appearance of dark spots. Talk about a multitasker!\n\nThis sunscreen features La Roche-Posay's innovative Melasyl™ and 5% Niacinamide, making it a powerhouse formula for tackling dark spots and uneven skin tone. Say goodbye to those pesky post-acne marks and hello to a more radiant complexion.\n\n**Easy to Use and Suitable for All Skin Types**\n\nUsing the Mela B3 UV Sunscreen is a breeze. Simply apply it generously to your face and neck, making sure to do so at least 15 minutes before stepping out into the sun. Oh, and don't forget to reapply every two hours for maximum protection.\n\nOne of the things I love about this sunscreen is that it's suitable for all skin tones and types. Whether you have oily, sensitive, or combination skin, this sunscreen has got you covered. It's also been tested on hands, which is a nice touch since we often forget to protect our hands from the sun.\n\n**My Experience and Results**\n\nNow, let's get personal. \n\nI've been using the La Roche-Posay Mela B3 UV Sunscreen for a solid 2 ½ weeks, and my oh my, the results are starting to show. Remember those persistent dark spots that have been bothering me for ages? Well, they are visibly diminishing, and my skin tone is starting to look more even. I must say, I'm pretty impressed.\n\nWhat I really appreciate about this sunscreen is how lightweight it feels on the skin. It doesn't leave that greasy, heavy feeling that some sunscreens tend to do. It absorbs quickly and leaves my skin looking more radiant - an instant confidence booster.\n\n**Pros**\n- Powerful SPF 30 protection against UVA and UVB rays\n- Helps prevent and improve the appearance of dark spots and uneven skin tone\n- Lightweight and non-greasy formula\n- Suitable for all skin tones and types, including oily and sensitive skin\n- Absorbs quickly and leaves skin looking radiant\n\n**Cons**\n- The sunscreen may not be sufficient for prolonged sun exposure or extreme outdoor activities. In such cases, it's advisable to use a water-resistant sunscreen and take additional sun protection measures.\n\n**Final Thoughts**\n\nI have to say, the La Roche-Posay Mela B3 UV Sunscreen has won me over. The fact that it not only protects my skin from the sun's harmful rays but also helps diminish those stubborn dark spots is a game-changer for me. It's become an essential step in my skincare routine, and I would highly recommend it to anyone dealing with dark spots and uneven skin tone.\n\nSo, go ahead and give it a try. Your skin will thank you later!\n\nRemember, always protect your skin and stay sun-safe. Until next time! \n\nThank you Influenster for the opportunity for in exchange of testing free the La Roche-Posay Mela B3 UV Sunscreen, I share my personal experience in this honest review. \n\nEnjoy!",
        "headline": "Your Solution to Dark Spots + Uneven Skin Tone",
        "rating": 5,
        "ugc_id": 502106839
      },
      "faceoff_negative": {
        "comments": "Thank you to La Roche-Posay & Influenster for this Mela B3 UV Daily Moisturizer SPF 30 WITH Melasyl + Niacinamide in exchange for my honest review. I have used this sunscreen in conjunction with the Mela B3 Dark Spot Serum (see my review on that item which I do recommend). Firstly, I had been on the fence as to whether the serum was working for me, then after looking through my progress photos from just over a month (from Dec 23, 2023 to Jan 29, 2024), I determined that I was starting to see some slight tone improvement, overall lightening benefit and breaking apart of my stubborn dark spots with the serum. However, where the Mela B3 UV Daily Moisturizer SPF 30 is concerned, there are a few things I really like about it, but sadly there are many more things I dislike about it. Firstly, I do like the feel, texture & smell of the moisturizer. It is nicely fragranced (which I prefer), without being overwhelming or causing me a headache. The smell doesn't linger either which is nice. If you have oily, combination or normal skin then this should be moisturizing enough for you and not too greasy. Sadly, I am extremely dry, so this is not nearly enough moisture for me on its own. I have to layer with all my other serums/boosters, plus a heavy cream, and I applied this as the last step in my routine. I was very consistently aggravated because I can't seem to keep this from pilling, balling up and rolling off, despite my repeated attempts to finagle my routine and the order in which I apply it to prevent this sunscreen from completely rolling off my face with the slightest brush of the finger. This is why I can state fairly emphatically that I don't believe this product contributed to the positive results you see in my photos… why? Because 9 times out of 10 it had all rolled off of my face within an hour (I always applied the serum first & waited a few minutes so I know it was always fully absorbed after every application). I even read through all the reviews on LaRoche-Posay.us and found this to be a problem other users complained about as well, so evidently it isn't just me. I would expect this to be a problem if you are only using this by itself or with one other product. If you are using several actives though I don't recommend this moisturizing sunscreen, and I also don't recommend it if you are actually suffering from significant hyperpigmentation. This brings me to my main complaint about this item… which is the use of chemical sunscreens in products touted as dark spot treatments, as I believe it to be counterproductive for many individuals (if not all). Is a chemical sunscreen better than none at all? Probably, but why wouldn't you use a more natural physical sunscreen that actually deflects rays, with less side effects that won't contribute to hyperpigmentation? If you didn't know, there are a growing number of dermatologists and skin care professionals (i.e. estheticians) who think chemical sunscreens actually contribute to hyperpigmentation in those prone to melasma and dark spots (because of the way they soak up the rays instead of deflecting them like physical sunscreens). I must be one of those skin types because I have experienced this phenomenon first hand. After a trip this summer to the lake and consistently wearing & reapplying a waterproof chemical sunscreen to my face all week, I had dark spots pop up everywhere that were never there previously, and the big one on my cheek got way darker. This has never happened to me before when wearing a physical sunscreen like zinc oxide &/or titanium dioxide. I set out to find the reason for this online and found I wasn't alone, and that there is much brewing speculation as to why certain chemical sunscreen agents are actually contributing to hyperpigmentation. From Real Self: \"\"The best formulas for those with hyperpigmentation boast high percentages of the mineral filters zinc oxide and titanium dioxide, which deflect UV rays rather than absorbing them, as chemical sunscreens do. \"The belief is that chemical filters release the energy they absorb as heat, which we know can exacerbate melasma,\" says Dr. Dhaval Bhanusali, a board-certified dermatologist in New York City. Chemical sunscreens can also be irritating, sparking post-inflammatory hyperpigmentation, or dark marks that turn up in the wake of insult and inflammation. Over the past few years, research has shown that visible light—emitted by the sun and screens—\"can also play a role in hyperpigmentation disorders, particularly in darker skin types,\" he adds. Iron oxides, the pigment particles in tinted sunscreens, are critical for those struggling with pigmentary conditions. \"Your sunscreen won't block visible light unless it contains iron oxides,\" says board-certified Boston dermatologist Dr. Mitalee Christman.\"\" To sum it up, I will continue to wear this daily if I'm just sputtering around the house or if it's a low sun day. Other than that I will be sticking with a daily sunscreen that has physical blockers in it to keep my hyperpigmentation from worsening. I hope that La Roche-Posay will create a new hyperpigmentation moisturizer with physical sunscreen or reformulate this one to include zinc oxide &/or titanium dioxide as its active ingredient(s) so I can in good conscience use it plus recommend it to those also suffering from hyperpigmentation.",
        "headline": "Pills & balls up; Chemical sunscreens not best for hyperp...",
        "rating": 2,
        "ugc_id": 519010167
      },
      "name": "Mela B3 UV Daily Moisturizer Sunscreen, SPF 30",
      "native_review_count": 6,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 916,
      "locale": "en_US"
    }
  }
}