{
  "product_id": "pimprod2055175",
  "product_url": "https://www.ulta.com/p/limited-edition-clarifique-4-piece-mini-skincare-discovery-set-pimprod2055175",
  "extracted_at": "2025-09-23T04:23:07.109853+00:00",
  "product_name": "LancomeLimited-Edition Clarifique 4 Piece Mini Skincare Discovery Set",
  "brand": "Lancome",
  "categories": [
    "Home",
    "Gifts",
    "By Category",
    "Fragrance Gifts"
  ],
  "category_keys": [
    "home",
    "gifts",
    "by-category",
    "fragrance"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "37.00",
  "availability": "in_stock",
  "rating_avg": "",
  "rating_count": "",
  "images": [
    "https://media.ulta.com/i/ulta/2645205?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2645205?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2645205_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2645205_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2645205_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2645205_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2645205_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2645205_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2645205_alt07?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryLancôme Clarifique Mini Skincare Discovery Set designed to introduce you to their unforgettable Clarifique collection of products.",
  "details": "DetailsIncludesMini Clarifique Pro-Solution Serum (0.23 oz)Mini Clarifique Clarifique Pore Refining Cleanser (1.7 oz)Mini Clarifique Double Treatment Essence (1.7 oz)Mini UV Expert Defense SPF 50+ Primer & Moisturizer (0.33 oz)BenefitsFrom cleansing to UV protection, this discovery set has your brightening needs covered in a full regimen, designed to introduce you to our unforgettable Clarifique & UV Expert collection of products.Skin Concerns: Brightening, Acne/Blemishes, Dark spots, Dullness/Uneven TextureResearch ResultsSERUM:Conesumer Self-Assessment Results*: 96% agree skin texture looks refined, 92% agree skin looks brighter, 89% agree skin tone looks more even & pores look tightened, 84% agree dark spots and skin discoloration are visibly reduced*Based on self-assessment results in a 10-week consumer study with 64 womenClinically Tested Results**: Post-acne marks are visibly reduced -29.7%, Dark spots are visibly reduced -20.3%, Pores are visibly reduced -18.7%, Skin tone is more even +28.2%**Based on a 10-week clinical study with 64 womenCLEANSER:Immediately: 92% agree the product is gentle, 88% agree skin looks clean and clear following usageAfter 2nd Application: 92% agree product removes impurities (dirt, dust, pollution), 89% agree skin feels smootherAfter 4 Weeks: 95% agree skin looks clean, 92% agree skin texture appears refined, 90% agree product allows to cleanse, unclog poresBased on a multi-phototype self-assessment study of 105 women, after 4 weeksESSENCE:Clinical Results*: +13% improvement in Radiance, +10% improvement in Evenness of Skin tone, +10% improvement in Visibility of Pores, -13% visible reduction in post-acne marksImmediately After First Use**: 84% of women agree skin texture appeared refined, 82% of women agree skin tone looked more evenAfter 1 Week**: 88% of women agree texture appears refined, 80% of women agree pore visibility looks reduced/minimized, 75% of women agree skin looks more radiant, luminous, and brighterAfter 4 Weeks**: 92% of women agree skin tone looks more even, 88% of women agree skin feels smoother, 80% of women agree skin appearance looks improved*Based on a clinical study conducted with 76 women over 6 weeks**Based on a self-assessment study conducted with 79 women over 6 weeksSPF MOISTURIZER:Instantly*: 93% say skin feels more hydrated, 90% agree skin feels softer, 82% say that product does not leave a white appearance on the skinAfter four weeks*: 93% agree skin feels smoother, 86% say skin tone looks more even, 85% agree skin appears more radiant, with a healthy-looking glow*Based on self-assessment results in a 4-week consumer study with 88 women.Item 2645205How To UseApply a small amount of cleanser to damp skin, gently massaging in circular motions to remove makeup and impurities. Rinse thoroughly with lukewarm water and pat skin dry.Shake the Clarifique face essence bottle vigorously to activate the whisk to perfectly blend the two phases. This product may cause peeling. Avoid eye area and lips contour.In case of contact with eyes, rinse them immediately and thoroughly with water. In case of persistent irritation, stop using the product. Avoid sun exposure.Sunburn alert: This product contains an alpha hydroxy acid (AHA) that may increase your skin's sensitivity to the sun and particularly the possibility of a sunburn. Use a sunscreen, wear protective clothing, and limit sun exposure while using this product and for a week afterwards.Apply Clarifique Brightening Serum by twisting the cap to open and push down on the silver button to dispense the formula onto your fingertips & apply until fully absorbed. Note: Dropper automatically loads the precise dosage amount for one application.Finish with UV Expert Defense SPF 50+ during the day.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Apply a small amount of cleanser to damp skin, gently massaging in circular motions to remove makeup and impurities. Rinse thoroughly with lukewarm water and pat skin dry.Shake the Clarifique face essence bottle vigorously to activate the whisk to perfectly blend the two phases. This product may cause peeling. Avoid eye area and lips contour.In case of contact with eyes, rinse them immediately and thoroughly with water. In case of persistent irritation, stop using the product. Avoid sun exposure.Sunburn alert: This product contains an alpha hydroxy acid (AHA) that may increase your skin's sensitivity to the sun and particularly the possibility of a sunburn. Use a sunscreen, wear protective clothing, and limit sun exposure while using this product and for a week afterwards.Apply Clarifique Brightening Serum by twisting the cap to open and push down on the silver button to dispense the formula onto your fingertips & apply until fully absorbed. Note: Dropper automatically loads the precise dosage amount for one application.Finish with UV Expert Defense SPF 50+ during the day.",
  "ingredients": "",
  "extended_contents": {},
  "tags": {
    "category": [
      "fragrance",
      "perfume"
    ],
    "skin_type": [
      "dry",
      "sensitive",
      "acne-prone"
    ],
    "finish": [
      "matte",
      "dewy",
      "creamy"
    ],
    "brand": [
      "luxury",
      "mid-range"
    ],
    "special_features": [
      "spf",
      "brightening",
      "soothing",
      "purifying"
    ],
    "product_type": [],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2055175",
    "total_reviews": 0,
    "reviews": [],
    "paging": {
      "total_results": 0,
      "pages_total": 0,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {}
  }
}