{
  "product_id": "pimprod2051931",
  "product_url": "https://www.ulta.com/p/genifique-ultimate-eye-cream-with-beta-glucan-cm-pimprod2051931",
  "extracted_at": "2025-09-23T03:58:28.815545+00:00",
  "product_name": "LancomeGenifique Ultimate Eye Cream with Beta Glucan-CM",
  "brand": "Lancome",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Cream"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "eye-cream"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "87.00",
  "availability": "in_stock",
  "rating_avg": "3.6",
  "rating_count": "8",
  "images": [
    "https://media.ulta.com/i/ulta/2638731?w=500&h=500"
  ],
  "detailed_images": [],
  "summary": "SummaryReverse eye contour damage in just 1 week! Lancôme's Génifique Ultimate Eye Cream is expertly formulated to address signs of eye-area aging for brighter eyes.",
  "details": "DetailsBenefitsReverses eye contour damage in just 1 weekIntense hydration: Hydrates eye area for smoother, more even-looking skinEnhanced skin barrier repair: Reinforces the skin's natural barrier, promoting faster recovery from environmental stressors & daily aggressorsImproved skin tone & texture: Dark circles appear reduced, revealing a brighter, smoother eye areaFor all skin types, including sensitive: Ophthalmologically tested & suitable for sensitive skin and contact lens wearersLightweight: The luxurious cream melts effortlessly into the skin, leaving a non-greasy, velvety finishKey IngredientsBeta Glucan-CMCaffeineBifidus ferment lysateEnoxoloneItem 2638731How To UseApply a small amount of cream to the eye contour area twice daily, morning and evening. Gently massage in using your fingertips until fully absorbed. For optimal results, incorporate into your skincare routine after cleansing and toning.IngredientsDimethicone, Glycerin, Bifida Ferment Lysate, Propanediol, Alcohol Denat., Polysilicone-11, Silica, Dimethicone/Peg-10/15 Crosspolymer, Caffeine, Peg-10 Dimethicone, Ammonium Polyacryloyldimethyl Taurate, Chlorella Vulgaris Extract, Polygonum Fagopyrum Seed Extract/Buckwheat Seed Extract, Adenosine, Alpha-Glucan Oligosaccharide, Copper Gluconate, Faex Extract/Yeast Extract/Extrait De Levure, Glycyrrhetinic Acid, Lactobacillus, Magnesium Aspartate, Mannose, Polymnia Sonchifolia Root Juice, Salicyloyl Phytosphingosine, Sodium Carboxymethyl Beta-Glucan, Sodium Hyaluronate, Sodium Hydroxide, Trisodium Ethylenediamine Disuccinate, Zinc Gluconate, Ascorbyl Glucoside, Octyldodecanol, Boron Nitride, Acetic Acid, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Alumina, Caprylic/Capric Triglyceride, Caprylyl Glycol, Carbomer, Ceteareth-20, Ci 77891/Titanium Dioxide, Dipropylene Glycol, Hydrogenated Vegetable Oil, Lactic Acid, Maltodextrin, Pentylene Glycol, Potassium Cetyl Phosphate, Sodium Citrate, Synthetic Fluorphlogopite, Tin Oxide, Tocopherol, Bis-Peg/Ppg-16/16 Peg/Ppg-16/16 Dimethicone, Dimethiconol, Geraniol, Chlorhexidine Digluconate, Chlorphenesin, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate, Sodium Benzoate, Alcohol, Parfum/Fragrance.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Apply a small amount of cream to the eye contour area twice daily, morning and evening. Gently massage in using your fingertips until fully absorbed. For optimal results, incorporate into your skincare routine after cleansing and toning.",
  "ingredients": [
    "Dimethicone",
    "Glycerin",
    "Bifida Ferment Lysate",
    "Propanediol",
    "Alcohol Denat",
    "Polysilicone-11",
    "Silica",
    "Dimethicone/Peg-10/15 Crosspolymer",
    "Caffeine",
    "Peg-10 Dimethicone",
    "Ammonium Polyacryloyldimethyl Taurate",
    "Chlorella Vulgaris Extract",
    "Polygonum Fagopyrum Seed Extract/Buckwheat Seed Extract",
    "Adenosine",
    "Alpha-Glucan Oligosaccharide",
    "Copper Gluconate",
    "Faex Extract/Yeast Extract/Extrait De Levure",
    "Glycyrrhetinic Acid",
    "Lactobacillus",
    "Magnesium Aspartate",
    "Mannose",
    "Polymnia Sonchifolia Root Juice",
    "Salicyloyl Phytosphingosine",
    "Sodium Carboxymethyl Beta-Glucan",
    "Sodium Hyaluronate",
    "Sodium Hydroxide",
    "Trisodium Ethylenediamine Disuccinate",
    "Zinc Gluconate",
    "Ascorbyl Glucoside",
    "Octyldodecanol",
    "Boron Nitride",
    "Acetic Acid",
    "Acrylates/C10-30 Alkyl Acrylate Crosspolymer",
    "Alumina",
    "Caprylic/Capric Triglyceride",
    "Caprylyl Glycol",
    "Carbomer",
    "Ceteareth-20",
    "Ci 77891/Titanium Dioxide",
    "Dipropylene Glycol",
    "Hydrogenated Vegetable Oil",
    "Lactic Acid",
    "Maltodextrin",
    "Pentylene Glycol",
    "Potassium Cetyl Phosphate",
    "Sodium Citrate",
    "Synthetic Fluorphlogopite",
    "Tin Oxide",
    "Tocopherol",
    "Bis-Peg/Ppg-16/16 Peg/Ppg-16/16 Dimethicone",
    "Dimethiconol",
    "Geraniol",
    "Chlorhexidine Digluconate",
    "Chlorphenesin",
    "Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate",
    "Sodium Benzoate",
    "Alcohol",
    "Parfum/Fragrance"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "moisturizer",
      "mask",
      "treatment",
      "eye cream"
    ],
    "skin_type": [
      "sensitive",
      "all skin types"
    ],
    "finish": [
      "sheer",
      "creamy",
      "cream",
      "oil"
    ],
    "ingredients": [
      "lactic-acid",
      "synthetic",
      "fragrance"
    ],
    "brand": [
      "luxury",
      "premium"
    ],
    "special_features": [
      "natural",
      "purifying"
    ]
  },
  "reviews": {
    "product_id": "pimprod2051931",
    "total_reviews": 8,
    "reviews": [
      {
        "review_id": 563220746,
        "rating": 5,
        "headline": "I would buy and use this product again.",
        "comments": "The product seems to be the same as the previously made product. I've used this for a couple of years and have not had any issues with it drying my skin. I also use it twice a day in the morning and evening.",
        "nickname": "Sylvia",
        "location": "Colorado",
        "created_date": 1757611144126,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559789497,
        "rating": 5,
        "headline": "\"Ultimate\" seems to be exactly the same as the original",
        "comments": "I've been a fan of Lancome's eye cream for a couple of years now. I was very concerned when I noticed the slight name change and was worried that the formula would be significantly different. I was fortunate to find a tester in my local Ulta and gave it a try. Seems exactly the same to me, which is perfect!",
        "nickname": "Lisa",
        "location": "Northern NJ",
        "created_date": 1754601455367,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559380463,
        "rating": 5,
        "headline": "Sorry, but not sorry",
        "comments": "I actually love this product. Ive used many eye creams and this one, when after waking up, makes my old people eyelids look better\n 🤷🏽‍♀️",
        "nickname": "Bri",
        "location": "California",
        "created_date": 1754443131666,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557401046,
        "rating": 5,
        "headline": "Love This Product",
        "comments": "One of the best I've ever used.",
        "nickname": "Alicson",
        "location": "Foley, Alabama",
        "created_date": 1752703721655,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556006897,
        "rating": 1,
        "headline": "Zero stars, Worst eye cream ever, be careful!!!",
        "comments": "I never write negative reviews, but I don't want this cream to harm anyone else's skin.\nMy skin has never been sensitive and I have never had a reaction to any product. But this is horrible, I ordered it with high expectations but it was my mistake not to read the reviews before. Not only did it dry out my skin around my eyes, I also had a rash around my eyes and face, I had swelling in my eyes for a week and discharge. I only used it for two days giving it a chance but it was the worst thing I did. \nI had to go to the dermatologist. Please DO NOT buy this, stay away from this eye cream. \n\nUlta was kind enough to give me a refund, but I'm still dealing with dry skin around my eyes after weeks.",
        "nickname": "Millie",
        "location": "West Virginia",
        "created_date": 1751151716447,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 9
      },
      {
        "review_id": 555685964,
        "rating": 2,
        "headline": "Had high hopes",
        "comments": "Like the other review mentioned, this eye cream dried my skin underneath my eye out really bad. So bad, my skin was cracked, flakey and a little puffy due to the irritation. I never applied on my upper lid, just underneath lower lash line but not  close to my lower lash line.  I have never had any reaction to any skin products before. I switched from using a fragrance free eye cream to try this product, which does contain fragrance. So my guess is that the fragrance may be the irritant possibly. Bummed. Lancome has always been known for their great products, but this will not be a brand I purchase again.",
        "nickname": "Lulu",
        "location": "Houston",
        "created_date": 1750560394226,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 6
      },
      {
        "review_id": 553446808,
        "rating": 5,
        "headline": "Worth Every Penny!",
        "comments": "I bought this as a birthday gift to myself this year and I will absolutely repurchase it when it runs out. I noticed a difference within a few days and the skin around my eyes has never looked better. I'm 39 years old and only have mild wrinkles/crow's feet and moderate dark circles. I don't need nearly as much concealer, my eyes look so much brighter and the skin is plump and healthy. The consistency is thick, a little goes a long way, and it sits beautifully under makeup. I think this will be a staple in my skincare routine for years to come.",
        "nickname": "Lindsey",
        "location": "Missouri, USA",
        "created_date": 1747414463156,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 2
      },
      {
        "review_id": 553436870,
        "rating": 1,
        "headline": "Extremely Drying!!!",
        "comments": "I used this for two days and my eyes felt like I had sand in them. I would wake up with super crusty and very irritated eyes, I did not apply it too close to my eyelids. Avoid this if you have sensitive/dry eyes!!!",
        "nickname": "Fera",
        "location": "Virginia",
        "created_date": 1747395561781,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 5
      }
    ],
    "paging": {
      "total_results": 8,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        2,
        1,
        0,
        0,
        5
      ],
      "review_histogram": [
        2,
        1,
        0,
        0,
        5
      ],
      "rating_count": 8,
      "review_count": 8,
      "average_rating": 3.63,
      "recommended_ratio": 1.0,
      "media": [],
      "name": "Génifique Ultimate Eye Cream with Beta Glucan-CM",
      "native_review_count": 8,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 0,
      "locale": "en_US"
    }
  }
}