{
  "product_id": "pimprod2050307",
  "product_url": "https://www.ulta.com/p/hueguard-glotion-mineral-sunscreen-broad-spectrum-spf-50-pimprod2050307",
  "extracted_at": "2025-09-23T04:09:40.347295+00:00",
  "product_name": "Live TintedHueguard Glotion Mineral Sunscreen Broad Spectrum SPF 50",
  "brand": "Live Tinted",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Tinted Moisturizer"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "tinted-moisturizer"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "36.00",
  "availability": "in_stock",
  "rating_avg": "4.1",
  "rating_count": "32",
  "images": [
    "https://media.ulta.com/i/ulta/2635932?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2635932?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635932_sm?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635927cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635927cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635927cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635927cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635927cm_alt05?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganLive Tinted Hueguard Glotion is a lightweight, tinted Mineral SPF 50 that hydrates, primes, and brightens skin for a radiant, even finish. Powered by antioxidants to neutralize uneven tone, it comes in two flexible shades for a natural, radiant finish.",
  "details": "DetailsBenefitsNatural, radiant finishMineral Broad Spectrum SPF 50Hydrates and primes skinWeightless, non greasy formulaPowered by a blend of antioxidants to help brighten and neutralize uneven skinAvailable in two flexible shadesKey IngredientsZinc Oxide 9.5% - a lightweight, non-nano zincButterfly Bush Flower Extract - provides antioxidant protection against UVA damagIndian Gooseberry - helps to re-establish skin's natural radianceItem 2635932How To UseApply a generous amount to your face, neck, and wherever else you want sun protection. HUEGUARD® Glotion can be used head to toe, year-round, alone or under makeup. Reapply throughout the day and after being in direct sunlight.IngredientsActive Ingredient: Zinc Oxide 9.5%Inactive Ingredients: Butylene Glycol, Butyloctyl Salicylate, Caprylic/Capric Triglyceride, C12-15 Alkyl Benzoate, C13-15 Alkane, C15-19 Alkane, Citric Acid, Clitoria Ternatea Flower Extract, Disteardimonium Hectorite, Epilobium Fleischeri Flower/Leaf/Stem Extract, Ethyl Ferulate, Ethylhexylglycerin, Fragaria Ananassa (Strawberry) Fruit Extract, Glycerin, Iron Oxides (CI 77491, CI 77492, CI 77499), Isostearic Acid, Lecithin, Magnesium Sulfate, Mica, Octyldodecanol, Polyglyceryl-3 Polyricinoleate, Polyglyceryl-4 Diisostearate/Polyhydroxystearate/Sebacate, Polyhydroxystearic Acid, Propanediol, Sh-Polypeptide-121, Silica, Sodium Benzoate, Squalane, Tin Oxide, Titanium Dioxide (CI 77891), Tocopherol, Vitis Vinifera (Grape) Leaf Extract, Water/Aqua/Eau, Zinc Stearate.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Apply a generous amount to your face, neck, and wherever else you want sun protection. HUEGUARD® Glotion can be used head to toe, year-round, alone or under makeup. Reapply throughout the day and after being in direct sunlight.",
  "ingredients": [
    "Active Ingredient: Zinc Oxide 9.5%Inactive Ingredients: Butylene Glycol",
    "Butyloctyl Salicylate",
    "Caprylic/Capric Triglyceride",
    "C12-15 Alkyl Benzoate",
    "C13-15 Alkane",
    "C15-19 Alkane",
    "Citric Acid",
    "Clitoria Ternatea Flower Extract",
    "Disteardimonium Hectorite",
    "Epilobium Fleischeri Flower/Leaf/Stem Extract",
    "Ethyl Ferulate",
    "Ethylhexylglycerin",
    "Fragaria Ananassa (Strawberry) Fruit Extract",
    "Glycerin",
    "Iron Oxides (",
    "Isostearic Acid",
    "Lecithin",
    "Magnesium Sulfate",
    "Mica",
    "Octyldodecanol",
    "Polyglyceryl-3 Polyricinoleate",
    "Polyglyceryl-4 Diisostearate/Polyhydroxystearate/Sebacate",
    "Polyhydroxystearic Acid",
    "Propanediol",
    "Sh-Polypeptide-121",
    "Silica",
    "Sodium Benzoate",
    "Squalane",
    "Tin Oxide",
    "Titanium Dioxide (",
    "Tocopherol",
    "Vitis Vinifera (Grape) Leaf Extract",
    "Water/Aqua/Eau",
    "Zinc Stearate"
  ],
  "extended_contents": {},
  "tags": {
    "product_type": [
      "moisturizer",
      "sunscreen"
    ],
    "finish": [
      "dewy",
      "sheer"
    ],
    "ingredients": [
      "peptides",
      "sulfate-free"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "natural",
      "spf",
      "brightening"
    ],
    "category": [],
    "skin_type": []
  },
  "reviews": {
    "product_id": "pimprod2050307",
    "total_reviews": 32,
    "reviews": [
      {
        "review_id": 562875862,
        "rating": 5,
        "headline": "Awesome sunscreen",
        "comments": "Sunscreen  has moisturizer and primer. It provides broad-spectrum SPF 30 protection against UVA and UVB rays.  It gives me an awesome glow on my skin",
        "nickname": "Yessenia",
        "location": "Chicago IL",
        "created_date": 1757092309599,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 561809644,
        "rating": 5,
        "headline": "High SPF, Glowy and Feels Good",
        "comments": "I tried this on a bit of a whim as I was not previously familiar with the brand. I liked that it's a high SPF (50) - others are often like 30 and I need the higher SPF for protection. I love how it feels on my skin! It keeps my skin hydrated and leaves a nice glow without being greasy. I'm sensitive to feeling stuff on my skin and I did not have that problem with this product. There is a color to the cream but it's basically clear on and not any kind of corrective tint. It's not a negative to me but just something to keep in mind if you are looking for more tinted coverage.",
        "nickname": "Alyssa",
        "location": "Fairfax",
        "created_date": 1756910256712,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 561022602,
        "rating": 5,
        "headline": "My new daily",
        "comments": "Exactly what I have been looking for and more!",
        "nickname": "Pam",
        "location": "San Diego, CA",
        "created_date": 1755988206807,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 561012603,
        "rating": 2,
        "headline": "Loved at first",
        "comments": "I purchased this in June and really enjoyed using it. Used it everyday in Cabo. Fast forward a couple months and my skin developed an allergic reaction to the product. I broke out in a red raised rash that itched and was hot to the touch. First couple of times was just around the eye area and the most recent time was all over my face and neck. I normally dont have sensitive skin but recently became pregant. Thought this sunscreen would still be safe to use since its mineral.",
        "nickname": "Viv",
        "location": "Chicago",
        "created_date": 1755968786311,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558077485,
        "rating": 5,
        "headline": "The best",
        "comments": "I have very sensitive eyes, this sunscreen I can literally put on my eyelids and I have no reaction, Im obsessed. Ive tried everything, Kosas, supergoop, caudalie even and every time my eyes burned and watered to the point that Id have to wash my face and start all over. Not with this sunscreen though! Its glowy and easy to spread, you can put two layers of this on with no pilling. Looks great under makeup because the glow from the sunscreen peaks through. It doesn't break me out, it isnt heavy, it dries down perfectly, it doesn't emphasize pores of skin texture like Kosas does. This is literally one of the best sunscreens Ive ever used and its all because I got a sample as a free birthday gift. Live tinted really does an awesome job with their sunscreens.",
        "nickname": "z",
        "location": "low",
        "created_date": 1753294974372,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556771476,
        "rating": 5,
        "headline": "Live Tinted Glotion",
        "comments": "I have used and really enjoyed all of Live Tinted's spf products! All mineral sunscreens are technically astringents, they can be a bit drying. This one is super glowy, but doesnt feel like it will slip or move all over the skin throughout the day. Not as moisturizing as other formulas. For that reason, I believe this formula is best for normal-oily skin types. It doesnt give coverage like their spf 50 skin tint, but this one does blur and even out the skin tone very nicely. All Live Tinted SPFs contain a modern \"hybrid\" UV filter that make the look and feel really nice while still utilizing gentle inorganic filters like zinc oxide. Will repurchase soon!",
        "nickname": "Sunny",
        "location": "Florida",
        "created_date": 1751909438227,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555781279,
        "rating": 1,
        "headline": "Chemical Butyloctyl Salicylate not Mineral Sunscreen",
        "comments": "Not a true Mineral Sunscreen! The chemical Butyloctyl Salicylate a UV absorber or UV filter. It irritates my skin, burns eyes and give me a rash. I do not recommend for sensitive skin or those of use who only can wear a Mineral sunscreen. Do better Live Tinted! Better transparency with UV filters or UV absorbers either active or inactive!",
        "nickname": "MamaKitty",
        "location": "Seattle",
        "created_date": 1750714567883,
        "bottom_line": null,
        "helpful_votes": 12,
        "not_helpful_votes": 3
      },
      {
        "review_id": 554753130,
        "rating": 5,
        "headline": "The best mineral sunscreen I have ever used.",
        "comments": "I have been long on the hunt for a mineral sunscreen with no drawbacks. I have personally always preffered chemical sunscreens, but with super sentitive eyes and rosacea prone skin, mineral sunscreens always agreed with my body more, even though I HATED them. I found all of them to be heavy, always pilled with my other skincare, and most left a cast even on my fair skin. I'm not sure what's so different about this one, but they have truly cracked the code. It melts into the skin like chemical sunscreen, with none of the drawbacks like stinging eyes and random rosacea flareups. This is going to be my new everyday sunscreen, it is truly worth every penny.",
        "nickname": "John",
        "location": "Long Island",
        "created_date": 1749442521614,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554478215,
        "rating": 5,
        "headline": "Great for daytime everyday wear or while in the sun",
        "comments": "My friend is a vendor for Live Tinted and she got me hooked on this glotion. I already loved their spf primer but this js what I've been looking for a long time. It's like the perfect spf skin tint for me. I bought 2 more during the AAPI Point Multiplier date to stock up. I hope they add more shades and bigger sizes to use all over the body.",
        "nickname": "Samiya",
        "location": "Plano, TX",
        "created_date": 1748985728521,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554399087,
        "rating": 4,
        "headline": "gorgeous glowy finish but takes forever to set",
        "comments": "this sunscreen didn't irritate my dry, eczema prone skin and wore beautifully. it's super hydrating, esp when you use the correct 2-ish fingers' worth on your face, so I would skip moisturizing on days you're using this sunscreen unless you're going to be wearing makeup on top (bc it can look rly greasy over moisturizer). i love how minimal the coverage is; it perfects your skin ever so slightly without looking like you have foundation on. this sunscreen does take literal hours to dry down, though, so definitely use setting spray and/or powder and avoid applying it to any parts of your body that come into contact with clothing bc it will transfer if you used enough! I have not tried it under a full face of makeup, but it worked well with blush and bronzer on top.",
        "nickname": "local diva",
        "location": "pnw",
        "created_date": 1748874999983,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554076390,
        "rating": 2,
        "headline": "broke me out!",
        "comments": "started using this on a friday and my face started breaking out by sunday allll over. feels really light on the skin and applied nicely but did not even remotely tint my skin.",
        "nickname": "Loemm",
        "location": "idaho",
        "created_date": 1748395767177,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 553622781,
        "rating": 5,
        "headline": "Nice coverage and color",
        "comments": "I got a ton of compliments the first day I used this. It lasts all day.",
        "nickname": "GinaNoele",
        "location": "NY",
        "created_date": 1747756254314,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 553288953,
        "rating": 3,
        "headline": "Wanted to love but broke me out",
        "comments": "Very hydrating, glowy on the skin with a silky, liquid texture. The tint on my very fair skin didn't show up (a plus since many universal tints end up wayyy too dark) and was great underneath makeup. However, I started noticing by the next day that there were multiple pimples where I don't normally get acne. Paused usage and waited a week and when I used this again, same story.",
        "nickname": "ryry",
        "location": "Texas",
        "created_date": 1747189503109,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 2
      },
      {
        "review_id": 552822507,
        "rating": 3,
        "headline": "Cause me to break out",
        "comments": "This was easy to apply and didn't feel heavy, but I noticed it pilled and flaked on top of my other skincare products. It didn't leave a white cast on my light skin, but it broke me out every time I used it. I had to discontinue use. :( Also seems very expensive for a tint.",
        "nickname": "makeup4me",
        "location": "VA",
        "created_date": 1746357565263,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 4
      },
      {
        "review_id": 552772849,
        "rating": 5,
        "headline": "Yes, I love this.",
        "comments": "I love how my face feels moisturized.",
        "nickname": "Connie",
        "location": "Tx",
        "created_date": 1746217331495,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552576893,
        "rating": 4,
        "headline": "Tint is wonderful but slightly heavy for my liking",
        "comments": "The product has a nice tint. It wasnt pulling too orange or white/purple on my olive skin tone, which is what i struggle with. I tend to go for the runny mineral sunscreens since the heavier ones ive tried easily build up in my eye lid and around my nose. The consistency is definitely a lotion, felt nourishing but sadly built up in my eyelid which is a deal breaker for me. It felt slightly heavy/chalky for me (a non makeup wearer) but its definitely a solid choice when it comes to SPFS. Im just very picky lol. Worth a try!",
        "nickname": "Olivia",
        "location": "Chicago, IL",
        "created_date": 1745872770444,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 3
      },
      {
        "review_id": 552195863,
        "rating": 1,
        "headline": "Not for sensitive skin",
        "comments": "if you have sensitive skin, this is not the product for you. Had a bad allergic reaction to this product that caused my face to turn red and get bad  blisters.",
        "nickname": "Joy",
        "location": "Columbia, South Carolina",
        "created_date": 1745376122087,
        "bottom_line": null,
        "helpful_votes": 11,
        "not_helpful_votes": 5
      },
      {
        "review_id": 551468745,
        "rating": 5,
        "headline": "Yes",
        "comments": "Anyone who thinks all mineral sunscreens leave a white cast and don't play well with other products should try this. I am also a fan of Hueguard 3-in-1 but decided to try this given the higher SPF and hoping for a bit of coverage. While it does smooth out my skin tone a bit, it has very little coverage so not it if that is what you are after. But I found the feel elegant, and it absorbs well and does not sit on top of the skin the way some mineral screens do. It imparts a very subtle youthful glow that is not greasy or overly shiny. I am fairly dry so still need some moisturizer but wouldn't be surprised if some people can get away without any. I have worn it alone on natural days and under makeup with success, although have had to experiment just a tiny bit with how much time between products to allow everything to sink in and avoid pilling. But it is so worth figuring it out. I am pretty fair but lean a bit yellow and thought the light would be too pink when I first saw it, but it works. I cannot say for sure how flexible only 2 shades will be for all skin tones but definitely worth a try to find out. I also like that the brand is clean and cruelty free. I really don't understand why this brand is not getting more attention given the quality of the products I have tried.",
        "nickname": "SP",
        "location": "North Carolina",
        "created_date": 1744385331404,
        "bottom_line": "Yes",
        "helpful_votes": 15,
        "not_helpful_votes": 1
      },
      {
        "review_id": 551221594,
        "rating": 5,
        "headline": "Obsessed!",
        "comments": "This is my new go to spf! It's so lightweight and the glowy finish is perfect for under makeup.",
        "nickname": "Jasmine",
        "location": "NC",
        "created_date": 1744125366755,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550990370,
        "rating": 1,
        "headline": "Not for me!",
        "comments": "I was super hopeful about this tinted spf. But I just could not get past the smell of rhe product. I even had my husband try it just in case i was being too sensitive and he ran to the sink and couldn't wash it off fast enough…its just gross! I returned it!",
        "nickname": "Sonn",
        "location": "Los Angeles, Ca",
        "created_date": 1743743509813,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 15
      }
    ],
    "paging": {
      "total_results": 32,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2050307/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        4,
        2,
        2,
        3,
        21
      ],
      "review_histogram": [
        4,
        2,
        2,
        3,
        21
      ],
      "rating_count": 32,
      "review_count": 32,
      "average_rating": 4.09,
      "recommended_ratio": 1.0,
      "media": [
        {
          "id": "554478207",
          "review_id": 554478215,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/demkcatns4wh8bwpnfxr.jpg",
          "headline": "Great for daytime everyday wear or while in the sun",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Shade Medium-Deep",
          "nickname": "Samiya",
          "created_date": 1748985728521
        }
      ],
      "faceoff_positive": {
        "comments": "I work outside in the sun, so I need effective sun protection (higher than like spf 15-30 like a lot of tinted sunscreens have) I also like the look of a tinted moisturizer for every day, and for me this combines both very well! You can layer makeup on top (I've only tried it with a little concealer over acne scars, brows, blush, and mascara) although I have found that it doesn't blend quite as well as a regular complexion product but not to the point that it's too difficult to work with or anything, and it's completely worth it for the sun protection it provides. I've worn it twice now for 6-8 hour shifts in direct sunlight and have not gotten burnt at all, not even on my nose and cheeks, which typically burn the easiest. I also like the finish, it's \"glowy\" without looking too oily, pretty natural but not all greased up like when you put on reguksr sunscreen. My skin is typically pretty oily in my T-zone, especially in the summer, and while it isn't becessarily perfect after hours in the sun it still looks pretty great, which is all I can really expect especially without setting with a powder or spray. The lightest shade works well for me, I'm typically a \"light neutral\" shade in regular foundations. It IS disappointing that the current shade range doesn't seem like it'll work for all skin tones despite how sheer it is, but that's just an assumption, hopefully either way they'll expand it.",
        "headline": "Perfect for every day wear",
        "rating": 4,
        "ugc_id": 550506571
      },
      "faceoff_negative": {
        "comments": "I purchased this in June and really enjoyed using it. Used it everyday in Cabo. Fast forward a couple months and my skin developed an allergic reaction to the product. I broke out in a red raised rash that itched and was hot to the touch. First couple of times was just around the eye area and the most recent time was all over my face and neck. I normally dont have sensitive skin but recently became pregant. Thought this sunscreen would still be safe to use since its mineral.",
        "headline": "Loved at first",
        "rating": 2,
        "ugc_id": 561012603
      },
      "name": "Hueguard Glotion Mineral Sunscreen Broad Spectrum SPF 50",
      "native_review_count": 32,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 0,
      "locale": "en_US"
    }
  }
}