{
  "product_id": "pimprod2037105",
  "product_url": "https://www.ulta.com/p/superhue-brightening-eye-cream-pimprod2037105",
  "extracted_at": "2025-09-23T05:21:39.753948+00:00",
  "product_name": "Live TintedSuperhue Brightening Eye Cream",
  "brand": "Live Tinted",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Cream"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "eye-cream"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "34.00",
  "availability": "in_stock",
  "rating_avg": "4.5",
  "rating_count": "188",
  "images": [
    "https://media.ulta.com/i/ulta/2606374?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2606374?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2606374_sm?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2606374_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2606374_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2606374_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2606374_alt04?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganTHE dark circle eye cream that brightens and depuffs instantly and over time, Live Tinted's Superhue Brightening Eye Cream is powered by hyperpigmentation-targeting actives like Niacinamide, Caffeine, and Vitamin C and made with a cooling applicator to boost circulation.",
  "details": "DetailsBenefitsInstantly brightens and depuffsMade with ingredients known to fade the appearance of hyperpigmentation over timeBoosts circulation with cooling tipHydrates and smooths fine linesPrimes eyes for makeupVegan and cruelty-freeDermatologist and ophthalmologist testedKey IngredientsNiacinamide helps improve uneven skin tone and strengthen the skin barrier.Vitamin C helps to brighten and balance uneven skin tone while boosting collagen production.Caffeine boosts circulation, firms skin, and helps to reduce the appearance of pufﬁness and dark circles.Research ResultsIn a self-assessment of 32 users after 4 weeks:94% agreed eyes looked more radiant88% said dark circles were less visibleItem 2606374How To UseApply with the cooling copper applicator, and gently tap in using your ring finger. Use as a primer before color correcting makeup or concealer. Use both morning and night.IngredientsAqua/Water/Eau, Glycerin, Diisostearyl Malate, Polyglyceryl-2 Diisostearate, Triethylhexanoin, Cetearyl Olivate, Ammonium Acryloyldimethyltaurate/VP Copolymer, Niacinamide, Caffeine, Tetrahexyldecyl Ascorbate, Sodium Hyaluronate, Chamomilla Recutita (Matricaria) Flower Extract, Curcuma Longa (Turmeric) Root Extract, Butyrospermum Parkii (Shea) Butter, Mica, Sorbitan Olivate, Isostearyl Alcohol, Tocopherol, Xanthan Gum, Ethylhexylglycerin, Butylene Glycol, Trisodium Ethylenediamine Disuccinate, Malic Acid, Citric Acid, Sodium Hydroxide, Caprylyl Glycol, Sorbic Acid, Phenoxyethanol, Titanium Dioxide (CI 77891), Iron Oxides (CI 77492, CI 77491).Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Apply with the cooling copper applicator, and gently tap in using your ring finger. Use as a primer before color correcting makeup or concealer. Use both morning and night.",
  "ingredients": [
    "Aqua/Water/Eau",
    "Glycerin",
    "Diisostearyl Malate",
    "Polyglyceryl-2 Diisostearate",
    "Triethylhexanoin",
    "Cetearyl Olivate",
    "Ammonium Acryloyldimethyltaurate/VP Copolymer",
    "Niacinamide",
    "Caffeine",
    "Tetrahexyldecyl Ascorbate",
    "Sodium Hyaluronate",
    "Chamomilla Recutita (Matricaria) Flower Extract",
    "Curcuma Longa (Turmeric) Root Extract",
    "Butyrospermum Parkii (Shea) Butter",
    "Mica",
    "Sorbitan Olivate",
    "Isostearyl Alcohol",
    "Tocopherol",
    "Xanthan Gum",
    "Ethylhexylglycerin",
    "Butylene Glycol",
    "Trisodium Ethylenediamine Disuccinate",
    "Malic Acid",
    "Citric Acid",
    "Sodium Hydroxide",
    "Caprylyl Glycol",
    "Sorbic Acid",
    "Phenoxyethanol",
    "Titanium Dioxide (",
    "Iron Oxides ("
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "moisturizer",
      "mask",
      "treatment",
      "eye cream"
    ],
    "finish": [
      "dewy",
      "sheer",
      "creamy",
      "cream"
    ],
    "ingredients": [
      "niacinamide"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "brightening"
    ],
    "skin_type": []
  },
  "reviews": {
    "product_id": "pimprod2037105",
    "total_reviews": 188,
    "reviews": [
      {
        "review_id": 552560161,
        "rating": 5,
        "headline": "Repeat purchase",
        "comments": "I got this as a birthday gift one year, and have repurchased twice since. It's cooling, concealing, and brightening. The peach color really hides the dark circles, and there's just enough sparkle to brighten. It works really well under foundation and concealer. I leave mine in the fridge to let the metal applicator get really cold.",
        "nickname": "Metrocard",
        "location": "New York",
        "created_date": 1745846450360,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551906595,
        "rating": 1,
        "headline": "Not for sensitive skin",
        "comments": "I was able to use this about four times before I started having issues. I wore it during the daytime, never at night, and never under makeup. Only on clean skin after a shower. I wouldnt recommend. Fifth time wearing this I developed a red burning rash under my eyes where I applied it.",
        "nickname": "Cat",
        "location": "California",
        "created_date": 1744917452337,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551033280,
        "rating": 5,
        "headline": "The best!",
        "comments": "I got this for free when I had diamond status back in December, I've been using it fairly regularly since then, and I've noticed that the under eyes are brighter. It looks so natural and this is basically what I use when I just wanna curl my lashes and put really no make up on and this is all I use and it just makes my whole face brighten up",
        "nickname": "Church",
        "location": "San Diego",
        "created_date": 1743786658176,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549744169,
        "rating": 5,
        "headline": "Love it",
        "comments": "I have been using this for over a month and have noticed a huge difference under my eyes. I had some dark circles nothing major but since I started using this I don't have anymore dark under eyes. I've used other stuff like dime but never saw any difference, this was the only one that truly brightened my eyes. I use it morning and night, under my eyes and eyelid, and sometimes I'll skip one and use it either morning or night but I've been pretty consistent on putting this on twice a day.",
        "nickname": "JesusSavedMe",
        "location": "Fresno",
        "created_date": 1742786005001,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549744168,
        "rating": 5,
        "headline": "Love it",
        "comments": "I have been using this for over a month and have noticed a huge difference under my eyes. I had some dark circles nothing major but since I started using this I don't have anymore dark under eyes. I've used other stuff like dime but never saw any difference, this was the only one that truly brightened my eyes. I use it morning and night, under my eyes and eyelid, and sometimes I'll skip one and use it either morning or night but I've been pretty consistent on putting this on twice a day.",
        "nickname": "JesusSavedMe",
        "location": "Fresno",
        "created_date": 1742786004707,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 549667299,
        "rating": 5,
        "headline": "Great under concealer!",
        "comments": "My under eye circles aren't bad but the skin around my eyes is very dry. I use this product under concealer and it has made a huge difference. No more cakiness. I love it.",
        "nickname": "Jessie",
        "location": "New Hampshire",
        "created_date": 1742596723781,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547171321,
        "rating": 5,
        "headline": "Great for hyperpigmentation",
        "comments": "I love the Live Tinted brand but the Tinted moisturizer didnt work for me. Decided to try this product when it was half off and i'm glad i did. Ive been using it for about a month and ive noticed an improvement in my hyperpigmentation around my eyes. Love the applicator and even with daily use the container is still full. Will repurchase",
        "nickname": "Jamie",
        "location": "Lakeland, FL",
        "created_date": 1740357237102,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 545903735,
        "rating": 5,
        "headline": "A must have!",
        "comments": "I never write reviews, but for this product I must.  I almost didn't buy  it for half price, but I'm so glad I did!\nIt is my new favorite product!  It really makes your under eyes look bright and less tired, but without looking fake or overly made up.  It goes on so smoothly, and you don't have to use much product to get the results.",
        "nickname": "Maria",
        "location": "Oklahoma City, OK",
        "created_date": 1738688271083,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543875529,
        "rating": 5,
        "headline": "Bye bye eye bags/circles",
        "comments": "This eye cream does what it says it will do! The tint helps to mask my eye circles caused from aging! This will now be apart of my skincare routine!",
        "nickname": "Meri",
        "location": "Lawrence, KS",
        "created_date": 1737639702696,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543475888,
        "rating": 4,
        "headline": "Worked great",
        "comments": "Light weight product good coverage",
        "nickname": "Michele",
        "location": "NJ",
        "created_date": 1737130590048,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542627466,
        "rating": 5,
        "headline": "With skeptical, but now Love!",
        "comments": "I bought this on a whim while working with one of the Ulta employees. I was skeptical, but I could always try a new eye cream. I tend to have puffy eyes in the morning. The stuff is great! No more puffy eyes I always look awake this one's different than most and I totally recommend. I will buy again!",
        "nickname": "Christine M.",
        "location": "Riverside CA",
        "created_date": 1736543410870,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542486604,
        "rating": 1,
        "headline": "not for fair skin, probably pretty on darker skin",
        "comments": "I was really excited to get this as a diamond welcome gift for free. Really excited to try this, but it immediately burned both eyes. so I was super red for about 24 hours. \njust because it burned my eyes, doesn't mean it will burn yours. it was not a flattering look on my skin; however, imo I think this might just be beautiful on deeper skin tones. \nI would never even pay half price for this as it's not for me.",
        "nickname": "kb",
        "location": "Midwest city, OK",
        "created_date": 1736355447162,
        "bottom_line": null,
        "helpful_votes": 12,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541928693,
        "rating": 3,
        "headline": "Ok product",
        "comments": "The metal applicator does feel cold when applying to the under eyes. It feels pretty good and I do notice it helps reduce puffiness BUTTT after 30min under my eyes the pruduct builds up and it starts rolling and peeling. So I end up with pieces of dry product under my eyes.",
        "nickname": "Lily",
        "location": "Chicago",
        "created_date": 1735429656422,
        "bottom_line": null,
        "helpful_votes": 10,
        "not_helpful_votes": 1
      },
      {
        "review_id": 541701696,
        "rating": 5,
        "headline": "Love this",
        "comments": "It brightens my dark circles nicely! Not sticky or thick like other creams. Repeated buyer!",
        "nickname": "Ellie",
        "location": "New Mexico",
        "created_date": 1734984710721,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537736981,
        "rating": 5,
        "headline": "Definitely would buy again",
        "comments": "Satisfied",
        "nickname": "Marquitta",
        "location": "Lakewood, CA",
        "created_date": 1731455110498,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 4
      },
      {
        "review_id": 533154392,
        "rating": 5,
        "headline": "Love this cream so much",
        "comments": "I received this as a free gift when I purchased another Live Tinted product and figured I would try it out. I'm so glad I did, too! I have a bunch of milia around my eyes from heavier products I used before I realized that they caused this issue. This eye cream has made some of the milia go away entirely while most have become much smaller. I was pleasantly surprised and I will definitely order this when it runs out.",
        "nickname": "CM123",
        "location": "Midwest",
        "created_date": 1726443114842,
        "bottom_line": null,
        "helpful_votes": 33,
        "not_helpful_votes": 1
      },
      {
        "review_id": 532121893,
        "rating": 3,
        "headline": "Good idea, so so results",
        "comments": "I chose this eye cream as my freebie as a platinum member, I like the design of the applicator. However, i noticed little spots start to form on it after a few weeks of use. They seemed a bit rough. I scratched at a little bit of it and it appeared to be rust. Also the list of ingredients seem like they would address the key things we look for in eye creams, depuffing, moisture, dark circles. However, i didnt notice long lasting results. So if youre ok with with reapplication, sure. I personally would not purchase another tube of this.",
        "nickname": "Jazzy",
        "location": "Bay Area, CA",
        "created_date": 1725568667483,
        "bottom_line": null,
        "helpful_votes": 34,
        "not_helpful_votes": 5
      },
      {
        "review_id": 531905421,
        "rating": 5,
        "headline": "Nice brightening eye cream",
        "comments": "I am a eyecream enthusiast, i always try everything, This kind of reminds me of origins ginzing eye cream.  I think i like this formula better though. I was able to get as my Ulta tier renewal gift. I really like it! It does have a bit of a tint to it but blends in nice with the applicator,  I does a great job at brightening and depuffing my eye area.   I used to like clinique pepstart but think it's been discontinued, so think this may be a good replacement!",
        "nickname": "Jennifer",
        "location": "NJ",
        "created_date": 1725403271122,
        "bottom_line": "Yes",
        "helpful_votes": 18,
        "not_helpful_votes": 0
      },
      {
        "review_id": 525655265,
        "rating": 2,
        "headline": "Not worth it",
        "comments": "It feels nice, however, the tinted is very light and it's also pinkish. If you have dark eyebags, I don't recommend this.",
        "nickname": "V",
        "location": "Los Angeles, CA",
        "created_date": 1722010440677,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 1
      },
      {
        "review_id": 525422936,
        "rating": 1,
        "headline": "This is pure sparkle",
        "comments": "I have tried a bunch of stuff from this brand and I've never been wowed by any of it. However this was on sale one day so i decided to give it a try. This has such an intense silver sheen that it looks ridiculous under the eye. Very unnatural and unflattering. It also seems to burn, and it gets worse the longer it's on. The packaging is great, I love the metal applicator. But I cannot recommend this. If you are interested, definitely test it out in store first.",
        "nickname": "Mrskish1014",
        "location": "Midland, TX",
        "created_date": 1721596229460,
        "bottom_line": null,
        "helpful_votes": 33,
        "not_helpful_votes": 11
      }
    ],
    "paging": {
      "total_results": 65,
      "pages_total": 4,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2037105/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        10,
        6,
        17,
        7,
        148
      ],
      "review_histogram": [
        10,
        6,
        17,
        7,
        148
      ],
      "rating_count": 188,
      "review_count": 188,
      "average_rating": 4.47,
      "recommended_ratio": 0.67,
      "media": [],
      "faceoff_positive": {
        "comments": "The applicator feels luxurious and the product isn't a bad price point compared to other similar products on the market. I love that the packaging makes it so that your not dipping your fingers into a pot. I am a fan of Live Tinted's sunscreen and I trust the brand and decided to buy this eye cream since I am missing a good one from my current routine and I like the ingredients that are listed. The issue is the sparkle that is in the formula. I looked at myself in the mirror and thought I had not removed my eye makeup completely, but realized the glitter is from this product! Honestly, I am not a fan of sparkles on my face at night or all day. I gave it a chance and left it on through the night and the next morning, the sparkles were still there. Personally, I do not prefer sparkles in my skin care so I will be returning.",
        "headline": "Sparkles in Skincare?",
        "rating": 4,
        "ugc_id": 446162335
      },
      "faceoff_negative": {
        "comments": "I purchased this product on sale because the overall reviews are pretty good. I need an eye cream I can use on my eye lids, and this one seemed to fit the bill. Unfortunately, it's a dud. It did not moisturize my eye area at all. I was applying it multiple times a day (when not wearing makeup) with no results. I eventually just threw it away. Not the product for me.",
        "headline": "No thank you",
        "rating": 2,
        "ugc_id": 486398243
      },
      "native_review_count": 65,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 123,
      "locale": "en_US"
    }
  }
}