{
  "product_id": "",
  "product_url": "https://www.ulta.com/p/glycolic-grapefruit-cleansing-lotion-xlsImpprod6200777",
  "extracted_at": "2025-09-23T04:02:44.294689+00:00",
  "product_name": "Mario BadescuGlycolic Grapefruit Cleansing Lotion",
  "brand": "Mario Badescu",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Toner"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "toner"
  ],
  "currency": "USD",
  "list_price": "18.00",
  "sale_price": "12.60",
  "availability": "in_stock",
  "rating_avg": "3.8",
  "rating_count": "86",
  "images": [
    "https://media.ulta.com/i/ulta/2210013?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2210013?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2210013_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2210013_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2210013_alt03?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryMario Badescu's Glycolic Grapefruit Cleansing Lotion rejuvenates and refreshes dull, oily skin. This lotion is an exfoliant that is a toning lotion powered by Glycolic Acid and infused with revitalizing Grapefruit Extract.",
  "details": "DetailsBenefitsPowerful resurfacing tonerBrightens and helps re-balance skin post-cleanseHelps refine the look of pores and improve the look of dry fine lines and uneven skin tonePromotes a more radiant and even-toned complexionItem 2210013How To UseTwice daily after cleansing, apply to skin with a cotton ball or pad. Wipe in sweeping, outward motions until the cotton comes up clean. Avoid eye area. If product gets into eyes, rinse well with water.*Not recommended for use with topical prescriptions, acne-erupted, or sensitive skin. Avoid contact with the eyes. If contact occurs, rinse well with water. If irritation develops and persists, discontinue use. Sunburn Alert: This product contains an alpha hydroxy acid (AHA) that may increase your skin's sensitivity to the sun and particularly the possibility of sunburn. Use a sunscreen, wear protective clothing, and limit sun exposure while using this product and for a week afterwards.IngredientsAqua (Water, Eau), Glycolic Acid, Propylene Glycol, Citrus Grandis (Grapefruit) Fruit Extract, Aloe Barbadensis Leaf Juice, Hexylene Glycol, Caprylyl Glycol, Polysorbate 20, Parfum (Fragrance), Sodium Chloride, Phenoxyethanol, Benzyl Alcohol, Lyral, Linalool, Benzyl Salicylate, Citronellol, Limonene, Geraniol, Hexyl Cinnamaldehyde, CI 19140 (Yellow 5), CI 42090 (Blue 1).Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Twice daily after cleansing, apply to skin with a cotton ball or pad. Wipe in sweeping, outward motions until the cotton comes up clean. Avoid eye area. If product gets into eyes, rinse well with water.*Not recommended for use with topical prescriptions, acne-erupted, or sensitive skin. Avoid contact with the eyes. If contact occurs, rinse well with water. If irritation develops and persists, discontinue use. Sunburn Alert: This product contains an alpha hydroxy acid (AHA) that may increase your skin's sensitivity to the sun and particularly the possibility of sunburn. Use a sunscreen, wear protective clothing, and limit sun exposure while using this product and for a week afterwards.",
  "ingredients": [
    "Aqua (Water",
    "Eau)",
    "Glycolic Acid",
    "Propylene Glycol",
    "Citrus Grandis (Grapefruit) Fruit Extract",
    "Aloe Barbadensis Leaf Juice",
    "Hexylene Glycol",
    "Caprylyl Glycol",
    "Polysorbate 20",
    "Parfum (Fragrance)",
    "Sodium Chloride",
    "Phenoxyethanol",
    "Benzyl Alcohol",
    "Lyral",
    "Linalool",
    "Benzyl Salicylate",
    "Citronellol",
    "Limonene",
    "Geraniol",
    "Hexyl Cinnamaldehyde"
  ],
  "extended_contents": {},
  "tags": {
    "product_type": [
      "cleanser",
      "moisturizer",
      "toner"
    ],
    "skin_type": [
      "oily",
      "dry",
      "sensitive",
      "acne-prone"
    ],
    "finish": [
      "matte",
      "dewy",
      "oil"
    ],
    "ingredients": [
      "glycolic-acid",
      "fragrance"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "exfoliating",
      "brightening",
      "purifying"
    ],
    "category": []
  },
  "reviews": {
    "product_id": "xlsImpprod6200777",
    "total_reviews": 86,
    "reviews": [
      {
        "review_id": 383851262,
        "rating": 1,
        "headline": "Burned my skin",
        "comments": "I am 28 and I have combination skin, it burned pretty badly and left my sling feeling irritated,itchy and changed the texture of my skin. I would recommend testing before buying.",
        "nickname": "Racheal",
        "location": "Virginia",
        "created_date": 1633742009714,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 338517509,
        "rating": 1,
        "headline": "Very harsh left painful burns",
        "comments": "Very harsh on my skin. I normally use the glycolic acid toner which works great. The grapefruit lotion literally left me with chemical burns on my face and neck.",
        "nickname": "J'Nique",
        "location": "Humble Texas",
        "created_date": 1616343771201,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 318844170,
        "rating": 5,
        "headline": "Perfect product",
        "comments": "A wonderful product.",
        "nickname": "Jeanie",
        "location": "Dothan Alabama",
        "created_date": 1607487220153,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 2
      },
      {
        "review_id": 307166620,
        "rating": 5,
        "headline": "absolutely love",
        "comments": "I have post damage to my earlier acne,  stressed past over exposure to the sun.  This is a great product for my own skincare needs to address the issues that I have dealt with in the past. I recommend a sunscreen for the day when using this product. \nI am also a fan of the alpha grapefruit toner for the day,  my evening gentle exfoliation  is really wonderful, the vit c in the morning routine with the alpha grapefruit after cleansing with the seaweed soap which has a slight granular exfoliation from the seaweed really leaves my skin incredibly smooth, bright,  feeling great,  especially when I use a vit c serum or moisturizer,  also recommend the buttermilk moisturizer for a bright, moisturized texture \nThe whole line is highly recommended. The price is great especially for the results that can be achieved",
        "nickname": "CosmoCyd",
        "location": "NY",
        "created_date": 1602513316884,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 290658550,
        "rating": 5,
        "headline": "Have Used Other MB Toners - This Is My Fave!",
        "comments": "Love Mario Badescu products and this is my most recent try. Fell in love! I deal with acne, dry skin, and wrinkles...this product has noticibly helped clear my skin. Will purchase again!",
        "nickname": "Anne",
        "location": "Oregon",
        "created_date": 1597255080690,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 277614957,
        "rating": 5,
        "headline": "So refreshing!",
        "comments": "This cleansing lotion is so refreshing and not harsh at all like some other toners. This toner wakes your skin right up and is the prefect addition to your skincare routine.",
        "nickname": "TClum0327",
        "location": "Ohio",
        "created_date": 1590583452530,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 268578640,
        "rating": 5,
        "headline": "Favorite Toner",
        "comments": "This is my fav toner. Tingles on application, and can sting slightly when it comes in contact with a blemish. Helps shrink my pores and clear out my skin. Also has a pleasant scent that isn't overpowering.",
        "nickname": "RGrenier",
        "location": "KC",
        "created_date": 1584454519076,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 268094437,
        "rating": 5,
        "headline": "My summer toner - great for combo oily skin",
        "comments": "This is my summer toner for when I get more oily. Works well as a part of a 3-part regimen (cleanser, this toner, and moisturizer). It doesn't dry me out in summer. (I use a different one in winter when I tend to get drier.)\nI love that you can mix and match MB products in how it works best for you. If you're not sure where to start, visit Ulta in person and ask. That's how I've chosen all my MB products. The associates are always knowledgeable and helpful.",
        "nickname": "LGee",
        "location": "TN",
        "created_date": 1583466933761,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 267876520,
        "rating": 5,
        "headline": "Might have finally found my holy grail",
        "comments": "I don't normally take the time to write reviews but this was too good not to. Lately I've had a lot of acne/bumps on my forehead. I was using another Mario toner in my routine but NOTHING was getting rid of them. Within a few days of using this instead, there's noticeably less bumps and the redness of the ones that remain has all but disappeared. And my face feels so soft! It does tingle a little but just follow with a moisturizer and you'll be good.",
        "nickname": "K",
        "location": "Atlanta",
        "created_date": 1582948191047,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 267692540,
        "rating": 1,
        "headline": "Very instrusive to my skin!",
        "comments": "My skin remained red throughout the entirety of the use of the product. I understand that glycolic acid is an acid and breaks down the skin so it can grow new cells to look more youthful, but I disliked the constant redness.",
        "nickname": "Megpie",
        "location": "Lockport, NY",
        "created_date": 1582651254124,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 264640200,
        "rating": 5,
        "headline": "Very nice",
        "comments": "Sales lady at ulta recommended this to me. I love it! My skin feels nice and clean after I take all my makeup off.",
        "nickname": "Liz",
        "location": "New Hartford, NY",
        "created_date": 1578514826342,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 264611066,
        "rating": 4,
        "headline": "Almost took it back, so glad I didn't",
        "comments": "I use this after the cleansing gel as a toner more or less. I almost took it back bc it burned the first few uses, but my skin got used to it and now I never get breakouts. And I'm not the best at washing my face twice everyday. I love the skin care line, it takes a bit of trial and error to figure out what works best for you, but I finally found something that works for me.",
        "nickname": "Danielle",
        "location": "Oklahoma",
        "created_date": 1578459397957,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 261610786,
        "rating": 5,
        "headline": "Will never stop using this",
        "comments": "I'm in my 40s. My skin had become dull, dry and sometimes almost scaly. I had used a $400 skincare system and moved away from it because the cost seemed crazy. My skin conditions plummeted. I did an online search seeing if there existed a more economical alternative to the system I had used. Sure enough, this popped up as the recommended toner. I bought it. I'm almost through my first bottle which lasted me 3 months - morning and night. It could likely last longer but I went cotton pad crazy. I've just received my second bottle.\n\nUsing this in conjunction with a deep pore cleanser. I use this after the cleanser. Within a few days, the scaliness and dullness was lessening. My skin practically shines right now. Makeup goes on smoother, I feel ok going to the store makeup-free on weekends. On occasion it does tingle when I put it on, especially in dry weather, but I birthed two kids - I can (and have!) survive(d) a skin tingle. This stuff is AMAZING. I highly recommend and I literally pray my skin never becomes immune to it. Also don't be confused - this is a TONER to be used after a cleanser, NOT a cleanser as the name suggests.",
        "nickname": "Paige in Tulsa",
        "location": "Tulsa, OK",
        "created_date": 1573837100550,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 2
      },
      {
        "review_id": 260603973,
        "rating": 1,
        "headline": "Too strong",
        "comments": "Burned when applying. Made me break out after every use. Too strong for someone with sensitive skin.",
        "nickname": "Emily",
        "location": "Michigan",
        "created_date": 1572858903337,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 253029947,
        "rating": 5,
        "headline": "love!",
        "comments": "My skin had been EXTREMELY oily and always so congested and broken out since the 7th grade (I'm now a junior in college) and I hadn't been able to go without makeup since then because I was always so embarrassed! I had tried other Mario products and they helped, just didn't quite clear my skin up. Over the summer, I decided to try this toner with the Botanical Facial Cleanser and the Enzyme Cleanser (whichever was on hand I love them both) with this toner. My skin has not been this clear since before I ever started breaking out!!! I can finally feel comfortable going with out makeup!! Highly reccommend!",
        "nickname": "E",
        "location": "Texas",
        "created_date": 1568558675146,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 245782998,
        "rating": 4,
        "headline": "So far so great",
        "comments": "I needed a toner with a kick. I have combo skin, historically problematic breakouts and large pores. This stuff WORKS. I've been using about two weeks and there's a noticeable difference in the smoothness of my skin - no dry patches, no oil. Those with crazy skin know that while those two features seem competing, they are absolutely not. My skin is soft, clarified, and I feel the appearance of my pores are slightly smaller. My makeup goes on my smoothly.",
        "nickname": "TulsaPaige",
        "location": "Tulsa, OK",
        "created_date": 1566319788007,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 243999636,
        "rating": 2,
        "headline": "Returned it",
        "comments": "I originally went to Ulta to purchase the original Glycolic Acid Toner but it was out of stock. After the Ulta employee recommended this product saying they are virtually the same, I believed her. THIS IS NOT THE SAME!! It is so strong, has a terrible smell, and burnt! I returned the next day. It also is FULL of alcohol",
        "nickname": "Zoe",
        "location": "Wisconsin",
        "created_date": 1563760785702,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 237622408,
        "rating": 2,
        "headline": "Didn't work out",
        "comments": "Didn't work out for both my mom or I",
        "nickname": "Jor",
        "location": "Michigan",
        "created_date": 1557428727112,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 236688425,
        "rating": 2,
        "headline": "BURNS",
        "comments": "I've only been using this for 4 days and every time it burns my skin. I have combo skin, I never had acne and I rarely break out. I really wanted to like it bc afterwards my skin would feel really smooth.",
        "nickname": "Lulu",
        "location": "Dallas, TX",
        "created_date": 1555879542414,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 236663775,
        "rating": 2,
        "headline": "BURNS",
        "comments": "My skin usually never gets irritated with nothing but THIS sis 😭 this really burns my skin. I have combo skin I NEVER had acne and I rarely get a pimple so I think I must be allergic to the glycolic acid in this 🤷🏻‍♀️ I really wanted to love it 😩 Bc it does leave my skin feeling soft afterwards but the burning is too much when I apply it.",
        "nickname": "Lua",
        "location": "Dallas, TX",
        "created_date": 1555817173135,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 1
      }
    ],
    "paging": {
      "total_results": 86,
      "pages_total": 5,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/xlsImpprod6200777/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "beautyroutine",
          "name": "My Beauty Routine Takes",
          "type": "tag",
          "values": [
            {
              "label": "10 Minutes",
              "count": 11
            },
            {
              "label": "30 Minutes",
              "count": 9
            },
            {
              "label": "1+ Hour",
              "count": 1
            }
          ],
          "display_values": [
            "1+ Hour",
            "10 Minutes",
            "30 Minutes"
          ]
        },
        {
          "display_type": "default",
          "key": "bestuses",
          "name": "Best Uses",
          "type": "tag",
          "values": [
            {
              "label": "Oily Skin",
              "count": 29
            },
            {
              "label": "Daily Use",
              "count": 23
            },
            {
              "label": "Combination Skin",
              "count": 20
            },
            {
              "label": "Acne-Prone Skin",
              "count": 17
            },
            {
              "label": "Women",
              "count": 6
            },
            {
              "label": "All Skin Types",
              "count": 4
            },
            {
              "label": "Men",
              "count": 4
            },
            {
              "label": "Sensitive Skin",
              "count": 3
            },
            {
              "label": "On-the-go",
              "count": 3
            },
            {
              "label": "Weekly Use",
              "count": 3
            },
            {
              "label": "Dry Skin",
              "count": 2
            },
            {
              "label": "Twice a day",
              "count": 1
            },
            {
              "label": "Aging skin",
              "count": 1
            },
            {
              "label": "Dull skin",
              "count": 1
            },
            {
              "label": "Bedtime",
              "count": 1
            },
            {
              "label": "Extremely Oily Skin",
              "count": 1
            },
            {
              "label": "Never",
              "count": 1
            },
            {
              "label": "Semi Daily Use",
              "count": 1
            },
            {
              "label": "Acne",
              "count": 1
            }
          ],
          "display_values": [
            "Acne",
            "Acne-Prone Skin",
            "After Shower/Bath",
            "Aging skin",
            "All Skin Types",
            "Bedtime",
            "Combination Skin",
            "Daily Use",
            "Deep Moisturization",
            "Dry Skin",
            "Dry/Chapped Skin",
            "Dull skin",
            "Eczema",
            "Extremely Oily Skin",
            "Men",
            "Never",
            "Oily Skin",
            "On-the-go",
            "Semi Daily Use",
            "Sensitive Skin",
            "Twice a day",
            "Weekly Use",
            "Winter Dryness",
            "Women"
          ]
        },
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "Irritates Skin",
              "count": 14
            },
            {
              "label": "Dries Out Skin",
              "count": 8
            },
            {
              "label": "Doesn't Remove Makeup",
              "count": 2
            },
            {
              "label": "Doesn't Work",
              "count": 2
            },
            {
              "label": "Not Effective",
              "count": 2
            },
            {
              "label": "None",
              "count": 1
            },
            {
              "label": "Bad smell",
              "count": 1
            },
            {
              "label": "Contains alcohol",
              "count": 1
            },
            {
              "label": "Bad Smell",
              "count": 1
            },
            {
              "label": "Greasy",
              "count": 1
            },
            {
              "label": "Made me break out in hives",
              "count": 1
            },
            {
              "label": "Slight tinginling when used but i goes away",
              "count": 1
            },
            {
              "label": "stings just a little",
              "count": 1
            },
            {
              "label": "Needs to include the % of active ingredients",
              "count": 1
            },
            {
              "label": "Sticky",
              "count": 1
            },
            {
              "label": "Allergic reaction",
              "count": 1
            },
            {
              "label": "Burns",
              "count": 1
            },
            {
              "label": "Bad Ingredients",
              "count": 1
            },
            {
              "label": "Poor Texture",
              "count": 1
            },
            {
              "label": "Harsh",
              "count": 1
            },
            {
              "label": "Irritating",
              "count": 1
            },
            {
              "label": "Oily",
              "count": 1
            }
          ],
          "display_values": [
            "Allergic reaction",
            "Bad Ingredients",
            "Bad Smell",
            "Bad smell",
            "Burns",
            "Complicated To Use",
            "Contains alcohol",
            "Doesn't Absorb Well",
            "Doesn't Remove Makeup",
            "Doesn't Work",
            "Dries Out Skin",
            "Greasy",
            "Harsh",
            "Irritates Skin",
            "Irritating",
            "Made me break out in hives",
            "Messy",
            "Needs to include the % of active ingredients",
            "None",
            "Not Effective",
            "Not Long-Lasting",
            "Oily",
            "Poor Texture",
            "Slight tinginling when used but i goes away",
            "Sticky",
            "stings just a little"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "Brand Buyer",
              "count": 31
            },
            {
              "label": "Budget Shopper",
              "count": 26
            },
            {
              "label": "65 t years old",
              "count": 1
            },
            {
              "label": "Licensed in esthetics, with post acne,sun damage",
              "count": 1
            }
          ],
          "display_values": [
            "65 t years old",
            "Brand Buyer",
            "Budget Shopper",
            "Casual Dresser",
            "Comfort-seeking",
            "Energetic/Active",
            "Licensed in esthetics, with post acne,sun damage",
            "Stylish/Fashionista",
            "Trendy/Stylish Dresser",
            "Youthful"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "Leaves Clean Feel",
              "count": 27
            },
            {
              "label": "Improves Skin Texture",
              "count": 21
            },
            {
              "label": "Balances Skin",
              "count": 19
            },
            {
              "label": "Easy To Use",
              "count": 17
            },
            {
              "label": "Smells Great",
              "count": 16
            },
            {
              "label": "Not Greasy",
              "count": 15
            },
            {
              "label": "Effective",
              "count": 13
            },
            {
              "label": "Good Value",
              "count": 12
            },
            {
              "label": "Gentle",
              "count": 8
            },
            {
              "label": "Lightweight",
              "count": 7
            },
            {
              "label": "Moisturizing",
              "count": 4
            },
            {
              "label": "Love it.  I use twice a day.",
              "count": 1
            },
            {
              "label": "works @night can exfoliate when sleeping.",
              "count": 1
            },
            {
              "label": "Clears acne",
              "count": 1
            },
            {
              "label": "Exfoliates",
              "count": 1
            },
            {
              "label": "Tightens skin",
              "count": 1
            },
            {
              "label": "Controls Oil",
              "count": 1
            },
            {
              "label": "Reduces Scarring",
              "count": 1
            },
            {
              "label": "for Cystic Acne",
              "count": 1
            },
            {
              "label": "helps clear out cysts",
              "count": 1
            },
            {
              "label": "Absorbs Quickly",
              "count": 1
            },
            {
              "label": "Cleansing",
              "count": 1
            }
          ],
          "display_values": [
            "Absorbs Quickly",
            "Balances Skin",
            "Cleansing",
            "Clears acne",
            "Controls Oil",
            "Easy To Use",
            "Effective",
            "Exfoliates",
            "Gentle",
            "Goes On Smoothly",
            "Good Value",
            "Improves Skin Texture",
            "Leaves Clean Feel",
            "Lightweight",
            "Long Lasting",
            "Love it.  I use twice a day.",
            "Moisturizes Well",
            "Moisturizing",
            "Not Greasy",
            "Reduces Scarring",
            "Smells Great",
            "Softens Skin",
            "Tightens skin",
            "for Cystic Acne",
            "helps clear out cysts",
            "works @night can exfoliate when sleeping."
          ]
        }
      ],
      "rating_histogram": [
        12,
        11,
        4,
        15,
        44
      ],
      "review_histogram": [
        12,
        11,
        4,
        15,
        44
      ],
      "rating_count": 86,
      "review_count": 86,
      "average_rating": 3.79,
      "recommended_ratio": 0.77,
      "media": [
        {
          "id": "204102209",
          "review_id": 204102194,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/n1oljbnyoyog3jrkz7rh.jpg",
          "headline": "Love it",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Clear skin",
          "nickname": "Cat",
          "created_date": 1537273150809
        }
      ],
      "faceoff_positive": {
        "comments": "This is the only product I've ever reviewed, but that's just because this is the only thing that has actually worked for me. I'm 20 and was blessed with acne when I was just 9 years old (as you can tell, genetics are not my friend) and I have tried every product you can imagine. I spent so much money trying pretty much every acne regimen out there when all along I just needed this little magic bottle and a $5 moisturizer from Trader Joe's? I wish I had known about this 10 years ago. \nAnyway, here is my experience with this product: A few months ago, my skin was probably the worst it's ever been. My skin was greasy, my pores were visibly clogged despite taking great care of it (thanks for nothing, skin), I had clusters of acne scars and spots on my cheeks, and my cheeks and forehead were covered in these tiny little bumps I later learned were called comedones (pretty much just blackheads trapped under the skin). I tried so many different creams, masks, and toners in an attempt to clean out my congested pores and fade my scars, but nothing worked. Eventually after digging around the Ulta website I came across this product and it's honestly the best thing that's ever happened to my skincare routine. Within a few weeks my skin was smooth (the comedones are completely GONE), less oily (this toner is a bit drying but if you apply a moisturizer after you should be fine), and my acne scars have faded drastically. Now my skincare regimen only includes Biore face wash with charcoal, this cleansing lotion, and some Trader Joe's moisturizer and my skin looks smooth and even. As someone with extremely problematic skin, I never imagined I could have a skincare routine that was so low maintenance. I wish I could write a love letter to the person who created this product.\n\nP.S. Sorry this review is super lengthy, as you can tell I'm really excited about this stuff and wish I could give a bottle to every person on the planet.",
        "headline": "Talented, brilliant, incredible, amazing",
        "rating": 5,
        "ugc_id": 192803682
      },
      "faceoff_negative": {
        "comments": "I was very disappointed in this product. It was very harsh on my combination skin and worked well at first but my skin began to go back to the way it used to be in about a month. I was very disgusted after reading the ingredients that a \"Prestige\" brand would use rubbing alcohol (went by another name) as one of their ingredients. That breaks skin barriers down and may kill bacteria but by taking that barrier, it also comes back faster. I returned it after noticing that.",
        "headline": "Disappointed",
        "rating": 2,
        "ugc_id": 192803612
      },
      "name": "Glycolic Grapefruit Cleansing Lotion",
      "native_review_count": 86,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 0,
      "locale": "en_US"
    }
  }
}