{
  "product_id": "pimprod2046161",
  "product_url": "https://www.ulta.com/p/beautyscreen-mineral-peptide-foundation-tint-spf-50-pimprod2046161",
  "extracted_at": "2025-09-23T03:22:03.436296+00:00",
  "product_name": "Naked SundaysBeautyScreen Mineral Peptide Foundation Tint SPF 50",
  "brand": "Naked Sundays",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Tinted Moisturizer"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "tinted-moisturizer"
  ],
  "currency": "USD",
  "list_price": "38.00",
  "sale_price": "26.60",
  "availability": "in_stock",
  "rating_avg": "4.8",
  "rating_count": "392",
  "images": [
    "https://media.ulta.com/i/ulta/2629939?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2629939?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629939_sm?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629939_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629939_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629939_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629939_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629939_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629939_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629939_alt07?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganGive BackHSA/FSA eligibleNaked Sundays BeautyScreen Mineral Peptide Foundation Tint SPF 50 is a lightweight, buildable non-nano zinc sunscreen tint in 13 shades. Infused with peptides and antioxidants, it protects from UVA/UVB, Blue Light & Infrared with a second-skin finish.",
  "details": "DetailsBenefitsProtects your skin against UVA, UVB, Blue Light and Infrared with its non nano mineral SPF 50 filtersReduces pollution-induced free radicals by over 85%Blocks over 35% of blue light that hits the skinNon ComedogenicSensitive skin safe80 Minutes water resistantFeaturesA lightweight, 2-in-1 mineral sunscreen foundation SPF Tint with SPF5013 blendable shades, perfect for any and all skin tonesLight to medium coverage (buildable) and second-skinParaben free. Fragrance free. Alcohol freePA++++ RatingKey IngredientsPeptides- A Super anti-ageing ingredient, Palmitoyl Pentapeptide-4 (Peptides) helps boost collagen, firm and repair the skin. Works to plumps the skin and helps to reduce lines.Polyglutamic Acid - Acts as a humectant and powerful skin hydrator. It can hold 4 times more water than Hyaluronic Acid, attracting moisture and sealing it in. It provides intense hydration and supports your skin barrier.Niacinamide - A form of vitamin B3 that helps even and brighten your skin tone.Squalane - Anti-inflammatory properties and effectively helps increase hydration.Item 2629939How To UseShake to activate the tint.Apply desired coverage amount onto fingertips or directly onto your brush.Press into the skin with fingertips like you would a tint or work into the skin with your brush until fully blended.Allow the SPF tint 4-5 minutes to fully absorb.Enjoy your brightened and revitalized complexion!Precautions: For external use only. Do not use on damaged or broken skin. When using this product: Keep out of eyes. Rinse with water to remove. Stop use and ask a doctor if a rash occurs. Keep out of reach of children: If product is swallowed, get medical help or contact a Poison Control Center right away.IngredientsActives: Zinc Oxide: 12%.Inactive: Water, C12-15 Alkyl Benzoate, Butyloctyl Salicylate, Isododecane, Lauryl PEG-8 Dimethicone, Titanium Dioxide, Propanediol, Caprylyl Methicone, Dimethicone Niacinamide, Octyldodecyl Neopentanoate, Polymethylsilsesquioxane, Trilaureth-4 Phosphate, Dimethiconol/Propylsilsesquioxane/Silicate Crosspolymer, Lauryl PEG-10 Tris(Trimethylsiloxy)silylethyl Dimethicone, Sodium Chloride, Phenoxyethanol, Bisabolol, Iron Oxides CI77492, Capryl Glycol, Allantoin, Iron Oxides CI77491, Aluminum Hydroxide, Polyglyceryl-4 Diisostearate/Polyhydroxystearate/Sebacate, Ethylhexylglycerin, Hexylene Glycol, Hydrogenated Lecithin, PEG-10, Tetrasodium Glutamate Diacetate, Palmitoyl Pentapeptide-4, Squalane, Iron Oxides CI77499, Sodium Hydroxide, Polyglutamic Acid.",
  "how_to_use": "Shake to activate the tint.Apply desired coverage amount onto fingertips or directly onto your brush.Press into the skin with fingertips like you would a tint or work into the skin with your brush until fully blended.Allow the SPF tint 4-5 minutes to fully absorb.Enjoy your brightened and revitalized complexion!Precautions: For external use only. Do not use on damaged or broken skin. When using this product: Keep out of eyes. Rinse with water to remove. Stop use and ask a doctor if a rash occurs. Keep out of reach of children: If product is swallowed, get medical help or contact a Poison Control Center right away.",
  "ingredients": [
    "Actives: Zinc Oxide: 12%.Inactive: Water",
    "C12-15 Alkyl Benzoate",
    "Butyloctyl Salicylate",
    "Isododecane",
    "Lauryl PEG-8 Dimethicone",
    "Titanium Dioxide",
    "Propanediol",
    "Caprylyl Methicone",
    "Dimethicone Niacinamide",
    "Octyldodecyl Neopentanoate",
    "Polymethylsilsesquioxane",
    "Trilaureth-4 Phosphate",
    "Dimethiconol/Propylsilsesquioxane/Silicate Crosspolymer",
    "Lauryl PEG-10 Tris(Trimethylsiloxy)silylethyl Dimethicone",
    "Sodium Chloride",
    "Phenoxyethanol",
    "Bisabolol",
    "Iron Oxides CI77492",
    "Capryl Glycol",
    "Allantoin",
    "Iron Oxides CI77491",
    "Aluminum Hydroxide",
    "Polyglyceryl-4 Diisostearate/Polyhydroxystearate/Sebacate",
    "Ethylhexylglycerin",
    "Hexylene Glycol",
    "Hydrogenated Lecithin",
    "PEG-10",
    "Tetrasodium Glutamate Diacetate",
    "Palmitoyl Pentapeptide-4",
    "Squalane",
    "Iron Oxides CI77499",
    "Sodium Hydroxide",
    "Polyglutamic Acid"
  ],
  "extended_contents": {},
  "tags": {
    "product_type": [
      "moisturizer",
      "sunscreen",
      "foundation",
      "day cream"
    ],
    "skin_type": [
      "sensitive"
    ],
    "finish": [
      "sheer",
      "medium coverage",
      "waterproof"
    ],
    "ingredients": [
      "niacinamide",
      "peptides"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "non-comedogenic",
      "fragrance-free",
      "paraben-free",
      "alcohol-free",
      "spf"
    ],
    "category": []
  },
  "reviews": {
    "product_id": "pimprod2046161",
    "total_reviews": 392,
    "reviews": [
      {
        "review_id": 563217971,
        "rating": 1,
        "headline": "Disappointed",
        "comments": "I love Naked Sundays Mineral Primer Sunscreen. It has a nice consistency and is long lasting and pairs well with any foundation I have tried with it. So you would think that NS Foundation would pair well too. Instead it was a greasy runny mess that sits on top of your skin and wears off within a couple hours. And I never touch my face. I did not find it to be buildable as stated either. Just kept getting greasier. The one good thing I can say is that I got a pretty perfect color match using the color match tool. Disappointed so this will be going back.",
        "nickname": "AML",
        "location": "Bentoville",
        "created_date": 1757607101930,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 561845138,
        "rating": 5,
        "headline": "Nice Coverage, High SPF and Glowy Skin",
        "comments": "Naked Sunday offers a lot of excellent products and the foundation tint is a must get. The product is a very runny/liquid but it's easy to apply with your fingers or brush. The tint provides coverage but it is still sheer enough so your skin looks more natural. The high SPF and price point are a big plus. Highly recommended!",
        "nickname": "Alyssa",
        "location": "Fairfax",
        "created_date": 1756913176518,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 561001835,
        "rating": 5,
        "headline": "Fantastic for mature skin",
        "comments": "This product gives you glow without greasy feel, sun protection without being heavy. I get compliments every time I wear it. It just melts in to your skin. I have to combine two shades to get the right color match, but worth it!",
        "nickname": "Ab",
        "location": "Austin, Texas",
        "created_date": 1755946752900,
        "bottom_line": null,
        "helpful_votes": 18,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560162864,
        "rating": 5,
        "headline": "Already repurchased",
        "comments": "I really love that this doesn't have chemical SPF so it doesn't burn my eyes. The coverage I would say is lightish/medium and it leaves a nice glass skin finish to the point where I've gotten compliments from strangers on my skin. It blends really well with my fingers so I don't need any brush or sponge to apply it. It lasts a pretty long time. It's very liquidy so when the container is almost done, there's not much leftover product that gets stuck inside the packaging.",
        "nickname": "Stef",
        "location": "North Bergen nj",
        "created_date": 1755180303494,
        "bottom_line": null,
        "helpful_votes": 19,
        "not_helpful_votes": 1
      },
      {
        "review_id": 559964945,
        "rating": 5,
        "headline": "Perfection",
        "comments": "This is the such a beautiful foundation! And so easy to use and apply. At first I was using a makeup brush but I think looks even better when I rub it in with my fingers like I would a face lotion. It lasts really well, leaves my skin looking flawless and glowy while still looking natural. It doesn't settle into my laugh lines either. \n\nI still wear sunscreen under this foundation especially if I'm going to be in the sun, as the coverage is so good that I do not need to use a lot to cover up any imperfections/redness. I even tried using it under my eyes in place of my concealer and it covered my undereye darkness pretty well with minimal to no creasing. \n\nI have light medium neutral skin and shade 2.5 perfectly blends in with my skin.",
        "nickname": "ThekittenH",
        "location": "San Francisco",
        "created_date": 1754959536150,
        "bottom_line": null,
        "helpful_votes": 18,
        "not_helpful_votes": 1
      },
      {
        "review_id": 558792843,
        "rating": 1,
        "headline": "Poor color options. Drying",
        "comments": "Im a huge fan of this brand but this was a disappointment. I chose what i thought would be the lightest coolest tone they offered and it was DARK orange, and very warm. I tried to blend it out but the longer it sat the darker it got. It wasnt very blendable and was very chalky / matte and drying when you applied a decent amount. Wish i could return but waited too long to try it.",
        "nickname": "Aalways",
        "location": "Los Angeles",
        "created_date": 1753947204394,
        "bottom_line": null,
        "helpful_votes": 8,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558676716,
        "rating": 1,
        "headline": "No",
        "comments": "This stuff is so greasy, I have combo skin and it was just gross feeling to me. Color is off too, it oxidizes bad. Just no.",
        "nickname": "Hapbad13",
        "location": "Birmingham",
        "created_date": 1753893987027,
        "bottom_line": null,
        "helpful_votes": 11,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558350612,
        "rating": 5,
        "headline": "Would buy this again",
        "comments": "I've never used this brand before and heard good things so I decided to try this. I really like it for sheer makeup days. It's really lightweight, almost a bit watery, but it feels so good on my skin. The coverage is light and has a nice color that matches my skin and doesn't turn orange throughout the day. I'm 55 and it doesn't settle into fine lines. I do need to wear under eye concealer because I need more coverage in that area. This is comparable to LaRoche Posay sheet mineral tint, just a bit thinner consistency. Great sun protection without any white cast.",
        "nickname": "JanetD",
        "location": "MI",
        "created_date": 1753559586011,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558341540,
        "rating": 5,
        "headline": "Amazing",
        "comments": "This is coming from a diehard estee lauder double wear foundation girl. I have never been able to wear a tinted moisterizer bc it either does nothing or slides right off my skin because I'm oily. This stuff is legit. Wonderful coverage yet light. Makes my skin glow like a dream and doesnt slide off. I have gotten so many compliments recently wearing it. I do set it with a translucent powder and it stays put and wears beautifully even on a boat day in southern heat! I will be repurchasing!",
        "nickname": "Jess",
        "location": "Louisiana",
        "created_date": 1753539225703,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557432869,
        "rating": 3,
        "headline": "Description is false...",
        "comments": "If you look on the actual website, it does not state 80 percent waterproof because it is not. Naked Sunday also says you need to use a good amount or use in conjunction with another. The tint is nice. It does even out skin tone but will not cover any dark spots or freckles. I bought this thinking I could wear just this to pool but its not waterproof. I wear it throughout the day but need powder on top because it is shiny. Its not thick and works with concealer. I do like the bronzer I purchased with it. They both apply seamlessly. I will use the bottle up but see no point in repurchase. I use a waterproof zinc spf 50+ under my makeup and will stick to that.",
        "nickname": "Gaby",
        "location": "Tampa",
        "created_date": 1752754852556,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 2
      },
      {
        "review_id": 556925968,
        "rating": 5,
        "headline": "Wonderful Foundation Tint",
        "comments": "Bought this foundation tint because of the positive reviews.  It is light, goes on smoothly (I used a brush), feels so soft on my skin.  I ordered 2.5 Light and its a perfect match.  I may try the Fair 2, since it has cool undertones for a sunkissed look.  It has SPF which is what I was looking for in a tint.  Its for my no-makeup makeup days, but will probably wear more frequently because it is that good.",
        "nickname": "Crazy Old Lady",
        "location": "Alabama",
        "created_date": 1752178061732,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556715255,
        "rating": 5,
        "headline": "The best tinted sunscreen I've ever used",
        "comments": "I have oily, dehydrated, acne prone, textured, and reactive skin. This is the best tinted sunscreen I've ever used. Goes on smoothly, has great coverage, doesn't feel heavy on my skin. Usually the other brands of the same product turns into an oily sheen that breaks up on my face after acouple of hours. BeautyScreen does not do this. And I'm very impressed with the intensity of the pigment used. A little goes a long way. My only complaints: needs to be a bigger bottle, maybe 60 mL and an expanded shade range. Right now I have to mix two shades to get a better match.",
        "nickname": "Looby",
        "location": "California",
        "created_date": 1751804004396,
        "bottom_line": null,
        "helpful_votes": 10,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556708279,
        "rating": 5,
        "headline": "GET IT",
        "comments": "Before trying this skin tint I tried the Tower 28 one. I gave T28 a fair 2 weeks but it was clogging my chin pores bad. I waited about a month to let my skin calm down before trying the naked sunday. I have combo acne prone skin, and this one has given me no issues. Yes its watery, but i kinda prefer that over the thickness of T28. I also really like NS spray sunscreen!",
        "nickname": "Cflo",
        "location": "California",
        "created_date": 1751776755140,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556427899,
        "rating": 5,
        "headline": "Great so far!",
        "comments": "Not heavy, blends well, and stays put! So far this is a great purchase and it's working wonderful as a summertime foundation!",
        "nickname": "Crystal",
        "location": "Raleigh",
        "created_date": 1751583294857,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555671432,
        "rating": 2,
        "headline": "No",
        "comments": "Was too liquidated for me & the bottle is quiet small.",
        "nickname": "Sierra",
        "location": "Vance",
        "created_date": 1750525059620,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 6
      },
      {
        "review_id": 555230174,
        "rating": 5,
        "headline": "Beautiful Product",
        "comments": "I don't wear foundation usually but I do love makeup and wear it almost daily. I'm 44 and I religiously use sunscreen year round with just a tinted moisturizer to even out my skin tone before blush, etc. I don't know what prompted me to buy this but I'm glad I did. It's a thin, lightweight formula that feels sheer ( which is what I prefer) but it does build up beautifully without being cakey. It has a gorgeous finish that makes my skin look even and dewey without feeling sticky, greasy or heavy. It instantly became my daily go to. I will definitely repurchase this when I run out.",
        "nickname": "B",
        "location": "Philadelphia",
        "created_date": 1750125236350,
        "bottom_line": null,
        "helpful_votes": 11,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554955657,
        "rating": 5,
        "headline": "Love this!",
        "comments": "Blended out nicely, no sunscreen smell, looked beautiful and kept my face from burning in the sun. Will continue to use throughout the summer!",
        "nickname": "AB",
        "location": "Omaha, NE",
        "created_date": 1749690645289,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 1
      },
      {
        "review_id": 554792422,
        "rating": 3,
        "headline": "It was not irritating but very messy.",
        "comments": "For my sensitive skin, it was not irritating and it did not sting my eyes.  However, it does not stand up to heat or humidity and it slides right off and is very messy.  Sadly, I had to return it.",
        "nickname": "Ann",
        "location": "FL",
        "created_date": 1749482428581,
        "bottom_line": "No",
        "helpful_votes": 12,
        "not_helpful_votes": 1
      },
      {
        "review_id": 554713450,
        "rating": 5,
        "headline": "Love",
        "comments": "I am so happy that i took a chance on this product. It looks fantastic! Blends easily and offers enough coverage to hide imperfections.",
        "nickname": "Westdan",
        "location": "NY",
        "created_date": 1749333633686,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554604709,
        "rating": 5,
        "headline": "Exactly what I was looking for in a mineral skin tint!",
        "comments": "Right off the bat, I love the consistency. It isn't thick (think IT Cosmetics original CC cream), it is more water-like (similar to the Estee Lauder Hydra Rescue foundation). The finish is beautiful! I primed with an SPF and Futurist Aqua Brilliance primer. \nAfter applying with a sponge, I used the Chocolate Soleil cream bronzing stick and Patrick Ta cream blush- all of which work very well with this tint (I do not apply other products directly to my face- I apply to the back of my hand, then to the face).\nI lightly set everything with the Make Up By Mario loose powder and added powder bronzer/blush (Hourglass). It is absolutely beautiful and most importantly, it lasts!\n\nThis is my new favorite for when I need to do errands and go for a run. I need good staying power/SPF, but don't want to use actual foundation. (I use this brand's SPF spray as well before going running!)\n\nI have sensitive skin and am acne-prone. This has not broken me out and there is really no sunscreen smell to it.\n\nI did not get paid for this review, and I did not recieve any products for free. I got shade 1 and did not experience any oxidation (I am 1C0 Shell in Double Wear).",
        "nickname": "Christ",
        "location": "Dallas, TX",
        "created_date": 1749188491455,
        "bottom_line": null,
        "helpful_votes": 24,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 61,
      "pages_total": 4,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2046161/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        4,
        5,
        9,
        39,
        335
      ],
      "review_histogram": [
        4,
        5,
        9,
        39,
        335
      ],
      "rating_count": 392,
      "review_count": 392,
      "average_rating": 4.78,
      "recommended_ratio": 0.95,
      "media": [
        {
          "id": "536015996",
          "review_id": 536015995,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/xuwpdeina8jouvjrflsv.jpg",
          "headline": "I am obsessed",
          "rating": 5,
          "helpful_votes": 1,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "I am in love",
          "nickname": "Elena",
          "created_date": 1728916357353
        },
        {
          "id": "527679509",
          "review_id": 527679497,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/vpo90opcxh6snwy0ncne.jpg",
          "headline": "My new go-to skin tint!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Lindsey",
          "created_date": 1724173064336
        },
        {
          "id": "527419096",
          "review_id": 527419086,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/jh5qqzii6rkynopaowni.jpg",
          "headline": "Feels like skin ! 🤩",
          "rating": 5,
          "helpful_votes": 1,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "I love it !",
          "nickname": "Alejandra",
          "created_date": 1723816851046
        }
      ],
      "faceoff_positive": {
        "comments": "I recently had the chance to try out a foundation SPF peptide tint, and I must say, it has quickly become one of my go-to products! This foundation is incredibly lightweight on the skin, which is a huge plus for me. I often find heavier foundations can feel suffocating, especially during warmer months, but this formula feels almost like a second skin.One of the standout features of this foundation is how true it is to my skin color. It blends effortlessly, providing a natural finish that enhances my complexion without masking it. I appreciate that it evens out my skin tone while still allowing my natural beauty to shine through. It's perfect for those days when I want a little coverage but don't want to look overly made up.The SPF in this foundation is another major selling point. I love that I can get sun protection while also wearing makeup. It's so convenient to have a product that combines both, especially since I'm often on the go. The added peace of mind knowing my skin is protected from harmful UV rays is invaluable.The peptide aspect of this foundation is also noteworthy. Peptides are known for their skin-loving benefits, and I feel good knowing that I'm applying a product that not only looks great but also supports the health of my skin. Over time, I've noticed my skin feels more hydrated and looks more radiant, which is a fantastic bonus.Application is a breeze with this foundation. I typically use my fingers or a damp beauty sponge, and it blends out beautifully. There's no need for heavy layering; a small amount goes a long way, providing just the right amount of coverage. I love how it feels like I'm applying a skincare product rather than a traditional foundation.Another great aspect is its longevity. I've worn it for several hours without any noticeable fading or settling into fine lines. It holds up well throughout the day, which is essential for my busy lifestyle. I can confidently go about my day without worrying about touch-ups, which is a game-changer.In terms of packaging, the foundation comes in a sleek and practical bottle that dispenses just the right amount of product. It's easy to control how much you use, which helps prevent waste. The design is also aesthetically pleasing, making it a lovely addition to my makeup collection.Overall, I highly recommend the foundation SPF peptide tint to anyone looking for a lightweight, true-to-skin color foundation that also offers sun protection. It's perfect for daily wear, whether you're running errands, heading to work, or enjoying a day out. The combination of skincare benefits and makeup is a win-win in my book.In conclusion, this foundation has exceeded my expectations in terms of performance, comfort, and skin benefits. If you're in the market for a new foundation that feels good, looks natural, and protects your skin, definitely give this one a try! You won't be disappointed.\n**This review was collected as part of a promotion.",
        "headline": "I absolutely loveee this product",
        "rating": 5,
        "ugc_id": 546080561
      },
      "faceoff_negative": {
        "comments": "I love the idea of a skin tint with sunscreen. Was really excited to try this product. I ordered shade 4 (medium) and shade 3 (light medium) because I'm usually tan in the summer but once Fall & Winter arrive I'm going back to lighter toned makeup. \nWell even with a tan, shade 4 was just to orange for me. Shade 3 was too light for my current skin tone. I tried wearing shade 4 but the orange got worse during the day. The next time I applied it, I mixed the 2 colors together with better results. \nBut my main complaint is the finish is not good. This foundation is super shiny & oily looking on the skin. As a result, it highlights every pore, every wrinkle & defect. The coverage is light -medium so if your skin is without flaws it should be great. I ended up using concealer on several spots. I love a dewy, skin like finish but this was far too shiny and sheer and served only to highlight every issue. I ended up using way more setting powder than I normally do in the Summer because my normal light dusting on my t-zone didn't come close to dampening down the oily shine of this makeup. \nI love the SPF in this makeup. I just wish it was formulated to give a better finish to the skin. I won't be reordering because the shades don't suit my coloring and the makeup is just super super shiny.",
        "headline": "Disappointed",
        "rating": 2,
        "ugc_id": 528950504
      },
      "name": "BeautyScreen Mineral Peptide Foundation Tint SPF 50",
      "native_review_count": 61,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 331,
      "locale": "en_US"
    }
  }
}