{
  "product_id": "pimprod2045669",
  "product_url": "https://www.ulta.com/p/niacinamide-cleansing-gelee-3-pimprod2045669",
  "extracted_at": "2025-09-23T04:42:01.465682+00:00",
  "product_name": "NaturiumNiacinamide Cleansing Gelee 3%",
  "brand": "Naturium",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wash"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "17.99",
  "availability": "in_stock",
  "rating_avg": "4.6",
  "rating_count": "268",
  "images": [
    "https://media.ulta.com/i/ulta/2627354?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2627354?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2627354_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2627354_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2627354_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2627354_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2627354_vid01/thumbs/d46449da-f467-4b0c-8df3-6d271ee3a927?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganNaturium's Niacinamide Cleansing Gelee 3% is formulated with 3% niacinamide and works to gently dissolve makeup, oil and impurities, while improving the appearance of skin, for a healthier-looking complexion. Leaves skin feeling softer, smoother, and balanced, never dry or stripped.",
  "details": "DetailsBenefitsGently dissolves impuritiesLeaves skin feeling soft & smoothHelps balance skin, leaving it feeling comfortable, not dry or strippedDermatologist testedFragrance freeVegan, paraben & cruelty freeResearch ResultsCLINICALLY PROVEN RESULTS* 100% of subjects showed immediate & all-day oil control*In an 1-day clinical study on subjects (women & men), representation across all skin types & self-perceived sensitive skinKey IngredientsNiacinamide: high purity form of vitamin B3, helps balance oil, leaves skin feeling ultra soft & smoothSodium Hyaluronate: replenishes essential moisture, creates a smoothing, plumping-effectSodium Ascorbyl Phosphate: a water soluble & stable form of Vitamin C, potent antioxidant that protects skin from environmental stressorsItem 2627354How To UseApply a few pumps onto dry or damp skin and massage to emulsify. Rinse thoroughly. For a quick mask, leave on for five minutes before rinsing. Wear SPF during the day. Patch test prior to use is advised.For external use only. Use only as directed.IngredientsAqua, Disodium Cocoyl Glutamate, Niacinamide, Glycerin, Disodium Cocoamphodiacetate, Decyl Glucoside, Xanthan Gum, Sodium Hyaluronate, Myrciaria Dubia Fruit Extract, Sodium Ascorbyl Phosphate, Phenoxyethanol, Citric Acid, Ethylhexylglycerin, Potassium Sorbate, Tocopherol.",
  "how_to_use": "Apply a few pumps onto dry or damp skin and massage to emulsify. Rinse thoroughly. For a quick mask, leave on for five minutes before rinsing. Wear SPF during the day. Patch test prior to use is advised.For external use only. Use only as directed.",
  "ingredients": [
    "Aqua",
    "Disodium Cocoyl Glutamate",
    "Niacinamide",
    "Glycerin",
    "Disodium Cocoamphodiacetate",
    "Decyl Glucoside",
    "Xanthan Gum",
    "Sodium Hyaluronate",
    "Myrciaria Dubia Fruit Extract",
    "Sodium Ascorbyl Phosphate",
    "Phenoxyethanol",
    "Citric Acid",
    "Ethylhexylglycerin",
    "Potassium Sorbate",
    "Tocopherol"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser"
    ],
    "skin_type": [
      "oily",
      "dry",
      "sensitive",
      "normal",
      "all skin types"
    ],
    "finish": [
      "sheer",
      "creamy",
      "gel",
      "oil"
    ],
    "ingredients": [
      "niacinamide"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "dermatologist-tested",
      "fragrance-free",
      "spf",
      "purifying"
    ]
  },
  "reviews": {
    "product_id": "pimprod2045669",
    "total_reviews": 268,
    "reviews": [
      {
        "review_id": 558539367,
        "rating": 5,
        "headline": "Best face wash!!",
        "comments": "Love everything about this face wash. It has a natural smell and glides on effortlessly. I might replace my Cetaphil for this :)",
        "nickname": "trippykittyxo",
        "location": "New York, New York",
        "created_date": 1753756245822,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555117961,
        "rating": 5,
        "headline": "Price performer, gentle and effective on skin",
        "comments": "This was extremely helpful with an unexpected breakout. It was BAD. I was told that I was being too harsh with my skin for it to heal, and they suggested niacinamide. It still took a while for the really stubborn zits to go away, but it did a lot of good for my pores and was much more gentle on my skin than what I was using, which was exactly what I needed. It's a price performer, too.",
        "nickname": "Anni",
        "location": "Durham, NC",
        "created_date": 1749852532565,
        "bottom_line": "Yes",
        "helpful_votes": 9,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553605978,
        "rating": 5,
        "headline": "My fave",
        "comments": "This review is NOT incentivized. I just lovd it. This cleanser is perfect for my dry combo skin. Gentle enough to not strip my dry parts, and removes excess oil from my T-zone. The niacinamide is so good for my large pores too. Highly reccommend.",
        "nickname": "Gaby",
        "location": "Nashville",
        "created_date": 1747715689253,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552477128,
        "rating": 5,
        "headline": "100% Holy Grail",
        "comments": "This is my favorite cleanser of all time. I have sensitive combination skin and using this makes my skin feel clean, but not stripped, and soft and smooth. 10/10 will be repurchasing forever.",
        "nickname": "Han",
        "location": "Atlanta, GA",
        "created_date": 1745612506848,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 552099193,
        "rating": 5,
        "headline": "HOLY GRAIL",
        "comments": "My friend bought this and let me try it, so when I needed a cleanser I bought the travel size (only five bucks!) and OH MY GOODNESS I love this so much! It's non stripping, but cleans well and doubles as a mask. It's brightening too! I'm on my third travel size bottle (travel size because my budget is tinyyyy) but the travel size lasts me about three months! A little goes a very long way. I have combo/oily skin and my friend has dry. It worked so well for both of us! Go get it!",
        "nickname": "Loveballet",
        "location": "California",
        "created_date": 1745187487117,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552099171,
        "rating": 5,
        "headline": "HOLY GRAIL",
        "comments": "My friend bought this and let me try it, so when I needed a cleanser I bought the travel size (only five bucks!) and OH MY GOODNESS I love this so much! It's non stripping, but cleans well and doubles as a mask. It's brightening too! I'm on my third travel size bottle (travel size because my budget is tinyyyy) but the travel size lasts me about three months! A little goes a very long way. I have combo/oily skin and my friend has dry. It worked so well for both of us! Go get it!",
        "nickname": "Loveballet",
        "location": "California",
        "created_date": 1745187486766,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 550875148,
        "rating": 5,
        "headline": "Missed it so much I had to come back!",
        "comments": "I had used this product for a long time but I stopped using it so I could just finish up every other face wash I had. In the two weeks it took me to finish my other products, I developed the most noticeable blackheads on my nose! I had never had that problem before and it was super embarrassing. Within 3 days of going back to this facewash my face cleared up! Its crazy to see how much of a difference it made. 100% recommend this product.",
        "nickname": "Cami",
        "location": "New York",
        "created_date": 1743618126605,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549910510,
        "rating": 5,
        "headline": "Great cleanser I love it",
        "comments": "So soothing and gentle!!!! Yet takes off all my makeup i love it!!! Going to keep using this i love it:)",
        "nickname": "Anna",
        "location": "Chicago IL",
        "created_date": 1743079685048,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549858370,
        "rating": 1,
        "headline": "Broke me out",
        "comments": "This stuff broke me out and made my skin feel tight",
        "nickname": "Ralynn",
        "location": "Kansas City",
        "created_date": 1743008262436,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 549827542,
        "rating": 1,
        "headline": "drying",
        "comments": "i have normal skin and use this as my final.cleanser after make up remover. Noticed that the skin around my eye area still has mascara and is bone dry. as a result my skin is dirty and itchy.",
        "nickname": "unimpressed",
        "location": "Houston, tx",
        "created_date": 1742942550318,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 549820412,
        "rating": 5,
        "headline": "Great cleanser",
        "comments": "Great cleanser at a great price",
        "nickname": "",
        "location": "San Antonio",
        "created_date": 1742933053450,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549684562,
        "rating": 5,
        "headline": "Best Cleanser I have ever used",
        "comments": "I picked this cleanser up on a complete whim after seeing it in the store and I am so glad I did.  It is like a double cleanse in one step.  Heavy mineral sunscreen melts away.  My skin in clog and break out prone and I have to be careful because I will break out if I use an oil cleanser and don't cleanse thoroughly enough with the second step.  It is really nice to avoid this but still get all my sunscreen off in one step.  \n\nI adore the consistency.  It has a plush gel texture that turns to soft creamy bubbles and rinses completely clean but without leaving that tight feeling.  It nudged out my previous HG cleanser that I thought I would never stop using: Krave Matcha Hemp.",
        "nickname": "Jennifer",
        "location": "Dublin, CA",
        "created_date": 1742648396888,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 548869257,
        "rating": 3,
        "headline": "Too drying for me",
        "comments": "I have found this cleanser to be too drying for me personally, though I see many others disagree so YMMV. I have pretty dry skin at baseline especially in the winter, and Ive had some dry patches and stinging since switching to this cleanser. I have needed a massive increase in the amount of moisturizer I'm using to keep up. I was hoping to find a gel cleanser I liked just because I prefer the texture but seems cream cleanser will still be the way to go. Also as some others have mentioned the packaging is horrible, the first one I got was broken and Ulta replaced it, the second is intact but now gets jammed and clogged all the time.",
        "nickname": "Rachel",
        "location": "Atlanta",
        "created_date": 1742144295334,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 545861569,
        "rating": 4,
        "headline": "Favorite",
        "comments": "Love this cleanser, even got my fiancé obsessed with it too. We've been through multiple bottles and will continue to buy more. The gel texture feels very silky and soothing, and overall my skin looks healthier since I started using it. I have very sensitive oily skin and I have not experienced any irritation or breakouts from this cleanser, nor does my face feel dry or tight if I don't put moisturizer on immediately after. It's a great product. I also love the pump dispenser. I only removed 1 star because it doesn't always completely remove eye makeup, and I haven't noticed much difference in oil production. Those things are not a big deal to me, but were worth noting for the review.",
        "nickname": "J",
        "location": "DC",
        "created_date": 1738603949027,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 545820385,
        "rating": 5,
        "headline": "Great cleanser",
        "comments": "I got a sample size and immediately had to purchase the large bottle. I use this as my first step in my two step cleansing process. It is great at removing makeup without stripping the skin. Leaves the skin clean and smooth with no abrasive properties. I have seen a huge improvement of my skin since the first use. I have very very sensitive skin so im always apprehensive to try new things and this is an instant win!",
        "nickname": "RMB",
        "location": "Surf City, NC",
        "created_date": 1738505142012,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543610665,
        "rating": 3,
        "headline": "So so",
        "comments": "When I bought this I LOVED it. As I continued to use it I felt like my skin was irritated. I switched to vanicream and my skin is better than ever. I think it may work for some but not me.",
        "nickname": "Jess",
        "location": "Orlando, fl",
        "created_date": 1737301796815,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 1
      },
      {
        "review_id": 542279522,
        "rating": 5,
        "headline": "Amazing",
        "comments": "This product has worked amazing on my skin. This top all cleansers I've ever used. I know some products doesn't work for all skin types but if you're looking for something that will help improve your skin, Buy this.",
        "nickname": "Cass",
        "location": "Mississippi",
        "created_date": 1736109227668,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 538925095,
        "rating": 1,
        "headline": "Not for hyper sensitive skin",
        "comments": "The first week i used it i had terrible irritation and swelling. I stop because my dr and i thought it was seasonal allergies, I stopped using it for about a month and a half. 3 days ago 12.1.24 today 12.3.24 is how long ive used it for again to see if it was the product and i can tell you it definitely is because i wake up with the same reactions. I've officially stopped using 🚮. I love the brabd, but not this particular product.",
        "nickname": "Shali",
        "location": "New York",
        "created_date": 1733290210786,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 538674204,
        "rating": 5,
        "headline": "This is a great face wash",
        "comments": "Leaves my face soft and smooth",
        "nickname": "Adriana",
        "location": "San Antonio, TX",
        "created_date": 1732680099406,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 535394761,
        "rating": 1,
        "headline": "Not for oily skin",
        "comments": "I got this because of the great reviews but my skin started getting really bad pimples everywhere. I was super upset but i feel that this isnt for oily prone skin as it produces extra sebum",
        "nickname": "Good soup",
        "location": "Md",
        "created_date": 1728005172020,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 5
      }
    ],
    "paging": {
      "total_results": 31,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2045669/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        10,
        7,
        12,
        30,
        209
      ],
      "review_histogram": [
        10,
        7,
        12,
        30,
        209
      ],
      "rating_count": 268,
      "review_count": 268,
      "average_rating": 4.57,
      "recommended_ratio": 0.86,
      "media": [],
      "faceoff_positive": {
        "comments": "Sweet baby Jesus. I have searched for skincare that works for so long. Let's preface by clarifying, I am not a skincare junkie, I love makeup, but I suck at using it. I'm just a tired mom in her 30's trying to get my oily postpartum skin under control. I've had issues with oily skin forever. Every cleanser that promised to help deal with oil failed miserably or dried out my skin to the point where I looked like a plump, sunburnt reptile. When Naturium launched, I was pregnant so I waited until I had my daughter to try it out. I'll never go back. This cleanser just works. I mentioned before that I'm just tired mom, and I never use oil to take off my mascara or makeup before the cleanser. With so many other cleansers I would just get raccoon eyes. Not this bad boy. When I rinsed my face after using it once, all of my makeup was gone. that had never happened to me before and I was afraid I was hallucinating. My skin felt clean but not dried out. While my face certainly isn't matte because I'm an actual real life human being, my oily skin is so much better under control. It's the end of the day and my skin just feels soft not slimy. I can't recommend this product enough.",
        "headline": "I've been searching for so long",
        "rating": 5,
        "ugc_id": 535328576
      },
      "faceoff_negative": {
        "comments": "I typically use Youth to the People's Superfood cleanser but when I ran low on my supply, I thought I'd do a lot of research and find another cruelty free/eco friendly cleanser to try out. I accidentally stumbled upon this brand thanks to Hyram and did hours and hours of research on the brand. I was pleased by what I had found and decided to purchase a few different products to try. \n\nI was nervous because I really did love my last cleanser very much but I was mostly excited to try this more treatment based cleanser. I have normal skin with slight texture and was interested in the niacinamide as a new addition to my routine. \n\nFirst impressions: I wasn't sure if this bottle would be plastic or glass but it is in fact plastic. I try to never purchase anything with plastic so I was disappointed about that. Not the worst of my issues though. Second, this is unscented and which I enjoy. Although, this cleanser smells like hand soap and I just didn't love that. After cleansing my skin, I moisturized my skin with my Milk Vegan Milk Moisturizer before laying down for bed. Usually, my moisturizer makes my skin feel so heavily moisturized and comfortable. This time, it completely soaked into my skin and I still felt tight/dry. I added more. Still felt dry. Moments later, my nose tickled a lot and I thought nothing of it. Soon after that my entire face felt sort of like it was throbbing and itchy. I completely ignored it. My skin looked alright the next morning but I did have one new small blemish in the bridge of my nose. I felt dry and tingly the rest of the day and after my second use of this cleanser last night, my skin has a tight burning sensation and I have little uncomfortable tingles/tickles that keep popping up all over my face. I think this brand is interesting and I'm still looking forward to trying the two other products I'm waiting for in the mail but I am certainly confused about why this happened because my skin is completely irritated. I will go back to using my YTTP superfood cleanser because it made my skin feel supple, bouncy, and never stripped or tight.",
        "headline": "I wanted to love this so badly!",
        "rating": 2,
        "ugc_id": 535328445
      },
      "native_review_count": 31,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 237,
      "locale": "en_US"
    }
  }
}