{
  "product_id": "pimprod2045670",
  "product_url": "https://www.ulta.com/p/purple-ginseng-cleansing-balm-pimprod2045670",
  "extracted_at": "2025-09-23T04:58:14.503386+00:00",
  "product_name": "NaturiumPurple Ginseng Cleansing Balm",
  "brand": "Naturium",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Cleansing Balms & Oils"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "cleansing-balms--oils"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "19.99",
  "availability": "in_stock",
  "rating_avg": "4",
  "rating_count": "354",
  "images": [
    "https://media.ulta.com/i/ulta/2627357?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2627357?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2627357_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2627357_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2627357_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2627357_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2627357_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2627357_vid01/thumbs/ad2adc37-f8d8-46bb-b79d-05d5a20aee6b?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganNaturium's Purple Ginseng Cleansing Balm is formulated with purple ginseng, plant-based esters and a nourishing blend of linoleic-rich oils that help to dissolve makeup, oil, sunscreen and other impurities.",
  "details": "DetailsBenefitsA sorbet-like cleansing balm that melts into skinDissolves dirt, oil, makeup, sunscreen and other impuritiesEmulsifies upon contactDermatologist testedFragrance freeVegan, paraben & cruelty freeFeaturesSorbet-like balm-to-oil formula contains linoleic-rich oils that work to dissolve makeup, oil, sunscreen, and other impurities, plus rinses clean. Great as a first cleanse or as your only cleanseDeveloped for all skin typesFormulated with purple ginseng, plant-based esters and a nourishing blend of linoleic-rich oilsDoes not contain any PEGs or polyethyleneKey IngredientsEmulsifiers rich with Fatty Acids & Linoleic Oils: leaves skin feeling silky smooth and velvety-soft, promotes a conditioned and supple skin barrier, leaving skin feeling moisturized, not greasy or oily; leaves skin feeling conditioned, nourished and cleansed.Neem Leaf & Flower Extract: potent antioxidant, rich in flavanoids and polyphenolsRed Algae Extract: contains natural minerals, including magnesium and zinc, helps soothe dry skinAloe Flower Extract: powerful skin conditioner with humectant propertiesItem 2627357How To UseUsing dry hands, work a generous amount of the cleansing balm onto dry skin and add water to emulsify. Rinse thoroughly and follow with second cleanse. Wear SPF during the day. Patch test prior to use is advised.For external use only. Use only as directed.IngredientsEthylhexyl Palmitate, Coco-Caprylate/Caprate, Synthetic Wax, Polyglyceryl-10 Dioleate, Sorbitan Oleate Decylglucoside Crosspolymer, Isoamyl Cocoate, Glyceryl Citrate/Lactate/Linoleate/Oleate, Polygonum Bistorta Root Extract, Salvia Hispanica Seed Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Sorbitan Sesquioleate, Glyceryl Laurate, Aloe Barbadensis Flower Extract, Melia Azadirachta Leaf Extract, Ocimum Sanctum Leaf Extract, Melia Azadirachta Flower Extract, Aqua, Glyceryl Caprylate, Polyglyceryl-3 Caprate, Polyglyceryl-4 Cocoate, Coccinia Indica Fruit Extract, Corallina Officinalis Extract, Solanum Melongena (Eggplant) Fruit Extract, Curcuma Longa (Turmeric) Root Extract, Ocimum Basilicum (Basil) Flower/Leaf Extract, Glycerin, Phenoxyethanol, Pentylene Glycol, Sodium Chloride, Alcohol, Tocopherol.",
  "how_to_use": "Using dry hands, work a generous amount of the cleansing balm onto dry skin and add water to emulsify. Rinse thoroughly and follow with second cleanse. Wear SPF during the day. Patch test prior to use is advised.For external use only. Use only as directed.",
  "ingredients": [
    "Ethylhexyl Palmitate",
    "Coco-Caprylate/Caprate",
    "Synthetic Wax",
    "Polyglyceryl-10 Dioleate",
    "Sorbitan Oleate Decylglucoside Crosspolymer",
    "Isoamyl Cocoate",
    "Glyceryl Citrate/Lactate/Linoleate/Oleate",
    "Polygonum Bistorta Root Extract",
    "Salvia Hispanica Seed Oil",
    "Simmondsia Chinensis (Jojoba) Seed Oil",
    "Sorbitan Sesquioleate",
    "Glyceryl Laurate",
    "Aloe Barbadensis Flower Extract",
    "Melia Azadirachta Leaf Extract",
    "Ocimum Sanctum Leaf Extract",
    "Melia Azadirachta Flower Extract",
    "Aqua",
    "Glyceryl Caprylate",
    "Polyglyceryl-3 Caprate",
    "Polyglyceryl-4 Cocoate",
    "Coccinia Indica Fruit Extract",
    "Corallina Officinalis Extract",
    "Solanum Melongena (Eggplant) Fruit Extract",
    "Curcuma Longa (Turmeric) Root Extract",
    "Ocimum Basilicum (Basil) Flower/Leaf Extract",
    "Glycerin",
    "Phenoxyethanol",
    "Pentylene Glycol",
    "Sodium Chloride",
    "Alcohol",
    "Tocopherol"
  ],
  "extended_contents": {},
  "tags": {
    "product_type": [
      "cleanser",
      "moisturizer",
      "lip gloss",
      "oil"
    ],
    "skin_type": [
      "oily",
      "dry",
      "all skin types"
    ],
    "finish": [
      "sheer",
      "creamy",
      "oil"
    ],
    "color": [
      "purple"
    ],
    "ingredients": [
      "synthetic"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "natural",
      "dermatologist-tested",
      "fragrance-free",
      "spf",
      "hydrating",
      "purifying"
    ],
    "category": []
  },
  "reviews": {
    "product_id": "pimprod2045670",
    "total_reviews": 354,
    "reviews": [
      {
        "review_id": 561300830,
        "rating": 1,
        "headline": "TERRIBLE FOMULA CHANGE",
        "comments": "Used to be my holy grail. But since this year formula change... I hate it it. The only way to get the residue off is with bar soap. The new formula has cause clogged pores and breakouts.",
        "nickname": "Roluh",
        "location": "Palm Beach Gardens",
        "created_date": 1756391615606,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558093503,
        "rating": 1,
        "headline": "Clogged pores",
        "comments": "First this leaves a film on the skin that does not rinse away. After a second wash with a cleanser my skin still feels like its not completely gone. After about a week of use i now have clogged pores and blackheads on my chin and nose. Its a shame because ive loved everything else by this brand but this is a big miss. Ill stick with Farmacy",
        "nickname": "Amanda",
        "location": "Pittsburgh",
        "created_date": 1753322734554,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554104679,
        "rating": 5,
        "headline": "My sister and I Love it",
        "comments": "I tried it out when it first came out and it does the job of removinf hard make up, suncreen, eyeliner, mascara. It works better with a double cleanse but overall for the price and how much you are getting its a really good cleansing balm compared to others with the same price range and amount. My sister tried it out when it got to ulta and it still works the same. If you dont wanna splirge but need something to help remove your waterresistant stuff this will work!",
        "nickname": "Cozmo",
        "location": "LA",
        "created_date": 1748450163651,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553624776,
        "rating": 5,
        "headline": "Works amazing",
        "comments": "Works great to take make up off and leaves skin hydrated. My eyes are super sensitive to products and gets irritated very easily, but this cleanser doesn't irritate my eyes at all. Will definitely repurchase!",
        "nickname": "EC",
        "location": "Pittsburgh",
        "created_date": 1747760211194,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552132131,
        "rating": 5,
        "headline": "Works amazing if you follow instructions",
        "comments": "I love this cleansing balm! It melts makeup off well... As far as the other reviews saying it leaves a film, the instructions clearly say follow up with a second cleanse. It's a necessity in my skin care routine to wash off makeup.",
        "nickname": "Jaye",
        "location": "Nashville TN",
        "created_date": 1745262436042,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551107354,
        "rating": 2,
        "headline": "Don't do it",
        "comments": "Even though the price is affordable, it's not worth breaking out for. If you wanna go afforable, it's better just to get the elf balm at least that won't break you out",
        "nickname": "LC",
        "location": "California",
        "created_date": 1743961658872,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 544242233,
        "rating": 3,
        "headline": "Was really hoping to love",
        "comments": "Melts nicely & easy to massage...BUT just horrible for eye area. Even with 2nd cleanser hard to wash residue off around eyes. Defaulting to my Peach & Lily cleanser.",
        "nickname": "Mari",
        "location": "Rockwall TX",
        "created_date": 1737843901571,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 544122257,
        "rating": 5,
        "headline": "My go to in my double cleanse routine!",
        "comments": "I have repurchased this makeup remover several times now. It melts into the skin pretty easily, and I can wipe the residue off with a cotton round. It works great and I haven't had any issues with it! Works well with the rest of my products as well. I suggest follwing up with a foaming cleanser.",
        "nickname": "Zyla",
        "location": "Tuscaloosa, AL",
        "created_date": 1737740574194,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 544122329,
        "rating": 5,
        "headline": "My go to in my double cleanse routine!",
        "comments": "I have repurchased this makeup remover several times now. It melts into the skin pretty easily, and I can wipe the residue off with a cotton round. It works great and I haven't had any issues with it! Works well with the rest of my products as well. I suggest follwing up with a foaming cleanser.",
        "nickname": "Zyla",
        "location": "Tuscaloosa, AL",
        "created_date": 1737740573793,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543635357,
        "rating": 2,
        "headline": "Hard pass",
        "comments": "I was excited to try this cleansing balm but it did not do a great job. I wear a good amount of makeup like a full face. Twice I had to cleanse to remove and still found eyeliner residue after.",
        "nickname": "Megl",
        "location": "Newport news",
        "created_date": 1737364010812,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543561424,
        "rating": 1,
        "headline": "Not worth the money",
        "comments": "It doesnt really remove my makeup all the way and I really wanted to try it because it has ginseng in it but not purchasing again",
        "nickname": "Angel",
        "location": "Dallas, Texas",
        "created_date": 1737166868998,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543554563,
        "rating": 2,
        "headline": "Don't love it",
        "comments": "I dont love this cleansing balm. It made me break out and felt heavy on my skin. Also burned my eyes and left a weird film. Did take off makeup though.",
        "nickname": "Ali",
        "location": "New Orleans",
        "created_date": 1737150915826,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543503908,
        "rating": 5,
        "headline": "Wonderful product",
        "comments": "This has no scent and works well taking off my full face of makeup and even waterproof mascara with no raccoon residue",
        "nickname": "Melinda",
        "location": "Seattle",
        "created_date": 1737138103038,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543411926,
        "rating": 2,
        "headline": "Choose Another Option",
        "comments": "My skin is normally very forgiving of new products and I am not acne prone at all, but two days into introducing these cleansing balm and the entire lower portion of my face is broken out. My partner is having the same reaction. After a little more research it seems as though this is a pretty common response. There are better balms out there.",
        "nickname": "Alyce",
        "location": "Oregon",
        "created_date": 1737091095229,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 543213390,
        "rating": 1,
        "headline": "Broke me out",
        "comments": "I have sensitive combination skin. That being said, I have never broken out with any type of balm remover.  It mustve been clogging my pores. Aside from that, thr balm didnt emulsify thst well and left a film on my skin. I always double cleanse when using these types of products, but I never felt such a thick film after a balm, mixed w balm and my makeup partially removed. A real mess! Other balms are a little more expensive but seem worth it compared to this",
        "nickname": "LCBaby",
        "location": "California",
        "created_date": 1737024312510,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542831142,
        "rating": 4,
        "headline": "Pretty great product",
        "comments": "It melts my makup so nicely, it is hydrating but does leave my face feeling a little heavy,  always use a cleanser after a melting balm",
        "nickname": "KJ",
        "location": "Utah",
        "created_date": 1736821352084,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542639295,
        "rating": 1,
        "headline": "broke me out, a lot of under the skin pimples",
        "comments": "i was so excited to try this but it broke me out so bad for weeks on end. im not allergic to any of the ingredients, not acne prone, and have normal skin, so i dont know why it happened, but i will never purchase again.",
        "nickname": "natalie",
        "location": "los angeles, ca",
        "created_date": 1736574323873,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542527087,
        "rating": 5,
        "headline": "I would buy this again",
        "comments": "Great product and price",
        "nickname": "Tammy",
        "location": "Starkville Ms",
        "created_date": 1736439679546,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542065950,
        "rating": 5,
        "headline": "Best cleansing balm",
        "comments": "Best cleansing balm ever! My makeup comes off so easily.",
        "nickname": "Melisha",
        "location": "Austin, TX",
        "created_date": 1735677212997,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541903725,
        "rating": 4,
        "headline": "Removes makeup easily but…..",
        "comments": "This removes all makeup easily. I don't use waterproof makeup so i cant speak go that, but regular makeup is no problem. The only downside is that it may sting your eyes. It doesn't every time but it does sometimes. That's why i only give 4 stars.",
        "nickname": "NanaChris",
        "location": "Powder Springs GA",
        "created_date": 1735398348625,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 40,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2045670/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        39,
        29,
        33,
        40,
        213
      ],
      "review_histogram": [
        39,
        29,
        33,
        40,
        213
      ],
      "rating_count": 354,
      "review_count": 354,
      "average_rating": 4.01,
      "recommended_ratio": 0.67,
      "media": [],
      "faceoff_positive": {
        "comments": "I've bought a lot of cleansing balms over the past few years, and I have to say that the Purple Ginseng Cleansing Balm is one of the best that I've tried. The texture feels so luxurious, and it melts my face off at the end of the day in the most wonderful way possible. The way my skin feels absolutely drives me crazy because of how smooth and soft it feels after using it.\n\nAnother thing I'd like to highlight is that I feel that my skin is now working better with my skincare products. I was using the same exact products before and after; the only thing that changed in my skincare routine was switching out my old cleansing balm for this one, and the difference after a few weeks makes me wish that I had picked up this product sooner.\n\nOne of the reasons why I waited to use this product was that I bought other cleansing balms for cheaper, and I had assumed since they did the same thing, I could easily invest in less expensive products and still achieve the same result. However, one of the first things I noticed when opening the packaging was how much product there actually was in the component. Along with the fact that it's outperforming my other cleansing balms, I have to say that getting this cleansing balm is such a steal. I almost feel you're getting MORE than your money's worth with this product.\n\nComing from a girl who has struggled with acne for years, I highly recommend this product. It's such a great investment, and I am definitely buying again after I run out of this one, which might take me a while since there is so much of it. I hope you find this review helpful and that once you try it, you also find the same results and feel the same joy I did.",
        "headline": "You're going to want and need this-",
        "rating": 5,
        "ugc_id": 535336145
      },
      "faceoff_negative": {
        "comments": "I was sooo excited for this to come out, since Susan Yara is all about cleansing balms and I figured she would make an amazing version. But no, this is a fail in my book. Agree with other reviewers, this does not emulsify nicely and leaves a waxy residue on my face every single time, regardless of how much I work it in, use different temp water. I had to use a physical exfoliant for my second cleanse every time just to get the waxy film off of my face. I gave it away and told the person they could toss it if they don't like it. So disappointing! Please try again.",
        "headline": "First Naturium product I do NOT like at all",
        "rating": 1,
        "ugc_id": 535335887
      },
      "name": "Purple Ginseng Cleansing Balm",
      "native_review_count": 40,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 314,
      "locale": "en_US"
    }
  }
}