{
  "product_id": "pimprod2052553",
  "product_url": "https://www.ulta.com/p/real-fresh-foam-green-tea-pimprod2052553",
  "extracted_at": "2025-09-23T04:59:49.270733+00:00",
  "product_name": "NEOGENReal Fresh Foam Green Tea",
  "brand": "NEOGEN",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wash"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "22.00",
  "availability": "in_stock",
  "rating_avg": "4.8",
  "rating_count": "81",
  "images": [
    "https://media.ulta.com/i/ulta/2645131?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2645131?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2645131_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2645131_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2645131_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2645131_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2645131_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2645131_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2645131_alt07?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsNeogen's Real Fresh Foam Green Tea is a gentle foaming cleanser is infused with fermented green tea extract and green tea water to soothe dry, sensitive skin while effectively removing makeup, dirt, and sweat without stripping natural oils.",
  "details": "DetailsBenefitsMoisturizes and brightens while tightening pores, leaving skin feeling refreshed, smooth, and balanced after every washDeeply cleanses and removes sebum, and exfoliates dead skin cellsKey IngredientsGreen Tea - Protects the skin from damage caused by free radicals, reducing signs of aging like fine lines and wrinklesItem 2645131How To UsePump a moderate amount and gently massage all over wet face. Rinse off thoroughly with lukewarm water.IngredientsCamellia Sinensis Leaf Water, Methylglucamine, Lauric Acid, Olive Oil Peg-7 Esters, Dipropylene Glycol, Glycerin, Myristic Acid, C12-14 Pareth-12, Water, 1,2-Hexanediol, Camellia Sinensis Leaf, PEG-60 Hydrogenated Castor Oil, Phenoxyethanol, Potassium Cocoyl Glycinate, Cocamidopropyl Betaine, Niacinamide, Citric Acid, Allantoin, Ethylhexylglycerin, Trehalose, Fragrance, Disodium EDTA, Sodium Chloride, Panthenol, Gardenia Florida Fruit Extract, Maltodextrin, Butylene Glycol, Carthamus Tinctorius (Safflower) Flower Extract, Argania Spinosa Kernel Oil, Saponaria Officinalis Root Extract, Citrus Aurantium Dulcis (Orange) Fruit Extract, Sapindus Trifoliatus Fruit Extract, Citrus Limon (Lemon) Fruit Extract, Gypsophila Paniculata Root Extract, Plankton Extract, Vaccinium Myrtillus Fruit/Leaf Extract, Gentiana Lutea Root Extract, Citrus Unshiu Peel Extract, Moringa Oleifera Seed Extract, Cymbopogon Citratus Extract, Melissa Officinalis Leaf Extract, Portulaca Oleracea Extract, Saccharum Officinarum (Sugarcane) Extract, Achillea Millefolium Extract, Acer Saccharum (Sugar Maple) Extract, Sodium Hyaluronate, Hamamelis Virginiana (Witch Hazel) Extract, Anthemis Nobilis Flower Extract, Carica Papaya (Papaya) Fruit Extract, Saururus Chinensis Leaf/Root Extract, Arnica Montana Flower Extract, Glycine Soja (Soybean) Seed Extract, Vitis Vinifera (Grape) Fruit Extract, Broussonetia Kazinoki Bark Extract, Artemisia Absinthium Extract.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Pump a moderate amount and gently massage all over wet face. Rinse off thoroughly with lukewarm water.",
  "ingredients": [
    "Camellia Sinensis Leaf Water",
    "Methylglucamine",
    "Lauric Acid",
    "Olive Oil Peg-7 Esters",
    "Dipropylene Glycol",
    "Glycerin",
    "Myristic Acid",
    "C12-14 Pareth-12",
    "Water",
    "2-Hexanediol",
    "Camellia Sinensis Leaf",
    "PEG-60 Hydrogenated Castor Oil",
    "Phenoxyethanol",
    "Potassium Cocoyl Glycinate",
    "Cocamidopropyl Betaine",
    "Niacinamide",
    "Citric Acid",
    "Allantoin",
    "Ethylhexylglycerin",
    "Trehalose",
    "Fragrance",
    "Disodium EDTA",
    "Sodium Chloride",
    "Panthenol",
    "Gardenia Florida Fruit Extract",
    "Maltodextrin",
    "Butylene Glycol",
    "Carthamus Tinctorius (Safflower) Flower Extract",
    "Argania Spinosa Kernel Oil",
    "Saponaria Officinalis Root Extract",
    "Citrus Aurantium Dulcis (Orange) Fruit Extract",
    "Sapindus Trifoliatus Fruit Extract",
    "Citrus Limon (Lemon) Fruit Extract",
    "Gypsophila Paniculata Root Extract",
    "Plankton Extract",
    "Vaccinium Myrtillus Fruit/Leaf Extract",
    "Gentiana Lutea Root Extract",
    "Citrus Unshiu Peel Extract",
    "Moringa Oleifera Seed Extract",
    "Cymbopogon Citratus Extract",
    "Melissa Officinalis Leaf Extract",
    "Portulaca Oleracea Extract",
    "Saccharum Officinarum (Sugarcane) Extract",
    "Achillea Millefolium Extract",
    "Acer Saccharum (Sugar Maple) Extract",
    "Sodium Hyaluronate",
    "Hamamelis Virginiana (Witch Hazel) Extract",
    "Anthemis Nobilis Flower Extract",
    "Carica Papaya (Papaya) Fruit Extract",
    "Saururus Chinensis Leaf/Root Extract",
    "Arnica Montana Flower Extract",
    "Glycine Soja (Soybean) Seed Extract",
    "Vitis Vinifera (Grape) Fruit Extract",
    "Broussonetia Kazinoki Bark Extract",
    "Artemisia Absinthium Extract"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser"
    ],
    "skin_type": [
      "dry",
      "sensitive",
      "mature",
      "normal"
    ],
    "finish": [
      "sheer",
      "creamy",
      "oil",
      "foam"
    ],
    "color": [
      "green"
    ],
    "ingredients": [
      "niacinamide",
      "fragrance"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "natural",
      "anti-aging",
      "soothing"
    ]
  },
  "reviews": {
    "product_id": "pimprod2052553",
    "total_reviews": 81,
    "reviews": [],
    "paging": {
      "total_results": 0,
      "pages_total": 0,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        1,
        0,
        3,
        8,
        69
      ],
      "review_histogram": [
        1,
        0,
        3,
        8,
        69
      ],
      "rating_count": 81,
      "review_count": 81,
      "average_rating": 4.78,
      "recommended_ratio": 0.97,
      "media": [],
      "faceoff_positive": {
        "comments": "I received this Neogen Dermalog Real Fresh Foam Green Tea Cleanser complimentary from Neogen and Skeepers in exchange for my honest review. From the very first pump, I have been in absolute love with this cleanser. In my past experience, foam cleansers can sometimes be on the weaker side, but this one is definitely potent and makes my skin feel so refreshed from just a single pump of foam. I love that one pump is plenty for each wash too. I wasn't expecting this to remove my makeup, but I tested it and it washed my mascara and brow gel off effortlessly! That was a pleasant surprise. I will say that on my dry cheeks, my skin feels a bit tight after cleansing so it may be best for oily skin types, but I have combination skin and it fantastic on my t-zone. My teenage son and tween daughter have been using it everyday and I can tell it's wonderful for my son's very oily skin. He has been looking very clean, fresh and has had no extra breakouts. He is very sensitive to new products so that is amazing to me! This is really an excellent cleanser and I will be purchasing it over and over again for sure.",
        "headline": "I'm definitely repurchasing this in the future!",
        "rating": 5,
        "ugc_id": 554948933
      },
      "faceoff_negative": {
        "comments": "I received this cleanser as a complimentary from Neogen and I?셶e been using it for a bit now, and it?셲 a pretty solid cleanser, but definitely not for everyone. The foam is super light and airy, which makes it feel nice when washing my face. It cleans really well and gets rid of any oil or leftover sunscreen, but I did notice that it can be a little drying. If you have dry skin, this might not be the best choice because it does leave that ?쐓queaky clean??feeling, which some people love but others might find too harsh. The green tea scent is subtle and refreshing, nothing too strong, and I like that it has real green tea leaves in the bottle, it?셲 a cool touch. It works great for oily or combination skin, but if your skin leans dry, you?셪l definitely want to follow up with a good moisturizer. I think it?셲 a nice cleanser overall, just not the most hydrating one out there.",
        "headline": "Decent",
        "rating": 3,
        "ugc_id": 554948988
      },
      "native_review_count": 0,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 81,
      "locale": "en_US"
    }
  }
}