{
  "product_id": "pimprod2048514",
  "product_url": "https://www.ulta.com/p/cleansing-balm-face-pimprod2048514",
  "extracted_at": "2025-09-23T03:36:11.356817+00:00",
  "product_name": "Oak EssentialsCleansing Balm for Face",
  "brand": "Oak Essentials",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Cleansing Balms & Oils"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "cleansing-balms--oils"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "48.00",
  "availability": "in_stock",
  "rating_avg": "4.7",
  "rating_count": "414",
  "images": [
    "https://media.ulta.com/i/ulta/2631904?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2631904?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2631904_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2631904_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2631904_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2631904_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2631904_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2631904_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2631904_alt07?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeSustainable PackagingOak Essentials Cleansing Balm is a velvety-soft, balm-to-oil cleanser with avocado and juniper oil, which gently dissolve makeup and impurities while helping to replenish the lipid layer and reinforce skin’s natural moisture barrier.",
  "details": "DetailsBenefitsGreat for dry, dehydrayed skin in need of extra moistureSkin is left with a rich layer of moistureCleanse, replenish and moisturize in one stepHelps support the skin barrierHelps calm irritation and soothes skinContains Camphor, a naturally calming aromatherapy scentFeaturesAromatherapy: balance and soothe with geranium and balsamJar is glass. Carton is tree-free board.How to recycle: Remove lid and sealing disc from jar. Rinse to remove any product. Dispose of all three components into your recycling bin.Key IngredientsOrganic Safflower Seed Oil: helps to soothe and nourish dry skin and is rich in fatty acids--like linoleic acid--that provide antioxidant properties and help promote cell renewalAvocado Oil: rich in vitamin E and omega-3 fatty acids to nourish skin and help protect against free radicals and environmental stressOrganic Sesame Oil: packed with antioxidants and essential fatty acids, it helps balance the skin’s PH and gently removes oil, dirt, and pollutants, leaving skin soft and moisturizedItem 2631904How To UseUse AM and PM daily. Warm a dime-size amount in your hands until it melts into oil. Apply to dry skin and massage in circular motions. Wet fingertips and continue to massage, then remove with a warm, damp washcloth or cotton round. Follow with Balancing Mist and Moisture Rich Balm.TIP: Focus on areas that need additional cleansing, like the eye area, to remove makeup.Warning: For external use only. Keep out of reach of children. Avoid contact with eyes. If contact occurs, rinse well with water immediately. Do not ingest. Do not store at elevated temperatures.IngredientsCarthamus Tinctorius (Safflower) Seed Oil*, Cera Alba (Beeswax, Cire d'abeille), Sesamum Indicum (Sesame) Seed Oil*, Persea Gratissima (Avocado) Oil, Helianthus Annuus (Sunflower) Seed Oil, Rosmarinus Officinalis (Rosemary) Leaf Oil, Mentha Citrata (Bergamot Mint) Oil, Lavandula Angustifolia (Lavender) Oil, Juniperus Mexicana (Cedarwood) Oil, Cupressus Sempervirens (Cypress) Leaf/Nut/Stem Oil, Copaifera Officinalis (Balsam Copaiba) Resin, Citrus Aurantium Dulcis (Orange) Peel Oil, Tocopherol, Ethylhexylglycerin, Phenoxyethanol, Limonene, Linalool. *Certified OrganicShipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Use AM and PM daily. Warm a dime-size amount in your hands until it melts into oil. Apply to dry skin and massage in circular motions. Wet fingertips and continue to massage, then remove with a warm, damp washcloth or cotton round. Follow with Balancing Mist and Moisture Rich Balm.TIP: Focus on areas that need additional cleansing, like the eye area, to remove makeup.Warning: For external use only. Keep out of reach of children. Avoid contact with eyes. If contact occurs, rinse well with water immediately. Do not ingest. Do not store at elevated temperatures.",
  "ingredients": [
    "Carthamus Tinctorius (Safflower) Seed Oil*",
    "Cera Alba (Beeswax",
    "Cire d'abeille)",
    "Sesamum Indicum (Sesame) Seed Oil*",
    "Persea Gratissima (Avocado) Oil",
    "Helianthus Annuus (Sunflower) Seed Oil",
    "Rosmarinus Officinalis (Rosemary) Leaf Oil",
    "Mentha Citrata (Bergamot Mint) Oil",
    "Lavandula Angustifolia (Lavender) Oil",
    "Juniperus Mexicana (Cedarwood) Oil",
    "Cupressus Sempervirens (Cypress) Leaf/Nut/Stem Oil",
    "Copaifera Officinalis (Balsam Copaiba) Resin",
    "Citrus Aurantium Dulcis (Orange) Peel Oil",
    "Tocopherol",
    "Ethylhexylglycerin",
    "Phenoxyethanol",
    "Limonene",
    "Linalool. *Certified Organic"
  ],
  "extended_contents": {},
  "tags": {
    "product_type": [
      "cleanser",
      "moisturizer",
      "lip gloss",
      "oil"
    ],
    "skin_type": [
      "dry",
      "sensitive"
    ],
    "finish": [
      "sheer",
      "oil"
    ],
    "ingredients": [
      "organic"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "organic",
      "natural",
      "soothing",
      "purifying"
    ],
    "category": []
  },
  "reviews": {
    "product_id": "pimprod2048514",
    "total_reviews": 414,
    "reviews": [
      {
        "review_id": 552242475,
        "rating": 1,
        "headline": "Crisco",
        "comments": "This is suuuch a thick, greasy product. I imagine the same feeling rubbing Crisco on my face. It does melt makeup, is is gentle and soothing, but leaving behind this thick layer of grease is not what I want from a cleansing balm. It leaves my skin feeling and looking amazing, but there's no chance any serums or actives would penetrate this. This would be better as a slugging step at the end of your routine. I used a handful of times and trashed it since I has received it free product as a diamond member.",
        "nickname": "Lauren",
        "location": "Matthews NC",
        "created_date": 1745453727684,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 549734703,
        "rating": 5,
        "headline": "Great Cleansjng Balm for Sensitive Skin",
        "comments": "This balm is the ONLY makeup remover my skin can tolerate!  Have tried so many cleasers and they burn and dry my skin. This does neither— it actually soothes it. Highlt recommended.",
        "nickname": "Andrea",
        "location": "Winston-Salem, NC",
        "created_date": 1742762932777,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549580775,
        "rating": 1,
        "headline": "So bad…",
        "comments": "This product is so incredibly bad. Doesnt remove makeup or mascara. Leaves a thick greasy film on the face. Even after rinsing and using a towel it still feels like residue on my skin. Luckily i got a travel size of this product or else i would have returned it.",
        "nickname": "Lacey",
        "location": "Texas",
        "created_date": 1742430542254,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547840442,
        "rating": 4,
        "headline": "A true cleansing balm",
        "comments": "This product grew on me. I received a free bottle as one of my platinum perks and had never heard of this particular brand. I use oils and cleansing balms regularly and have late 30s combo skin. It reminds me of the Eve Lom brand cleanser. I didnt reallt care for it the first few times I used it ,  but it really grew on me. \n\nI would recommend this to people with drier skin and I used it in the winter. Like some of the other reviews state, its super thick and does not emulsify like most of the other balms on the market. However I would apply to my face and gently massage into my skin and then add a small amount of warm water and repeat. Next I used a very warm and wet washcloth and laid it on my face and would press that into my skin. I then gently used that cloth to wipe off the balm and would repeat this a couple of times. This left my skin feeling so soft and refreshed. It was also nice to just slow down and really let the heat and steam sit on my face. Overall this wont be for everyone, but after I get used to the consistency I enjoyed using it. I also loved how it was basically scent free and gentle. The only other con is the price is expensive for the amount you get. I would estimate one jar may last a month with nightly use.",
        "nickname": "NolaDawn",
        "location": "Atlanta",
        "created_date": 1741232936176,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547840161,
        "rating": 5,
        "headline": "My dry skin loves this",
        "comments": "You do have to follow the directions with this one. Just wet a washcloth with warm water, and your makeup will simply melt off your skin. My face feels so soft afterwards. Highly recommend for dry skin.",
        "nickname": "SweetV",
        "location": "Indiana",
        "created_date": 1741231761758,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543677655,
        "rating": 1,
        "headline": "Mind blown by the positive reviews",
        "comments": "Products like these make me so thankful that Ulta accepts returns. This cleansing balm was almost $50, and was essentially the equivalent of trying to cleanse my skin with aquaphor. I have used so many cleansing balms and this did not resemble anything close to any of them. It was so thick and greasy, and did not emulsify at all. It took a washcloth and two additional washes with a totally separate cleanser to remove it, and even then I felt like I had a layer of grease on my skin. I can not fathom the positive reviews on this item.",
        "nickname": "Devinn",
        "location": "Champaign Illinois",
        "created_date": 1737466777445,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 1
      },
      {
        "review_id": 543596722,
        "rating": 4,
        "headline": "Works Fine",
        "comments": "Almost got scared away from it by various people saying it was bad and doesn't rinse off their face. READ THE INSTRUCTIONS. It clearly says you need to wipe it off with a cloth. This is not one that will come off with just water. The product does have the weirdest texture when it comes in contact with water. It came off easily with a warm wash cloth. \n\nThat being said, I do prefer ones I can just wash off with water. It worked, but nothing magical and not worth the price imo.",
        "nickname": "pink4kay",
        "location": "Chicago",
        "created_date": 1737253936114,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 1
      },
      {
        "review_id": 539402547,
        "rating": 2,
        "headline": "HUGE DISAPPOINTMENT",
        "comments": "The only positive thing I can say is there is a pleasant scent. I have used many balms and oils and this was an absolute nightmare to remove from my skin. Despite using a substantial cotton pad and cleaning my face TWICE with another cleanser, I still had an oily film on my face. This balm is a very thick grease layer that does not wash off easily. I'm so glad I trialed in the winter instead of humid summer because it would likely have been on my face for 1 week. WILL NEVER repurchase of recommend. Will stick to Farmacy balm and Tatcha oil cleanser.",
        "nickname": "Amy",
        "location": "Florida",
        "created_date": 1733925711323,
        "bottom_line": "No",
        "helpful_votes": 8,
        "not_helpful_votes": 2
      },
      {
        "review_id": 537446726,
        "rating": 1,
        "headline": "Confused w/all the good reviews",
        "comments": "I'm reading all the positive good reviews, and had to double check that I did in fact have the same product. I hated this product because it felt like I was rubbing crisco/ thick grease all over my face. It wouldn't just come off with water either I had to scrape it off my face. The scent is very mild, but does have a light oak scent. I didn't like anything about this product, but maybe I just had a bad batch since there are so many great reviews.",
        "nickname": "Skincaregirly",
        "location": "Virginia",
        "created_date": 1730986476118,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 1
      }
    ],
    "paging": {
      "total_results": 9,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        8,
        9,
        13,
        29,
        355
      ],
      "review_histogram": [
        8,
        9,
        13,
        29,
        355
      ],
      "rating_count": 414,
      "review_count": 414,
      "average_rating": 4.72,
      "recommended_ratio": 0.0,
      "media": [],
      "faceoff_positive": {
        "comments": "I love, love, love this cleanser! I'm a big fan of all the products I've used from the routine, but this is by far my favorite. I've oil cleansed in the past by creating my own oil blends and it mostly worked, but was difficult to get the right balance of how much oil remained on my skin versus removing all of it and taking away my natural moisture as well (because of the oil bonding). Additionally, I had to frequently exfoliate separately, and it all just wasn't a routine I wanted to keep up with and I have veered away from oil cleansing for several years as a result. To say I was skeptical about this cleansing balm, that is based on oil cleansing (with a few added ingredients) is an understatement. In fact, I almost didn't even try it when I got the mini routine to test the products out, but I am so glad I did! This keeps my skin clean and soft and beautifully balanced with moisture after cleansing and I'm noticing that I don't need to exfoliate separately at all and my pores are still small and my skin so, so soft. I'm sure part of that is a result of the other components of the routine, but I can't discount the impact of starting with this cleanser (as opposed to using the other parts of the routine with a goat milk face cleansing bar). My absolute favorite product by Oak Essentials, hands down.",
        "headline": "Best face cleanser out there",
        "rating": 5,
        "ugc_id": 535375166
      },
      "faceoff_negative": {
        "comments": "I really loved this balm - it took off ALL makeup and didn't leave behind too thick of a feeling.  However, I have sensitized skin. After a couple of weeks, I noticed bumps/breakouts/rash. I stupidly didn't check all of the ingredients beforehand, and it's loaded with essential oils, including lavender oil (which I can't figure out why any skincare company uses lavender oil since it's not good for ANY skin).   Long story short, it's lovely and if you don't have sensitive skin it might be perfect. If you have sensitized or sensitive skin, this unfortunately didn't cut it for me because of the essential oils.",
        "headline": "Nice, but essential oils make it tough for sensitive skin",
        "rating": 3,
        "ugc_id": 535375918
      },
      "name": "Cleansing Balm for Face",
      "native_review_count": 9,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 405,
      "locale": "en_US"
    }
  }
}