{
  "product_id": "pimprod2048535",
  "product_url": "https://www.ulta.com/p/hydra-eye-balm-pimprod2048535",
  "extracted_at": "2025-09-23T04:10:34.829699+00:00",
  "product_name": "Oak EssentialsHydra Eye Balm",
  "brand": "Oak Essentials",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Cream"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "eye-cream"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "55.00",
  "availability": "in_stock",
  "rating_avg": "4.6",
  "rating_count": "358",
  "images": [
    "https://media.ulta.com/i/ulta/2631907?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2631907?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2631907_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2631907_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2631907_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2631907_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2631907_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2631907_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2631907_alt07?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingOak Essentials Hydra Eye Balm is a deeply hydrating eye balm that instantly nourishes and refreshes the delicate eye area. Moringa Seed Oil and Shea Butter help smooth fine lines and reduce puffiness and dark circles for an instant pick-me-up.",
  "details": "DetailsKey IngredientsMoringa Seed Oil: Packed with nutrients and antioxidants, it is known to help boost cell renewal and prevent moisture loss.Shea Butter: Nourishes and hydrates the delicate eye area and helps reduce the appearance of fine lines and dark circles.Mango Seed Butter: A natural emollient and rich in vitamin E, it helps moisturize, soften and soothe skin for a naturally radiant under-eye area.Formulated WithoutMade simply and without compromise, their skincare formulas are non-GMO and organic whenever possible, and always formulated without silicones, colorants, sulfates, phthalates, parabens, PEGs, petrolatum, mineral oil, and nanoparticles.Item 2631907How To UseUse AM and PM after serum. Apply to the eye area, focusing on the under-eye and brow bone, avoiding eyelids. Gently massage in for increased microcirculation.Warning: For external use only. Keep out of reach of children. Avoid direct contact with eyes. If contact occurs, rinse with water immediately. Do not ingest. Do not store at elevated temperatures.IngredientsButyrospermum Parkii (Shea) Butter, Punica Granatum Seed Oil, Borago Officinalis Seed Oil, Argania Spinosa Kernel Oil, Cocos Nucifera (Coconut) Oil, Moringa Oleifera Seed Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Mangifera Indica (Mango) Seed Butter, Olea Europaea (Olive) Fruit Oil, Helianthus Annuus Seed Cera/Helianthus Annuus (Sunflower) Seed Wax, Tribehenin, Oryza Sativa (Rice) Bran Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Helianthus Annuus (Sunflower) Extract, Tocopherol.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Use AM and PM after serum. Apply to the eye area, focusing on the under-eye and brow bone, avoiding eyelids. Gently massage in for increased microcirculation.Warning: For external use only. Keep out of reach of children. Avoid direct contact with eyes. If contact occurs, rinse with water immediately. Do not ingest. Do not store at elevated temperatures.",
  "ingredients": [
    "Butyrospermum Parkii (Shea) Butter",
    "Punica Granatum Seed Oil",
    "Borago Officinalis Seed Oil",
    "Argania Spinosa Kernel Oil",
    "Cocos Nucifera (Coconut) Oil",
    "Moringa Oleifera Seed Oil",
    "Simmondsia Chinensis (Jojoba) Seed Oil",
    "Mangifera Indica (Mango) Seed Butter",
    "Olea Europaea (Olive) Fruit Oil",
    "Helianthus Annuus Seed Cera/Helianthus Annuus (Sunflower) Seed Wax",
    "Tribehenin",
    "Oryza Sativa (Rice) Bran Extract",
    "Rosmarinus Officinalis (Rosemary) Leaf Extract",
    "Helianthus Annuus (Sunflower) Extract",
    "Tocopherol"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "moisturizer",
      "mask",
      "lip gloss",
      "treatment",
      "eye cream"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "dewy",
      "sheer",
      "creamy",
      "oil"
    ],
    "brand": [
      "mid-range",
      "premium"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "organic",
      "natural",
      "hydrating",
      "brightening"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2048535",
    "total_reviews": 358,
    "reviews": [
      {
        "review_id": 542103327,
        "rating": 5,
        "headline": "Impressed!",
        "comments": "Once it absorbs into your skin, your undereye stays hydrated all day. Fine lines are less noticeable and your makeup stays flawless. It does take some time to absorb so I put it on first and then do my hair before doing my makeup. I rate it a 10!",
        "nickname": "Leslie",
        "location": "St. Louis, MO",
        "created_date": 1735764628781,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541950836,
        "rating": 5,
        "headline": "LOVE!!!",
        "comments": "This eye cream is so wonderful! Very hydrating! I use it every night! I do not think the smell is bad at all as the other review said. Its a very nice soft smell. Works wonderfully to soften my fine lines!! I would highly recommend. I dont want to go without it!!",
        "nickname": "Sue",
        "location": "Peoria,Az.",
        "created_date": 1735486906105,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537622071,
        "rating": 2,
        "headline": "THE SMELL...HORRIBLE",
        "comments": "THE SMELL...I absolutely loved what this product did for my under eyes, but the smell is STRONG. It smells like play dough and the scent never dissipates. The smell was so bad it gave me asthma attacks. I used it multiple nights & am positive that's the reason I couldn't breath. I would only recommend if Covid took your sense of smell.",
        "nickname": "Kirby",
        "location": "North Carolina",
        "created_date": 1731300961712,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 5
      }
    ],
    "paging": {
      "total_results": 3,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        14,
        14,
        14,
        26,
        290
      ],
      "review_histogram": [
        14,
        14,
        14,
        26,
        290
      ],
      "rating_count": 358,
      "review_count": 358,
      "average_rating": 4.58,
      "recommended_ratio": 0.0,
      "media": [],
      "faceoff_positive": {
        "comments": "I have never used a balm before, but I tried a sample of this one and I saw an instant change. I've struggled with dark circles under my eyes for years and have tried all sorts of creams, gels, and serums. This eye balm tops everything the cosmetic and skincare industry offers. I bought a full size one and have been using it for 4 months and I've seen a huge improvement. My eyes are the brightest and smoothest I have ever seen them. I don't wear as much eye makeup anymore and the balm actually leaves a beautiful dewy glow. It absorbs well and doesn't clog up your pores. I have combination skin and this balm is perfection in a lil jar. Very much worth buying.",
        "headline": "The best eye product you will find",
        "rating": 5,
        "ugc_id": 553281274
      },
      "faceoff_negative": {
        "comments": "I am a huge fan of Jenni Kayne. I have a ton of sweaters, shoes...you name it. I also have a few oak essential products that I enjoy, and have on rotation in my skincare routine. I thought to add this eye balm to the mix. What a mistake! I tried it for the first time on a Friday evening. I woke up on Saturday with such pain in my eye, major irritation and redness. It took all weekend of hot compresses to relieve the issue. I reached out to customer service about the issue. After a few days of not hearing back, I followed up. Finally, I received an email letting me know that there was nothing that they could do because I ordered the product during a promotion. Needless to say I was very disappointed with their response and failure to respond appropriately.",
        "headline": "Major irritation",
        "rating": 1,
        "ugc_id": 535376915
      },
      "native_review_count": 3,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 355,
      "locale": "en_US"
    }
  }
}