{
  "product_id": "pimprod2020798",
  "product_url": "https://www.ulta.com/p/cicalfate-restorative-protective-cream-pimprod2020798",
  "extracted_at": "2025-09-23T03:33:52.591461+00:00",
  "product_name": "AveneCicalfate+ Restorative Protective Cream",
  "brand": "Avene",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Face Moisturizer"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "face"
  ],
  "currency": "USD",
  "list_price": "26.00",
  "sale_price": "18.20",
  "availability": "in_stock",
  "rating_avg": "4.3",
  "rating_count": "1006",
  "images": [
    "https://media.ulta.com/i/ulta/2577161?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2577161?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2577161cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2577161cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2577161cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2577161cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2577161cm_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2577161cm_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2577161cm_alt07?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2577161cm_vid01/thumbs/cca32eb1-34f2-408d-aa1b-5a208f07e26e?w=600&h=337&fmt=auto",
    "https://media.ulta.com/v/ulta/2577161cm_vid02/thumbs/55f3f284-13d1-49b4-b75b-e1feeb530655?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsVeganSustainable PackagingAvene Cicalfate+ Restorative Protective Cream is a technologically advanced post-biotic restorative skin barrier cream clinically proven to accelerate the recovery process by 4X and maintain an optimal healing environment.",
  "details": "DetailsBenefitsRich, nourishing skin barrier cream infused with post-biotic restorative ingredient, helps protect skin from external aggressors while maintaining proper hydrationFormulated to minimize risk of allergic reactionsWon't clog poresSafe for infants, children and adultsVersatile cream helps promote and maintain healthy, balanced skin microbiomeHelps accelerate the skin recovery process by 4X **Evaluation of visible reduction in appearance of skin treated with Cicalfate+ vs. nontreated skinSuitable for every skin-SOS: It's great as a daily moisturizer and helps restore burns (including sunburn), cuts, scrapes, stiches, bug bites, perioral and diaper areas, and soothes skin prone to redness or drynessSuitable for skin that's compromised (aka: sensitive, dry, damages)Key IngredientsC+ Restore, postbiotic restorative ingredient, is rich in proteins that help skin restoration while preserving skin's natural barrierCopper - Zinc Sulfate Complex helps promote and maintain a healthy skin environmentAvène Thermal Spring Water clinically shown to soothe, soften and calm skinFormulated WithoutFragranceParabenAlcoholSoyWheatItem 2577161How To UseApply twice a day to clean, dry skin.Precautions: For external use only. Avoid contact with eyes. Keep out of reach of children. DO not expose the product to temperatures below 32 F (0 C).IngredientsWater / Eau (Aqua), Caprylic/Capric Triglyceride, Mineral Oil / Huile Minerale (Paraffinum Liquidum), Glycerin, Hydrogenated Vegetable Oil, Zinc Oxide, Propylene Glycol.",
  "how_to_use": "Apply twice a day to clean, dry skin.Precautions: For external use only. Avoid contact with eyes. Keep out of reach of children. DO not expose the product to temperatures below 32 F (0 C).",
  "ingredients": [
    "Water / Eau (Aqua)",
    "Caprylic/Capric Triglyceride",
    "Mineral Oil / Huile Minerale (Paraffinum Liquidum)",
    "Glycerin",
    "Hydrogenated Vegetable Oil",
    "Zinc Oxide",
    "Propylene Glycol"
  ],
  "extended_contents": {
    "text": "Show less"
  },
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "moisturizer"
    ],
    "skin_type": [
      "dry",
      "sensitive",
      "normal"
    ],
    "finish": [
      "sheer",
      "liquid",
      "cream",
      "oil"
    ],
    "ingredients": [
      "mineral"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "vegan",
      "natural",
      "hydrating"
    ]
  },
  "reviews": {
    "product_id": "pimprod2020798",
    "total_reviews": 1006,
    "reviews": [
      {
        "review_id": 561042643,
        "rating": 1,
        "headline": "Allergic",
        "comments": "I use their recovery cream no problem and loved it so naturally wanted to try another popular product by them. Unfortunately I am allergic to it so had to return.",
        "nickname": "Ashley",
        "location": "NC",
        "created_date": 1756050214923,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560579320,
        "rating": 1,
        "headline": "Inconsistent product formulation",
        "comments": "Before last night I would have given this product 5 stars. I have been using a free sample size container of this for my sensitive face eczema for over a year. I loved it and bought a full size end of last year, but did not open it until last night. I was shocked when a lot of blue water came out when squeezing product out. I tried shaking and squeezing the container to remix, as that usually works. Yet nope it's still very separated. \nThis is very disappointing because I loved the product. I would caution to only buy in person so you can shake it to listen for the separation. Or make sure you at least open it right after buying. Even though the product is faulty, I am past the return window so I'm losing money by throwing it out. \nI doubt I would buy this again because I would rather support a new product than one with known issues. Not sure if its a batch or formulation issue, or extreme temperatures during transportation that causes the separation sometimes, but Avène or Ulta need to figure it out. Very disappointing!!",
        "nickname": "Anna",
        "location": "Lancaster, PA",
        "created_date": 1755820684615,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 3
      },
      {
        "review_id": 560192571,
        "rating": 4,
        "headline": "Great for Rashes/Allergic Reactions",
        "comments": "I have rosacea and eczema so it is extremely hard to find products that work for my face. I bought this as a moisturizer and it did okay, I just don't like how hard it is to spread and it makes my face super itchy. I used it for probably a month or two before I couldn't handle the itching then threw it at the back of the drawer. I like that it never burned the area below my eyebrows and didn't cause more breakouts than my normal. I knocked off a star for the itching but gave it 4 stars because it saved my face:\n\nI used a new face moisturizer (Bioderma Atoderm Intensive Balm) and had the most outrageous reaction on my face, neck, and upper chest, everywhere I applied it. My mom said my face looked like it had been chemically peeled it was so red and shiny looking. My skin felt tight, it burned, and I wanted to scratch my skin off it itched so badly. I remembered this cream and decided to try it (cleansed with Cetaphil cream cleanser and applied just this) and it took a few hours but the redness went down and the tightness lessened. I just had intensive itching (this probably magnified because it made me itch in general) which required me to then apply aveeno baby eczema balm on top to fix it. Because I have rosacea, I can't use steroids on my face so had to use the aveeno. This stuff is a life savor for most of the side affects of a skin reaction, so I am glad to have it on hand!",
        "nickname": "Megan",
        "location": "CA",
        "created_date": 1755222172382,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558315214,
        "rating": 4,
        "headline": "Nice",
        "comments": "Ive dealt with sensitive skin ALL my life and when I started getting into skincare it felt impossible to find the right product to meet all my needs and wants but this stuff is so GOOD. It is thick so more for dry skin and if you love a dewy glow but still i find it EASY to really rub (just takes a tad bit effort) in like very buttery but you do have to take your time. Discovered this product and its so good i GO THROUGH ALOT and ive noticed this did clear my skin and smooth my texture (i dont suffer from major acne). Now, i will say im a fellow brown skin gal and you do have to wait a second for it to really sit and soak in…texture is good just rub in really well and let it sit for like 3-5 minutes so it doesnt leave a white cast….TRUST IVE LEARNED MY LESSON. Overall very moisturizing and great price!",
        "nickname": "Ciara",
        "location": "Summerville, SC",
        "created_date": 1753502478618,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557431213,
        "rating": 5,
        "headline": "Best Ever",
        "comments": "I can't sing the praises of this enough. It hydrates my skin and makes my skin look as glasslike as it can. My husband can't even believe it is my skin. He thought my picture was filtered until I came home and he saw for himself.",
        "nickname": "Claire",
        "location": "St. Petersburg, Florida",
        "created_date": 1752751737203,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557366953,
        "rating": 5,
        "headline": "Very Calming",
        "comments": "This calmed my severe eczema flare up within HOURS. During the time when all my other standard prod uts started burning my skin, i bought this on recommendation and it has made all the difference. Scaly skin was immediately moisturized and did not come back hours later. redness relieved and my flare yo was barely noticeable 12 hours later. I also did not need to constantly reapply. AMAZING",
        "nickname": "SG",
        "location": "Kansas City",
        "created_date": 1752675021054,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557010241,
        "rating": 5,
        "headline": "So moisturizing!",
        "comments": "I was hesitant to purchase this after the reviews talking about it separating. But I was having a ton of issues with dry, irritated, skin out of nowhere. I took a chance and could not recommend this more. I shook the container in advance to hear if there was separated liquid, then also massaged the tube to make sure it was completely mixed together before opening. I used this on my face and woke up with very moisturized skin. I think it is going to make a huge difference in my dermal barrier. I paired it with the lip version as well. If you're on the fence, buy it!",
        "nickname": "Lauren",
        "location": "Georgia",
        "created_date": 1752327004721,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 556969608,
        "rating": 3,
        "headline": "Fine, required extra steps",
        "comments": "Arrived completely separated. Had to stick in hot water for 15 min and shake vigorously to recombine. Continued to slowly reseparate over the course of a couple weeks. Have a feeling i did not use it with the intended texture.",
        "nickname": "L",
        "location": "Minneapolis",
        "created_date": 1752274470077,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 556842057,
        "rating": 3,
        "headline": "Tricky",
        "comments": "Fine cream, arrived separated, had to place in hot water to combine ingredients, continues to separate slowly afterward. Kept at room temperature. Texture not terribly pleasant.",
        "nickname": "Lalo",
        "location": "Minneapolis",
        "created_date": 1752030040996,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556345448,
        "rating": 5,
        "headline": "amazing",
        "comments": "calms my perioral dermatitis so much!!",
        "nickname": "mel",
        "location": "NC",
        "created_date": 1751489698695,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555782830,
        "rating": 4,
        "headline": "Does not clog pores yayy!!",
        "comments": "For someone who gets occasional comedonal acne because I like to layer a lot of products this one is an absolute gem, of a moisturiser , doesn't feel heavy on skin and can wear under makeup doesn't matter how humid it is.",
        "nickname": "Rabi",
        "location": "NJ",
        "created_date": 1750717553347,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555334424,
        "rating": 5,
        "headline": "Amazing",
        "comments": "I'm not the type to leave reviews, this is my first one ever! but I have been struggling to find a night time moisturizer for my sensitive skin, i struggled with dry patches, a damaged skin barrier and acne/acne scars and this product absolutely changed that within the first week of using. My makeup sticks better on my skin, no more dry patches, and i've even noticed my acne scars have faded. I've tried all kinds of moisturizers with Hyaluronic acid, Niacinamide, and other popular ingredients that are supposed to repair barriers and are \"meant for sensitive skin\" but my skin has not reacted well to those so if you have skin like mine i recommend trying this product out! I wish i had pictures but i truly did not expect such a great outcome.",
        "nickname": "Giss",
        "location": "Texas",
        "created_date": 1750289679894,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555297408,
        "rating": 3,
        "headline": "It works well when it's not separated",
        "comments": "This is hands down the best barrier relief cream to ever exist. The major issue with this as everyone has mentioned is that the product comes separated. I still tried to use it but it will break you out if you try. I went to paris recently and decided to buy this product there (since it's a french brand) and i'm currently trying to salvage every last morsel because this product is that good. If bought from a non american market this product will save your skin, otherwise you're wasting your time.",
        "nickname": "Regina",
        "location": "New York",
        "created_date": 1750264846937,
        "bottom_line": "Yes",
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555229484,
        "rating": 1,
        "headline": "Used to love… new formula sucks",
        "comments": "This was my holy grail. My last four tubes must be a new formula. When I opened them a bluish liquid leaked out everywhere. Nothing I do to try to mix the cream with the liquid works. What a mess. It's so disappointing - I can tell the product is less moisturizing than it used to be.",
        "nickname": "Jcubed",
        "location": "Madison WI",
        "created_date": 1750123127399,
        "bottom_line": null,
        "helpful_votes": 17,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555190044,
        "rating": 4,
        "headline": "I love this but",
        "comments": "This is very good as a night time spot treatment on minor skin abrasions or as an all over face mask on dry or irritated skin. Mayyyybe as a thick makeup primer in the winter months in maybe like a pea sized amount. Very thick and paste like. Didn't expect it to be so thick and white but its very hydrating and healing so I still recommend.",
        "nickname": "Gio",
        "location": "Houston Texas",
        "created_date": 1750053614605,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554898468,
        "rating": 5,
        "headline": "Perfect",
        "comments": "THE only moisturizer that helps calm my skin. I have rosacea, eczema, and very sensitive skin. This keeps me from breaking out, no dry spots, and my skin is so soft. I love this!",
        "nickname": "PJ",
        "location": "Chicago, Illinois",
        "created_date": 1749614995790,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554795462,
        "rating": 5,
        "headline": "Best moisturizer ever for sensitive skin!!",
        "comments": "Good for senstive skin and if you have eczema. Gives you a nice glowy finish without being to greasy.",
        "nickname": "Bre",
        "location": "Lansing mi",
        "created_date": 1749485172363,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554289917,
        "rating": 3,
        "headline": "separated and non usable",
        "comments": "like others have mentioned, mine separated as soon as i opened it. was straight liquid and i ended up returning",
        "nickname": "Rachel",
        "location": "Chicago, IL",
        "created_date": 1748626149496,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554255863,
        "rating": 4,
        "headline": "It works but was a confusing process?",
        "comments": "I purchased the set with a mini cream and thermal\nwater. I was confused when only a liquid like serum came out. Applied the \"water\" to my skin and was like this isn't for me, but kept using it. I'm in perimenopause and the hormonal breakouts and blotchy itchy skin are terrible. I woke up my skin felt a bit moisturized and it was helping my issues. After a couple days, a thick cream appeared and that's when it REALLY helped heal my skin. It was like a magic potion.  I just reordered the full size. I only gave it a 4 because I would like to know if it should actually mix together and we are not getting the full benefit of the product? FYI, you don't shake the thermal water though I read the box.",
        "nickname": "Angela",
        "location": "USA",
        "created_date": 1748563719876,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553933987,
        "rating": 5,
        "headline": "Wow!",
        "comments": "I got this a few a months ago, but I was still thinking about how great it worked, so thought I'd write a review. The skin on my hands had been cracking and bleeding in the dry winter air, and when I tried to use other hand creams, my hands would burn, and while they helped a little, I was looking for something that would help more. And wow, not only did this not burn when I used put it on, but it helped right away. Within a couple days my hands were doing so much better and weren't cracking anymore. It's very thick, so maybe not good for just regular out and about use, but if you're dealing with cracking, dry skin, then this is amazing.",
        "nickname": "A",
        "location": "Chicago",
        "created_date": 1748098395413,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 253,
      "pages_total": 13,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2020798/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "bestuses",
          "name": "Best Uses",
          "type": "tag",
          "values": [
            {
              "label": "Calm, moisturize dry, irritated skin",
              "count": 1
            },
            {
              "label": "Dermatitis, eczema",
              "count": 1
            }
          ],
          "display_values": [
            "Calm, moisturize dry, irritated skin",
            "Dermatitis, eczema"
          ]
        },
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "sprays water everywhere",
              "count": 1
            },
            {
              "label": "Can be watery when first opened",
              "count": 1
            }
          ],
          "display_values": [
            "Can be watery when first opened",
            "sprays water everywhere"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "Dermatitis-prone skin",
              "count": 1
            }
          ],
          "display_values": [
            "Casual Dresser",
            "Comfort-seeking",
            "Dermatitis-prone skin",
            "Energetic/Active",
            "Stylish/Fashionista",
            "Trendy/Stylish Dresser",
            "Youthful"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "dense",
              "count": 1
            },
            {
              "label": "Calming",
              "count": 1
            },
            {
              "label": "Calms dermatitis/eczema",
              "count": 1
            },
            {
              "label": "Creamy texture",
              "count": 1
            },
            {
              "label": "Very moisturizing",
              "count": 1
            }
          ],
          "display_values": [
            "Calming",
            "Calms dermatitis/eczema",
            "Creamy texture",
            "Very moisturizing",
            "dense"
          ]
        },
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Dry",
              "count": 14
            },
            {
              "label": "Combination",
              "count": 12
            },
            {
              "label": "Normal",
              "count": 5
            },
            {
              "label": "Oily",
              "count": 2
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        103,
        37,
        41,
        67,
        758
      ],
      "review_histogram": [
        103,
        37,
        41,
        67,
        758
      ],
      "rating_count": 1006,
      "review_count": 1006,
      "average_rating": 4.33,
      "recommended_ratio": 0.87,
      "media": [
        {
          "id": "539046366",
          "review_id": 539046365,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ilsdqjfd5h4rstpal4bf.jpg",
          "headline": "Best product ever",
          "rating": 5,
          "helpful_votes": 1,
          "not_helpful_votes": 1,
          "type": "image",
          "caption": "After 3 weeks",
          "nickname": "Maggie",
          "created_date": 1733427988663
        },
        {
          "id": "539046372",
          "review_id": 539046365,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/au2pkybfstizwoi1wvxm.jpg",
          "headline": "Best product ever",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Before",
          "nickname": "Maggie",
          "created_date": 1733427988663
        },
        {
          "id": "518873877",
          "review_id": 518874013,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/kyujnnqckcsu53hxe5bj.jpg",
          "headline": "Broken emulsion, squirting water",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Squort",
          "nickname": "Kensi",
          "created_date": 1717018051639
        },
        {
          "id": "518873948",
          "review_id": 518874013,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/itb7rnbkshulrscznk31.jpg",
          "headline": "Broken emulsion, squirting water",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "There was so much more water than you can see here!",
          "nickname": "Kensi",
          "created_date": 1717018051639
        },
        {
          "id": "515171590",
          "review_id": 515171570,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/kygmvc0m55bb1smt8ire.jpg",
          "headline": "Holy grail product",
          "rating": 5,
          "helpful_votes": 1,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "My routine",
          "nickname": "Lee G",
          "created_date": 1715482214000
        },
        {
          "id": "515168480",
          "review_id": 515168379,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/itnhh8snjskzjpr4skii.jpg",
          "headline": "Skincare routine must have!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 2,
          "type": "image",
          "caption": "Skin has never been clearer",
          "nickname": "Johanduvern",
          "created_date": 1715105144000
        },
        {
          "id": "506971471",
          "review_id": 506971415,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/fnxet3s300q2r1enqqnc.jpg",
          "headline": "Don't hate it but caused red bumps around my eyes.",
          "rating": 3,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Red bumps and swelling around eyes but I have very sensitive skin.",
          "created_date": 1708964680698
        },
        {
          "id": "443169417",
          "review_id": 443169477,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ks0u2itkbkbwfqbzvkla.jpg",
          "headline": "Water",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Eliana",
          "created_date": 1675907927408
        },
        {
          "id": "432973292",
          "review_id": 432973291,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/nnr5k0jauz5tzpv6yk3d.jpg",
          "headline": "Would not recommend for PD",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Tuesday morning (sulfer soap use only)",
          "nickname": "Danielle",
          "created_date": 1668092108300
        },
        {
          "id": "432973358",
          "review_id": 432973291,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/dzkpwky2ke2wakh8yu94.jpg",
          "headline": "Would not recommend for PD",
          "rating": 1,
          "helpful_votes": 3,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Wednesday morning (used the avene cream for only one day)",
          "nickname": "Danielle",
          "created_date": 1668092108300
        }
      ],
      "faceoff_positive": {
        "comments": "I initially bought this to restore my skin after a laser treatment, and now I use it as my daily moisturizer. Not only did it accelerate the healing process, but it also gives you a healthy glow. I'm obsessed with the results this has given me, especially when paired with hyaluronic acid. Dries down well to give a semi matte yet glowy finish. Couldn't recommend this enough! The compliments speak for themselves.",
        "headline": "Skincare routine must have!",
        "rating": 5,
        "ugc_id": 515168379
      },
      "faceoff_negative": {
        "comments": "I was really excited to try this cream because of all the wonderful reviews, but for whatever reason, it did not work for my skin. I trust that it really did for other people, but unfortunately for me, it exacerbated the redness around my nose and mouth. I read the directions twice and applied it following them, but it just did not work. I tried it for about a week and the redness only intensified the more I used it. I'm a little bummed because I spent so much money on this product, but I'm sure it works for others considering the reviews.",
        "headline": "Unfortunately, it did not work on my skin.",
        "rating": 1,
        "ugc_id": 515170579
      },
      "name": "Cicalfate+ Restorative Protective Cream",
      "native_review_count": 253,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 753,
      "locale": "en_US"
    }
  }
}