{
  "product_id": "pimprod2026570",
  "product_url": "https://www.ulta.com/p/tolerance-control-skin-recovery-balm-pimprod2026570",
  "extracted_at": "2025-09-23T05:25:33.979393+00:00",
  "product_name": "AveneTolerance Control Skin Recovery Balm",
  "brand": "Avene",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Face Moisturizer"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "face"
  ],
  "currency": "USD",
  "list_price": "38.00",
  "sale_price": "26.60",
  "availability": "in_stock",
  "rating_avg": "4.5",
  "rating_count": "199",
  "images": [
    "https://media.ulta.com/i/ulta/2586856?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2586856?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2586856cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2586856cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2586856cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2586856cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2586856cm_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2586856cm_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2586856cm_alt07?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2586856cm_vid01/thumbs/af1611a3-a3a4-4317-9d06-9299f48c8261?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsSustainable PackagingAvène's Tolerance Control Skin Recovery Balm is an ultra-rich, calming daily skincare for all hypersensitive, reactive, intolerant and allergic skin. Helps hydrate and restore skin's barrier in 48 hours while soothing and calming skin hyperactivity.",
  "details": "DetailsBenefitsCalms skin in 30 seconds and soothes skin discomfort, including tingling, burning sensations and tightnessProvides 24 hours of continuous hydrationIngredients are 98% of natural originSoothes and calms skin hyperreactivityKey IngredientsD-Sensinose postbiotic ingredient derived from Avène Thermal Spring Water helps calm all sensations of discomfort and restore skin's barrierItem 2586856How To UseApply to the face, neck and eye contour, morning and evening.Precautions: For external use only.IngredientsAvene Thermal Spring Water (Avene Aqua), Caprylic/Capric Triglyceride, Glycerin, Cetearyl Alcohol, Butyrospermum Parkii (Shea) Butter (Butyrospermum Parkii Butter), Squalane, Beeswax (Cera Alba), Cetearyl Glucoside, Cetyl Esters, Aquaphilus Dolomiae Extract Filtrate, Arginine, Citric Acid, Tromethamine, Water (Aqua), Xanthan Gum.",
  "how_to_use": "Apply to the face, neck and eye contour, morning and evening.Precautions: For external use only.",
  "ingredients": [
    "Avene Thermal Spring Water (Avene Aqua)",
    "Caprylic/Capric Triglyceride",
    "Glycerin",
    "Cetearyl Alcohol",
    "Butyrospermum Parkii (Shea) Butter (Butyrospermum Parkii Butter)",
    "Squalane",
    "Beeswax (Cera Alba)",
    "Cetearyl Glucoside",
    "Cetyl Esters",
    "Aquaphilus Dolomiae Extract Filtrate",
    "Arginine",
    "Citric Acid",
    "Tromethamine",
    "Water (Aqua)",
    "Xanthan Gum"
  ],
  "extended_contents": {
    "text": "Show less"
  },
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "moisturizer",
      "lip gloss"
    ],
    "skin_type": [
      "sensitive"
    ],
    "finish": [
      "sheer",
      "long-wear"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "natural",
      "soothing"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2026570",
    "total_reviews": 199,
    "reviews": [
      {
        "review_id": 559412075,
        "rating": 5,
        "headline": "The best for sensitive skin and rosacea!",
        "comments": "I have seriously sensitive skin that will react if you look at it wrong. I started using this cream a few years back and it has saved my life. I have oily skin, but the rosacea makes my skin patchy with dry spots, and this lotion helps SOOO much. I use it morning and night and even layer it under makeup. Avene has so many great products, many that don't include fragrance of any kind (even natural), and because of that, I'll be a loyal customer for as long as they keep it up. If you have sensitive skin, are prone to redness, and/or have rosacea, try this face lotion!",
        "nickname": "Joanna",
        "location": "TX",
        "created_date": 1754498094232,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557087521,
        "rating": 5,
        "headline": "Holy grail moisturizer!",
        "comments": "Loooooovveee this balm! Not too heavy, not too light. My skin is hypersensitive and reactive to everything, but not this! It was a relief to my very irritated skin diring pregnancy and now postpartum. The only downside is that I wish it wasnt so small for the price. But its worth it for a product i finally don't react to!",
        "nickname": "hanssssss",
        "location": "Honolulu, HI",
        "created_date": 1752489163392,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 548631422,
        "rating": 5,
        "headline": "Amazing!",
        "comments": "This stuff is amazing. I have Perioral dermatitis and I have tried all the creams. This one has truly worked in helping my get rid of it. Don't be discouraged that the balm is somewhat thick (many recommend lightweight moisturizers for PD). It truly does the trick.",
        "nickname": "Ines",
        "location": "Louisiana",
        "created_date": 1741796860353,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537538674,
        "rating": 1,
        "headline": "Not moisturizing",
        "comments": "I tried this product for 2 weeks and I now have dry flaky skin on my cheeks and nose. I bought this product because I have sensitive skin that gets a little drier in the winter months, but my skin has never been this dry in my life! \nPros: it dries quickly and applys nice under makeup. Not greasy. \nCons: dried up my skin into a flaky mess.",
        "nickname": "Kit",
        "location": "Florida",
        "created_date": 1731114729752,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 2
      },
      {
        "review_id": 527420067,
        "rating": 4,
        "headline": "Great for people suffering for hypothyroidism!",
        "comments": "Since I have hypothyroidism, my skin was always super dry and I would have a lot of rashes as a result. But, this lotion is sensitive enough not to irritate my skin furthermore and durable enough to lock in moisture to eliminate dryness without clogging up my pores. Happy i came across this brand because I have wasted a lot of money before finding this product.",
        "nickname": "Canadace",
        "location": "Mississippi",
        "created_date": 1723818569416,
        "bottom_line": null,
        "helpful_votes": 11,
        "not_helpful_votes": 0
      },
      {
        "review_id": 515525824,
        "rating": 5,
        "headline": "Saved me",
        "comments": "Please never remove this. It's the only moisturizer I've ever been able to use without triggering my acne!! I never have any product related breakouts anymore!! Finding a good moisturizer that worked for my skin was soo hard. This is so perfect and I've been using it for probably a year now.",
        "nickname": "Emily",
        "location": "Fontana, CA",
        "created_date": 1716153717069,
        "bottom_line": null,
        "helpful_votes": 10,
        "not_helpful_votes": 0
      },
      {
        "review_id": 511314806,
        "rating": 5,
        "headline": "My favorite soothing balm",
        "comments": "I use retinol and aha products regularly so every now and then my skin peels and gets red and sensitive. I have tried a lot of soothing and calming products on the market to fix my occasionally irritated skin but so far this one is the only one that doesn't hurt when applied and that actually calms my skin down. I have used both its cream and balm version. They are both great but I like the balm one a little better.",
        "nickname": "W",
        "location": "Carlsbad",
        "created_date": 1713079352528,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 484155272,
        "rating": 5,
        "headline": "Love this!",
        "comments": "Glides onto the skin nicely and leaves a nice hydrated finish to the skin. Very soothing for dryness without clogging pores",
        "nickname": "M",
        "location": "Texas",
        "created_date": 1702166916114,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 462802331,
        "rating": 5,
        "headline": "Only product that saved me.",
        "comments": "In recent years i've developed excema on my eyelids, chin & ear lobes. I've tried so many moisturizers that claim to help reduce redness and lock in moisture, but it wasn't until I found this product that my skin changed for the better. I bought the 3 pack sample with the facewash and thermal water and fell in love with all. \n\nFirst purchased back in September 2022 & still using the same 3 products today. I even tried to change back to some old products that used to work for me and my skin returned to the brittle and scaly old self that used to be. I remain consistent with this brand, and they have shown me love back, my skin soaks this stuff in and doesnt break me out whatsoever. \n\nSuper gentle and refreshing. One of my favorite pros is that it leaves my irritated and stinging skin, smooth and calm. if you have irritated skin that stings, even when you put your moisturizer on it, this product is definitely for you and will help with that sensation.",
        "nickname": "Brooke H.",
        "location": "San Diego",
        "created_date": 1687893877272,
        "bottom_line": null,
        "helpful_votes": 41,
        "not_helpful_votes": 0
      },
      {
        "review_id": 449714568,
        "rating": 5,
        "headline": "SO GOOD!!",
        "comments": "This is my favorite Avene product! So much that I finished my first tube and bought two more! It has been very helpful for my dry face this winter and I love using it at night over my serums.",
        "nickname": "Grace",
        "location": "KS",
        "created_date": 1679801276871,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 442980450,
        "rating": 5,
        "headline": "Helped razor burn!",
        "comments": "Helped razor burn and is super gentle",
        "nickname": "Allison",
        "location": "Ohio",
        "created_date": 1675612715331,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 442550805,
        "rating": 3,
        "headline": "Works good on my neck",
        "comments": "It help relieve the redness on my irritated neck, little pricey",
        "nickname": "Brenda",
        "location": "Liberty tx",
        "created_date": 1675360887628,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 442046832,
        "rating": 5,
        "headline": "I love this product!",
        "comments": "This moisturizer is extremely lightweight but really leaves my skin feeling hydrated!!!  I read reviews about how hard it is to use the dispenser, but I do have not had any problem with the pump working.  I will definitely be buying this again!",
        "nickname": "Annette",
        "location": "Greensboro,  NC",
        "created_date": 1674926298188,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 441765744,
        "rating": 3,
        "headline": "Meh. Returned.",
        "comments": "I bought this for 50% off during the skin event recently and ended up returning it. I didn't find any relief of the mild redness that I have on my face, and the pump and consistency reminded me of sunblock. It actually felt like sunblock too, after application. It felt like it was sitting on my face rather than being absorbed (this is after about an hour of application). I am happy with my current night cream (Belif Aqua Bomb Sleeping Mask) but figured for the price and great reviews, this was worth a shot. No luck for me, back to the store it went!",
        "nickname": "cd405",
        "location": "Long Island, NY",
        "created_date": 1674677621182,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 2
      },
      {
        "review_id": 441242550,
        "rating": 5,
        "headline": "Instant relief for rosacea flare-up",
        "comments": "I rushed to my local Ulta during a rosacea flare-up to get Cicaplast balm, as it's usually the only thing that can provide relief from the intense burning and itching. They were out of stock, so I had to find something else on the spot. Avene products were right next to La Roche-Posay, and this balm had great reviews, so I took a chance and bought it. Washed my face (with vanicream soap-free bar) upon getting home, applied a generous dollop of this balm, and hallelujah! Within 5 minutes the burning and stinging had significantly decreased. A couple of hours later my skin felt back to normal and comfortable. The texture is a lot nicer than Cicaplast, much lighter and creamier, and it's much more moisturizing than my current ceramide cream, so I'm switching to this as daily moisturizer. After just two days, my skin already feels less rough and tight (although the bumps are still there, that's another story), and no itching or burning to report. Highly recommend.",
        "nickname": "V",
        "location": "Richmond, VA",
        "created_date": 1674230655390,
        "bottom_line": "Yes",
        "helpful_votes": 9,
        "not_helpful_votes": 0
      },
      {
        "review_id": 440404952,
        "rating": 1,
        "headline": "Love product, Ulta is the problem",
        "comments": "Bought during save skin event.  Received email confirmation.  Next week received email that it would be delayed due to shipping issues.  Hours later, email says \"order cancelled\".  Contacted ulta over a dozen times.  Kept getting bot-like responses that sale is over, watch for another sale.  NO, Ulta make this right.  I suggested they transfer order to local store so I can pick up since it was in stock (didn't buy it at store due to previous issues buying items and finding them used or old at home).  They said sale over.  I said send when restocked.  If you didn't have enough for a sales event, why promote.  Bait and switch tactics.  Extremely poor customer service right through to supervisor level.  This is why I have decreased my purchases from Ulta over the years.  In today's economy, sellers should work with buyers to keep them.  Not alienate them.  Again worst experience yet with Ulta and it keeps getting worse each ordeal with them.",
        "nickname": "",
        "location": "Pennsylvania",
        "created_date": 1673710832197,
        "bottom_line": null,
        "helpful_votes": 11,
        "not_helpful_votes": 13
      },
      {
        "review_id": 436917018,
        "rating": 5,
        "headline": "Good for rosacea",
        "comments": "This is a thick unscented cream that absorbs quickly. I have rosacea and the redness can get out of control unless you're on top  of it. This product is now part of my routine. They also make a fantastic  eye cream.",
        "nickname": "ItsKrissyPoo",
        "location": "Maryland",
        "created_date": 1670587292679,
        "bottom_line": null,
        "helpful_votes": 21,
        "not_helpful_votes": 1
      },
      {
        "review_id": 436351087,
        "rating": 5,
        "headline": "Worth trying for eczema-prone, reactive, skin",
        "comments": "I would describe my 30 year old skin as desert-like. I have persistent flaky patches that just never seem to be soothed unless I use at least 2 moisturizers and vaseline on top. This balm has been excellent, better than any moisturizer I've tried since my skin has been this reactive and dry. I'm really taken aback at how this makes my dryest flaky patches look like normal skin. Goes well underneath makeup as well. If I feel dry throughout the day, I put this on and my skin feels and looks refreshed. I also like to use it when I have an itchy flare or hive, and it seems to calm it down. The texture is like a rich moisturizer, not greasy feeling like vaseline but it leaves a lovely protective barrier. I live in a dry climate, so I sometimes add something more occlusive (petrolatum-based) on top at night, but that's just me. I honestly would recommend anyone with eczema or flaky skin to try this, especially if it's on sale.",
        "nickname": "Lo",
        "location": "Montreal, QC",
        "created_date": 1670204349055,
        "bottom_line": "Yes",
        "helpful_votes": 23,
        "not_helpful_votes": 0
      },
      {
        "review_id": 435396570,
        "rating": 5,
        "headline": "Worth every penny",
        "comments": "Wow this is fantastic!  I had a skin infection and needed a prescription to clear it up. Unfortunately the prescription left my skin red and peeling. This balm saved the day. The redness disappeared within a day and the peeling went away after 3 days. This does not feel like a balm at all. It feels like a lightweight lotion and absorbs quickly. I was even able to apply a bit of foundation over it with no pilling. I highly recommend!",
        "nickname": "Lauren",
        "location": "NJ",
        "created_date": 1669580044751,
        "bottom_line": "Yes",
        "helpful_votes": 22,
        "not_helpful_votes": 0
      },
      {
        "review_id": 430677157,
        "rating": 5,
        "headline": "Your skin barrier's bff!",
        "comments": "Love this product pm and sometimes am use too. Very moisturizing and doesn't irritate my sensitive rosacea and seb derm skin. :)",
        "nickname": "Carrie",
        "location": "Michigan",
        "created_date": 1666391273505,
        "bottom_line": "Yes",
        "helpful_votes": 22,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 35,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2026570/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "too small",
              "count": 1
            }
          ],
          "display_values": [
            "too small"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "not irritating fragrance free",
              "count": 1
            },
            {
              "label": "Good for redness",
              "count": 1
            },
            {
              "label": "good for dry winters",
              "count": 1
            },
            {
              "label": "good for sensitive skin",
              "count": 1
            },
            {
              "label": "no fragrance",
              "count": 1
            },
            {
              "label": "not irritating",
              "count": 1
            }
          ],
          "display_values": [
            "Good for redness",
            "good for dry winters",
            "good for sensitive skin",
            "no fragrance",
            "not irritating",
            "not irritating fragrance free"
          ]
        }
      ],
      "rating_histogram": [
        10,
        2,
        18,
        23,
        146
      ],
      "review_histogram": [
        10,
        2,
        18,
        23,
        146
      ],
      "rating_count": 199,
      "review_count": 199,
      "average_rating": 4.47,
      "recommended_ratio": 0.92,
      "media": [
        {
          "id": "406400791",
          "review_id": 406400826,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/gg0v9ry4ie1edlrmujwf.jpg",
          "headline": "Avène Tolerance Control Soothing Skin Recovery Balm",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Chels",
          "created_date": 1650972182086
        },
        {
          "id": "406400818",
          "review_id": 406400826,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/r9mkyzbgoeb9ioqe0ysa.jpg",
          "headline": "Avène Tolerance Control Soothing Skin Recovery Balm",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Packaging",
          "nickname": "Chels",
          "created_date": 1650972182086
        },
        {
          "id": "405863553",
          "review_id": 405863578,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/nmzbrrekre1n9eh7hvjc.jpg",
          "headline": "Mild and effective skin recovery balm.",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Avène Tolerance Control Soothing Skin Recovery Balm",
          "nickname": "Angel G",
          "created_date": 1650623997476
        },
        {
          "id": "405863538",
          "review_id": 405863578,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ohq5itics4hjopmslf3s.jpg",
          "headline": "Mild and effective skin recovery balm.",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "After using the skin recovery balm.",
          "nickname": "Angel G",
          "created_date": 1650623997476
        },
        {
          "id": "405748026",
          "review_id": 405748000,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/wzbsfl16l5ohdn3jhvzk.jpg",
          "headline": "Very Nice",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Love this stuff!",
          "nickname": "MsMayMomma4",
          "created_date": 1650491586948
        },
        {
          "id": "405739467",
          "review_id": 405739429,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ykvbcwmdasblxl5nlfmd.jpg",
          "headline": "Soaks into skin so fast!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Crystal",
          "created_date": 1650480487211
        },
        {
          "id": "405739476",
          "review_id": 405739429,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/aru2kgqeqixndamwz4zo.jpg",
          "headline": "Soaks into skin so fast!",
          "rating": 5,
          "helpful_votes": 1,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Crystal",
          "created_date": 1650480487211
        },
        {
          "id": "405719343",
          "review_id": 405719335,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/jel0nyubigeujxlwiaun.jpg",
          "headline": "I'm honestly impressed!",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "JuliaGulia",
          "created_date": 1650462480338
        },
        {
          "id": "405700281",
          "review_id": 405700410,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/pkoccdtrlh683aywguso.jpg",
          "headline": "A Great Moisturizer",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Love the tube",
          "nickname": "TTHEREVIEWER",
          "created_date": 1650433595595
        },
        {
          "id": "405700432",
          "review_id": 405700410,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/a9dx3wrni3lldpng6l2m.jpg",
          "headline": "A Great Moisturizer",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Great Moisturizer",
          "nickname": "TTHEREVIEWER",
          "created_date": 1650433595595
        },
        {
          "id": "405697552",
          "review_id": 405697551,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/zv1a00pbygsop0s79v0x.jpg",
          "headline": "Unpleasant Scent",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Nice outer packaging",
          "nickname": "Jessie M.",
          "created_date": 1650428401521
        },
        {
          "id": "405076784",
          "review_id": 405076848,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/vphuqo8ysqvcbdqtmjso.jpg",
          "headline": "Great product!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Lindsay",
          "created_date": 1649854427076
        },
        {
          "id": "405000164",
          "review_id": 405000149,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/uwsica1m8egdhlfv0h4s.jpg",
          "headline": "Does Just What it Advertises",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Aimster",
          "created_date": 1649761561163
        },
        {
          "id": "404987978",
          "review_id": 404987997,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/qxlhlk6jsa10p6hud6zh.jpg",
          "headline": "Calms Irritated Skin",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Laladas",
          "created_date": 1649732691015
        },
        {
          "id": "404987998",
          "review_id": 404987997,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/be92g7oydveiexospkgt.jpg",
          "headline": "Calms Irritated Skin",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Laladas",
          "created_date": 1649732691015
        },
        {
          "id": "404870443",
          "review_id": 404870457,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/nzis9hekj0uphgbmmrda.jpg",
          "headline": "Lightweight but effective",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Brittany",
          "created_date": 1649600233178
        },
        {
          "id": "404811565",
          "review_id": 404811547,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/mcrtmaqhwg2z6dtityof.jpg",
          "headline": "Finally!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Dena1384",
          "created_date": 1649506265846
        },
        {
          "id": "404775417",
          "review_id": 404775395,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ahrcbfkvdd3zanbl7obm.jpg",
          "headline": "AMAZE-Balm",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Before",
          "nickname": "Holly",
          "created_date": 1649449162766
        },
        {
          "id": "404775323",
          "review_id": 404775395,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/b49omk2surc9y64vo72b.jpg",
          "headline": "AMAZE-Balm",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "AFTER",
          "nickname": "Holly",
          "created_date": 1649449162766
        },
        {
          "id": "404457587",
          "review_id": 404457302,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/nbuc7kjxq5uytvby0xwj.jpg",
          "headline": "Holy Grail!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Addi",
          "created_date": 1649208790232
        },
        {
          "id": "404457597",
          "review_id": 404457302,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/lhurmdsd5zeazxagk4w1.jpg",
          "headline": "Holy Grail!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Addi",
          "created_date": 1649208790232
        },
        {
          "id": "404417317",
          "review_id": 404417303,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/nivtuxixlus2pso3unti.jpg",
          "headline": "Good for sensitive skin",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Campingpixi",
          "created_date": 1649183047109
        },
        {
          "id": "404372863",
          "review_id": 404372896,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/s7iqeya4vz1kh0fgspvr.jpg",
          "headline": "So far so good",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "After",
          "nickname": "T",
          "created_date": 1649170650882
        },
        {
          "id": "404372763",
          "review_id": 404372896,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/pxni50x78lri2djuddth.jpg",
          "headline": "So far so good",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Before",
          "nickname": "T",
          "created_date": 1649170650882
        },
        {
          "id": "404372888",
          "review_id": 404372896,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/zxodg98kcrwyyuxjqbkp.jpg",
          "headline": "So far so good",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "After",
          "nickname": "T",
          "created_date": 1649170650882
        },
        {
          "id": "404372834",
          "review_id": 404372896,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/mva421fuovjffcsjusui.jpg",
          "headline": "So far so good",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Before",
          "nickname": "T",
          "created_date": 1649170650882
        },
        {
          "id": "404367992",
          "review_id": 404367955,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/apsnmozxnzwnapferdvb.jpg",
          "headline": "Avene balm",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Avene balm",
          "nickname": "Marmill88",
          "created_date": 1649167515238
        },
        {
          "id": "404336230",
          "review_id": 404336329,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/tgin2snljh4aanvmmpmp.jpg",
          "headline": "Rich balm with calming effect",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "A little bit of white cast after spreading it",
          "nickname": "thecheapsubscriber",
          "created_date": 1649124480878
        },
        {
          "id": "404336118",
          "review_id": 404336329,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/t7iodz6phu4q9zqlra8n.jpg",
          "headline": "Rich balm with calming effect",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Rich balm",
          "nickname": "thecheapsubscriber",
          "created_date": 1649124480878
        },
        {
          "id": "404334729",
          "review_id": 404334708,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/xa2g617fcemhnumb8jzl.jpg",
          "headline": "Little tube of Magic",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Minette2004",
          "created_date": 1649123056619
        },
        {
          "id": "404310836",
          "review_id": 404310826,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/vdp5xgnwh1ndmveo5opu.jpg",
          "headline": "So Soothing",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "A skincare must have",
          "nickname": "Smack",
          "created_date": 1649100833557
        },
        {
          "id": "404176773",
          "review_id": 404176741,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/mmafzpfb14x9ojtb5nkg.jpg",
          "headline": "Skin Relief",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Great Face Balm",
          "nickname": "Ashley25",
          "created_date": 1648993664607
        }
      ],
      "faceoff_positive": {
        "comments": "I love Avene products. They keep my rosacea under control and make my skin look beautiful and feel wonderful. I get lots of compliments on my skin and questions as to what I use. I am 67 years old and my skin looks and feels like 17 years old. I have never had plastic surgery. I believe the first key to anti-aging is to use SPF and Avene's is the only SPF product that does not irritate my face. The second key is to use products for sensitive skin. I love Avene's hypersensitive skin products such as Xera Calm and Tolerance Control as well as Cicalfate and Retrinol products. And the third key is to use Avene's Eau Thermale Thermal Spring Water. I even spray it in my dogs' faces sometimes especially on hot days and they are gorgeous dogs!!",
        "headline": "Use Avene for smooth, calm and beautiful skin!",
        "rating": 5,
        "ugc_id": 515180179
      },
      "faceoff_negative": {
        "comments": "I bought this one because auto recommended when I choose the \"tolerance cream\" I used to use, but it out of stock and discontinued product. It says they are similar, but after using one bottle, my face keeps peeling actually they are not the same thing. It is not gentle enough for my face.",
        "headline": "I bought this one because",
        "rating": 3,
        "ugc_id": 515180872
      },
      "name": "Tolerance Control Skin Recovery Balm",
      "native_review_count": 35,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 164,
      "locale": "en_US"
    }
  }
}