{
  "product_id": "pimprod2039548",
  "product_url": "https://www.ulta.com/p/mini-milk-shake-hyaluronic-acid-squalane-facial-toner-mist-pimprod2039548",
  "extracted_at": "2025-09-23T04:35:45.675612+00:00",
  "product_name": "Beekman 1802Mini Milk Shake Hyaluronic Acid & Squalane Facial Toner Mist",
  "brand": "Beekman 1802",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Face Mists & Essences"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "20.00",
  "availability": "in_stock",
  "rating_avg": "4.8",
  "rating_count": "666",
  "images": [
    "https://media.ulta.com/i/ulta/2611431?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2611431?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611431_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611431_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611431_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2611431_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2611431_vid01/thumbs/10f70107-34ee-4006-be20-0c632160cc4e?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeSustainable PackagingGive BackBeekman 1802's Milk Shake Hyaluronic Acid & Squalane Facial Toner Mist is an alcohol-free, bi-phase formula that blends goat milk and mugwort with squalene and hyaluronic acid to keep sensitive skin toned and hydrated all day.",
  "details": "DetailsBenefitsInstantly tones and hydrates skin2-in-1 treatment that works to keep skin both hydrated and balanced all day longPrevents trans epidermal water loss and protects skin barrier without clogging poresHelps to relieve redness and irritationSafe for sensitive skin2022 Allure Best of Beauty Skin Award WinnerConvenient travel size so you can take a shake break any time, any placeKey IngredientsMugwort is an ancient super herb & proven adaptogen that relieves stress and redness - Using mugwort as an astringent instead of alcohol makes Beekman 1802's mist safe for sensitive skinGoat Milk & Probiotic Extract feed and nourish the skin's microbiome to keep it balancedJojoba Oil is a natural occlusive that creates a physical barrier on the skin, helping to lock in moisture and hydrationPlant-derived Squalane is an emollient that prevents trans epidermal water loss and protects the skin while being non-comedogenic, meaning that it won't clog poresResearch ResultsProven for 8 hours of hydration+111% increase in hydration after 8 hours+45% increase in hydration after 1 useItem 2611431How To UseSHAKE WELL TO ACTIVATE. Shake the bottle generously before spraying. Reapply throughout the day for an instant refresh. Milk Shake Mini is the perfect go-anywhere size for a shake break at work, at the gym, on a plane...wherever you need it!IngredientsWater (Aqua), Ethylhexyl Palmitate, Caprylic/Capric Triglyceride, Coco-Caprylate/Caprate,1,2-Hexanediol, Simmondsia Chinensis (Jojoba) Seed Oil, Caprae Lac (Goat Milk), Colostrum, Bifida Ferment Lysate, Lactose, Milk Protein, Artemisia Capillaris (Mugwort) Extract, Hyaluronic Acid, Squalane, Aloe Barbadensis Leaf Water, Eryngium Alpinum (Blue Thistle) Flower Extract, Chamomilla Recutita (Matricaria) Flower Extract, Honey Extract, Hippophae Rhamnoides (Sea Buckthorn) Oil, Symphytum Officinale (Comfrey) Leaf Extract, Hydrolyzed Jojoba Esters, Glycerin, Sodium Chloride, Hydroxyacetophenone, Pentaerythrityl Tetra-di-I-butyl, Hvdroxvhvdrocinnamate, Ethylhexylglycerin, Propanediol, Tocopherol, Whey Protein, C10-18 Triglycerides, Lecithin. . . and Kindness.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "SHAKE WELL TO ACTIVATE. Shake the bottle generously before spraying. Reapply throughout the day for an instant refresh. Milk Shake Mini is the perfect go-anywhere size for a shake break at work, at the gym, on a plane...wherever you need it!",
  "ingredients": [
    "Water (Aqua)",
    "Ethylhexyl Palmitate",
    "Caprylic/Capric Triglyceride",
    "Coco-Caprylate/Caprate",
    "2-Hexanediol",
    "Simmondsia Chinensis (Jojoba) Seed Oil",
    "Caprae Lac (Goat Milk)",
    "Colostrum",
    "Bifida Ferment Lysate",
    "Lactose",
    "Milk Protein",
    "Artemisia Capillaris (Mugwort) Extract",
    "Hyaluronic Acid",
    "Squalane",
    "Aloe Barbadensis Leaf Water",
    "Eryngium Alpinum (Blue Thistle) Flower Extract",
    "Chamomilla Recutita (Matricaria) Flower Extract",
    "Honey Extract",
    "Hippophae Rhamnoides (Sea Buckthorn) Oil",
    "Symphytum Officinale (Comfrey) Leaf Extract",
    "Hydrolyzed Jojoba Esters",
    "Glycerin",
    "Sodium Chloride",
    "Hydroxyacetophenone",
    "Pentaerythrityl Tetra-di-I-butyl",
    "Hvdroxvhvdrocinnamate",
    "Ethylhexylglycerin",
    "Propanediol",
    "Tocopherol",
    "Whey Protein",
    "C10-18 Triglycerides",
    "Lecithin. . . and Kindness"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "moisturizer",
      "serum",
      "toner"
    ],
    "skin_type": [
      "sensitive",
      "normal"
    ],
    "finish": [
      "sheer",
      "oil"
    ],
    "ingredients": [
      "hyaluronic-acid"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "natural",
      "non-comedogenic",
      "alcohol-free"
    ]
  },
  "reviews": {
    "product_id": "pimprod2039548",
    "total_reviews": 666,
    "reviews": [
      {
        "review_id": 559202724,
        "rating": 5,
        "headline": "Milk Shake Great",
        "comments": "Beekman 1802 Mini Milk Shake Hyaluronic Acid & Squalane Facial Toner Mist.  Love this.  I was told to use after, and as a last step for my routine.  But, I started using it between moisturizer and primer.  Wow!  my primer has never looked so good and what a smooth finish. I do not even need to use a foundation.  I started getting so many compliments on my skin.",
        "nickname": "Sarah",
        "location": "Arizona",
        "created_date": 1754236635086,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558580180,
        "rating": 4,
        "headline": "Pretty good product!",
        "comments": "Having to shake the bottle turns more into a habit as after every use, so I'll be getting this again after I empty out the travel size! Not a fan of the price, but every spritz is worth the cost. Its also very hot climate friendly, and convenient.",
        "nickname": "Momo!",
        "location": "Detroit",
        "created_date": 1753805086890,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 558018896,
        "rating": 3,
        "headline": "I don't know whether I would purchase again",
        "comments": "I've only used the product a few times, so I do not know whether I like it or not",
        "nickname": "Debra",
        "location": "Gray, GA",
        "created_date": 1753203492374,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 13
      },
      {
        "review_id": 556719723,
        "rating": 4,
        "headline": "Just didn't work for me",
        "comments": "I love the feel and the formula but right now it made my face sting a bit. It is my fault due to trying to use with a broken skin barrier. However it works well as a refresh spray after hours of wearing makeup.",
        "nickname": "",
        "location": "Sumter SC",
        "created_date": 1751814344298,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 2
      },
      {
        "review_id": 554988211,
        "rating": 5,
        "headline": "I will buy this product again.",
        "comments": "I love this product.It feels good on my skin.",
        "nickname": "Susan",
        "location": "Tennessee",
        "created_date": 1749749854079,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554683754,
        "rating": 5,
        "headline": "This gets it exactly right!",
        "comments": "As an oily girl, hydration is a tricky balancing act. This spray followed by a natural matte foundation is the perfect combination! My skin feels amazing when I use this spray on its own as well.",
        "nickname": "Tanea",
        "location": "Chattanooga, TN",
        "created_date": 1749253614372,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553215496,
        "rating": 1,
        "headline": "Not for sensitive skin",
        "comments": "This product gave me skin an instant stinging and burning sensation. It's very strong and smells like bee wax.",
        "nickname": "Kristy",
        "location": "Cape Coral Fl",
        "created_date": 1747067783018,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 552089061,
        "rating": 5,
        "headline": "Really like it",
        "comments": "I use it twice a day and I really like it",
        "nickname": "Diana",
        "location": "Waterford ct",
        "created_date": 1745163176408,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551547672,
        "rating": 5,
        "headline": "I Wold buy this product again",
        "comments": "If you want hydrated skin, this is the perfect product",
        "nickname": "Ada",
        "location": "Fl.",
        "created_date": 1744391702704,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550747676,
        "rating": 4,
        "headline": "Skin care Routine must have!",
        "comments": "Its a gentle spray toner, moisturizing.  I bought the sampler kit for my Mom and sistera at Christmas brcause I loved it so much.  ALL OF THEM LOVED THIS PRODUCT!  They all have differnt akin types and concerns from dry,redmess, rosacea, to acne prone.  I have normal skin with discoloration and skin texture. This product and the beekman milk drops faded my age spot to where its not noticeable anymore.  Not even Caudalie, Clinique performed as fast or as good. Also my testure was completely smoothed.  I have used these products for about 5 months now since 11/24.  I just sent to Ulta today and bought aome more from this line.",
        "nickname": "Angel",
        "location": "SoCal",
        "created_date": 1743363834154,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 1
      },
      {
        "review_id": 549606130,
        "rating": 5,
        "headline": "Best product",
        "comments": "I love it and I am enjoying it",
        "nickname": "",
        "location": "Washington",
        "created_date": 1742486552022,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549565532,
        "rating": 5,
        "headline": "amazing",
        "comments": "I have went through two bottles now. The orange one is so fresh and bright, smells great. And this time I got the coconut one, it's warm and gourmand. These are so so so good for people who can't reach parts of their body. I am older and cannot reach my back or upper shoulder blades, neck, etc. I can spray this after my shower back there and it FINALLY gets moisture to that area. I always use body creams after shower but that area always got neglected. this solved that. and I've also used this when I'm in a hurry and don't want to her body creams all over my hands and nails. I'll do a quick spray all over. they are wonderful.",
        "nickname": "mommyluvof4",
        "location": "ohio",
        "created_date": 1742404418774,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547345956,
        "rating": 2,
        "headline": "Great product, AWFUL packaging",
        "comments": "I love this toner. I've bought the full size multiple times. It's amazing. The mini, however, is AWFUL. I've bought at least 4 of them, always hoping to get one with a decent sprayer so I can at least swap it to the bottles with the faulty ones, but ALL of them end up spraying all over the place in weird streams and not at all misting within the first few uses. Save yourself the trouble and just get the full size.",
        "nickname": "Allison",
        "location": "Destin, FL",
        "created_date": 1740453554623,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547100094,
        "rating": 2,
        "headline": "Didn't work for my dry skin",
        "comments": "Very drying on my skin",
        "nickname": "Angie",
        "location": "Searcy, Arkansas",
        "created_date": 1740173626635,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 546939194,
        "rating": 5,
        "headline": "I would buy again",
        "comments": "Bought this before. It's moisturizing and leaves skin glowing.",
        "nickname": "",
        "location": "SC",
        "created_date": 1739901095631,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 546577675,
        "rating": 4,
        "headline": "Moisturizing, but the sprayer sucks",
        "comments": "I've finished the whole bottle at this point. The sprayer delivers heavy droplets instead of a fine mist. It sprays only in the outer circle, but not the middle. Hopefully that makes sense. I really like that there is enough oil to be moisturizing.",
        "nickname": "mithl",
        "location": "Houston, TX",
        "created_date": 1739422014657,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 1
      },
      {
        "review_id": 545976871,
        "rating": 5,
        "headline": "Is one of my favorites",
        "comments": "This toner is amazing, winter and summer, know there I'm pregnant is everything I need and good moisturizer.",
        "nickname": "Katherin",
        "location": "Dickson City",
        "created_date": 1738847040300,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 542359730,
        "rating": 5,
        "headline": "Easy extra moisture.",
        "comments": "I was looking for something extra for winter moisture. This is very easy to use, and I like how it feels. Also soaks in quickly so I do not have to wait to put my regular moisturizer over.",
        "nickname": "Lynn11",
        "location": "AR",
        "created_date": 1736188374491,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542095359,
        "rating": 5,
        "headline": "Every Yes",
        "comments": "I have ridiculously dry skin and this is amazing. it keeps my skin feeling hydrated throughout the day. I bought the trial size because I had no idea of it was going to work, and she's a little pricey. adding the full size immediately. I also have the moisturizer and it's a match made in heaven for my skin. If you have impossibly dry skin, you won't regret this purchase.",
        "nickname": "allison",
        "location": "Maine",
        "created_date": 1735755858132,
        "bottom_line": null,
        "helpful_votes": 11,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542006657,
        "rating": 3,
        "headline": "Glad I bought the travel size first...",
        "comments": "So please don't get me wrong, this mist seems to be made for a \"younger\" skin than mine (I'm in my early 60s) because it is refreshing but it does absolutely nothing else.  I have very oily skin to begin with and it didn't seem to add any additional oil, nor did it make me break out, but it really did nothing more than a spritz of water and a hand-held fan would do. It did feel very tacky when I first sprayed it on (about 8-10 inches away from my face, and I didn't saturate my face or make it dripping wet with the spray) and took about 2-3 minutes before the initial heavy tackiness went away (it still felt like there was \"something\" on my skin though, even when it dried down). I really didn't like that very much, to be honest. I had read some other reviews and saw that some people felt that it left them oily - however it didn't do that to me and I am very oily skinned.  I was more worried about it affecting my hair and making my hairline greasy looking, so I put either a towel over my hairline or put on a shower cap whenever I sprayed my face. Obviously, I couldn't do this out in public so I would have to duck into a restroom and cover my hairline to spray - and again, it really didn't add anything to my face but tackiness.  No extra moisture, no extra softness, no glow, nothing.  \nOn the plus side, I would recommend this because I think the ingredients would help younger skin but at my age, a \"mist\" isn't really going to help anything other than give a cooling feeling when used with a pocket fan. Rosewater in a mister and a fan would do he same for my skin and cost a LOT less - plus I wouldn't have that tacky feeling left on my skin afterwards! The concept is a great one - just not for my age bracket or skin type.",
        "nickname": "fhr1128",
        "location": "Vero Beach, Florida",
        "created_date": 1735577607530,
        "bottom_line": "Yes",
        "helpful_votes": 12,
        "not_helpful_votes": 4
      }
    ],
    "paging": {
      "total_results": 33,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2039548/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Combination",
              "count": 1
            },
            {
              "label": "Dry",
              "count": 1
            },
            {
              "label": "Normal",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        13,
        7,
        15,
        46,
        585
      ],
      "review_histogram": [
        13,
        7,
        15,
        46,
        585
      ],
      "rating_count": 666,
      "review_count": 666,
      "average_rating": 4.78,
      "recommended_ratio": 0.79,
      "media": [],
      "faceoff_positive": {
        "comments": "As a licensed medical esthetician, I definitely feel it's my duty to try products out that could be good for my clients, even if we don't sell that product in our medical clinic. What caught my eye about this delightful product was the use of squalane. I've been aware of this ingredient as far back as 1992, and had tried it then and realized its benefits. Only is issue is the sourcing of squalene, which is called sqaulane once it's been processed, and that was coming from shark livers in the past. I did see this squalane is derived from plants, which is a relief. But it's still an ongoing issue, so always check the sourcing out if it has squalane. Happily,.no issues here and I've used this product every day since purchasing in Sept. It really added a nice layer of hydration and sets my skin up for my serums and moisturizer, and then makeup. I have recommended it to my mature skinned clients and also bec the humidity can get low and dry here in Los Angeles. I really love this product for all it does for combination skin. And now I'm going to order a few for clients and my bestie for Xmas. For the price, it's really worth it and the fine mist goes along way. I also love the design of the bottle..it's quite pretty sitting on my counter.",
        "headline": "Skin Drink in A Bottle",
        "rating": 5,
        "ugc_id": 477923449
      },
      "faceoff_negative": {
        "comments": "So please don't get me wrong, this mist seems to be made for a \"younger\" skin than mine (I'm in my early 60s) because it is refreshing but it does absolutely nothing else.  I have very oily skin to begin with and it didn't seem to add any additional oil, nor did it make me break out, but it really did nothing more than a spritz of water and a hand-held fan would do. It did feel very tacky when I first sprayed it on (about 8-10 inches away from my face, and I didn't saturate my face or make it dripping wet with the spray) and took about 2-3 minutes before the initial heavy tackiness went away (it still felt like there was \"something\" on my skin though, even when it dried down). I really didn't like that very much, to be honest. I had read some other reviews and saw that some people felt that it left them oily - however it didn't do that to me and I am very oily skinned.  I was more worried about it affecting my hair and making my hairline greasy looking, so I put either a towel over my hairline or put on a shower cap whenever I sprayed my face. Obviously, I couldn't do this out in public so I would have to duck into a restroom and cover my hairline to spray - and again, it really didn't add anything to my face but tackiness.  No extra moisture, no extra softness, no glow, nothing.  \nOn the plus side, I would recommend this because I think the ingredients would help younger skin but at my age, a \"mist\" isn't really going to help anything other than give a cooling feeling when used with a pocket fan. Rosewater in a mister and a fan would do he same for my skin and cost a LOT less - plus I wouldn't have that tacky feeling left on my skin afterwards! The concept is a great one - just not for my age bracket or skin type.",
        "headline": "Glad I bought the travel size first...",
        "rating": 3,
        "ugc_id": 542006657
      },
      "name": "Mini Milk Shake Hyaluronic Acid & Squalane Facial Toner Mist",
      "native_review_count": 33,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 633,
      "locale": "en_US"
    }
  }
}