{
  "product_id": "pimprod2043358",
  "product_url": "https://www.ulta.com/p/kissing-lipstick-pimprod2043358",
  "extracted_at": "2025-09-23T04:19:47.325179+00:00",
  "product_name": "Charlotte TilburyK.I.S.S.I.N.G Lipstick",
  "brand": "Charlotte Tilbury",
  "categories": [
    "Home",
    "Makeup",
    "Lips",
    "Lipstick"
  ],
  "category_keys": [
    "home",
    "makeup",
    "lips",
    "lips"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "35.00",
  "availability": "in_stock",
  "rating_avg": "4.5",
  "rating_count": "276",
  "images": [
    "https://media.ulta.com/i/ulta/2619409?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2619409?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619409_sm?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619409_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619409_alt02?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryK.I.S.S.I.N.G Lipstick in a signature range of Charlotte Tilbury's moisturizing lipsticks with a satin, cashmere-soft finish.",
  "details": "DetailsBenefitsEnriched with Charlotte's secret ingredients, the K.I.S.S.I.N.G formula protects lips from UV damage, leaving them cashmere-soft and irresistible.A special blend of waxes maintains the rich color while making this lipstick glide over the contours of your lips, with no bleeding outside the lip line.Light-diffusing pigments give lips a brilliant, multi-dimensional finish and full-bodied effect.Formulated WithoutParabensSulfatesItem 2619409How To UseApply the matching Lip Cheat Lip Liner (sold separately) just over your natural lip line to redefine, resize, and reshape your lips.Apply straight from the bullet for a quick, easy lipstick slick. For more precision, apply using a lip brush.To glam it up for evening, layer with a matching Lip Lustre Lip Gloss (sold separately).IngredientsOctyldodecanol, Polybutene, Pentaerythrityl Tetraisostearate, Ethylene/Propylene Copolymer, Caprylic/Capric Triglyceride, VP/Hexadecene Copolymer, Mica, Diisostearyl Malate, Silica, Hydrogenated Styrene/Methyl Styrene/Indene Copolymer, Ozokerite, Stearalkonium Bentonite, Propylene Carbonate, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate, Crambe Abyssinica Seed Oil, Ethyl Vanillin, Bixa Orellana Seed Extract, BHT, Dicalcium Phosphate, Tin Oxide. May Contain: Titanium Dioxide (CI 77891), Iron Oxides (CI 77491, CI 77492, CI 77499), Red 6 (CI 15850), Red 7 (CI 15850), Red 7 Lake (CI 15850), Red 28 Lake (CI 45410), Red 30 Lake (CI 73360), Yellow 5 Lake (CI 19140), Yellow 6 Lake (CI 15985), Blue 1 Lake (CI 42090).Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Apply the matching Lip Cheat Lip Liner (sold separately) just over your natural lip line to redefine, resize, and reshape your lips.Apply straight from the bullet for a quick, easy lipstick slick. For more precision, apply using a lip brush.To glam it up for evening, layer with a matching Lip Lustre Lip Gloss (sold separately).",
  "ingredients": [
    "Octyldodecanol",
    "Polybutene",
    "Pentaerythrityl Tetraisostearate",
    "Ethylene/Propylene Copolymer",
    "Caprylic/Capric Triglyceride",
    "VP/Hexadecene Copolymer",
    "Mica",
    "Diisostearyl Malate",
    "Silica",
    "Hydrogenated Styrene/Methyl Styrene/Indene Copolymer",
    "Ozokerite",
    "Stearalkonium Bentonite",
    "Propylene Carbonate",
    "Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate",
    "Crambe Abyssinica Seed Oil",
    "Ethyl Vanillin",
    "Bixa Orellana Seed Extract",
    "BHT",
    "Dicalcium Phosphate",
    "Tin Oxide. May Contain: Titanium Dioxide (",
    "Iron Oxides (",
    "Red 6 (",
    "Red 7 (",
    "Red 7 Lake (",
    "Red 28 Lake (",
    "Red 30 Lake (",
    "Yellow 5 Lake (",
    "Yellow 6 Lake (",
    "Blue 1 Lake ("
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "makeup",
      "lips",
      "lip",
      "cosmetics"
    ],
    "product_type": [
      "lipstick"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "satin",
      "sheer",
      "oil"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "natural",
      "hydrating"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2043358",
    "total_reviews": 276,
    "reviews": [
      {
        "review_id": 563271780,
        "rating": 5,
        "headline": "Beautiful!",
        "comments": "Everything about this lipstick is perfect.  The packaging and the product.  I guess you get what you pay for.",
        "nickname": "Mimiballerina",
        "location": "Rhode Island",
        "created_date": 1757685482942,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 561184764,
        "rating": 5,
        "headline": "Love it!",
        "comments": "Oh my goodness! I saw this color and knew I had to try it and I absolutely love it and I've been told that it looks fabulous with my complexion and my hair!",
        "nickname": "Barbara Kathrine",
        "location": "Santa Fe, New Mexico",
        "created_date": 1756310327565,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559206393,
        "rating": 2,
        "headline": "Glad I tried a sample first",
        "comments": "The color payoff is terrible! Maybe i read the description wrong, and if i did that's on me and keep scrolling. But I thought this was a lipstick and not a gloss balm. I tried Icon Baby and yeah if uou want sheer pink, this will be your jam. This was my first experience with CT and I was underwhelmed. Great marketing tho.",
        "nickname": "Jh123",
        "location": "Austin",
        "created_date": 1754243794652,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558356084,
        "rating": 5,
        "headline": "My holy grail of lipsticks!",
        "comments": "While all of Charlotte Tilburry is great....this lipstick is my favorite thing! It's my favorite lipstick period! The color payoff is great, it's not drying what so ever! It leaves the lips soft and weightless. Very comfortable to wear & the pillow talk medium or deep are my absolute favorites! I have medium/tan skin so it's a great pinky nude for me!",
        "nickname": "Makenzie",
        "location": "Oregon",
        "created_date": 1753571936151,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558128882,
        "rating": 5,
        "headline": "A must have",
        "comments": "First time trying anything charlotte tilbury product. I really love the color you can wear it with anything. I don't need to re apply as often. I will definitely try more of her products.",
        "nickname": "Michele",
        "location": "Nashville TN",
        "created_date": 1753379804861,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555707053,
        "rating": 5,
        "headline": "Feels wonderful on",
        "comments": "I love the deep pillow talk and it feels great on.",
        "nickname": "KC",
        "location": "Oklahoma",
        "created_date": 1750618534981,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555655141,
        "rating": 3,
        "headline": "Pretty concept",
        "comments": "This lipstick is very eye pleasing for package but it isnt very pigmented. I did get the shade candy chic, so unsure if that has any impact conpared to other colors.",
        "nickname": "Lippopcolor",
        "location": "Sacramento, ca",
        "created_date": 1750486794369,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554655773,
        "rating": 2,
        "headline": "LOVE the color- HATE the glitter!",
        "comments": "Icon baby is 10/10 for the gorgeous shade. However- there are LARGE rough chunks of silver glitter in this lipstick, which was an unwelcome surprise as the pics online do not show that. I get little girl princess lipstick vibes rather than classy.",
        "nickname": "Kris",
        "location": "Grand Rapids, MIchigan",
        "created_date": 1749231256363,
        "bottom_line": "No",
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554456367,
        "rating": 5,
        "headline": "Smooth going on.",
        "comments": "I really like the smoothness and coverage of this lip stick. It stays on for a reasonable time without reapplying.",
        "nickname": "Nancy",
        "location": "Maryville Tennessee",
        "created_date": 1748968809906,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553905544,
        "rating": 5,
        "headline": "Kissable Color",
        "comments": "i personally really like this lipstick formula, it's creamy and pigmented and feels very luxe!",
        "nickname": "Icey",
        "location": "Scranton, PA",
        "created_date": 1748043544977,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552714155,
        "rating": 1,
        "headline": "Shade KISSING PT FAIR is not like the pic.",
        "comments": "The color in the picture is not what you get. I love the shade in the picture, that's why I bought it. In person, it's very warm. Also very sheer. It's great if you want to throw something on real quick to look presentable but otherwise it's completely useless. You have to put 10 layers on to see the color.",
        "nickname": "",
        "location": "Orlando, FL",
        "created_date": 1746136910231,
        "bottom_line": "No",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552084387,
        "rating": 5,
        "headline": "LOVE her satin lipsticks - smooth, lightweight, beautiful",
        "comments": "Love the satin lipsticks formula it's smooth to go on creamy and is also light on the lips. She has large color range and beautiful colors.",
        "nickname": "Anonymous",
        "location": "PA",
        "created_date": 1745149574076,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551592325,
        "rating": 5,
        "headline": "Beautiful!!",
        "comments": "Purchased Rose to Fame, I was looking for a nice pinkish-nude that compliments my deep skin. This shade is BEAUTIFUL!! Definitely a splurge, but this lipstick is long-lasting and hydrating. I paired with both a brown and red liner",
        "nickname": "Lulu",
        "location": "Springfield, PA",
        "created_date": 1744421128479,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549916173,
        "rating": 5,
        "headline": "Glad I Splurged",
        "comments": "I'm very happy I bought this lipstick in the shade CORAL KISS. It's a great color, not too red, not too peach, and goes well with my medium light olive neutral skin tone. I'm older and this shade is not too bright...it's just right, a bit more subtle than most reds and oranges. It looks good with my brown eyes and greying brown hair. The formula is exceptionally good, providing a smooth surface on my lips and good moisturization. So far, it's staying on, although I have not eaten yet. I'll be trying this with some liners and toppers for variety, although lining isn't necessary as this lipstick has the perfect shape tip to be precise when applying along the lip line. Charlotte, you did good.",
        "nickname": "Mindy",
        "location": "South Florida",
        "created_date": 1743089606979,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 548556469,
        "rating": 4,
        "headline": "Yes, Yes!",
        "comments": "Like to results",
        "nickname": "Juanita",
        "location": "WA",
        "created_date": 1741710327504,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547832434,
        "rating": 5,
        "headline": "Great lipstick",
        "comments": "Great Lipstick, one of the few I've found that stay at least a little moist on my super dry lips. Candy Chic is the perfect rosy pink and Pillow Talk Fair is the perfect shade of pink for me. I have a problem with lipsticks changing colors as I wear them, Charlotte Tilbury lipsticks do not do that.",
        "nickname": "Cindy",
        "location": "AZ",
        "created_date": 1741212288221,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 546031584,
        "rating": 4,
        "headline": "Rose to Fame",
        "comments": "This particular color, Rose to Fame is INCREDIBLY comfortable. Also love that t no lip liner necessary. It lasts longer than most lipsticks and I forget it is on, it is that comfortable.  I returned it only because it is too purpleish/magenta on my lips. I would have to add pink to balance it and for this expensive of a lipstick I dont' want to have to modify to just be able to keep it.  Truly one of the most n comfortable lipsticks ever! I purchased  Glowing Jen (I am a brunette) and love the color but it def isn't as comfortable as Rose to Fame so far.  It is a bit drying again compared to Rose to Fame it is noticeable! Frustrating.",
        "nickname": "",
        "location": "Phoenix, AZ",
        "created_date": 1738882032436,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543433213,
        "rating": 5,
        "headline": "the perfect nude!",
        "comments": "for years i've been sticking to a dark brown lipstick because of how hard it was to find the perfect nude for lip combos by my standards as a dark skin woman. then i found icon baby! i'm obsessed with it— the sparkles that add to the sheen, the pretty pale pink that covers my lip scar, and the pretty packaging!! plus, finally a matte lipstick that doesn't dry my lips! :)\n\ni will say- i do have to reapply it frequently throughout the day. i don't know if it's due to the humidity of my environment or my hair getting stuck in my gloss, but it doesn't last all day.",
        "nickname": "lailailoopsy",
        "location": "Dallas, TX",
        "created_date": 1737125128697,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 539201689,
        "rating": 2,
        "headline": "Don't waste your money.",
        "comments": "I always want to like Charlotte Tilbury lipstick, but this is my second purchase and it's disappointing again. The lipstick starts out fine, but doesn't continue that way. It wears to a dull throwback color that reminds me of grandmothers of 50 years ago when their Revlon started to wear off. It's dull and pinkish. Not a good look when technology in makeup has brought us so far. This company is just plain overhyped and they won't be receiving anymore money from me. If I had my receipt, I'd return it.",
        "nickname": "DM",
        "location": "Maryland",
        "created_date": 1733662431348,
        "bottom_line": "No",
        "helpful_votes": 4,
        "not_helpful_votes": 5
      },
      {
        "review_id": 538927378,
        "rating": 5,
        "headline": "Candy Chic",
        "comments": "I'm so happy I didn't return this shade (now that it's almost sold out everywhere). It isn't as long-lasting as the 'Matte Revolution Lipstick,' but it's comfortable to wear, and with the right shade of liner, it's a winner!",
        "nickname": "Manyi",
        "location": "Las Vegas",
        "created_date": 1733303104889,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 44,
      "pages_total": 3,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2043358/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        5,
        7,
        16,
        68,
        180
      ],
      "review_histogram": [
        5,
        7,
        16,
        68,
        180
      ],
      "rating_count": 276,
      "review_count": 276,
      "average_rating": 4.49,
      "recommended_ratio": 0.74,
      "media": [
        {
          "id": "558128812",
          "review_id": 558128882,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/theq7kzamvzwulmuqdsa.jpg",
          "headline": "A must have",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "This is my new favorite color.",
          "nickname": "Michele",
          "created_date": 1753379804861
        }
      ],
      "faceoff_positive": {
        "comments": "I purchased Rose to Fame, Icon Baby, and 90's Pink. Rose to Fame and 90's Pink are very creamy long lasting (for a cream lip) and very close to my natural darker mauve lip color. Comfortable and look really gorgeous on. I dont really need a lipliner with these two. Now for Icon Baby. It took me a long time to decide between Candy Chic and icon baby and im a little disappointed. While Icon is a really beautiful color (think pillow talk just a bit warmer) and the lippie looks lovely on, it has this micro glitter in it. Which is fine. I dont mind a shimmer done right in a lipstick by all means. But! Its a little bit gritty. Its not bad at all that's not even my main complaint about it. I can deal with that. The issue is, I am left with teeny microscopic glitters all over my upper lip, under my lip, chin, every bit of peach fuzz around my nose and lip area and even over to the cheek. No!! And it clings! This happens when you wipe or dab your mouth or talk! So trying to get the little glitters off destroys your makeup. And youre left with glitter bukkake on your face.  And when you go to remove the icon baby, the glitter is still on your lips it doesnt budge! And its drying its glitter. Im not exactly mad at it, its a very fine glitter, and its very pretty on the lips. But it would have been nice to know that this shade was a different girl than the others so I could've made a better decision to my lipstick desires. I wouldve got Candy Chic or Red Carpet Pink and I will. I will still wear Icon Baby but with caution. Charlotte, you need to properly advertise your glorious lipsticks when theres a weird glitter in ONE shade out of 5. Because you cant see it in the photos either. My only gripe is that. Otherwise the other 2 are fantastic. So if you dont want glitter on your face steer clear of Icon Baby for the lighter pinks and get Candy Chic or red carpet pink instead. This formula and the new pinks are 5 star but i had to knock a star off for no mention of that glitter in icon baby and the problems its caused.",
        "headline": "Bought Three love 2",
        "rating": 4,
        "ugc_id": 508390655
      },
      "faceoff_negative": {
        "comments": "Charlotte Tilbury's \"Icon Baby\" lipstick promises a blend of sophistication and subtlety, and in many ways, it delivers. This warm nude-rose pink shade exudes elegance and refinement, making it an attractive option for those seeking a polished look.\n\nOne of the standout features of this lipstick is its luxurious formula. It glides effortlessly onto the lips, imparting a feeling of indulgence with each application. The texture is smooth and creamy, providing hydration and comfort throughout wear.\n\nHowever, the inclusion of glitter chunks in the formula is a double-edged sword. While they add a touch of sparkle and dimension to the lips, they also pose a downside. For some, myself included, the glitter particles can feel gritty and sandy, detracting from the overall experience. It's akin to having a subtle exfoliant on the lips, which may not be to everyone's liking.\n\nAdditionally, the nude pink hue of \"Icon Baby\" may not be universally flattering. For individuals with olive-colored skin like mine, it didn't quite hit the mark. The shade lacked the desired complement to my complexion, failing to enhance my features as I had hoped.\n\nDespite these drawbacks, the allure of Charlotte Tilbury's lipstick formula persists. For those intrigued by its luxurious feel and sophisticated appeal, I would recommend exploring alternative shades, perhaps opting for a suede finish in a darker hue. This adjustment could offer a more flattering and enjoyable experience for those seeking a Charlotte Tilbury lipstick to call their own.",
        "headline": "Glitter explosion!",
        "rating": 3,
        "ugc_id": 506576417
      },
      "native_review_count": 44,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 232,
      "locale": "en_US"
    }
  }
}