{
  "product_id": "pimprod2044488",
  "product_url": "https://www.ulta.com/p/charlottes-magic-hydration-revival-cleanser-pimprod2044488",
  "extracted_at": "2025-09-23T03:32:40.655503+00:00",
  "product_name": "Charlotte TilburyCharlotte's Magic Hydration Revival Cleanser",
  "brand": "Charlotte Tilbury",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wash"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "30.00",
  "availability": "in_stock",
  "rating_avg": "4.6",
  "rating_count": "471",
  "images": [
    "https://media.ulta.com/i/ulta/2621968?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2621968?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2621968_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2621968_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2621968_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2621968_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2621968_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2621968_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2621968_alt07?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryCharlotte's Magic Hydration Revival Cleanser deeply cleanses, gently removes makeup, and instantly hydrates without stripping or drying.",
  "details": "DetailsBenefits3-in-1 cleanserReduces the look of poresImproves the appearance of tone and texturePlumps skin with hydration that continues post-cleanse, even after rinsingResearch ResultsInstant results: Skin is immediately 2x more hydrated + stays hydrated for up to 24 hours*In just 1 week: Skin feels instantly revived and appears 97% clearer + smoother in 7 days*In just 2 weeks: Skin looks glowing + radiant in 7 days and pores appear reduced by 4x in 14 days**Tested on 33 peopleKey IngredientsHydrating Hyaluronic Acid: Powerful hydration for smoother, plumper looking skinSkin-Smoothing Peptide Complex: Reduces the apperance of pores and refines skin tone appearanceBiomimetic Barrier Shield Technology: Protects and replenishes the skin barrier to prevent water lossItem 2621968How To UseAs a cleanser:Apply a small amount to the palm of the hand.Add a couple of drops of water then gently rub hands together.Apply evenly across the face and massage into skin.Use AM + PM to deeply cleanse, purify and melt away all makeup + impurities.For best results, use Charlotte's Magic Cream or Magic Water Cream after Charlotte's Magic Hydration Revival Cleanser for immediate skin revival and the perfect base for makeup.IngredientsAqua/Water/Eau, Glycerin, Sodium Cocoyl Glycinate, Disodium Cocoyl Glutamate, Citric Acid, Decyl Glucoside, Glyceryl Stearate Se, Sodium Cocoyl Glutamate, Sodium Benzoate, Glycol Distearate, Pentylene Glycol, Cetyl Hydroxyethylcellulose, Hydrolyzed Cottonseed Protein, Fructose, Sodium Hydroxide, Urea, Parfum (Fragrance), Opuntia Ficus-Indica Stem Extract, Tetrasodium Glutamate Diacetate, Allantoin, Maltose, Sodium Chloride, Sodium Lactate, Sodium PCA, Trehalose, Sodium Hyaluronate, Phenoxyethanol, Aloe Barbadensis Leaf Juice Powder, Butyrospermum Parkii (Shea) Butter, Sodium Ascorbyl Phosphate, Tocopheryl Acetate, Camellia Oleifera (Camellia) Seed Oil, Rosa Canina Fruit Oil, Helianthus Annuus (Sunflower) Seed Oil, Disodium EDTA, Potassium Sorbate, Disodium Phosphate, Hydrated Silica, Glucose, Silica Dimethyl Silylate, Sodium Phosphate, Plumeria Rubra Flower Extract, Tocopherol, Hexyl Cinnamal, Benzyl Benzoate.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "As a cleanser:Apply a small amount to the palm of the hand.Add a couple of drops of water then gently rub hands together.Apply evenly across the face and massage into skin.Use AM + PM to deeply cleanse, purify and melt away all makeup + impurities.For best results, use Charlotte's Magic Cream or Magic Water Cream after Charlotte's Magic Hydration Revival Cleanser for immediate skin revival and the perfect base for makeup.",
  "ingredients": [
    "Aqua/Water/Eau",
    "Glycerin",
    "Sodium Cocoyl Glycinate",
    "Disodium Cocoyl Glutamate",
    "Citric Acid",
    "Decyl Glucoside",
    "Glyceryl Stearate Se",
    "Sodium Cocoyl Glutamate",
    "Sodium Benzoate",
    "Glycol Distearate",
    "Pentylene Glycol",
    "Cetyl Hydroxyethylcellulose",
    "Hydrolyzed Cottonseed Protein",
    "Fructose",
    "Sodium Hydroxide",
    "Urea",
    "Parfum (Fragrance)",
    "Opuntia Ficus-Indica Stem Extract",
    "Tetrasodium Glutamate Diacetate",
    "Allantoin",
    "Maltose",
    "Sodium Chloride",
    "Sodium Lactate",
    "Sodium PCA",
    "Trehalose",
    "Sodium Hyaluronate",
    "Phenoxyethanol",
    "Aloe Barbadensis Leaf Juice Powder",
    "Butyrospermum Parkii (Shea) Butter",
    "Sodium Ascorbyl Phosphate",
    "Tocopheryl Acetate",
    "Camellia Oleifera (Camellia) Seed Oil",
    "Rosa Canina Fruit Oil",
    "Helianthus Annuus (Sunflower) Seed Oil",
    "Disodium EDTA",
    "Potassium Sorbate",
    "Disodium Phosphate",
    "Hydrated Silica",
    "Glucose",
    "Silica Dimethyl Silylate",
    "Sodium Phosphate",
    "Plumeria Rubra Flower Extract",
    "Tocopherol",
    "Hexyl Cinnamal",
    "Benzyl Benzoate"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "dewy",
      "long-wear",
      "creamy",
      "powdery",
      "cream",
      "oil"
    ],
    "ingredients": [
      "fragrance"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "hydrating",
      "brightening"
    ]
  },
  "reviews": {
    "product_id": "pimprod2044488",
    "total_reviews": 471,
    "reviews": [
      {
        "review_id": 554292726,
        "rating": 2,
        "headline": "I would not buy this product again",
        "comments": "I absolutely love all of Charlotte Tilbury face care products, except this cleanser. It is very harsh my skin started burning as soon as I started rubbing it in my cheeks. It almost felt like I had small cuts on my skin or something. I left it for about another minute to see if the burning subsided, but it only got worse. I will admit it deeply, deeply cleans your face and strips it of any oils as well which I didn't like. My face was left tight as a drum, red as a beet and the next day I broke out (mind you I never have acne) I had pimples all on my cheeks. All in all it was way too harsh for my skin.",
        "nickname": "Michelle",
        "location": "MD",
        "created_date": 1748630128885,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 546745688,
        "rating": 3,
        "headline": "No",
        "comments": "I can't explain but I don't like it.",
        "nickname": "Liliana",
        "location": "Oregon",
        "created_date": 1739646050654,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 3
      },
      {
        "review_id": 538411241,
        "rating": 5,
        "headline": "Good cleanser",
        "comments": "Good cleanser",
        "nickname": "Darlena",
        "location": "Blackville",
        "created_date": 1732316315810,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 513209406,
        "rating": 3,
        "headline": "I'm Conflicted",
        "comments": "Okay, so, I do think it is much more hydrating than any other cleanser I've tried. I love the texture/consistency; it's super creamy. The smell is a little weird - it kind of reminds me of old-school Olay or something. But my main gripe is that it BURNS!!! It burns like a chemical peel! For face wash?? WHY?!?! That part is so off-putting, because I just don't understand why or how a hydrating cleanser burns like an acid??\n\nTL;DR: It works, but weirdly stings.",
        "nickname": "Susie",
        "location": "Indiana",
        "created_date": 1715092294345,
        "bottom_line": "No",
        "helpful_votes": 8,
        "not_helpful_votes": 1
      },
      {
        "review_id": 510149334,
        "rating": 5,
        "headline": "Love this product",
        "comments": "Totally recommended, after using it your skin feels soft, clean, fresh and with less noticeable pores.",
        "nickname": "Carlerly",
        "location": "Fredericksburg, VA",
        "created_date": 1711784944623,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 5,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        5,
        9,
        32,
        88,
        337
      ],
      "review_histogram": [
        5,
        9,
        32,
        88,
        337
      ],
      "rating_count": 471,
      "review_count": 471,
      "average_rating": 4.58,
      "recommended_ratio": 0.25,
      "media": [],
      "faceoff_positive": {
        "comments": "Ooooh this stuff is exactly what a toy is to a kid, for an adult! Luxury in a bottle! The smoothest, cleanest, perfectly enhanced cleanser! Now that my excitement is out of the bag, I'd like to just rave on how wonderful this cream to foam to milk cleanser is! It goes on nice and thin as the cream part, you massage it into your skin and watch it magically turn to a foamy kind of wash, continue massaging and then it becomes a kind of thick milky texture. As the consistency's change, you can feel how each layer does something different. It's like, at first you are prepping for a clean.. and then it goes to actually cleaning, and finishes with a moisturizing and hydrating touch. At the end, your skin is plumped up, glowing, and oh so smooth! It even smells clean.. with maybe a faint hint of roses. It has no problems removing all the makeup and pollution, and left my skin feeling and looking way better than it did at the start! Some additional pros for using this includes how it makes your pores look reduced, and leaves a glow in its place. The longer you use this product, the better your skin looks and feels! You use this in the AM and the PM, you just apply and rinse with warm water. That's it, that's all for the most beautiful skin you could possibly have! Definitely give this a try and prepare to be amazed!",
        "headline": "The best cleanser!",
        "rating": 5,
        "ugc_id": 511616299
      },
      "faceoff_negative": {
        "comments": "I received this product for free from Influenster and Charlotte Tilbury in exchange for my honest review. \n\nI've luckily been able to try out a few of Charlotte Tilbury's products (all makeup) and have loved them all! This was the first time I tried a skincare item so had very high expectations. \n\nThe pros:\n• It comes with a safety seal, which is super important to me with skincare. \n• It has a pleasant scent (but those who dislike scented skincare, may not like this cleanser). \n• It removed all of my makeup (I was not wearing eye makeup so am unable to comment on how well it does removing eye makeup). \n• I like that it goes from cream to foam to milk. \n\nBUT, I have to get to the cons. The con's definitely outweigh the pros and I won't be using this again. \n\nAs soon as I put it on my dry skin (before even adding the warm water to make it foamy), my skin started burning! But only in certain areas, it was very, very odd. And then as soon as I removed it, a large red bump appeared on my face. I have never had this happen with a cleanser before, and I have tried a LOT!! It also left my skin feeling super dry and stripped afterwards. \n\nUnfortunately, I will not be using this again. Everyone's skin is different! Mine is fairly sensitive, but I have never had a reaction like this before. Super bummed BUT this does not change my opinion on Charlotte Tilbury's products. There might just be an ingredient in this specific cleanser that doesn't agree with my skin.",
        "headline": "I really wanted to love this!!",
        "rating": 3,
        "ugc_id": 511615789
      },
      "name": "Charlotte's Magic Hydration Revival Cleanser",
      "native_review_count": 5,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 466,
      "locale": "en_US"
    }
  }
}