{
  "product_id": "pimprod2043312",
  "product_url": "https://www.ulta.com/p/daily-glow-toner-with-niacinamide-pimprod2043312",
  "extracted_at": "2025-09-23T03:43:41.268920+00:00",
  "product_name": "Charlotte TilburyDaily Glow Toner with Niacinamide",
  "brand": "Charlotte Tilbury",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Toner"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "toner"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "55.00",
  "availability": "in_stock",
  "rating_avg": "4.5",
  "rating_count": "143",
  "images": [
    "https://media.ulta.com/i/ulta/2619574?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2619574?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619574_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619574_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619574_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619574_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619574_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619574_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2619574_alt07?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryCharlotte Tilbury's Daily Glow Toner with Niacinamide is a daily, acid-free toner for all skin types that gently and effectively exfoliates skin to reduce the appearance of pores.",
  "details": "DetailsBenefitsGood for: Pores, Dryness, Redness.Skin Type: Normal, Dry, Combination, and Oily.Niacinamide.While most acid toners can't be used daily, Daily Glow Toner was formulated so that it can be used every day without the concern of irritation.It's acid-free, gentle, and suitable for sensitive skin. It leaves skin feeling gently exfoliated to reveal visibly glowing, glass-like skin.Key IngredientsExfolactive - Prickly Pear Extract: Helps boost skin's natural exfoliation process.Peptides: Visibly brighten for a more even-looking complexion.Niacinamide: Smooths and visibly refines pores.Research ResultsIn a clinical trial of 100 people over 4 weeks:93% agree pores appear unclogged93% agree skin looks glowing91% agree skin feels gently resurfacedItem 2619574How To UseApply AM and PM to clean, dry skin using a cleansing pad, or press on using your hands.Follow with Magic skincare (sold separately).Avoid the eye area.IngredientsAqua/Water/Eau, Propanediol, Niacinamide, Silica, Isopentyldiol, Phenoxyethanol, Glycerin, Benzyl Alcohol, Dicaprylyl Ether, Butyrospermum Parkii (Shea) Butter, Carbomer, Parfum (Fragrance), Sodium Hyaluronate, Trisodium Ethylenediamine Disuccinate, Hydrolyzed Opuntia Ficus-Indica Flower Extract, Sodium Hydroxide, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Hydrogenated Lecithin, Citrus Aurantium Bergamia (Bergamot) Peel Oil, Trifolium Pratense (Clover) Flower Extract, Citrus Limon (Lemon) Peel Oil, Phenethyl Alcohol, Ethylhexylglycerin, Maltodextrin, Pentapeptide-48, Tocopherol, Limonene, Citronellol, Geraniol, Linalool, Citral, Eugenol.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Apply AM and PM to clean, dry skin using a cleansing pad, or press on using your hands.Follow with Magic skincare (sold separately).Avoid the eye area.",
  "ingredients": [
    "Aqua/Water/Eau",
    "Propanediol",
    "Niacinamide",
    "Silica",
    "Isopentyldiol",
    "Phenoxyethanol",
    "Glycerin",
    "Benzyl Alcohol",
    "Dicaprylyl Ether",
    "Butyrospermum Parkii (Shea) Butter",
    "Carbomer",
    "Parfum (Fragrance)",
    "Sodium Hyaluronate",
    "Trisodium Ethylenediamine Disuccinate",
    "Hydrolyzed Opuntia Ficus-Indica Flower Extract",
    "Sodium Hydroxide",
    "Acrylates/C10-30 Alkyl Acrylate Crosspolymer",
    "Hydrogenated Lecithin",
    "Citrus Aurantium Bergamia (Bergamot) Peel Oil",
    "Trifolium Pratense (Clover) Flower Extract",
    "Citrus Limon (Lemon) Peel Oil",
    "Phenethyl Alcohol",
    "Ethylhexylglycerin",
    "Maltodextrin",
    "Pentapeptide-48",
    "Tocopherol",
    "Limonene",
    "Citronellol",
    "Geraniol",
    "Linalool",
    "Citral",
    "Eugenol"
  ],
  "extended_contents": {},
  "tags": {
    "product_type": [
      "cleanser",
      "toner"
    ],
    "skin_type": [
      "oily",
      "dry",
      "combination",
      "sensitive",
      "normal",
      "all skin types"
    ],
    "finish": [
      "dewy",
      "creamy",
      "oil"
    ],
    "ingredients": [
      "niacinamide",
      "peptides",
      "fragrance"
    ],
    "brand": [
      "mid-range",
      "premium"
    ],
    "special_features": [
      "natural",
      "soothing",
      "purifying"
    ],
    "category": []
  },
  "reviews": {
    "product_id": "pimprod2043312",
    "total_reviews": 143,
    "reviews": [
      {
        "review_id": 528364863,
        "rating": 5,
        "headline": "Love this Toner by CT !!",
        "comments": "Charlotte Tilbury Skincare for the win! This Toner brightens & makes my skin so glowy & dewy, under makeup, or alone on no makeup days! My skin feels hydrated & fresh when I use it. highly recommend! Thx So Much !!:)",
        "nickname": "mofitzy",
        "location": "Wickliffe ohio",
        "created_date": 1724463870064,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 511553009,
        "rating": 5,
        "headline": "Good toner",
        "comments": "Decent price, great product. Doesn't leave my skin feeling dry or too oily. I have only used for about 2 weeks now so I will continue using it and update with progress or to see if I would recommend buying again in the next 2 months or however long the product will last.",
        "nickname": "Lori",
        "location": "Cape Coral fl",
        "created_date": 1713304195609,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 509744848,
        "rating": 2,
        "headline": "Burning feeling when applied!",
        "comments": "Holy heck. Shocked by the reviews and wondering how I am the only one to experience a severe burning sensation on my cheeks / nose area after applying. I have to breathe through it ha however, it does not leave me red. I am on day 3 of using this (with Charlotte face cleanser and moisturizer) and am hoping it's just burning from my skin being irritated and dry prior to starting this. BUT if it does not stop burning when using after a week, I have to return as it is incredibly painful.",
        "nickname": "Christie",
        "location": "CT",
        "created_date": 1711410926011,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 3
      },
      {
        "review_id": 508471450,
        "rating": 3,
        "headline": "Nothing much to write home about, considering the price.",
        "comments": "This toner was disappointing. Its consistency was thick and greasy, and it didn't improve my skin's appearance much. Plus, I didn't like its scent.",
        "nickname": "Lissa",
        "location": "Albuquerque, NM",
        "created_date": 1710432944037,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 2
      },
      {
        "review_id": 507621137,
        "rating": 5,
        "headline": "SOOOO AMAZING",
        "comments": "I WILL ALWAYS REPURCHASES THIS IT IS AMAZING",
        "nickname": "Rose",
        "location": "Canada",
        "created_date": 1709707204304,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 5,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        2,
        4,
        13,
        33,
        91
      ],
      "review_histogram": [
        2,
        4,
        13,
        33,
        91
      ],
      "rating_count": 143,
      "review_count": 143,
      "average_rating": 4.45,
      "recommended_ratio": 0.67,
      "media": [],
      "faceoff_positive": {
        "comments": "I've been enjoying using the Charlotte Tilbury Glow Toner. I like that it uses prickly pear extract to exfoliate the skin instead of acids. It's a nice change from the other toners I typically use. As a result I can use it daily without worrying about any skin irritation. It also contains sodium hyaluronate for hydration, which I like since it can penetrate deeper into the skin than hyaluronic acid. The toner itself has a soft milky texture and I find it has a thicker consistency than a usual toner formula. It feels refreshing when applied and leaves your skin with an incredibly soft and smooth velvetly feel to the touch. I prefer to use my hands to apply this and gently press it into my skin. I find if I try using a cotton pad it just sucks up too much of the product. The only issue I have with this toner is the scent. I have no idea why they would choose to make this have such a strong floral fragrance. Luckily it doesn't seem to linger too long once applied. Overall though I'm pleased and will definitely continue using this toner.",
        "headline": "Soft skin",
        "rating": 4,
        "ugc_id": 498877831
      },
      "faceoff_negative": {
        "comments": "First, I found this product to be heavily fragranced which doesn't mix well with my sensitive skin. With an exfoliating toner, something already pretty rough on the skin, I would've preferred no fragrance. \n\nInitially I thought this toner would be like a Korean toner, one to be patted into the skin with just your hands. I tried using a cotton pad with it but found the stopper too restricting to get enough product out. I also felt like it wasn't emollient enough to soak and soften the cotton pad. Rubbing the pad across my skin felt harsh and unpleasant. I switched over to my hands and perhaps that's why it didn't work for me. \n\nI just found it irritated my skin and caused further redness flareups. I even slowly introduced it into my skin care routine and cut out all other exfoliating products. I have tested it for several months and still, nothing good has changed with my skin while using this product. \n\nI also want to caution people purchasing this based off of the \"clinically backed\" science. The pool of people who tested this product is very, very small and they tested it for a short amount of time. I'd be dubious about this products claims and caution anyone with sensitive skin to steer clear. \n\nI received this gifted product from Influenster in exchange for my full and honest review.",
        "headline": "I don't think it did a thing",
        "rating": 1,
        "ugc_id": 498877803
      },
      "name": "Daily Glow Toner with Niacinamide",
      "native_review_count": 5,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 138,
      "locale": "en_US"
    }
  }
}