{
  "product_id": "pimprod2048700",
  "product_url": "https://www.ulta.com/p/all-about-eyes-brightening-serum-concentrate-with-retinoid-pimprod2048700",
  "extracted_at": "2025-09-23T03:16:02.201997+00:00",
  "product_name": "CliniqueAll About Eyes Brightening Serum Concentrate with Retinoid",
  "brand": "Clinique",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Serums"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "serums"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "49.00",
  "availability": "in_stock",
  "rating_avg": "4.4",
  "rating_count": "456",
  "images": [
    "https://media.ulta.com/i/ulta/2632281?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2632281?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2632281_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2632281_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2632281_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2632281_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2632281_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2632281_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2632281_alt07?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsSustainable PackagingClinique's All About Eyes Brightening Serum Concentrate is an instant eye brightener that helps target the look of dark circles and puffiness.",
  "details": "DetailsBenefitsBrightens, depuffs, hydrates.Visibly brightening eye serum formulated with potent retinoid, yet still gentle enough for the eye area.Precision applicator created with Clinique’s guiding dermatologist helps target hard-to-reach areas under the eye.Instantly brightens the appearance of the undereye area for more wide-awake-looking eyes.Reduces the appearance of dark circles over time.Helps smooth the look and feel of skin.Massaging the eye area with the applicator helps reduce the look of puffiness.Metal tip feels cool on skin.Ophthalmologist tested.Free of drying alcohol, fragrance, oil, parabens, phthalates, sodium lauryl sulfate, sodium laureth sulfate, and synthetic color.Dermatologist tested. Allergy tested. 100% fragrance free.Key IngredientsRetinoid: Helps accelerate skin’s natural cell renewal for a visibly smoother eye area.Vitamin C: Helps reduce the look of dark circles with continued use.Hyaluronic acid: This moisture-binding ingredient helps create a “moisture reservoir” for ideal hydration. Clinique’s formula is expertly blended with two different molecular weights of hyaluronic acid.Research Results94% show an instant radiance boost.**Clinical testing on 44 women after using the product one time.Item 2632281How To UseGently massage under eye with applicator.To start: use 3x a week at night.Week 2: Use every night.Week 3 and after: use 2x daily.Use sunscreen and limit sun exposure while using and the week after. Avoid getting in eyes. Do not use with other retinol products.IngredientsWater\\Aqua\\Eau, Dimethicone, Polyethylene, Isododecane, Peg/Ppg-18/18 Dimethicone, Butylene Glycol, Glycerin, Propanediol, Trisiloxane, Sodium Chloride, Acetyl Glucosamine, Ascorbyl Glucoside, Sodium Hyaluronate, Caffeine, Yeast Extract\\Faex\\Extrait De Levure, Trametes Versicolor Extract, Camellia Sinensis Leaf Extract, Salicylic Acid, Dimethoxytolyl Propylresorcinol, Hydroxypinacolone Retinoate, Sodium Acetylated Hyaluronate, Caprylyl Glycol, Synthetic Fluorphlogopite, Tin Oxide, Propylene Glycol Caprylate, Dimethyl Isosorbide, Sodium Phosphate, Disodium Phosphate, Polysilicone-11, Potassium Hydroxide, Hydroxyacetophenone, Tocopheryl Acetate, Bht, Resveratrol, Disodium Edta, Phenoxyethanol, Sodium Benzoate, Potassium Sorbate, Titanium Dioxide (Ci 77891).Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Gently massage under eye with applicator.To start: use 3x a week at night.Week 2: Use every night.Week 3 and after: use 2x daily.Use sunscreen and limit sun exposure while using and the week after. Avoid getting in eyes. Do not use with other retinol products.",
  "ingredients": [
    "Water\\Aqua\\Eau",
    "Dimethicone",
    "Polyethylene",
    "Isododecane",
    "Peg/Ppg-18/18 Dimethicone",
    "Butylene Glycol",
    "Glycerin",
    "Propanediol",
    "Trisiloxane",
    "Sodium Chloride",
    "Acetyl Glucosamine",
    "Ascorbyl Glucoside",
    "Sodium Hyaluronate",
    "Caffeine",
    "Yeast Extract\\Faex\\Extrait De Levure",
    "Trametes Versicolor Extract",
    "Camellia Sinensis Leaf Extract",
    "Salicylic Acid",
    "Dimethoxytolyl Propylresorcinol",
    "Hydroxypinacolone Retinoate",
    "Sodium Acetylated Hyaluronate",
    "Caprylyl Glycol",
    "Synthetic Fluorphlogopite",
    "Tin Oxide",
    "Propylene Glycol Caprylate",
    "Dimethyl Isosorbide",
    "Sodium Phosphate",
    "Disodium Phosphate",
    "Polysilicone-11",
    "Potassium Hydroxide",
    "Hydroxyacetophenone",
    "Tocopheryl Acetate",
    "Bht",
    "Resveratrol",
    "Disodium Edta",
    "Phenoxyethanol",
    "Sodium Benzoate",
    "Potassium Sorbate",
    "Titanium Dioxide (Ci 77891)"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "serum",
      "mask",
      "treatment",
      "eye cream"
    ],
    "skin_type": [
      "dry",
      "sensitive"
    ],
    "finish": [
      "sheer",
      "creamy",
      "oil"
    ],
    "ingredients": [
      "salicylic-acid",
      "synthetic"
    ],
    "brand": [
      "luxury",
      "mid-range"
    ],
    "special_features": [
      "natural",
      "dermatologist-tested",
      "hypoallergenic",
      "fragrance-free",
      "brightening",
      "soothing"
    ]
  },
  "reviews": {
    "product_id": "pimprod2048700",
    "total_reviews": 456,
    "reviews": [
      {
        "review_id": 557012716,
        "rating": 5,
        "headline": "Clinique All About Eyes Brightening Serum Concentrate",
        "comments": "I LOVE this product. My eye wrinkles vanished!",
        "nickname": "Lynn",
        "location": "Quad-city area, IA",
        "created_date": 1752333855797,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551226364,
        "rating": 5,
        "headline": "Love it",
        "comments": "It really helps with the puppy eyes &:dark circles.  But expensive!",
        "nickname": "",
        "location": "Pooler GA",
        "created_date": 1744133514625,
        "bottom_line": "No",
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 551156615,
        "rating": 5,
        "headline": "I would buy this product again",
        "comments": "I underestimated this product! I have been using it going on 2 weeks and I most definitely see a reduction of fine lines under my eyes. Totally recommended.",
        "nickname": "Gio",
        "location": "Connecticut",
        "created_date": 1744041027662,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549265017,
        "rating": 5,
        "headline": "Yes",
        "comments": "Great product.",
        "nickname": "Brigitte",
        "location": "Dover NH",
        "created_date": 1742314556616,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 548867653,
        "rating": 5,
        "headline": "I will buy this product again",
        "comments": "It seems to be working. Time will tell",
        "nickname": "linda",
        "location": "MO",
        "created_date": 1742140761550,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547709412,
        "rating": 5,
        "headline": "Puffy eyes",
        "comments": "The roller ball is cooling to the under eye and helps with red and puffy eye. I really like it.",
        "nickname": "Jackie",
        "location": "Garden City, mi",
        "created_date": 1741128570987,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547534008,
        "rating": 2,
        "headline": "BURNS",
        "comments": "I really wanted to like this product because I did notice a difference after using it but as soon as I put it on my undereye area burned. I kept using it to see if the burning would cease but it did not.",
        "nickname": "LB",
        "location": "Charlotte, NC",
        "created_date": 1740787625343,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 546114081,
        "rating": 2,
        "headline": "not that good",
        "comments": "didn't do that much and cost too much",
        "nickname": "marsha",
        "location": "little rock",
        "created_date": 1739048647805,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 546058043,
        "rating": 2,
        "headline": "Mica or shimmer?",
        "comments": "I dont like anything with glitter or shimmer, so i always check ingredients lists. I dont see Mica on the list of ingredients… but something in this is putting very tiny glitter on my face.",
        "nickname": "Lainey",
        "location": "Washington",
        "created_date": 1738909683097,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 545800745,
        "rating": 4,
        "headline": "Lightens dark circles",
        "comments": "It seems to be lightening dark under eye circles and it is used judicially in small amounts.",
        "nickname": "Patty",
        "location": "Denver",
        "created_date": 1738443688229,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 544122972,
        "rating": 4,
        "headline": "Can burn initially but a good product",
        "comments": "This can sting upon the first couple uses. Takes some getting used to but I do see a difference in terms of tightness around my eyes",
        "nickname": "Elizabeth",
        "location": "Montvale NJ",
        "created_date": 1737741864247,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542088174,
        "rating": 4,
        "headline": "Good eye cream",
        "comments": "I like that this has a cooling ball shaped aplicator to cool and depuff eyes while rubbing the cream into your skin. This makes it super easy to use. I don't think the retinoid level is that high because I started using it 2x daily right away and it didn't irritate my skin. It says to start off only using at night and work your way up, but I don't think you need to. The tube is travel friendly too!",
        "nickname": "artimake",
        "location": "WV",
        "created_date": 1735741002414,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542058897,
        "rating": 5,
        "headline": "I like it",
        "comments": "Got this a few weeks ago before launch and I like it. I've noticed a difference in the smoothness of my undereye as well as the metal tip feels good on my skin. Also, my makeup tends to sit better now that I'm using this in my regular routine.",
        "nickname": "Sasha",
        "location": "California",
        "created_date": 1735667583790,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542026787,
        "rating": 5,
        "headline": "Worth",
        "comments": "The design of the applicator is convenient and clean, I don't need to use my hands to apply the cream evenly to the eye area anymore, I will use it directly, both cleaning and massaging my eyes with a cool metal piece.\nThe cream is liquid, easy to absorb, does not leave a greasy feeling.\nThe effect of brightening the eye area is immediate, but the effect of reducing dark circles and eye bags needs a longer time for me to test.\nOverall, I like this product, and I will persist in using it to prove its effect.\nThe cream is odorless, suitable for those who like odorless natural skin care products\nThe cream tube is compact, easy to carry with you.\nWorth the money",
        "nickname": "Clover",
        "location": "MA",
        "created_date": 1735594925924,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 14,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        5,
        15,
        50,
        118,
        268
      ],
      "review_histogram": [
        5,
        15,
        50,
        118,
        268
      ],
      "rating_count": 456,
      "review_count": 456,
      "average_rating": 4.38,
      "recommended_ratio": 0.9,
      "media": [
        {
          "id": "542026795",
          "review_id": 542026787,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/iorxr4lsx3tq4jm3qaby.jpg",
          "headline": "Worth",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Clover",
          "created_date": 1735594925924
        }
      ],
      "faceoff_positive": {
        "comments": "Clinique All About Eyes Brightening Serum: My Secret for Radiant, Refreshed Undereyes\n\nLet me just say, the Clinique All About Eyes Brightening Serum has completely elevated my skincare routine. I've been on the hunt for something that could tackle my tired-looking undereyes without irritating my sensitive skin, and this serum has been such a joy to use.\n\nFrom the first application, I noticed how cooling the metal tip feels—honestly, it's like a mini spa treatment every morning. That precision applicator not only helps with targeting those tricky areas but also delivers the most soothing massage that visibly depuffs my undereyes. After using it consistently for a few weeks, I've fallen in love with the improvement I've seen in my undereye area. The skin looks so much brighter and smoother, and those pesky dark circles I thought I'd never get rid of? They've faded significantly.\n\nThe formula itself is such a thoughtful blend. The retinoid is incredibly gentle (something I was nervous about for my delicate eye area), yet I can tell it's working to smooth and refine the skin texture. The inclusion of vitamin C feels like the cherry on top, helping to tackle those stubborn dark circles. And let's not forget the hyaluronic acid duo! My undereyes feel so plump and hydrated—it's like this serum has created a protective moisture cushion for my skin.\n\nOne of my favorite things about this serum is how lightweight and refreshing it is. It absorbs quickly, leaving no greasy residue, and it layers beautifully under makeup. Plus, knowing it's free of fragrance, oil, and all those potentially irritating ingredients makes me trust it even more.\n\nIf your undereye area needs some TLC—whether you're battling puffiness, dark circles, or just want a hydration boost—this serum is worth every penny. It's gentle yet effective, luxurious yet practical. I can't recommend it enough for anyone looking to brighten and refresh their eye area.",
        "headline": "My secretary, refreshed under eyes",
        "rating": 5,
        "ugc_id": 542667913
      },
      "faceoff_negative": {
        "comments": "One of the standout features of this serum is its gentle, non-irritating formula, which makes it an excellent choice for those with sensitive eyes like myself. The texture is also noteworthy - it's lightweight, smooth, and absorbs quickly into the skin without leaving any residue.\nHowever, despite using the serum consistently, I unfortunately didn't notice any significant brightening or improvement in the appearance of my under-eye area. I was expecting a more noticeable reduction in dark circles and puffiness, but sadly, I didn't see any substantial difference.\nIt's possible that my expectations were too high, or that my under-eye concerns are more deep-seated and require a more intense treatment. Nevertheless, I was hoping for a more dramatic result from a product with \"brightening\" in its name.\nOverall, I would recommend the Clinique All About Eyes Brightening Serum Concentrate to those with sensitive eyes who are looking for a gentle, non-irritating serum. However, if you're seeking a product that will make a significant impact on dark circles, puffiness, or under-eye brightness, you might want to explore other options.",
        "headline": "Good serum for sensitive eyes",
        "rating": 3,
        "ugc_id": 543234870
      },
      "name": "All About Eyes Brightening Serum Concentrate with Retinoid",
      "native_review_count": 14,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 442,
      "locale": "en_US"
    }
  }
}