{
  "product_id": "pimprod2051007",
  "product_url": "https://www.ulta.com/p/even-better-clinical-vitamin-makeup-broad-spectrum-spf-45-foundation-pimprod2051007",
  "extracted_at": "2025-09-23T03:51:21.163634+00:00",
  "product_name": "CliniqueEven Better Clinical Vitamin Makeup Broad Spectrum SPF 45 Foundation",
  "brand": "Clinique",
  "categories": [
    "Home",
    "Makeup",
    "Face",
    "Foundation"
  ],
  "category_keys": [
    "home",
    "makeup",
    "face",
    "foundation"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "48.00",
  "availability": "in_stock",
  "rating_avg": "4.4",
  "rating_count": "479",
  "images": [
    "https://media.ulta.com/i/ulta/2637158?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2637158?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637158_sm?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637158_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637158_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637158cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637158cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637158cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637158cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2637158cm_vid01/thumbs/8c88b25d-5576-4b55-880b-2ee4a89a5970?w=600&h=337&fmt=auto",
    "https://media.ulta.com/v/ulta/2637158cm_vid02/thumbs/872da41d-04b9-4c72-93d3-f5d1cc514614?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsSustainable PackagingHSA/FSA eligibleClinique Even Better Clinical Vitamin Makeup SPF 45 is a lightweight, vitamin-rich liquid foundation for more vibrant, healthy-looking skin.",
  "details": "DetailsBenefitsSkin Types: Dry, Dry Combination, Combination OilyOil-free liquid foundation delivers light coverage and a vibrant finish that leaves skin with a natural, healthy radiance.Vitamin-Powered Formula: This dermatologist-tested formula is rich in vitamins that help support skin's natural energy, brighten, and defend for more radiant, healthy-looking bare skin over time.Luxurious Feel: Weightless, hydrating formula blends effortlessly and melts into skin for a smooth application.Sun Protection: SPF 45 helps protect skin from future sun damage.Flexible Shades: Light coverage means that each shade can flex across different skin tones.12-hour wear. Color true. Non-streaking. Non-caking. Non-settling.12-hour hydration.8-hour antioxidant defense: With antioxidants to help defend against environmental aggressors, including blue light, infrared and pollution. (Clinical testing on 21 women after one application.)Waterproof. Sweat and humidity resistant.Oil-free.Non-comedogenic.No grey cast.Free Of: Parabens, phthalates, oil, synthetic colors, sodium lauryl sulfate, sodium laureth sulfate.Ophthalmologist tested. Safe for sensitive eyes. Safe for contact lens wearers.Dermatologist tested. Safe for sensitive skin.Allergy tested. 100% fragrance free.Tested on all skin tones.Key Ingredients4% vitamin B3: Helps support skin's natural energy.5 forms of vitamin C: Provide multi-action benefits. Two forms help visibly brighten skin and three forms help provide antioxidant defense, with different rates of penetration to the skin's surface.Vitamin E: Helps provide antioxidant defense for the lipid barrier.SPF 45: A combination of physical sunscreens that reflect UV away from skin, and chemical sunscreens that capture UV rays.Research ResultsIn 1 week: 96% say skin looks more vibrant.*In 2 weeks: Bare skin looks healthier and more radiant.**94% showed improvement in hydration on bare skin.**96% showed improvement in moisture barrier strength.****Consumer testing on 165 women after using product for 1 week.**Clinical testing 72 women after 2 weeks of product use.***Clinical testing 27 women after 2 weeks of product use.Item 2637158How To UseStart in center of face, blending foundation outward.Build coverage as needed.Remove with your favorite Clinique makeup remover.IngredientsEnsulizole 2.7%, Octinoxate 6.7%, Octisalate 4.5%, Zinc Oxide 7.7%Ingredients: Water\\Aqua\\Eau, Methyl Trimethicone, Dimethicone, Niacinamide, Neopentyl Glycol Diheptanoate, Phenyl Trimethicone, Glycerin, Tromethamine, Lauryl Peg-9 Polydimethylsiloxyethyl Dimethicone, Hdi/Ppg/Polycaprolactone Crosspolymer, Trimethylsiloxysilicate, Polysilicone-11, Hexyl Laurate, Cetyl Peg/Ppg-10/1 Dimethicone, Butylene Glycol, Ascorbyl Glucoside, Sodium Hyaluronate, Caffeine, Hydrolyzed Wheat Protein/Pvp Crosspolymer, Polyglyceryl-4 Isostearate, Trehalose, Acetyl Glucosamine, Triethyl Citrate, Hydrogenated Coco-Glycerides, Aminopropyl Ascorbyl Phosphate, Dimethicone/Divinyldimethicone/Silsesquioxane Crosspolymer, Polyethylene, Silica, Polymethylsilsesquioxane, Disteardimonium Hectorite, Polyhydroxystearic Acid, Glyceryl Stearate, Cetearyl Alcohol, Ammonium Polyacryloyldimethyl Taurate, Polysorbate 80, Stearic Acid, Polysorbate 20, Lecithin, Hydrogenated Lecithin, Palmitic Acid, Laureth-7, Sodium Phosphate, Disodium Phosphate, Potassium Hydroxide, Stearyl Alcohol, Behenyl Alcohol, Triethoxycaprylylsilane, Ascorbyl Palmitate, Tocopheryl Acetate, Magnesium Ascorbyl Phosphate, Tetrahexyldecyl Ascorbate, Bht, Disodium Edta, Phenoxyethanol, Potassium Sorbate, Sodium Dehydroacetate, [+/- Mica, Titanium Dioxide (CI 77891), Iron Oxides (CI 77491), Iron Oxides (CI 77492), Iron Oxides (CI 77499)].Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Start in center of face, blending foundation outward.Build coverage as needed.Remove with your favorite Clinique makeup remover.",
  "ingredients": [
    "Ensulizole 2.7%",
    "Octinoxate 6.7%",
    "Octisalate 4.5%",
    "Zinc Oxide 7.7%Ingredients: Water\\Aqua\\Eau",
    "Methyl Trimethicone",
    "Dimethicone",
    "Niacinamide",
    "Neopentyl Glycol Diheptanoate",
    "Phenyl Trimethicone",
    "Glycerin",
    "Tromethamine",
    "Lauryl Peg-9 Polydimethylsiloxyethyl Dimethicone",
    "Hdi/Ppg/Polycaprolactone Crosspolymer",
    "Trimethylsiloxysilicate",
    "Polysilicone-11",
    "Hexyl Laurate",
    "Cetyl Peg/Ppg-10/1 Dimethicone",
    "Butylene Glycol",
    "Ascorbyl Glucoside",
    "Sodium Hyaluronate",
    "Caffeine",
    "Hydrolyzed Wheat Protein/Pvp Crosspolymer",
    "Polyglyceryl-4 Isostearate",
    "Trehalose",
    "Acetyl Glucosamine",
    "Triethyl Citrate",
    "Hydrogenated Coco-Glycerides",
    "Aminopropyl Ascorbyl Phosphate",
    "Dimethicone/Divinyldimethicone/Silsesquioxane Crosspolymer",
    "Polyethylene",
    "Silica",
    "Polymethylsilsesquioxane",
    "Disteardimonium Hectorite",
    "Polyhydroxystearic Acid",
    "Glyceryl Stearate",
    "Cetearyl Alcohol",
    "Ammonium Polyacryloyldimethyl Taurate",
    "Polysorbate 80",
    "Stearic Acid",
    "Polysorbate 20",
    "Lecithin",
    "Hydrogenated Lecithin",
    "Palmitic Acid",
    "Laureth-7",
    "Sodium Phosphate",
    "Disodium Phosphate",
    "Potassium Hydroxide",
    "Stearyl Alcohol",
    "Behenyl Alcohol",
    "Triethoxycaprylylsilane",
    "Ascorbyl Palmitate",
    "Tocopheryl Acetate",
    "Magnesium Ascorbyl Phosphate",
    "Tetrahexyldecyl Ascorbate",
    "Bht",
    "Disodium Edta",
    "Phenoxyethanol",
    "Potassium Sorbate",
    "Sodium Dehydroacetate",
    "[+/- Mica",
    "Titanium Dioxide (",
    "Iron Oxides (",
    "Iron Oxides (",
    "Iron Oxides ("
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "makeup",
      "face",
      "cosmetics"
    ],
    "product_type": [
      "sunscreen",
      "foundation"
    ],
    "skin_type": [
      "oily",
      "dry",
      "combination",
      "sensitive"
    ],
    "finish": [
      "dewy",
      "sheer",
      "light coverage",
      "waterproof",
      "creamy",
      "liquid",
      "oil"
    ],
    "ingredients": [
      "niacinamide"
    ],
    "brand": [
      "luxury",
      "mid-range"
    ],
    "special_features": [
      "natural",
      "dermatologist-tested",
      "hypoallergenic",
      "non-comedogenic",
      "fragrance-free",
      "oil-free",
      "spf",
      "hydrating",
      "brightening"
    ]
  },
  "reviews": {
    "product_id": "pimprod2051007",
    "total_reviews": 479,
    "reviews": [
      {
        "review_id": 563406834,
        "rating": 1,
        "headline": "Would not purchase personally!",
        "comments": "This foundation was not good for my skin at all. It dried my skin out so bad !",
        "nickname": "Jennifer",
        "location": "Sc",
        "created_date": 1757956617080,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 563406292,
        "rating": 5,
        "headline": "Love it!",
        "comments": "I've been searching for a new foundation that was really light on my skin, but still had some coverage. This does both of those and more. It is moisturizing, and I love that it has SPF. Highly recommend.",
        "nickname": "April",
        "location": "IN",
        "created_date": 1757955701844,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 563182385,
        "rating": 5,
        "headline": "Clean and Light",
        "comments": "I received a sample and was hooked... Ordered the full size and it was even better.. Light and clean with great coverage without being cakey or thick.",
        "nickname": "Nici",
        "location": "OKC,OK",
        "created_date": 1757529126012,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 562958201,
        "rating": 5,
        "headline": "I would buy this product again.",
        "comments": "I had to get use to the fact that it wasn't very thick, so the thinness surprised me, but I really like the way it feels and looks on my skin.",
        "nickname": "Kim C.",
        "location": "LAS VEGAS, NV",
        "created_date": 1757276160315,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 562477939,
        "rating": 2,
        "headline": "Did not love it",
        "comments": "This provided very little coverage and it pilled on top of my moisturizer. It is probably effective as a sunscreen but beyond that, I just didn't love it.",
        "nickname": "JRinMD",
        "location": "Annapolis, Md",
        "created_date": 1756999178905,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559410503,
        "rating": 3,
        "headline": "Not for me",
        "comments": "The formula of this product is okay, but it doesn't have enough color for me. I tried the medium deep 3, and it was kind of ashy; the other colors did not match my skin either, too dark or too light. I returned it, as I could not work with it.",
        "nickname": "San-D",
        "location": "Detroit, Michigan",
        "created_date": 1754494585571,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559381780,
        "rating": 5,
        "headline": "Great Skin Tint",
        "comments": "I love how this feels on my skin. It has a nice lightweight coverage and not too thick on my skin.",
        "nickname": "Abi",
        "location": "Minneapolis, MN",
        "created_date": 1754446854803,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 557208467,
        "rating": 5,
        "headline": "Best foundation",
        "comments": "I've never liked a foundation this much. Its light, moisturizing yet doesn't feel greasy. I burn very easily and this does a wonderful job protecting my face all day from the sun. Does not make my eyes water like other foundations and sunscreens. My complection looks younger and healthier. Great for fine lines, does not cake in them. The color blends perfectly and doesnt feel like make-up. Looks and feels natural and holds up when i'm sweating and exercising.",
        "nickname": "IMO",
        "location": "Virginia",
        "created_date": 1752538836234,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556784595,
        "rating": 5,
        "headline": "Very good color match and not heavy",
        "comments": "I like it has SPF but isn't heavy",
        "nickname": "Lora",
        "location": "Wadsworth Ohio",
        "created_date": 1751925108386,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556350697,
        "rating": 1,
        "headline": "Not worth the money comes right off",
        "comments": "I bought some because it was recommended by a lady working at that ulta location. I usually buy two faces lightest shade but they were out. It doesn't come in a light enough shade for me. Their lightest shade looks yellow on me. I'm used to not having my shade so that's not the main problem. My problem with the foundation is that I have to put on three to five layers for it to look like foundation. And on top of that I barely tap my nose because it's itching and it comes right off. I wear glasses and if I have my glasses on and they slide down my nose a little bit the part where it touches my nose wipes all of the foundation off. Bottom line is to save your money cause it's not worth that much.",
        "nickname": "Shaye",
        "location": "Cookeville, TN",
        "created_date": 1751499621786,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 2
      },
      {
        "review_id": 556009644,
        "rating": 5,
        "headline": "Good for Mature Skin",
        "comments": "My mom was matched for this foundation and I have to say, it gives her a nice airbrush look for mature skin. I also like that a little goes a long way.",
        "nickname": "Omie",
        "location": "Orlando",
        "created_date": 1751162670816,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555618690,
        "rating": 3,
        "headline": "Not for me",
        "comments": "Loved the color and the moisturizing coverage, but the SPF 45 broke me out.  I'm disappointed.",
        "nickname": "Lisa",
        "location": "FL",
        "created_date": 1750448793605,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555589680,
        "rating": 5,
        "headline": "beautiful tint",
        "comments": "im relatively young compared to most clinique customers (early 20s) so if you have more mature skin my review wont help you, but i really do love this product. it gives an amazing glow and gives me that no-makeup makeup look while also covering my acne scars that ive been looking for for a very long time. it holds up very well when i go on my runs and sweat lots, and when im out in the southern humidity. ive been wearing it to work out outside and have been impressed with how effective the spf protects my skin. it plays with my other makeup products very well.",
        "nickname": "ella",
        "location": "huntsville, al",
        "created_date": 1750397077776,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555096231,
        "rating": 1,
        "headline": "No substitute for previous product as promised",
        "comments": "Promised it was a good replacement for discontinued Even Better Hydrating and Repair. It was a terrible replacement. Absolutely no coverage for freckles, discoloration or age spots. I have to use twice as much. And twice as much powder to counter the stickiness. Clinique has made a teemendous mistake discontinuing the Even Better Hydrating/Repairing. I will be looking elsewhere!",
        "nickname": "Disappointed",
        "location": "Shreveport La",
        "created_date": 1749823487592,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 555096040,
        "rating": 1,
        "headline": "Very Disappointed!!!!",
        "comments": "I was sold this makeup as the replacement for Even Better Refresh Hydrating and Repair which was suddenly discontinued. Big Mistake!!\nNo coverage-have to use twice as much!  Doesnt cover age spots and freckles which i was told it would do!  Extremely disappointed!!  Will not buy Clinique bas makeup again",
        "nickname": "BB",
        "location": "Shreveport La",
        "created_date": 1749823016381,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 554865103,
        "rating": 5,
        "headline": "Approved For The Over 40 Club!",
        "comments": "I'm 41 with dry skin and old acne scars on my cheeks.  Growing up with oily skin and bad acne (two rounds of heavy duty acne treatments), the dewy glowy look did not appeal to me.  While purchasing one Clinique foundation, Hope at the Ulta in Columbus, Oh on Polaris gave me a sample of the Even Better Clinical Vitamin foundation.  She insisted I give it a go and try a lighter coverage, and I'm glad I listened to her, because I ended up purchasing this product real quick.  \nThis is a nice light buildable coverage.  I feel like it does a pretty good job covering my redness after applying a second layer to spots that need it, and it really does feel weightless.  It doesn't feel cakey and does not settle into my fine lines.\nLove that there's a pump on the bottle, so I can control the foundation and keep it clean!  \nClinique really hit the mark with this foundation!",
        "nickname": "Ti",
        "location": "Mairon, OH",
        "created_date": 1749580117366,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554352179,
        "rating": 4,
        "headline": "Exactly what I was looking for!",
        "comments": "I had been looking for a light-coverage moisturizer with SPF and skin benefits, and this is it! I use it after my Clinique moisture surge 100h, and the two pair beautifully. It's definitely water-based, so I think other reviews mentioning cakiness may be using it along with other products that don't pair well. The only con for me is the smell. It smells just like heavy sunscreen.",
        "nickname": "Dee",
        "location": "Kentucky",
        "created_date": 1748749440579,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554302889,
        "rating": 3,
        "headline": "pretty for about 30 minutes.",
        "comments": "I will say this foundation had a perfect shade match for me. it was very glowy and I thought I was going to love it. it broke me out terribly (I'm acne prone with dehydrated skin) and left my face feeling insanely oily but also extremely dry at the same time after about an hour of wear. it did not look how my skin felt though. it stayed looking as it did when I applied it (about 1.5 hours) and faded off pretty evenly. I think it could be good for a normal skin type and for a quick outing if you're not acne prone. I like that it doesn't smell funky.",
        "nickname": "gabby",
        "location": "Florida",
        "created_date": 1748650821875,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554299897,
        "rating": 5,
        "headline": "Foundation",
        "comments": "This was a light foundation, perfect for summer; it also had nice sunscreen",
        "nickname": "Karen",
        "location": "Pooler, GA",
        "created_date": 1748643618887,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554095084,
        "rating": 1,
        "headline": "Returned",
        "comments": "This foundation was awful. Didn't cover anything, didn't make me radiant and even left red bumps on my face. Its expensive ans is so bad, its a shame.",
        "nickname": "Coco",
        "location": "VA",
        "created_date": 1748435805616,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 1
      }
    ],
    "paging": {
      "total_results": 43,
      "pages_total": 3,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2051007/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        15,
        12,
        37,
        101,
        314
      ],
      "review_histogram": [
        15,
        12,
        37,
        101,
        314
      ],
      "rating_count": 479,
      "review_count": 479,
      "average_rating": 4.43,
      "recommended_ratio": 0.91,
      "media": [],
      "faceoff_positive": {
        "comments": "I have already gone through like 3 bottles of this. So maybe the only negative is I wish there was more product in the bottle. But this is the product of my dreams that I have been looking for. I love clinique serum foundation, I've used it for years, but after getting sun damage for the first time a few years ago and realizing my fair skin is sensitive to the sun I am very generous with sunscreen. So I've tried so many SPF foundations and skin tints, all the viral big brands, for when I'm wearing makeup in the summer. I found one I liked okay, but it is a little greasy and stains everything. This product here however is everything I could have dreamed! I look forward to putting it on every day lol. It layers so beautifully and feels great on. I am big on liquid/cream blush and it looks great over this. This foundation dries down natural, it looks like my skin but better but actually somehow gives great coverage while still being lightweight and natural looking. It is not greasy like most spf foundations, just dewy which is how I like my makeup. It is described as a radiant finish and that is accurate. I really love the wide range of shades as well, way better shade range than other brands, and I used the online tool to shade match and I think that's also why I love it so much because it matches my skin tone perfectly. This foundation has been a game changer for me for this summer, a big confidence boost. I can comfortably reapply it like sunscreen or a moisturizer but the coverage looks natural like a foundation that I like. I recently went on a trip where the sun was intense and was able to just reapply this and blush multiple times throughout the day. I love knowing I am having adequate sun protection and also feeling pretty while wearing it rather than having to compromise the aesthetic of my makeup to include spf like how I've felt with other brands. Also I'm prone to breakouts and this doesn't break me out, I believe it has actually improved my skin.",
        "headline": "I'm super obsessed and so happy this was made",
        "rating": 5,
        "ugc_id": 555987234
      },
      "faceoff_negative": {
        "comments": "I received this product free of charge in exchange for my unbiased review. I  absolutely love that this is a vitamin-rich foundation with SPF 45! I was so excited to try it because it sounded like it would be so nourishing for my skin. I really like that the coverage is buildable and the way it feels so lightweight on my skin after application. The consistency is appealing, it's easy to apply and blend, and it dries down quickly without ever feeling tacky. Surprisingly, however, this foundation doesn't wear well on my skin at all. Despite moisturizing my skin before application, this foundation settles around dry patches that I didn't even know I had, highlighting dryness and flakiness. Additionally, it also settles into fine lines and wrinkles after only a few hours. I really love the concept of this product, but not the execution.\nAdded Plus: I greatly appreciate that this product comes with a pump applicator to prevent contamination.",
        "headline": "Love the Skincare Benefits!",
        "rating": 2,
        "ugc_id": 551390417
      },
      "name": "Even Better Clinical Vitamin Makeup Broad Spectrum SPF 45 Foundation",
      "native_review_count": 43,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 436,
      "locale": "en_US"
    }
  }
}