{
  "product_id": "pimprod2015167",
  "product_url": "https://www.ulta.com/p/oil-milk-gentle-oat-cleanser-pimprod2015167",
  "extracted_at": "2025-09-23T04:44:22.911705+00:00",
  "product_name": "cocokindOil to Milk Gentle Oat Cleanser",
  "brand": "cocokind",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wash"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "18.99",
  "sale_price": "13.29",
  "availability": "in_stock",
  "rating_avg": "4.7",
  "rating_count": "2523",
  "images": [
    "https://media.ulta.com/i/ulta/2566404?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2566404?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2566404cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2566404cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2566404cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2566404cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2566404cm_vid01/thumbs/a066a253-9446-4afa-9efd-b73a27274a53?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive Backcocokind's Oil to Milk Gentle Oat Cleanser uses prebiotic fermented oat and oils to cleanse while supporting the skin's microbiome. The unique texture starts as an oil balm to loosen makeup and impurities. After adding water, it transforms into a milk that easily rinses everything off.",
  "details": "DetailsBenefitsDaily gentle and non-disruptive cleansing, leaving skin feeling refreshed and comfortableRemoves impurities without stripping skin of moistureSupports a healthy skin barrierKey IngredientsFermented Oat and Oat Lipid Complex - supports a healthy microbiome where good bacteria can thrive and the skin can defend itself against external stressorsOrganic oil blend (Baobab and Sunflower Seed) Oil - high in linoleic acid that helps soothe, nourish, and seal in moistureItem 2566404How To UseWith slightly damp hands, massage cleanser onto dry skin to create a milky wash. Add more water for slip if needed. rinse off and pat dry.IngredientsHelianthus Annuus (Sunflower) Seed Oil, Glycerin, Vitis Vinifera (Grape) Seed Oil, Water, Sucrose Laurate, Avena Sativa (Oat) Kernel Oil, Adansonia Digitata Seed Oil, Sucrose Stearate, Tocopherol, Pelargonium Graveolens Flower Oil, Sucrose Palmitate, Anthemis Nobilis Flower Oil, Avena Sativa (Oat) Kernel Extract, Lactobacillus Ferment.",
  "how_to_use": "With slightly damp hands, massage cleanser onto dry skin to create a milky wash. Add more water for slip if needed. rinse off and pat dry.",
  "ingredients": [
    "Helianthus Annuus (Sunflower) Seed Oil",
    "Glycerin",
    "Vitis Vinifera (Grape) Seed Oil",
    "Water",
    "Sucrose Laurate",
    "Avena Sativa (Oat) Kernel Oil",
    "Adansonia Digitata Seed Oil",
    "Sucrose Stearate",
    "Tocopherol",
    "Pelargonium Graveolens Flower Oil",
    "Sucrose Palmitate",
    "Anthemis Nobilis Flower Oil",
    "Avena Sativa (Oat) Kernel Extract",
    "Lactobacillus Ferment"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser",
      "oil"
    ],
    "skin_type": [
      "dry",
      "sensitive"
    ],
    "finish": [
      "sheer",
      "oil"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "organic",
      "soothing",
      "purifying"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2015167",
    "total_reviews": 2523,
    "reviews": [
      {
        "review_id": 557880145,
        "rating": 1,
        "headline": "Yikes",
        "comments": "I loveeee trying out non toxic products but like many have commented, this leaves a weird film on your skin. In an attempt to not waste it i would only use it after my other cleansers. Doesnt even remotely take makeup off. I hate how its runny, and the smell was not great. I ended up throwing it away because i couldnt stand using it.",
        "nickname": "Kacie",
        "location": "Quantico VA",
        "created_date": 1753056537498,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 2
      },
      {
        "review_id": 556923087,
        "rating": 1,
        "headline": "Greasy",
        "comments": "Bought because of the great reviews but was so dissapointed. Imagine washing your face with vaseline, thats ehat this feels like. Leaves a film over ur skin and doesnt feel clean afterwards",
        "nickname": "A",
        "location": "Sonoma, ca",
        "created_date": 1752173647973,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 556409162,
        "rating": 2,
        "headline": "Won't buy again",
        "comments": "I tried this because i try to keep my products toxic free, but the smell is terrible, it feels like im washing my face with vasoline, and i dont like how it made my skin feel. I may be an outlier since it has many good reviews, but it wasnt for me.",
        "nickname": "JT",
        "location": "Philadelphia",
        "created_date": 1751552479272,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 554119038,
        "rating": 3,
        "headline": "not super effective",
        "comments": "my skin feels amazing after using this cleanser, but only if i'm washing my bare face. this cleanser does not budge my makeup, let alone wash it away. it's gentle on the skin, which is great, but it's way too gentle on makeup, which makes me question just how clean my skin is after using this even on a bare face.",
        "nickname": "liv",
        "location": "MA",
        "created_date": 1748475594232,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551699334,
        "rating": 1,
        "headline": "Doesn't rinse off",
        "comments": "I originally planned to use this cleanser as a makeup remover, but found it left a film that sealed in the makeup residue and made it even harder to remove after. It doesnt cleanse my skin at all, just leaves behind a layer of oil that doesn't rinse off.",
        "nickname": "L",
        "location": "Milwaukee, WI",
        "created_date": 1744647480236,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550899509,
        "rating": 1,
        "headline": "Big disappointment",
        "comments": "Took off MAYBE 60% of my makeup and left a nasty film on my face after rinsing.",
        "nickname": "Birdy",
        "location": "Riverside",
        "created_date": 1743669095525,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 549835486,
        "rating": 1,
        "headline": "skin feels covered in film",
        "comments": "this has amazing reviews so i was excited to try. the directions say to wet your hands, put the product in and then massage onto dry face. it mixes onto your face up just like typical makeup removing balm feels (although this is runny like a cleanser). the bad part about this is, when you try to wash it off, it leaves a thick film on your face that no amount of water rinsing removes, it is so bizarre. i have to wash it with a separate cleanser to get it off. at first i thought this was a weird reaction with my makeup, so another day i tried using it on a bare face, the end result feels exactly the same. its also kind of pricey for a small bottle. do not recommend at all.",
        "nickname": "Miss Guided",
        "location": "Oakland, CA",
        "created_date": 1742969780613,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 2
      },
      {
        "review_id": 544250143,
        "rating": 5,
        "headline": "It's a lovely makeup remover/cleanser",
        "comments": "It removes makeup very well and it's very effective as a double cleanse. I use with damp hands as advised and add a bit of water after massaging it into the skin for a minute. Then i use a damp disposable towlette to wipe it away. After that, i use a gentle cleanser. Im acne prone and sensitive. This did not break me out and is very gentle. Love it!",
        "nickname": "Rsh98",
        "location": "New Jersey",
        "created_date": 1737865640940,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 544227622,
        "rating": 4,
        "headline": "Great For Extra Dry Skin",
        "comments": "I have very dry skin and this product has been great, especially during winter months. With that being said, it does leave a slight residue on the skin so if that bothers you, this product probably isn't for you. I also would not recommend this to anyone who doesn't have dry skin! It's extremely hydrating. The only reason I knocked off a star is because of the scent. I'd prefer zero fragrance.",
        "nickname": "Maddie",
        "location": "Boston, MA",
        "created_date": 1737817670355,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543669407,
        "rating": 5,
        "headline": "My go to face wash",
        "comments": "I love milk facewashes. They are gental on my skin and keep it moisturized. I love that this one is affordable too. I would recommend 100 times over",
        "nickname": "Kerry",
        "location": "Midwest, USA",
        "created_date": 1737438507249,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542909932,
        "rating": 3,
        "headline": "Some good and some not so good",
        "comments": "I purchased this about a month or so ago because I needed to replace another cleanser that left my face with a burning feeling. This is plenty gentle on my skin. It also removes mascara decently well. I like the smell fine, it reminds me a lot of the Ren evercalm cleanser I had ages ago, but I may have lucked out and gotten a non-reformulated one because it seemed to be the only tube left on the shelf in the old packaging. \n\nI find this to be too hard to remove however. Even after emulsifying with water and removing it with a wash cloth, there is an oily residue left that I don't care for. It isn't causing any real breakouts, but definitely some congestion. Following it up with a second cleanser works, but I would rather it didnt require two products in order to work well.",
        "nickname": "Fiona",
        "location": "Washington",
        "created_date": 1736924374054,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541712322,
        "rating": 1,
        "headline": "formula change",
        "comments": "used to love this cleanser, but now with the formula change, I can't stand it. the smell is horrible. makes me wonder if the formula change is as clean as the original. disappointed!",
        "nickname": "Stina",
        "location": "New York",
        "created_date": 1735001549566,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 539229896,
        "rating": 1,
        "headline": "The formula changed — for the WORST",
        "comments": "I am so sick of these companies changing their formulas of things many people know and love. If it ain't broken don't fix it! I have used this as the first step in my double cleanse for a while, and have been without it for months. I have been struggling to find a new cleansing balm due to this awful formula change. The new smell is disgusting and irritates my skin. Cocokind, please take notes and bring back the old formula and I will repurchase forever.",
        "nickname": "Angry Customer",
        "location": "United States",
        "created_date": 1733714577405,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 539229408,
        "rating": 1,
        "headline": "the formula changed",
        "comments": "please bring back the old formula! i used to love this as my first step of my double cleanse until the formula was changed. now it smells awful and irritates my sensitive skin. unfortunately i will no longer buy this and will have to find a new cleansing balm which is really difficult for me. PLEASE bring back the old formula and then i will buy it again.",
        "nickname": "em",
        "location": "orlando, florida",
        "created_date": 1733713417624,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 539109169,
        "rating": 5,
        "headline": "I would buy this again",
        "comments": "I never had a skin care routine before now. I went to a spa to have a facial done. The lady who worked there told me to try Cocokind. I went out and got the the trial kit. That was the start of me taking care of myself ever. This company has been outstanding in customer service. They are awesome at answering any questions. I am 51 and my skin feels great for the first time ever with all the products they offer.",
        "nickname": "Janelle",
        "location": "WI",
        "created_date": 1733505980933,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 538984924,
        "rating": 5,
        "headline": "Great as a makeup remover",
        "comments": "This cleanser has really clean ingredient and even has a score of 1 on the ewg. I appreciate that it is only scented with geranium oil and does't contain preservatives like phenoxyethanol which can be very irriating to sensitive, eczema, or psoriasis prone skin. I used this as a first cleansing step at night and it has worked well to remove makeup and daily sunscreen. However, it does leave a noticeable layer of oil on your skin after being rinsed off. I think the leftover oil would be fine to leave on if you have extremely dry skin but for most people I think it would need to be followed with a gel clenser to avoid clogged pores. Overall, this is a very gentle product but is better suited as part of a multi-step cleansing regimen than as a stand alone cleanser.",
        "nickname": "Madeleine",
        "location": "Portland, OR",
        "created_date": 1733380190179,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537887597,
        "rating": 2,
        "headline": "Good! For people who don't have acne",
        "comments": "This product is good, it leaves the skin feeling soft and clean. I thought this product would work for me, considering it has a clean ingredient list with non-comodegenic ingredients. However, I am sensitive to oils, and this product has lots of them! If you have sensitive acne prone skin, with sensitivity to oils I would stir away from this product",
        "nickname": "Coolbeansjenn",
        "location": "Albuquerque, NM",
        "created_date": 1731692258947,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 2
      },
      {
        "review_id": 535806669,
        "rating": 5,
        "headline": "Skin Saver in Dry Cold Climate",
        "comments": "Wow, I have used Prestige products ever since I can remember. I received this is a gwp thru Ulta. Last minute I threw it in my makeup bag for a trip to Colorado because of the radically different climate my skin is used too ( Texas ) First, it feels so comforting to the skin, just a tiny bit goes a longgggg way & it spreads silky, milky luxury without leaving a residue. We visit here alot - CO - & my skin always pays the price, WELL NOT THIS TRIP!! It is radiant, youthful, glowing - & I am floored (!!) at this wonderful product!! THANK YOU COCO KIND!!!!!",
        "nickname": "mrscro31",
        "location": "DFW TEXAS",
        "created_date": 1728570062185,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 535321968,
        "rating": 1,
        "headline": "oils skin",
        "comments": "somehow I end up with more pimples. product was oily, couldn't have had any cleanser agents. do not recommend for combination skin",
        "nickname": "Monica",
        "location": "Tampa FL",
        "created_date": 1727926412686,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 4
      },
      {
        "review_id": 534701961,
        "rating": 3,
        "headline": "It's okay",
        "comments": "Ive been trying to find a new cleansing oil since boscia no longer exists 😢\nThis one is okay, I've definitely tried better ones. It removes your make up but leaves a weird residue/film on your skin so you definitely need to double cleanse.",
        "nickname": "Mirandapanda",
        "location": "Santa Cruz, ca",
        "created_date": 1727395537163,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 132,
      "pages_total": 7,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2015167/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "bestuses",
          "name": "Best Uses",
          "type": "tag",
          "values": [
            {
              "label": "Combo skin",
              "count": 1
            },
            {
              "label": "I use this as a pre cleanser for oil dirt remov",
              "count": 1
            },
            {
              "label": "gentle cleanse",
              "count": 1
            },
            {
              "label": "morning cleanse",
              "count": 1
            },
            {
              "label": "Once in the AM, Once before bed (2x daily)",
              "count": 1
            }
          ],
          "display_values": [
            "Combo skin",
            "I use this as a pre cleanser for oil dirt remov",
            "Once in the AM, Once before bed (2x daily)",
            "gentle cleanse",
            "morning cleanse"
          ]
        },
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "Small bottle",
              "count": 1
            },
            {
              "label": "Don't like the smell",
              "count": 1
            },
            {
              "label": "Hard to rinse off",
              "count": 1
            },
            {
              "label": "Leaves your face feeling gross",
              "count": 1
            },
            {
              "label": "Runs everywhere (down arms)",
              "count": 1
            },
            {
              "label": "Wouldn't work if u NEED exfoliation n a cleanser",
              "count": 1
            },
            {
              "label": "Bad smell",
              "count": 1
            },
            {
              "label": "not sure if my face is clean",
              "count": 1
            },
            {
              "label": "Small product size",
              "count": 1
            },
            {
              "label": "Wish there was a bigger bottle",
              "count": 1
            }
          ],
          "display_values": [
            "Bad smell",
            "Don't like the smell",
            "Hard to rinse off",
            "Leaves your face feeling gross",
            "Runs everywhere (down arms)",
            "Small bottle",
            "Small product size",
            "Wish there was a bigger bottle",
            "Wouldn't work if u NEED exfoliation n a cleanser",
            "not sure if my face is clean"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "Oily T zone, hormonal acne, sensitive skin",
              "count": 1
            },
            {
              "label": "I have drier skin and this helps",
              "count": 1
            },
            {
              "label": "Acne",
              "count": 1
            },
            {
              "label": "Oily",
              "count": 1
            },
            {
              "label": "Consistent skin routine",
              "count": 1
            },
            {
              "label": "Normal to dry skin",
              "count": 1
            }
          ],
          "display_values": [
            "Acne",
            "Casual Dresser",
            "Comfort-seeking",
            "Consistent skin routine",
            "Energetic/Active",
            "I have drier skin and this helps",
            "Normal to dry skin",
            "Oily",
            "Oily T zone, hormonal acne, sensitive skin",
            "Stylish/Fashionista",
            "Trendy/Stylish Dresser",
            "Youthful"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "Gentle and natural",
              "count": 1
            },
            {
              "label": "Hydrating",
              "count": 1
            },
            {
              "label": "Smooth and silky",
              "count": 1
            },
            {
              "label": "Lasts a long time",
              "count": 1
            },
            {
              "label": "Less abrasive than other cleansers",
              "count": 1
            },
            {
              "label": "Smell",
              "count": 1
            },
            {
              "label": "Balmy but not greasy",
              "count": 1
            },
            {
              "label": "Light weight , non greasy, simple ingredients",
              "count": 1
            },
            {
              "label": "gentle",
              "count": 1
            },
            {
              "label": "smells nice",
              "count": 1
            },
            {
              "label": "Effective",
              "count": 1
            },
            {
              "label": "Gentle",
              "count": 1
            },
            {
              "label": "Leaves a silky smooth feeling",
              "count": 1
            },
            {
              "label": "No oil residue",
              "count": 1
            },
            {
              "label": "Turns into milk when mixed with water on face",
              "count": 1
            }
          ],
          "display_values": [
            "Balmy but not greasy",
            "Effective",
            "Gentle",
            "Gentle and natural",
            "Hydrating",
            "Lasts a long time",
            "Leaves a silky smooth feeling",
            "Less abrasive than other cleansers",
            "Light weight , non greasy, simple ingredients",
            "No oil residue",
            "Smell",
            "Smooth and silky",
            "Turns into milk when mixed with water on face",
            "gentle",
            "smells nice"
          ]
        },
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Combination",
              "count": 10
            },
            {
              "label": "Dry",
              "count": 4
            },
            {
              "label": "Normal",
              "count": 1
            },
            {
              "label": "Oily",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        49,
        61,
        66,
        181,
        2166
      ],
      "review_histogram": [
        49,
        61,
        66,
        181,
        2166
      ],
      "rating_count": 2523,
      "review_count": 2523,
      "average_rating": 4.73,
      "recommended_ratio": 0.94,
      "media": [],
      "faceoff_positive": {
        "comments": "Bought this after having extra dry skin for weeks due to weather changes and I wish I would have used this sooner. I always used cleansers that made my skin feel slightly tight afterwards just assuming that meant my skin was really \"clean\" and this was the first time using an oil based cleanser. I've never looking back. Makes your skin actually feel moisturized after washing it off which I didn't know existed. The first two weeks using it I did have a few pimples pop up which I know is normal when switching to new cleansing products. I kept with it and have been using it for over a month now. My skin hasn't broken out yet and my skin texture has vastly improved. I saw reviews saying that it smelled awful (it doesn't smell great) but that's not the point of a cleanser to me and the reason it doesn't smell nice is because it doesn't contain fragrance which I actually love. You are washing it off your face so I feel like it shouldn't matter what it smells like if the ingredients are good and it works for your skin. I also read reviews about the container leaking and I would suggest not keeping it in the shower or getting it super wet because I know the tube is made out of natural recycled ingredients which is probably why it isn't as sturdy as straight up plastic. Again, not complaining because sustainability and caring for the planet tops all. Overall I love this product and would purchase it again!! I only wish it came in a larger size for the price.",
        "headline": "Great first oil cleanser!! Skin's never felt so good!",
        "rating": 5,
        "ugc_id": 435489144
      },
      "faceoff_negative": {
        "comments": "My thoughts on this cleanser are quite mixed.\n\nThe first time I used it was during the summer, & I didn't like it one single bit. I am experienced when it comes to oil-based cleansers, & I had honestly never used one that left such an unappealing film on my face. It was extremely noticeable—almost like if you were trying to rinse off petroleum jelly. Regardless of how ￼thoroughly I rinsed, it just \"clung\" to my skin, refusing to emulsify. This cleanser didn't just leave my oily summer skin feeling moisturized, it felt unclean. Of course, I followed with a water-based cleanser after (the Cocokind AHA Jelly Cleanser, which I absolutely recommend), which helped.\n\nI also found out pretty quickly that this cleanser is definitely not a good choice for makeup removal, since 1. It just doesn't work to remove makeup, & 2. The thick + balmy nature of the product means it doesn't have adequate slip, so it tugs the skin, apposed to gliding across it. One more issue I have with this cleanser is the scent. It's a bit too powdery-floral for my liking. I do appreciate the fact that it's not in your face intense, but it's definitely noticeable, & not at all up my alley.\n\nI set this cleanser aside, thinking I might have better luck during the colder months. Low, & behold, I found it much more enjoyable for my skin type come winter (I have dehydrated, combination skin). I also found that this particular cleanser works best when removed with a makeup removing cloth/flannel. I personally love using The Original Makeup Eraser. Using a makeup eraser honestly made a massive difference for me, since it seemed to solve both of my main issues with this cleanser—it ￼thoroughly removed my makeup, as well as got rid of that awful \"filmy\" residue.￼￼ I actually love the results of using the two together, my skin feels soft + supple, apposed to filmy + unclean.\n\nAs you can see, this cleansing balm took some finessing to really work for me. I'm still not head over heels in love with it, but it has its place in my collection. I would NOT recommend it to someone who hasn't used an oil-based cleanser before, since this would be the perfect product to completely put someone off from them altogether. The residue it leaves behind (when used without a makeup eraser) honestly feels awful. Most oil-based cleansers do not have this issue. They actually leave your skin feeling more clean (yet not stripped), apposed to filmy/congested.\n\nI'd say this is a good choice for someone who is prepared for both the emulsifying issue, & the difficulty with makeup removal. This means you're either okay with the residue it leaves behind + you're not planning to use it for makeup removal, or you're planning to use a makeup eraser to resolve these issues. Either way, I do not think this is the best option for oily, acne-prone skin. I'd say normal, dry, or normal/dry + mature skin types would love this cleanser the most, since it really does go a step beyond \"non-stripping\", to actually being moisturizing. I've tried quite a few Cocokind products, & I do have others I'd recommend over this one. Their AHA Jelly Cleanser is wonderful, as well as their Ceramide Barrier Serum, & their Turmeric Illuminating Solution. I recommend those three products for all skin types.\n\nIf you're looking for an oil-based cleanser (for every skin type) that both emulsifies/rinses completely, & removes even stubborn makeup, I highly recommend Green Clean from Farmacy. It's an excellent cleansing balm in every single way (including it's ingredients, & it's light citrus scent). The Elf Holy Hydration! Cleansing Balm is another excellent option, & it's very affordable. If you're looking for an oil-based￼ cleanser that has more of a unique/creamy texture (apposed to the classic solid-to-oil sorbet), the Elemis AHA Cleansing Butter is as luxurious as it gets. I greatly prefer it to its Pro-Collagen counterpart.\n\n*One more thing to note about this Cocokind cleanser, is an issue with the directions. It says to start with damp hands. Oil-based cleansers are only effective when first applied to dry skin, with dry hands. You then dampen your hands to begin the emulsification process (which is when you will see this cleanser turn \"milky\"). Starting with damp hands makes the purpose of using an oil-based cleanser obsolete, which is to remove the daily dirt + oils (or/and makeup/spf) that have built up on your skin. After all, \"like attracts like\"—so, oil attracts oil.",
        "headline": "Not a good option if you're new to oil-based cleansers",
        "rating": 3,
        "ugc_id": 441355622
      },
      "name": "Oil to Milk Gentle Oat Cleanser",
      "native_review_count": 132,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 2391,
      "locale": "en_US"
    }
  }
}