{
  "product_id": "pimprod2044099",
  "product_url": "https://www.ulta.com/p/travel-size-xtra-large-bombshell-volumizer-pimprod2044099",
  "extracted_at": "2025-09-23T05:32:59.140988+00:00",
  "product_name": "Color WowTravel Size Xtra Large Bombshell Volumizer",
  "brand": "Color Wow",
  "categories": [
    "Home",
    "Hair",
    "Travel Size Hair Care"
  ],
  "category_keys": [
    "home",
    "hair",
    "hair"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "12.00",
  "availability": "in_stock",
  "rating_avg": "4.1",
  "rating_count": "5241",
  "images": [
    "https://media.ulta.com/i/ulta/2607944?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2607944?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2607944_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2607944_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2607944_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2607944_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2607944_vid01/thumbs/7801e7a8-a80a-4a8d-a6dc-b950a31f9f51?w=600&h=337&fmt=auto",
    "https://media.ulta.com/v/ulta/2607944_vid02/thumbs/0c75dbbe-7a3c-44be-a3a7-fa049378ef26?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryA first of its kind, Color Wow Xtra Large Bombshell Volumizer delivers instant, super luxe volume without using alcohol or salt. Lasts for days!",
  "details": "DetailsBenefitsNon-drying, non-dullingBlows up massive volume while leaving hair quality super luxe and glossyInnovative light, frothy formula feels weightless in hairLong-lastingHeat protectantKey IngredientsUnlike typical volumizers that use alcohol, salts or crispy resins to create volume, Xtra Large uses a weightless yet bulky polymer blend to create the effect of volume without damaging the cuticleFortified with strand-strengthening bambooFormulated WithoutAlcohol, salt or crispy resinsParabenItem 2607944How To UseDivide damp hair into sections.Apply 2-3 pumps worth of product to each section smoothing through from top to ends.Comb through to distribute evenly.Style. Hair can be blow-dried or air-dried.IngredientsAqua/Water, Propanediol, Vp/Dmapa Acrylates Copolymer, Phenoxyethanol, Caprylyl Glycol, Ppg-26-Buteth-26, Peg-40 Hydrogenated Castor Oil, Disodium Edta, Benzalkonium Chloride, Bambusa Arundinacea Leaf Extract, Polyquaternium-22. #503-0",
  "how_to_use": "Divide damp hair into sections.Apply 2-3 pumps worth of product to each section smoothing through from top to ends.Comb through to distribute evenly.Style. Hair can be blow-dried or air-dried.",
  "ingredients": [
    "Aqua/Water",
    "Propanediol",
    "Vp/Dmapa Acrylates Copolymer",
    "Phenoxyethanol",
    "Caprylyl Glycol",
    "Ppg-26-Buteth-26",
    "Peg-40 Hydrogenated Castor Oil",
    "Disodium Edta",
    "Benzalkonium Chloride",
    "Bambusa Arundinacea Leaf Extract",
    "Polyquaternium-22. #503-0"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "hair",
      "haircare"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "matte",
      "glossy",
      "sheer",
      "long-wear",
      "creamy",
      "oil"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "product_type": [],
    "ingredients": [],
    "special_features": []
  },
  "reviews": {
    "product_id": "pimprod2044099",
    "total_reviews": 5241,
    "reviews": [
      {
        "review_id": 561082378,
        "rating": 5,
        "headline": "Yes I will be buying this product again!",
        "comments": "I love this product!",
        "nickname": "Heidi",
        "location": "Bison, SD",
        "created_date": 1756135121248,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554796685,
        "rating": 5,
        "headline": "Works great on my \"no volume\" hair!",
        "comments": "I have an annoying inconsistent wave to my hair, but NO Volume.  I love this product!  I even use it on day 3 dry hair and a little medium heat to restyle!  Works great!",
        "nickname": "Lisa",
        "location": "New Jersey",
        "created_date": 1749487159288,
        "bottom_line": "Yes",
        "helpful_votes": 10,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554435660,
        "rating": 5,
        "headline": "just buy the big bottle",
        "comments": "sooo\nI'm love volume at my roots bc I have long hair it gets heavy. it gave me a lift and all over volume! mouse  foam texture...easy to apply....blow dried hair on medium setting....when I thought it was going flat...did a little fluff and boom...it was good! I will be purchasing more!!!",
        "nickname": "AJ",
        "location": "Grand Rapids area MI",
        "created_date": 1748915892723,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554284154,
        "rating": 5,
        "headline": "Wow is right",
        "comments": "My hair has been thinning, this product has been a game changer for me!",
        "nickname": "Anna",
        "location": "Shelby Twp, Michigan",
        "created_date": 1748618339446,
        "bottom_line": "Yes",
        "helpful_votes": 17,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553284820,
        "rating": 5,
        "headline": "it REALLY TRULY WORKS!!!!",
        "comments": "I have been trying to find a product line to work on my strt  fine thin hair for a long years I am 67yo and get it highlight I tried this immed when I got it didn't get the results .called CW was advised you need to use 2 -3 pumps per section made ALL the DIFF",
        "nickname": "Karen",
        "location": "Erie PA",
        "created_date": 1747176991003,
        "bottom_line": "Yes",
        "helpful_votes": 21,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552381365,
        "rating": 3,
        "headline": "So, so",
        "comments": "Im not impressed. The color WOW added some body to my fine hair, but nothing special.\nIt does not work as well as some other products and it is expensive for a 6 oz can.",
        "nickname": "Oly Lady",
        "location": "Olympia WA",
        "created_date": 1745525562481,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 2
      },
      {
        "review_id": 552096490,
        "rating": 5,
        "headline": "Best volumizer for my extra fine hair",
        "comments": "This foam is considerably better than other volume products I've tried. I only use four small pumps overall, one for each of four sections of my medium length baby fine hair. When dry, the volume is noticeable but my hair still feels clean, soft, and shiny, impressively so. Combined with my favorite dry shampoo, my style is lasting into the third day. Will repurchase.",
        "nickname": "Court",
        "location": "San Francisco, CA",
        "created_date": 1745180726783,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 1
      },
      {
        "review_id": 551138136,
        "rating": 5,
        "headline": "I love it",
        "comments": "At 73 yrs old, I have thick, an inch or so below chin length hair, with a few layers.  I wear it in a bob.  I use 3 or 4 pumps on the crown of my hair.  I start at the root and rub/scrub it in the root and pull the remainder thru the end of that hair area.  I use a pump on the \"roots\" of my sides and bangs.  I do NOT use this all over my head. The secret is to work into the roots, blow dry w/large round brush, but use only where you need volume.  I then set my crown area on velcro rollers for a bit:  POOF, high hair that stays.  \nI don't see alot of shine but I do see a difference in volume. My bottle lasted several months, washing my hair twice a week.  If your hair is sticky, you are using too much.  Alot goes a long way.",
        "nickname": "Carolina Girl",
        "location": "North Carolina",
        "created_date": 1744032423614,
        "bottom_line": "Yes",
        "helpful_votes": 19,
        "not_helpful_votes": 2
      },
      {
        "review_id": 550914414,
        "rating": 5,
        "headline": "Added volume",
        "comments": "This product absolutely does what it says. I am thrilled with it.",
        "nickname": "Linda",
        "location": "Oak Ridge, TN",
        "created_date": 1743696263246,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549575878,
        "rating": 1,
        "headline": "Too sticky",
        "comments": "I don't like how my hair feels. The volume is slight. I have thin and fine hair and hoping this product would be a miracle. Not on my hair. I think you need thicker hair to get that type of volume.",
        "nickname": "De",
        "location": "Austin, TX.",
        "created_date": 1742419843233,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 1
      },
      {
        "review_id": 548036220,
        "rating": 4,
        "headline": "Don't use too much",
        "comments": "I have thin straight hair. I did notice some volume with this, but don't use too much it gets sticky and makes hair frizzy.",
        "nickname": "Lovie",
        "location": "OKC",
        "created_date": 1741551466254,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547487932,
        "rating": 4,
        "headline": "Awesome",
        "comments": "I really love this product, smells good, works wonders. I use it for every blow out now and what a difference in shine and volume that lasts a few days. Only downside is side is you need least 3 pumps when you section off your hair for top results- so it goes fast",
        "nickname": "Mickey",
        "location": "Michigan",
        "created_date": 1740689792643,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 1
      },
      {
        "review_id": 547098256,
        "rating": 3,
        "headline": "I'm not Wowwed",
        "comments": "I am glad I purchased the small bottle first. I followed the directions and even watched a few videos. I sectioned my hair, did 2-3 pumps per section and combed through each section before drying w a brush. I could not tell a big difference. I could not tell a difference at all honestly. I think I would have to use a TON more product to see the results you see in their advertising. I can feel the product giving texture to my hair, but not a lot of volume at the amount they suggest. The way I see it, if I have to use that much more product what's the point in paying so much for a product that works the same as any other volumizing mouse.",
        "nickname": "Jessica",
        "location": "Georgia",
        "created_date": 1740170680460,
        "bottom_line": "No",
        "helpful_votes": 9,
        "not_helpful_votes": 1
      },
      {
        "review_id": 546351604,
        "rating": 1,
        "headline": "Not working for my fine hair",
        "comments": "I saw LSU basketball coach Kim Mulkey's hair stylist was using this product on coach ( her hair style is always on point, big hair!) so I got this but unfortunately this product didn't give me the Coach Kim Mulley's volume.  This foam is super light, almost like hand foaming soap, I don't like it.",
        "nickname": "Momma50",
        "location": "Chicago Suburbs, IL",
        "created_date": 1739245746506,
        "bottom_line": null,
        "helpful_votes": 15,
        "not_helpful_votes": 2
      },
      {
        "review_id": 546105037,
        "rating": 5,
        "headline": "My second order!",
        "comments": "Best product I've found for my fine, straight hair!",
        "nickname": "Judy",
        "location": "Georgia",
        "created_date": 1739031474543,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 1
      },
      {
        "review_id": 545878503,
        "rating": 4,
        "headline": "I would buy it again",
        "comments": "Love it my hair is getting thin so it makes it look full",
        "nickname": "Doreen",
        "location": "Clermont Florida",
        "created_date": 1738626693045,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 545793729,
        "rating": 1,
        "headline": "This does absolutely nothing for me",
        "comments": "This product has done nothing but make my hair dry and sticky. I have oily hair so my roots get flat, but i have a lot of hair. I was looking for a product to give my roots volume and tried this. It does nothing no matter what I try, I've tried it on wet hair, with other products and without. Ive tried it with different heat tools like a blow dryer, heated curls and all, NOTHING.",
        "nickname": "Ashlyn",
        "location": "Pennsylvania",
        "created_date": 1738432281163,
        "bottom_line": null,
        "helpful_votes": 10,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543886142,
        "rating": 1,
        "headline": "Not so Wow!",
        "comments": "Did everything to get the volume…dried my hair upside down and used a big rounded brush.  Nothing!",
        "nickname": "Nina",
        "location": "Illnois",
        "created_date": 1737653170064,
        "bottom_line": "No",
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543802649,
        "rating": 5,
        "headline": "My newest go to styling product",
        "comments": "I was in search of a new styling product that would add volume without adding stiffness and dullness. I've tried mousse and gels with mediocre results. I found Wow Xtra Bombshell Volumizer and purchased after reading reviews. I am thrilled with this product! Great volume, holds without stiffness, and leaves hair soft and shiny. Highly recommend!",
        "nickname": "Kar424",
        "location": "Wilmington, Delaware",
        "created_date": 1737495038327,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543476158,
        "rating": 5,
        "headline": "This product is perfect for fine hair",
        "comments": "I have only used this once but it has been great for my thick but fine hair.  Holds very well and gives great volume.  I will definitely repurchase.",
        "nickname": "Cindy",
        "location": "N. Venice,  FL",
        "created_date": 1737130954533,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 57,
      "pages_total": 3,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2044099/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "hairtype",
          "name": "Hair Type",
          "type": "tag",
          "values": [
            {
              "label": "Straight Hair",
              "count": 10
            },
            {
              "label": "Wavy Hair",
              "count": 6
            }
          ],
          "display_values": [
            "Straight Hair",
            "Very Curly Hair",
            "Wavy Hair"
          ]
        }
      ],
      "rating_histogram": [
        594,
        363,
        391,
        376,
        3517
      ],
      "review_histogram": [
        594,
        363,
        391,
        376,
        3517
      ],
      "rating_count": 5241,
      "review_count": 5241,
      "average_rating": 4.12,
      "recommended_ratio": 0.64,
      "media": [
        {
          "id": "537742188",
          "review_id": 537742199,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/em9g8f7n7fgahjt9gj9h.jpg",
          "headline": "HOLY GRAIL VOLUMIZER, LEGIT $$$MONEEEEYYYY$$$$",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Kris",
          "created_date": 1731464997288
        }
      ],
      "faceoff_positive": {
        "comments": "LOL I'd GIVE ALL THE STARS for this!!!  WOWWW is most def word that describes the results of this volumizer, a few other terms of endearment I use: 'MANE MAGIC', and the 'MANE MASTER' (I call it Daddy too, wink wink) .  LEGIT, GAME CHANGER - I am so serious, if you are looking to add insane volume, height, mass, overall body to your hair YOU HAVE TO TRY THIS!!  I borrowed WOW from my sister while traveling- I was STUNNED with how amazingggg this made my aging/colored and bleached/damaged/thinning hair look!!  Since turning forty... everything has gone downhill including my hair! (silently crying) So much that I began using the 'halo' extensions and even sewn in extensions just to feel like I still have my normal head of hair again. Well, this was a party night in Vegas and I was NOT chancing my halo falling out or coming loose and worrying about having to explain the heap of golden locks on the dance floor...  This WOW volumizer SAVED THE DAY/NIGHT coming thru with insane volume, legit, it rivaled what my hair looks like with $800 extensions....Not only that- but it lasted ALLLL night long- a Vegas ALLL night (aka: well into the am and almost the PM following day!)..\nTHIS ISH WORKS, PERIOD.  I have always used with heat styling- Revlon round blow out brush or blow dryer for maximum results.  The consistency does seem slightly thin/watery, but it is a foam NOT a mousse so I think that is why?  I also think this contributes it being a light weight, non-sticky/tacky formula.  The scent is mehh and the actual pump on the bottle is weak.  Considering the BOMB \"SS product inside, they could really use a little innovation on packaging and pump. Trust me - these minor defects will NOT matter once you see results - I would use it if I had to rub sticks together fast enough to create flame like I was on Survivor!  Well worth the effort! Haha, I would prob take this volumizer as 1 of the select few items allowed on the deserted island! lol (I may be exaggerating a lil here) but it is absolutely my HOLY GRAIL/MUST HAVE haircare product, hands down!!\nI cannot recommend this WOW product enough, I tell every female I know about it, No gatekeeping!! Us females need to embrace, empower and engage!!  If you see a beautiful female - let her know!!  Compliments cost nothing yet could mean everything to someone.  Give grace to all until they don't deserve it. Everyone is struggling with something. We need all;the help/tips we can get!!\nLaugh often, live well, dance more, work hard, love harder, make memories you will be grateful for in the end when that is all we leave this world with.",
        "headline": "HOLY GRAIL VOLUMIZER, LEGIT $$$MONEEEEYYYY$$$$",
        "rating": 5,
        "ugc_id": 537742199
      },
      "faceoff_negative": {
        "comments": "About me: my hair color is natural light to medium blonde, medium to thick & very straight. The length is mid thigh. My hair doesn't hold a curl without a lot of product, then the curl tends to fall due to the weight of ny hair. I have bouncy hair but was hoping for massive volume like the woman in the video on Colir Wow site. I. Got. Nothing. No volume increase at all. Not even a little bit. What I did get was dry, crunchy hair that felt like I used hairspray & teased my hair like when I styled in the 80s. My hair still reminds me those were not our best years ;) I really had high (colume) hopes for this product but it honestly fell flat. I'm left nurturing my dry roots back to life which is taking a while. Not a fan.  I gave the product to my daughter who has shoulder length rhin ro medium hair. She reported the same dry feeling and gave it to a friend. Her friend said the same and the bottle was discarded.  I'm new to rhis brand and recently bought nearly all the products to try so watch for more honest reviews!",
        "headline": "This one fell flat",
        "rating": 2,
        "ugc_id": 510992450
      },
      "name": "Travel Size Xtra Large Bombshell Volumizer",
      "native_review_count": 57,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 5184,
      "locale": "en_US"
    }
  }
}