{
  "product_id": "",
  "product_url": "https://www.ulta.com/p/ultracalming-mist-toner-xlsImpprod2410035",
  "extracted_at": "2025-09-23T05:36:07.522391+00:00",
  "product_name": "DermalogicaUltracalming Mist Toner",
  "brand": "Dermalogica",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Face Mists & Essences"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "47.00",
  "availability": "in_stock",
  "rating_avg": "4.5",
  "rating_count": "487",
  "images": [
    "https://media.ulta.com/i/ulta/2220563?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2220563?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2220563_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2220563_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2220563_alt03?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive BackDermalogica's Ultracalming Mist Toner quickly relieves sensitivity while helping to calm redness, stinging and aggravated skin.",
  "details": "DetailsBenefitsSoothing, hydrating, lightweight lavender mistQuickly relieves inflammation and discomfortHelps condition skin and quickly absorbs into skin to soothe and minimize flare-upsCan be used after waxing or exfoliation for soothing benefitsBest for those experiencing dryness, redness, and sensitive skinKey IngredientsUltraCalming Complex: contains oat and botanicals to help soothe and strengthen skinAloe: helps calm while supports a natural moisture balance in skinItem 2220563How To UseAfter cleansing, spray over face, neck and chest with eyes closed. For added benefits, press into skin. May also be sprayed onto fingertips or dampened cotton pad and applied to the skin with light, upward strokes. Follow with UltraCalming Serum Concentrate.IngredientsWater/Aqua/Eau, Butylene Glycol, Leuconostoc/Radish Root Ferment Filtrate, PPG-2 Isoceteth-20 Acetate, Avena Sativa (Oat) Kernel Extract, Boerhavia Diffusa Root Extract, Pentylene Glycol, Bisabolol, Zingiber Officinale (Ginger) Root Extract, Aloe Barbadensis Leaf Juice, Hydroxyphenyl Propamidobenzoic Acid, Glycerin.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "After cleansing, spray over face, neck and chest with eyes closed. For added benefits, press into skin. May also be sprayed onto fingertips or dampened cotton pad and applied to the skin with light, upward strokes. Follow with UltraCalming Serum Concentrate.",
  "ingredients": [
    "Water/Aqua/Eau",
    "Butylene Glycol",
    "Leuconostoc/Radish Root Ferment Filtrate",
    "PPG-2 Isoceteth-20 Acetate",
    "Avena Sativa (Oat) Kernel Extract",
    "Boerhavia Diffusa Root Extract",
    "Pentylene Glycol",
    "Bisabolol",
    "Zingiber Officinale (Ginger) Root Extract",
    "Aloe Barbadensis Leaf Juice",
    "Hydroxyphenyl Propamidobenzoic Acid",
    "Glycerin"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "moisturizer",
      "serum",
      "toner"
    ],
    "skin_type": [
      "dry",
      "sensitive"
    ],
    "finish": [
      "sheer"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "natural",
      "hydrating",
      "soothing",
      "purifying"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "xlsImpprod2410035",
    "total_reviews": 487,
    "reviews": [
      {
        "review_id": 547161890,
        "rating": 5,
        "headline": "My 3rd back-to-back purchase",
        "comments": "This has been perfect for my heat-sensitive, oily skin. It's instantly soothing and hydrating without feeling greasy and without creating heaviness or trapping heat. I use it throughout the day to refresh my makeup and cool my skin. It doesn't disrupt any other products or add unwanted layers. It's especially beneficial when skin feels hot or \"feverish,\" providing immediate relief.",
        "nickname": "Victoria",
        "location": "Raleigh, NC",
        "created_date": 1740337405220,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 535984949,
        "rating": 1,
        "headline": "Not for my sensitive skin",
        "comments": "I don't normally like leaving negative reviews for skin care products because just because it didn't work for me doesn't make it bad.  BUT this claims to be for sensitive skin which I have and have rosacea that until I used this was under control. Unfortunately this made my skin very red and hot. There is obviously an ingredient in it that some of us are sensitive to",
        "nickname": "Missy",
        "location": "Orange County CA",
        "created_date": 1728858790073,
        "bottom_line": "No",
        "helpful_votes": 8,
        "not_helpful_votes": 1
      },
      {
        "review_id": 524716055,
        "rating": 3,
        "headline": "Smells like Elmer's glue",
        "comments": "Smells like Elmer's glue",
        "nickname": "Heather",
        "location": "Sc",
        "created_date": 1720707489659,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 3
      },
      {
        "review_id": 521848971,
        "rating": 1,
        "headline": "Rosacea People Be Cautious",
        "comments": "Really disappointing, but this caused the rosacea on my cheeks to flare up. My skin felt even more irritated and looked very red. It's too bad, because I use other Dermalogica products daily that work great for my skin! Just be cautious if you have rosacea!",
        "nickname": "K.G.",
        "location": "Michigan",
        "created_date": 1717620794199,
        "bottom_line": null,
        "helpful_votes": 8,
        "not_helpful_votes": 1
      },
      {
        "review_id": 482149875,
        "rating": 5,
        "headline": "Love this spray!",
        "comments": "I use this spray after washing my face. It calms my skin down. It's amazing.",
        "nickname": "Amy",
        "location": "VA",
        "created_date": 1700619990086,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 459705856,
        "rating": 1,
        "headline": "Expensive Tap Water",
        "comments": "I finished my old large bottle of the Soothing Protection Spray and bought another at my local Ulta, only it appeared that the name and formula has changed to Ultra Calming Mist. Of course there were no testers, but I bought it anyway. I sprayed some on that night after cleansing my face, and immediately noticed that the scent I love is non existent, and the spray does nothing for my skin. No calming, no soothing, nothing. It feels like absolutely nothing. It's like I'm just spraying water on my face. I figured I would give it a chance and see how I like it. Well, it's been nearly a year and it still feels like I'm just spraying my face with expensive tap water. I wish I had immediately returned the product to the store and demanded a refund. The employee at the time had told me over the phone that they don't accept opened products as returns, so I kept it.",
        "nickname": "LA Lady",
        "location": "New Orleans",
        "created_date": 1685541544950,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 2
      },
      {
        "review_id": 440429814,
        "rating": 5,
        "headline": "Love",
        "comments": "I purchased this so I could use it as part of an afterwax care routine I'm forming. This product isn't created for the the purpose, but with Ultra Calming in its name I wanted to try it. I'm impressed and in love with the performance of the mist! I use it every morning after I moisturize, and usually at night as well. It's multi purpose for me, and I totally recommend.",
        "nickname": "Lily",
        "location": "San Diego, CA",
        "created_date": 1673727846275,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 434659004,
        "rating": 3,
        "headline": "it's ok",
        "comments": "I got this to reduce the redness on my face and it doesn't. it does feel nice and calming if  when I put it on after my shower so if that's all  you're looking for then it's a good product.",
        "nickname": "giggles",
        "location": "Los Alamitos CA",
        "created_date": 1668942309215,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 403418877,
        "rating": 5,
        "headline": "An absolute must for redness!",
        "comments": "This is by far the best mist I have ever used! I have rosacea, yet I'm not joking when I say this calms my skin down within seconds. I use it after cleansing my face and before toner. Overall, I highly recommend for anyone who struggles with rosacea / redness!",
        "nickname": "Cristaly",
        "location": "Salt Lake City",
        "created_date": 1648481263637,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 401360823,
        "rating": 2,
        "headline": "Oily film?",
        "comments": "Bought this at the recommendation of my facialist because I have fair/sensitive skin. I have been using this daily both morning and night after cleansing for about a month now, and I don't feel like it has made any difference in how my skin looks. My skin is still just as dry and red as when I started using it. It also feels super thick and like there is a film on your skin after applying.",
        "nickname": "Carly",
        "location": "Alexandria, VA",
        "created_date": 1646867942891,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 392551381,
        "rating": 5,
        "headline": "Noticeable step for healthy barrier",
        "comments": "I'm 36 with dehydrated skin that was oily up until the last year and a half and now is normal/dry but acne prone and very sensitive. I wear sunscreen and hardly any makeup ever. I have been really dedicated in my skincare this past year. Dermalogica has been my go to for 10 years and this year I really branched as well figured out what really worked with my skin presently. I have bounced between the ultra calming mist and AgeSmart HydraMist for years. But I noticed at least for my dehydrated skin that when I use this face mist on freshly washed skin followed by an essence, my skin moisture retention is much better and my barrier isn't as tight near the end of the day. I tested a month without using this face mist and I could notice the difference. The Ultracalming Mist is a generous size and the fine mist spray works well. I love the very faint herbal scent it has and the quick absorption. It's got soothing ingredients for stressed skin and it's now a staple in my skincare routine.",
        "nickname": "Skin Care Enthusiast",
        "location": "Los Angeles",
        "created_date": 1640933900031,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 383972991,
        "rating": 5,
        "headline": "The BEST",
        "comments": "Man, I HATE SPRAYS… they've never been my favorite AT ALL. Then when my face was super dry in the winter I found this glorious product by accident and I haven't gone a day without it. I even carry a small spray in my purse. I have fry, acne prone, rosacea skin and this is magical on it!",
        "nickname": "Mandee",
        "location": "Tampa, FL",
        "created_date": 1633911517453,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 327797009,
        "rating": 5,
        "headline": "Saved my skin!!!",
        "comments": "I was struggling with breakouts from maskne and irritated inflamed skin until I started using this AM and PM and my breakouts are minimal, my redness reduced, and my skin is no longer inflamed. I hope they never discontinue this product!",
        "nickname": "Cass B",
        "location": "Pennsylvania",
        "created_date": 1612584061018,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 326745721,
        "rating": 5,
        "headline": "Love",
        "comments": "I was impressed it didn't have a strong smell. And this has also helped my skin not be dry feeling anymore.",
        "nickname": "Kivisto",
        "location": "Duluth, MN",
        "created_date": 1611935231014,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 324759156,
        "rating": 5,
        "headline": "IN LOVE",
        "comments": "I first purchased a system of Dermalogica products at the height of quarantine in early 2020. This mist was one of them and I was very skeptical of it at first, especially with that price point for a mist. However, I cannot get enough of this mist!!!!! I am very picky with my mists and I rotate them throughout my routine, but I still was able to FINISH an ENTIRE bottle of this!!!! (I've yet to do that with ANY other mist I own). When I saw there was an extra point bonus for this mist I had to get a new one & a backup. Would 1000x over recommend especially if you have dry & sensitive skin!",
        "nickname": "Fallon",
        "location": "New Jersey",
        "created_date": 1610567947426,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 322436439,
        "rating": 5,
        "headline": "I like the results but I wish it felt like something",
        "comments": "This does what its supposed to calm my skin, but I wish it had a cooling effect. It has nothing to relate to the use of the product Its just the need of instant gratification.",
        "nickname": "Ressa",
        "location": "NV",
        "created_date": 1609358354120,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 298910950,
        "rating": 5,
        "headline": "Looooove",
        "comments": "I love this toner. Most toners really irritate my skin and sting but this one really helps with the redness i usually get around my nose and cheeks after I wash my face. It evens it out and I love how it adds the perfect amount of moisture. It's super light and has no scent. Great addition to your skincare!",
        "nickname": "SJ",
        "location": "Virginia",
        "created_date": 1599447796737,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 277945391,
        "rating": 5,
        "headline": "MY ALL TIME FAVORITE!!!",
        "comments": "I enjoy using a facial mist, but I've been skeptical that they actually do anything... until I tried this one. I absolutely fell in LOVE! Its SUPER soothing for my sensitive/reactive skin. It immediately makes my skin feel more comfortable. There is a little bit of a scent when you first spray it on but then it goes away quickly. This stuff is amazing and is a must have in my skin care regimen! Pair it with the ultra calm water gel moisturizer and you will see great results in your skin!  Only downside is the price point :(",
        "nickname": "PrincessSofia",
        "location": "California",
        "created_date": 1590770642898,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 191582376,
        "rating": 4,
        "headline": "Actually help",
        "comments": "I usually go for the cheaper option but I'm so glad a spent a little extra on this buy.",
        "nickname": "Kel",
        "location": "Farmington NM",
        "created_date": 1508914800000,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 191582375,
        "rating": 5,
        "headline": "A definite must for sensitive skin!",
        "comments": "I have sensitive skin and have had much success with the Dermalogica ultra calming line of products. I spray this on after cleansing my face with the ultra calming cleanser. It's a must have for sensitive skin! I have been able to introduce other Dermalogica products into my routine outside of the ultra calming line to address other skin issues such as signs of aging, uneven skin tone & acne.  As long as I use the ultra calming mist and ultra calming serum in my skin care routine, I can avoid skin irritation.",
        "nickname": "AmyM3",
        "location": "Mpls, MN",
        "created_date": 1508137200000,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 102,
      "pages_total": 6,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/xlsImpprod2410035/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "beautyroutine",
          "name": "My Beauty Routine Takes",
          "type": "tag",
          "values": [
            {
              "label": "10 Minutes",
              "count": 11
            },
            {
              "label": "30 Minutes",
              "count": 8
            },
            {
              "label": "1+ Hour",
              "count": 2
            }
          ],
          "display_values": [
            "1+ Hour",
            "10 Minutes",
            "30 Minutes"
          ]
        },
        {
          "display_type": "default",
          "key": "bestuses",
          "name": "Best Uses",
          "type": "tag",
          "values": [
            {
              "label": "Daily Use",
              "count": 65
            },
            {
              "label": "Sensitive Skin",
              "count": 45
            },
            {
              "label": "Redness/ Blotchiness",
              "count": 21
            },
            {
              "label": "Women",
              "count": 14
            },
            {
              "label": "Dry Skin",
              "count": 12
            },
            {
              "label": "All Skin Types",
              "count": 8
            },
            {
              "label": "Men",
              "count": 7
            },
            {
              "label": "On-the-go",
              "count": 6
            },
            {
              "label": "Combination Skin",
              "count": 4
            },
            {
              "label": "Oily Skin",
              "count": 4
            },
            {
              "label": "Fine Lines/Wrinkles",
              "count": 3
            },
            {
              "label": "Uneven Skin Tone",
              "count": 3
            },
            {
              "label": "Acne-Prone Skin",
              "count": 2
            },
            {
              "label": "Weekly Use",
              "count": 1
            },
            {
              "label": "Before Moisturizer",
              "count": 1
            },
            {
              "label": "Right After Washing",
              "count": 1
            },
            {
              "label": "Enlarged Pores",
              "count": 1
            },
            {
              "label": "Calm sensitive skin",
              "count": 1
            },
            {
              "label": "Promotes absorption",
              "count": 1
            },
            {
              "label": "Post Treatment Skin",
              "count": 1
            },
            {
              "label": "Add moisture often",
              "count": 1
            },
            {
              "label": "Does not clog pores",
              "count": 1
            },
            {
              "label": "Hydrating Base",
              "count": 1
            },
            {
              "label": "With Other Line Of Produc",
              "count": 1
            },
            {
              "label": "To Control Itchiness",
              "count": 1
            },
            {
              "label": "Calm Redness",
              "count": 1
            },
            {
              "label": "Flushing",
              "count": 1
            },
            {
              "label": "Redness",
              "count": 1
            },
            {
              "label": "Rosacea",
              "count": 1
            }
          ],
          "display_values": [
            "Acne-Prone Skin",
            "Add moisture often",
            "All Skin Types",
            "Before Moisturizer",
            "Calm Redness",
            "Calm sensitive skin",
            "Combination Skin",
            "Daily Use",
            "Does not clog pores",
            "Dry Skin",
            "Enlarged Pores",
            "Fine Lines/Wrinkles",
            "Flushing",
            "Hydrating Base",
            "Men",
            "Oily Skin",
            "On-the-go",
            "Post Treatment Skin",
            "Promotes absorption",
            "Redness",
            "Redness/ Blotchiness",
            "Right After Washing",
            "Rosacea",
            "Sensitive Skin",
            "To Control Itchiness",
            "Uneven Skin Tone",
            "Weekly Use",
            "With Other Line Of Produc",
            "Women"
          ]
        },
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "Irritates Skin",
              "count": 2
            },
            {
              "label": "Not Effective",
              "count": 2
            },
            {
              "label": "Bad Smell",
              "count": 1
            },
            {
              "label": "Doesn't Work",
              "count": 1
            },
            {
              "label": "Dries Out Skin",
              "count": 1
            },
            {
              "label": "No cons",
              "count": 1
            },
            {
              "label": "None",
              "count": 1
            },
            {
              "label": "Not Moisurizing Enuf",
              "count": 1
            },
            {
              "label": "Price",
              "count": 1
            },
            {
              "label": "Temporary Odd Smell",
              "count": 1
            }
          ],
          "display_values": [
            "Bad Smell",
            "Complicated To Use",
            "Doesn't Remove Makeup",
            "Doesn't Work",
            "Dries Out Skin",
            "Greasy",
            "Heavy",
            "Irritates Skin",
            "Messy",
            "No cons",
            "None",
            "Not Effective",
            "Not Moisurizing Enuf",
            "Poor Texture",
            "Price",
            "Temporary Odd Smell"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "Brand Buyer",
              "count": 30
            },
            {
              "label": "Beauty Conscious",
              "count": 21
            },
            {
              "label": "Budget Shopper",
              "count": 17
            },
            {
              "label": "Survivalist / Minimalist",
              "count": 11
            },
            {
              "label": "acne / redness",
              "count": 1
            },
            {
              "label": "dry skin",
              "count": 1
            },
            {
              "label": "fair skin",
              "count": 1
            },
            {
              "label": "sensitive",
              "count": 1
            },
            {
              "label": "Skin Care Professional",
              "count": 1
            }
          ],
          "display_values": [
            "Beauty Conscious",
            "Brand Buyer",
            "Budget Shopper",
            "Casual Dresser",
            "Comfort-seeking",
            "Energetic/Active",
            "Skin Care Professional",
            "Stylish/Fashionista",
            "Survivalist / Minimalist",
            "Trendy/Stylish Dresser",
            "Youthful",
            "acne / redness",
            "dry skin",
            "fair skin",
            "sensitive"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "Lightweight",
              "count": 37
            },
            {
              "label": "Soothes Skin",
              "count": 28
            },
            {
              "label": "Gentle",
              "count": 26
            },
            {
              "label": "Smells Great",
              "count": 22
            },
            {
              "label": "Easy To Use",
              "count": 19
            },
            {
              "label": "Effective",
              "count": 19
            },
            {
              "label": "Balances Skin",
              "count": 18
            },
            {
              "label": "Leaves Clean Feel",
              "count": 16
            },
            {
              "label": "Moisturizing",
              "count": 14
            },
            {
              "label": "Not Greasy",
              "count": 14
            },
            {
              "label": "Moisturizes",
              "count": 13
            },
            {
              "label": "Non-Greasy",
              "count": 13
            },
            {
              "label": "Softens Skin",
              "count": 13
            },
            {
              "label": "Good Value",
              "count": 9
            },
            {
              "label": "Improves Skin Texture",
              "count": 7
            },
            {
              "label": "Helps apply moisturizer.",
              "count": 1
            },
            {
              "label": "Very Calming",
              "count": 1
            },
            {
              "label": "Soothing",
              "count": 1
            },
            {
              "label": "Calming",
              "count": 1
            },
            {
              "label": "Cooling",
              "count": 1
            },
            {
              "label": "Calms my face",
              "count": 1
            },
            {
              "label": "FEELS GOOD",
              "count": 1
            },
            {
              "label": "Helps redness",
              "count": 1
            },
            {
              "label": "Ends or Reduces Redness",
              "count": 1
            },
            {
              "label": "Has saved my skin",
              "count": 1
            },
            {
              "label": "Doesn't Irritate",
              "count": 1
            },
            {
              "label": "SENSITIVE SKIN",
              "count": 1
            },
            {
              "label": "Easy To Apply",
              "count": 1
            },
            {
              "label": "Calms Red Skin",
              "count": 1
            },
            {
              "label": "Best Use As A Moisterizer",
              "count": 1
            },
            {
              "label": "Calms Any Redness Or Inflammation",
              "count": 1
            }
          ],
          "display_values": [
            "Balances Skin",
            "Best Use As A Moisterizer",
            "Calming",
            "Calms Any Redness Or Inflammation",
            "Calms Red Skin",
            "Calms my face",
            "Cooling",
            "Doesn't Irritate",
            "Easy To Apply",
            "Easy To Use",
            "Effective",
            "Ends or Reduces Redness",
            "FEELS GOOD",
            "Gentle",
            "Good Value",
            "Has saved my skin",
            "Helps apply moisturizer.",
            "Helps redness",
            "Improves Skin Texture",
            "Leaves Clean Feel",
            "Lightweight",
            "Moisturizes",
            "Moisturizing",
            "Non-Greasy",
            "Not Greasy",
            "SENSITIVE SKIN",
            "Smells Great",
            "Softens Skin",
            "Soothes Skin",
            "Soothing",
            "Very Calming"
          ]
        },
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Combination",
              "count": 18
            },
            {
              "label": "Dry",
              "count": 8
            },
            {
              "label": "Normal",
              "count": 6
            },
            {
              "label": "Oily",
              "count": 3
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        33,
        10,
        10,
        61,
        373
      ],
      "review_histogram": [
        33,
        10,
        10,
        61,
        373
      ],
      "rating_count": 487,
      "review_count": 487,
      "average_rating": 4.5,
      "recommended_ratio": 0.86,
      "media": [
        {
          "id": "191582357",
          "review_id": 191582356,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/xe6g5ewnpet4lzw6rn6p.jpg",
          "headline": "Looooove it",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "",
          "nickname": "Sara W.",
          "created_date": 1485900053914
        }
      ],
      "faceoff_positive": {
        "comments": "Like most of the users of the Ultracalming products, my skin is (was!!) red, reactive and acne prone. I also had red, dry, scaly patches on my forehead and around my nose.\n\nI am also a serious doubter. I have tried nearly every brand of skincare, including lots and lots of toners which did nothing but sting and cause more redness (and those were the ones for sensitive skin- ha!).\n\nThis toner feels wonderful, it is slightly cooling for me and there is absolutely no sting. At all. Once I added this step to my cleansing/ Ultracalming serum and moisturizing routine, the red patches cleared up within days. I had had these red patches for months! And once they were gone they never came back.\n\nI have found that this toner also helps the Ultracalming Serum go on so much more evenly, and that I ultimately use less Serum, saving me money.\n\nAnd the acne- that's gone too, for the most part. I credit that to healthy skin, which I finally got from Dermalogica.",
        "headline": "Do Not Skip This Toner!!",
        "rating": 5,
        "ugc_id": 169912564
      },
      "faceoff_negative": {
        "comments": "Sadly disappointed. The UltraCalming Mist is Dermalogica's weak replacement for the Soothing Protection Spray. I don't like it. The problem is the two products are nothing alike. To call it a replacement is plain wrong. Not only does it not hydrate my face it dries it out just like every other product I used prior to finding the Soothing Protection Spay! Yes, the old product left an oily residue which I found locked in moisture while locking out the pollutants that irritated my skin. To add insult to injury UltraCalming Mist is only 6-oz! That's two 2-oz shorter than the Soothing Protection Spray it replaced but at the same price!!!",
        "headline": "UltraDRYING Mist",
        "rating": 1,
        "ugc_id": 169912615
      },
      "name": "Ultracalming Mist Toner",
      "variant_names": [
        "ultracalming mist"
      ],
      "native_review_count": 102,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 385,
      "locale": "en_US"
    }
  }
}