{
  "product_id": "pimprod2049954",
  "product_url": "https://www.ulta.com/p/biolumin-c-vitamin-c-heat-aging-protector-spf-50-pimprod2049954",
  "extracted_at": "2025-09-23T03:24:19.335714+00:00",
  "product_name": "DermalogicaBiolumin-C Vitamin C Heat Aging Protector SPF 50",
  "brand": "Dermalogica",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Face Moisturizer"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "79.00",
  "availability": "in_stock",
  "rating_avg": "4.8",
  "rating_count": "166",
  "images": [
    "https://media.ulta.com/i/ulta/2635497?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2635497?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635497_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635497_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635497_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635497_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635497_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635497_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635497_alt07?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2635497_vid01/thumbs/c6f5c022-413d-4a74-b815-d9532b8b4f6e?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive BackDermalogica's Biolumin-C Vitamin C Heat Aging Protector SPF 50 is designed to defend against the damaging effects of heat and UV exposure. Infused with moisturizing ingredients, this SPF not only protects but also hydrates and enhances your skin's natural glow.",
  "details": "DetailsBenefitsImmediately brightens, hydrates, and soothes skinHelps defend against heat aging and improves the look of skin texture + toneHelps protect against UV rays to prevent early skin agingKey IngredientsSPF 50: protects against UVA + UVB raysThermaradiance complex and Vitamin E: defends against visible signs of heat agingUltra-Stable Vitamin C: brightens and fights free radicalsBisabolol, Allantoin and Safflower: hydrate and soothe skinResearch Results100% felt it blended well into skin and left no white cast94% skin felt moisturized94% felt product comfortable for all day wear*Consumer perception based on a 3-week clinical study of 33 subjects, 1 application/dayItem 2635497How To UseApply liberally to face and neck, preferably 15 minutes prior to sun exposure. Precautions: For external use only. Do not use on damaged or broken skin. Avoid contact with eyes. If contact occurs, flush with water. Discontinue use if skin irritation or redness develops. Do not use on infants under 6 months.IngredientsActive: Avobenzone (3%), Homosalate (7%), Octisalate (5%) Octocrylene (10%). Inactive: Water/Aqua/Eau, Carthamus Tinctorius (Safflower) Oleosomes, Propanediol, Butyloctyl Salicylate, Bentonite, Butylene Glycol, Dibutyl Adipate, Polysorbate 80, Physalis Pubescens Fruit Juice, C12-15 Alkyl Benzoate, Diethylhexyl 2,6-Naphthalate, VP/Eicosene Copolymer, Aminopropyl Ascorbyl Phosphate, Hydroxyacetophenone, Dipotassium Glycyrrhizate, Glycine Soja (Soybean) Oil, Verbascum Thapsus Extract, Citrus Nobilis (Mandarin Orange) Peel Oil, Ricinus Communis (Castor) Seed Oil, Daucus Carota Sativa (Carrot) Root Extract, Citrus Aurantium Dulcis (Orange) Fruit Extract, Citrus Paradisi (Grapefruit) Fruit Extract, Glycerin, Citrus Aurantifolia (Lime) Oil, Tocopherol, Hydrogenated Lecithin, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Allantoin, Ascorbyl Methylsilanol Pectinate, Beta-Carotene, Caprylic/Capric Triglyceride, Bisabolol, Gluconolactone, Lecithin, Boron Nitride, Xanthan Gum, Methylpropanediol, Silica, Sodium Stearoyl Glutamate, Potassium Cetyl Phosphate, Tetrahydroxypropyl Ethylenediamine, Trisodium Ethylenediamine Disuccinate, Citric Acid, Sodium Hydroxide, Sodium Acrylates Copolymer, Sodium Benzoate, Potassium Sorbate, Limonene, Citrus Species Peel Extract.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Apply liberally to face and neck, preferably 15 minutes prior to sun exposure. Precautions: For external use only. Do not use on damaged or broken skin. Avoid contact with eyes. If contact occurs, flush with water. Discontinue use if skin irritation or redness develops. Do not use on infants under 6 months.",
  "ingredients": [
    "Active: Avobenzone (3%)",
    "Homosalate (7%)",
    "Octisalate (5%) Octocrylene (10%). Inactive: Water/Aqua/Eau",
    "Carthamus Tinctorius (Safflower) Oleosomes",
    "Propanediol",
    "Butyloctyl Salicylate",
    "Bentonite",
    "Butylene Glycol",
    "Dibutyl Adipate",
    "Polysorbate 80",
    "Physalis Pubescens Fruit Juice",
    "C12-15 Alkyl Benzoate",
    "Diethylhexyl 2",
    "6-Naphthalate",
    "VP/Eicosene Copolymer",
    "Aminopropyl Ascorbyl Phosphate",
    "Hydroxyacetophenone",
    "Dipotassium Glycyrrhizate",
    "Glycine Soja (Soybean) Oil",
    "Verbascum Thapsus Extract",
    "Citrus Nobilis (Mandarin Orange) Peel Oil",
    "Ricinus Communis (Castor) Seed Oil",
    "Daucus Carota Sativa (Carrot) Root Extract",
    "Citrus Aurantium Dulcis (Orange) Fruit Extract",
    "Citrus Paradisi (Grapefruit) Fruit Extract",
    "Glycerin",
    "Citrus Aurantifolia (Lime) Oil",
    "Tocopherol",
    "Hydrogenated Lecithin",
    "Acrylates/C10-30 Alkyl Acrylate Crosspolymer",
    "Allantoin",
    "Ascorbyl Methylsilanol Pectinate",
    "Beta-Carotene",
    "Caprylic/Capric Triglyceride",
    "Bisabolol",
    "Gluconolactone",
    "Lecithin",
    "Boron Nitride",
    "Xanthan Gum",
    "Methylpropanediol",
    "Silica",
    "Sodium Stearoyl Glutamate",
    "Potassium Cetyl Phosphate",
    "Tetrahydroxypropyl Ethylenediamine",
    "Trisodium Ethylenediamine Disuccinate",
    "Citric Acid",
    "Sodium Hydroxide",
    "Sodium Acrylates Copolymer",
    "Sodium Benzoate",
    "Potassium Sorbate",
    "Limonene",
    "Citrus Species Peel Extract"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "moisturizer",
      "sunscreen"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "dewy",
      "sheer",
      "oil"
    ],
    "brand": [
      "mid-range",
      "premium"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "natural",
      "spf",
      "hydrating"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2049954",
    "total_reviews": 166,
    "reviews": [
      {
        "review_id": 554267711,
        "rating": 5,
        "headline": "The best",
        "comments": "I love how i can use this so i dont have spend $150 on a serum!!!! The smell is amazing and it goes on smooth.",
        "nickname": "Orange",
        "location": "Lynden, WA",
        "created_date": 1748596982813,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553772159,
        "rating": 2,
        "headline": "No, anymore",
        "comments": "I did not like it, it is very oily, maybe it will work for very dry skin.",
        "nickname": "Xochitl",
        "location": "Minnesota",
        "created_date": 1747857557410,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 553647834,
        "rating": 4,
        "headline": "Illuminating SPF",
        "comments": "After reading reading the reviews, I decided to try this myself. All I use is Dermalogica for face care besides panoxyl wash for acne. I love the packaging. It's very clean and easy to use. The product itself I noticed is thicker than other SPF products I have used. That being said, I found that using my circular hydration serum before this product allowed it to go on smoother. It definitely gave me a more brighter, illuminating look, even after applying my powder foundation. I do feel like overall this product is a good buy given the 50 SPF and heat aging protector, especially if you're in the sun.",
        "nickname": "skincaregirly3",
        "location": "az",
        "created_date": 1747804178501,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 1
      },
      {
        "review_id": 553238372,
        "rating": 1,
        "headline": "If you do facials or saunas!!!",
        "comments": "If you do facials or saunas, do not use this product! My skin turned bright red and felt like the worst sunburn. I am on day 5 of recovery! Might need to go to dermatologist for healing recommendation.",
        "nickname": "Mary J.",
        "location": "Columbus, OH",
        "created_date": 1747100210341,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552917704,
        "rating": 5,
        "headline": "I was not gifted by a promotion",
        "comments": "For the first time ever I went on vacation to the tropics(San Juan, PR) and didn't come back with splotchy melasma face :)\nI'm 59 and have used sunscreen everyday on my face for 20 years, this is the best.",
        "nickname": "Trippy",
        "location": "Minnesota",
        "created_date": 1746495285665,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551074605,
        "rating": 4,
        "headline": "Dewy!",
        "comments": "So glowy and moisturizing on my skin, I love these types of SPF. It did break me out rather quickly though - I think that might just be due to my sensitive skin not tolerating vitamin C too well, other Dermalogica SPF's don't break me out at all. It still left a beautiful effect on my skin when applied though. Gifted by Dermalogica.",
        "nickname": "Logi",
        "location": "New York",
        "created_date": 1743871545550,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549721795,
        "rating": 5,
        "headline": "Love!",
        "comments": "Gifted by dermalogica. My skin tone is very light, but I'm not someone that always burns no matter what. I actually tan pretty easily as long as I wear some sunscreen. But because my skin is so light, it's really easy to tell when I get any color after being outside. It's a light and sheer feeling formula that is non greasy that seems to work well for my skin without irritation.",
        "nickname": "HughHue",
        "location": "Virginia",
        "created_date": 1742737718094,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 549713986,
        "rating": 5,
        "headline": "everyday use",
        "comments": "Gifted by dermalogica. This sunscreen has become a favorite. It is very lightweight that I can use it everyday without the need of applying foundation on top. My skin feels hydrated and healthy when I use it and it Kees it protected from UVA rays.",
        "nickname": "Karma",
        "location": "Arizona",
        "created_date": 1742720561328,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549700304,
        "rating": 5,
        "headline": "Works great!",
        "comments": ". This SPF is a powerhouse for anyone serious about skincare. The BioLumin-C Heat Aging Protector not only shields against UV rays with SPF50 but also defends against heat-induced aging—something most sunscreens don't address. The lightweight formula absorbs quickly without feeling greasy, making it perfect for daily wear under makeup. Plus, the vitamin C infusion leaves skin looking brighter and more even over time. If you're looking for a high-performance sunscreen that does more than just block the sun, this one's worth the investment.",
        "nickname": "Annie Mae",
        "location": "Texas",
        "created_date": 1742676795251,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 1
      },
      {
        "review_id": 549672017,
        "rating": 5,
        "headline": "Buy again",
        "comments": "This product is unique and I enjoyed using it. It left my skin feeling very moisturized. I did not see a white cast on my skin which is a bonus. I'll be getting this again once I run out. Give it a try! Complimentary from Dermalogica",
        "nickname": "Maya",
        "location": "Washington dc",
        "created_date": 1742611056053,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 549659665,
        "rating": 4,
        "headline": "I see a lot of potential in this product",
        "comments": "I received this product complimentary from Dermalogica. My opinions are honest and based on my sole experience using this product. I have been a big Dermalogica fan and I get excited every time when I get to try a product from them. For context, I have sensitive combination skin and suncare is of outmost importance in my daily skincare routine. This moisturizer comes in a nice, well thought packaging, designed to be easily used. The formula goes into the skin easily, but I would not call it lightweight. There is no white cast, it has a pleasant smell and I feels very hydrating on. The SPF factor is a definite plus. I like that it brings out my natural skin glow. Having sensitive combination skin, I noticed a slight greasy feel after applying it, so I would advice not to put makeup right away. Maybe wait for a bit. I also felt a slight discomfort around my eye area. Overall, I like the product and I will use it until it's finished.",
        "nickname": "Rally22",
        "location": "Boston, MA",
        "created_date": 1742583988759,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549586771,
        "rating": 5,
        "headline": "Loving this Skincare with SPF!",
        "comments": "This skincare is honestly the best! It goes on smooth and smells a little like traditional sunscreen but not strong. I love that it protects my skin with SPF while still helping my skin get moisture. The vitamin C in it seems to have really helped brighten my skin too! Immediately after putting it on I noticed my skin looked so pretty and glowy! I had a few dry spots from that seemed to look a bit less red too. It layered well underneath my makeup I do daily so def recommend! This product was Gifted by dermalogica in exchange for my honest review.",
        "nickname": "Katie",
        "location": "Bakersfield, CA",
        "created_date": 1742457326419,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 549579146,
        "rating": 5,
        "headline": "Worth the price point!",
        "comments": "Gifted by Dermalogica I really like this product. It's a thicker consistency so I add it a few minutes after adding my moisturizer. I've never been one for vitamin C simply because I never know when in my skincare routine to apply it but since this has SPF, it makes it easy for me to remember to use. There's no scent, it hasn't irritated my skin at all and I looove the pump, it makes it so easy to apply. If this is within your budget, it's definitely worth the price!",
        "nickname": "Samantha",
        "location": "San Diego, CA",
        "created_date": 1742426237296,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 549574560,
        "rating": 5,
        "headline": "Great SPF moisturizer with Vitamin C",
        "comments": "I been using this every morning for over week now and I'm loving how redness on my cheeks are fading. It gives me the nicest glow on my skin it brightens my skin as well. I love that it has SPF 50 to protect my skin. My skin feels very hydrated when I use it. The texture is great. It's lightweight. It doesn't leave a white cast. It has great ingredients.",
        "nickname": "Christieblogs",
        "location": "Michigan",
        "created_date": 1742417342814,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549486390,
        "rating": 5,
        "headline": "Perfect for everyday",
        "comments": "A new skincare stable added to my regimen. This product works so amazing. It's perfect for everyday use. The SPF is the cherry on top alongside with the vitamin C. My skin has been looking brighter and healthy. Gifted by",
        "nickname": "Liliana",
        "location": "New York NY",
        "created_date": 1742394004299,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549397105,
        "rating": 5,
        "headline": "Great for the sun",
        "comments": "I have to get all the protection from sun living on the West Coast. This SPF is the last step of my skincare routine to get me ready for the day. I like that it doesn't leave a white cast and layers evenly. Gifted by dermalogica.",
        "nickname": "Crystal",
        "location": "Los Angeles, CA",
        "created_date": 1742369140654,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549376313,
        "rating": 5,
        "headline": "Vitamin C and sun protection in one",
        "comments": "I love an SPF that does more than just protect—that's what Dermalogica Heat aging protector does for me, it gives my skin that extra boost.  It's  my morning routine favorite because it doubles as a good serum delivering the benefits of vitamin C. I love that I can keep my routine simple—just one step for hydration, skincare benefits, and sun protection. Perfect for busy moms. \n\nI apply it every morning and let it sit for a while, before makeup, and it layers beautifully without pilling. Blends with no white cast. If you have dry skin like me, you'll love it\n\nThis product was gifted by Dermalogica, but as always, my opinions are 100% my own!",
        "nickname": "Tatyana",
        "location": "MD",
        "created_date": 1742345795437,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549357325,
        "rating": 4,
        "headline": "Would recommend",
        "comments": "I really like this product, it applied smoothly and doesn't feel sticky on my skin nor does it peel, especially after applying makeup on top. It has vitamin C which I love that it will help brighten up my skin while protecting it from sun damage. Complimentary from dermalogica.",
        "nickname": "Yumna",
        "location": "Texas",
        "created_date": 1742340004310,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549357120,
        "rating": 5,
        "headline": "Quality",
        "comments": "Wow this is a serum that is invigorating and pretty special. Since turning 30 I have been more interested in seeking treatments for targeting my fine lines. This serum is biolumin C HEAT aging protector. Amazing quality with this brand. I was gifted this product complimentary from Dermalogica for review.",
        "nickname": "Apexandra",
        "location": "Texas",
        "created_date": 1742339959654,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 548984322,
        "rating": 5,
        "headline": "Amazing SPF",
        "comments": "I love the Dermalogica C-Heat Aging Protector SPF that was Gifted by Dermalogica because it combines powerful sun protection with skin-loving ingredients that keep my complexion healthy and youthful. Infused with vitamin C, it brightens my skin while defending against environmental stressors, and the heat protection technology helps prevent premature aging caused by UV rays and heat exposure. The formula feels lightweight and non-greasy, making it perfect for daily wear under makeup or on its own. It's the ultimate multitasker, protecting my skin while keeping it glowing and healthy!",
        "nickname": "Jenn",
        "location": "Los Angeles",
        "created_date": 1742247939914,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 147,
      "pages_total": 8,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2049954/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        1,
        2,
        2,
        19,
        142
      ],
      "review_histogram": [
        1,
        2,
        2,
        19,
        142
      ],
      "rating_count": 166,
      "review_count": 166,
      "average_rating": 4.8,
      "recommended_ratio": 0.99,
      "media": [
        {
          "id": "549376263",
          "review_id": 549376313,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/mhtnl9wa1pshg7k0xtyy.jpg",
          "headline": "Vitamin C and sun protection in one",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Tatyana",
          "created_date": 1742345795437
        },
        {
          "id": "548903766",
          "review_id": 548903765,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/e3ea9241hrocfd5orn0m.jpg",
          "headline": "Great sunscreen",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Skyla",
          "created_date": 1742221415367
        },
        {
          "id": "548887683",
          "review_id": 548887728,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/nct6ann1qc273xroqrci.jpg",
          "headline": "It's amazing",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Diana",
          "created_date": 1742186951589
        },
        {
          "id": "548887682",
          "review_id": 548887728,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/iyaywtbtfxjduzcyjpfa.jpg",
          "headline": "It's amazing",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Diana",
          "created_date": 1742186951589
        },
        {
          "id": "548701735",
          "review_id": 548701744,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/dhyfgbg7x9qb0s8wgiiw.jpg",
          "headline": "Great product.",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Nathy G",
          "created_date": 1741920075420
        },
        {
          "id": "548699099",
          "review_id": 548699080,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ndzkwnscvass5p3vbvtj.jpg",
          "headline": "Pretty good SPF!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Lola",
          "created_date": 1741911941141
        },
        {
          "id": "548698904",
          "review_id": 548698894,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/gzyfarjqfrup45bea3uh.jpg",
          "headline": "Amazing!!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Busymom",
          "created_date": 1741911420912
        },
        {
          "id": "548645898",
          "review_id": 548645868,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/q0nnaoli7ygmp3wdqrwa.jpg",
          "headline": "10/10",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "beautiful",
          "nickname": "Jessicale99",
          "created_date": 1741817759677
        },
        {
          "id": "548643294",
          "review_id": 548643287,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/xkcrn8wtx90rseyy1ywz.jpg",
          "headline": "Has Vitamin C and I love it.",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Great texture",
          "nickname": "KAREN",
          "created_date": 1741812790227
        },
        {
          "id": "548643266",
          "review_id": 548643287,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/d23ryqd45btokeef7qhy.jpg",
          "headline": "Has Vitamin C and I love it.",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "works well",
          "nickname": "KAREN",
          "created_date": 1741812790227
        },
        {
          "id": "548610665",
          "review_id": 548610618,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/jmdgvbhildsgk09nz94x.jpg",
          "headline": "Must have",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Veronica",
          "created_date": 1741742232473
        },
        {
          "id": "548607885",
          "review_id": 548607884,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/rrdqilfgshq1jxlezt2z.jpg",
          "headline": "Peels",
          "rating": 2,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Megan",
          "created_date": 1741734066278
        },
        {
          "id": "548605731",
          "review_id": 548605775,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/yeykdvi04geb33ojldlc.jpg",
          "headline": "100% recommend",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "My new fav",
          "nickname": "Glory",
          "created_date": 1741730369060
        },
        {
          "id": "548574959",
          "review_id": 548574975,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/vgsm7mxpty1m18xsmmq5.jpg",
          "headline": "3 in 1! All you need",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Sarah",
          "created_date": 1741711942847
        },
        {
          "id": "548497291",
          "review_id": 548497173,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ug65w6rmizpzkn30wfzy.jpg",
          "headline": "Love this spf",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Mia",
          "created_date": 1741705287913
        },
        {
          "id": "548497354",
          "review_id": 548497173,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/qpqszd3hh0tga4gtatme.jpg",
          "headline": "Love this spf",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Mia",
          "created_date": 1741705287913
        },
        {
          "id": "548268418",
          "review_id": 548268403,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/fhzkcwsima9rjzvxxfaf.jpg",
          "headline": "Brightens and protects!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Anna",
          "created_date": 1741646482254
        },
        {
          "id": "548268474",
          "review_id": 548268403,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/xf6pcumppvkpfswqxgyg.jpg",
          "headline": "Brightens and protects!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Anna",
          "created_date": 1741646482254
        },
        {
          "id": "548065759",
          "review_id": 548065758,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/jzftbbdaq19jdabot60n.jpg",
          "headline": "Luxurious care with Vitamin C and SPF 50 – my skin glows!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "GANNA",
          "created_date": 1741618311404
        },
        {
          "id": "548065775",
          "review_id": 548065758,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/b35cqj7kvfwfszapzqkg.jpg",
          "headline": "Luxurious care with Vitamin C and SPF 50 – my skin glows!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "GANNA",
          "created_date": 1741618311404
        },
        {
          "id": "548065109",
          "review_id": 548065126,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/klggyxkmgijydqmhon6m.jpg",
          "headline": "Great SPF and moisturizer",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Mandy",
          "created_date": 1741616559590
        },
        {
          "id": "548062124",
          "review_id": 548062008,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/kq4vr9kgckqnaelb96lm.jpg",
          "headline": "New SPF Obsession",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "SPF",
          "nickname": "Meredith",
          "created_date": 1741611364596
        },
        {
          "id": "548010515",
          "review_id": 548010501,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/bnapemhpihxmqh6ietc8.jpg",
          "headline": "Heat damage is slowly improving!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "JackieA",
          "created_date": 1741477208704
        },
        {
          "id": "547944093",
          "review_id": 547944182,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/v4xg1ogyyeetxx3ibxqi.jpg",
          "headline": "Love it",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Karla",
          "created_date": 1741383447666
        },
        {
          "id": "547905536",
          "review_id": 547905528,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/wmwitfwghtgho1qmrpxb.jpg",
          "headline": "Great product!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Lisa",
          "created_date": 1741356623488
        },
        {
          "id": "547905358",
          "review_id": 547905262,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/tx7rl1jyim8e5cooo7qp.jpg",
          "headline": "Love it!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Lisa",
          "created_date": 1741356461468
        }
      ],
      "faceoff_positive": {
        "comments": "I received this product complimentary from Dermalogica. My opinions are honest and based on my sole experience using this product. I have been a big Dermalogica fan and I get excited every time when I get to try a product from them. For context, I have sensitive combination skin and suncare is of outmost importance in my daily skincare routine. This moisturizer comes in a nice, well thought packaging, designed to be easily used. The formula goes into the skin easily, but I would not call it lightweight. There is no white cast, it has a pleasant smell and I feels very hydrating on. The SPF factor is a definite plus. I like that it brings out my natural skin glow. Having sensitive combination skin, I noticed a slight greasy feel after applying it, so I would advice not to put makeup right away. Maybe wait for a bit. I also felt a slight discomfort around my eye area. Overall, I like the product and I will use it until it's finished.",
        "headline": "I see a lot of potential in this product",
        "rating": 4,
        "ugc_id": 549659665
      },
      "faceoff_negative": {
        "comments": "I am a fan of the DYNAMIC SKIN RECOVERY SPF 50, but I decided to try the new BIOLUMIN-C HEAT AGING PROTECTOR SPF 50, I don't like it for two reasons: first, it doesn't moisturize as well as the DYNAMIC SKIN RECOVERY SPF 50, and second, it flakes, as you can see in the pictures. I'm going back to using Dynamic Skin Recovery SPF 50.",
        "headline": "It did not meet my expectations!",
        "rating": 3,
        "ugc_id": 557395499
      },
      "name": "Biolumin-C Vitamin C Heat Aging Protector SPF 50",
      "native_review_count": 147,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 19,
      "locale": "en_US"
    }
  }
}