{
  "product_id": "pimprod2025925",
  "product_url": "https://www.ulta.com/p/ultra-defining-gel-strong-hold-no-crunch-styler-pimprod2025925",
  "extracted_at": "2025-09-23T05:34:52.743200+00:00",
  "product_name": "DevaCurlULTRA DEFINING GEL Strong Hold No-Crunch Styler",
  "brand": "DevaCurl",
  "categories": [
    "Home",
    "Hair",
    "Styling Products",
    "Curl Enhancing"
  ],
  "category_keys": [
    "home",
    "hair",
    "styling-products",
    "curl-enhancing"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "32.00",
  "availability": "in_stock",
  "rating_avg": "3.7",
  "rating_count": "262",
  "images": [
    "https://media.ulta.com/i/ulta/2581902?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2581902?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2581902cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2581902cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2581902cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2581902cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2581902cm_vid01/thumbs/b409451d-f228-4a0b-be70-3a130b1876c6?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsCruelty FreeVeganSustainable PackagingDevaCurl's ULTRA DEFINING GEL Strong Hold No-Crunch Styler gives you definition without the crunch. This non-flaking formula with a strong curl-locking blend provides a non-sticky curl cast that defines, fights frizz, and amplifies shine and bounce.",
  "details": "DetailsBenefitsGives all curls ultimate curl flexibilityProvides strong holdEncourages curl shape & definitionControls & reduces frizzNon-flaking, non-stiff, non-crunchy & has a non-drying feel on hairFeaturesNon-flaking formula brings bounce back to your natural texture, minimizes flyaways, encourages curl clumping, improves manageability & combabilityDermatologist co-developed, backed by science & stylist approvedA crisp, uplifting juicy Bright Breeze scent that starts with notes of pomegranate, raspberry and salty melon, followed by waterlily and gardenia & finishes with sandalwood, cotton candy and muskBottle made from 50% recycled ocean bound plasticsGluten-free, cruelty-free & veganFormulated WithoutSLS/SLES sulfatesSiliconesParabensItem 2581902How To UseRub between palms, scrunch into soaking wet curls.Do not rinse.Style as usual.Once fully dry, shake at the root and scrunch to soften the cast.If you want another strong curl-locking blend option, Defining Spray Gel is recommended. If you want the lightest curl-locking blend, DevaCurl recommends Light Defining Gel. If you want the strongest curl-locking blend, Supreme Defining Gel is recommended.Keep out of the reach of children. In the event of contact with eyes, rinse thoroughly with water.IngredientsAqua/Water/Eau, Vp/Va Copolymer, Peg-40 Hydrogenated Castor Oil, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Aminomethyl Propanol, Disodium EDTA, Ethylhexylglycerin, Glycerin, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Polyquaternium-7, Tocopherol, Laurtrimonium Chloride, Phenoxyethanol, Sodium Benzoate, Sodium Bisulfite, Parfum/Fragrance, Citral, Hydroxycitronellal, Limonene, Linalool.As is common in the hair care industry, from time to time DevaCurl may update certain ingredients, such as preservative systems or fragrance, to improve quality, enhance the performance of the product, or to comply with the latest regulatory requirements. You should always check the product's packaging for the most up to date and accurate ingredient information.DevaCurl products go through rigorous testing and adhere to all relevant cosmetics regulations for product safety before they reach the market.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Rub between palms, scrunch into soaking wet curls.Do not rinse.Style as usual.Once fully dry, shake at the root and scrunch to soften the cast.If you want another strong curl-locking blend option, Defining Spray Gel is recommended. If you want the lightest curl-locking blend, DevaCurl recommends Light Defining Gel. If you want the strongest curl-locking blend, Supreme Defining Gel is recommended.Keep out of the reach of children. In the event of contact with eyes, rinse thoroughly with water.",
  "ingredients": [
    "Aqua/Water/Eau",
    "Vp/Va Copolymer",
    "Peg-40 Hydrogenated Castor Oil",
    "Acrylates/C10-30 Alkyl Acrylate Crosspolymer",
    "Aminomethyl Propanol",
    "Disodium EDTA",
    "Ethylhexylglycerin",
    "Glycerin",
    "Hydroxypropyltrimonium Hydrolyzed Corn Starch",
    "Polyquaternium-7",
    "Tocopherol",
    "Laurtrimonium Chloride",
    "Phenoxyethanol",
    "Sodium Benzoate",
    "Sodium Bisulfite",
    "Parfum/Fragrance",
    "Citral",
    "Hydroxycitronellal",
    "Limonene",
    "Linalool.As is common in the hair care industry",
    "from time to time DevaCurl may update certain ingredients",
    "such as preservative systems or fragrance",
    "to improve quality",
    "enhance the performance of the product",
    "or to comply with the latest regulatory requirements. You should always check the product's packaging for the most up to date and accurate ingredient information.DevaCurl products go through rigorous testing and adhere to all relevant cosmetics regulations for product safety before they reach the market"
  ],
  "extended_contents": {
    "text": "Show less"
  },
  "tags": {
    "category": [
      "hair",
      "haircare"
    ],
    "product_type": [
      "cleanser"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "sheer",
      "gel",
      "oil"
    ],
    "ingredients": [
      "fragrance"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "natural"
    ]
  },
  "reviews": {
    "product_id": "pimprod2025925",
    "total_reviews": 262,
    "reviews": [
      {
        "review_id": 559900738,
        "rating": 2,
        "headline": "New, worse formula",
        "comments": "Repurchased this for the first time in years and am so disappointed it's a compleltely new formulation. Smells good and that's where the pros stop. No hold, no cast. Pointless.",
        "nickname": "Raquel",
        "location": "Chicago",
        "created_date": 1754857060593,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555105433,
        "rating": 5,
        "headline": "Love this gel",
        "comments": "Always used Deva Curl on my curls. Only product that could manage my curls and keep them looking gorgeous all day. Then I stopped using the products when all that stuff came out about the products. I never could find another product to manage my curls like Deva Curl. To me my curls never looked the same again and I know my hair. I loved my curls now I was getting tired of them because I couldn't do anything to with my curls. Recently I decided to try the Deva Curl strong hold defining gel again. I remembered how it made my hair look and the formula changed so I wanted to give it a try. Its only been a week. My curls are more defined, my hair is fuller and it controlls my frizz. I hope it continues to improve my hair the more I use it. There was another Deva Curl product I used with the gel, but its been so long I can't remember what it was. I'm loving my curls so far.",
        "nickname": "walkerc6891",
        "location": "Rocky Mount, NC",
        "created_date": 1749839553965,
        "bottom_line": null,
        "helpful_votes": 19,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553600916,
        "rating": 3,
        "headline": "Gone way down in wuality",
        "comments": "This stuff used to be so good! I used devacurl all throughout the early-mid 2000s and then switched to leave in conditioner only. Got a bottle of this again the other day and it's gone down in quality so much. The archangel gel (now discontinued) was the best, but the ultra used to be good too. If you put enough in to actually hold the curls it just feels like there's a coating all over your hair. Put less in so it doesn't feel like it's coated in goop and it won't hold your curls. I won't get anything else from devacurl again.",
        "nickname": "Liza",
        "location": "Austin TX",
        "created_date": 1747697654824,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553596564,
        "rating": 3,
        "headline": "Wanted to love",
        "comments": "I had high hopes for this curl gel but unfortunately it dried my hair out so bad. I used leave-in conditioner first like I always do and it did define my waves really good but after my hair dried completely it felt like straw. Maybe it's bc I have fine hair but it's healthy and I've never had a product make my hair feel dry before.",
        "nickname": "Claire",
        "location": "Wilmington, NC",
        "created_date": 1747688545963,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553257190,
        "rating": 5,
        "headline": "Love this Product!",
        "comments": "I have used this product for years.  Took a break from it to try some others, but keep coming back to the tried and true.  Always gives my curls good definition with out that heavy or straw type feel to my hair.",
        "nickname": "Cathy",
        "location": "Mechanicsburg, PA",
        "created_date": 1747150036745,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547404055,
        "rating": 3,
        "headline": "Better than nothing",
        "comments": "I was a die hard Deva Curl Supreme defining gel user. My curls were amazing and would constantly get compliments. Of course like every product you love its discontinued so I had to buy the ultra. Its barely gel, its practically water. Barely does anything for my curls than a wave. But again, supreme was discontinued so its better than nothing.",
        "nickname": "Melissa",
        "location": "Las Vegas, NV",
        "created_date": 1740545442010,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542154783,
        "rating": 5,
        "headline": "This Works",
        "comments": "This is the only hair gel that helps define my hair and doesn't leave white flakes. It does seem like the formula has changed again. For a while it was a thick gray color and is now back to clear and runny.",
        "nickname": "Alyssa",
        "location": "Oklahoma City",
        "created_date": 1735852235970,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 538032987,
        "rating": 3,
        "headline": "I'd love it if I could get it out of the bottle.",
        "comments": "I really like the way this gel works to reinforce my natural curls and waves. That being said, I can't get the pump to unlock. The large bottle size makes it a challenge to get product out of the bottle when in the shower. Unfortunately, my last, smaller bottle lasted so long that I passed the return window for this. I just wish I could get a pump that works.",
        "nickname": "Disneygal18",
        "location": "San Diego",
        "created_date": 1731951787905,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537278205,
        "rating": 5,
        "headline": "Best curly hair gel ever!",
        "comments": "I feel like I have tried every curly hair gel made and Deva curl defining gel is the BEST! Im going on vacation out of the country and afraid to run out of the gel 🤣 since I can't live without this gel!",
        "nickname": "Teresa",
        "location": "Brentwood, CA",
        "created_date": 1730695784936,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 536791748,
        "rating": 1,
        "headline": "Poor quality",
        "comments": "It does not feel like gel. It feels like just water.",
        "nickname": "Martha",
        "location": "Camarillo, CA",
        "created_date": 1729887601871,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 2
      },
      {
        "review_id": 525037363,
        "rating": 5,
        "headline": "Love it!",
        "comments": "I have wavy/curly hair but its also bery thin so keeping my curls defined is super hard. For the first time ever, my curls are actually \ndefined after styling my hair. I got this as a free sample and im so glad i did because im sold on this product. Im on day 2 and my curls are still there. Sprayed some water on them to refresh and good as new!",
        "nickname": "Cece",
        "location": "North Carolina",
        "created_date": 1721143284642,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 522252862,
        "rating": 5,
        "headline": "Best curly hair gel!",
        "comments": "I have tried what feeks like every curky hair product ever made and finally found a product that works! \nI use a good amount of the gel to get the look i like :)",
        "nickname": "Teresa",
        "location": "Brentwood, CA",
        "created_date": 1717905757192,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 516018528,
        "rating": 2,
        "headline": "Meh",
        "comments": "For a product that has \"ultra-defining\" in its name, it fell short. This gel didn't perform as advertised and made my hair a frizzy mess. For the price and the brand, I expected much more as far as quality.",
        "nickname": "Betty",
        "location": "Minneapolis, MN",
        "created_date": 1716307696211,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 496730484,
        "rating": 2,
        "headline": "Ok hold",
        "comments": "This gel did great the first day. It didn't hold up to curl refreshing and it's left my hair flaky. I will not be continuing with this product..",
        "nickname": "Darla",
        "location": "Indiana",
        "created_date": 1705896960112,
        "bottom_line": "No",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 486458710,
        "rating": 5,
        "headline": "Finally a product that I actually like!",
        "comments": "Ive been looking for a product my entire life that holds my curls eventually i gave up and started straightening my hair in middle school and high school im now 29 and just recently found this product and gave jt a try. Im honestly really happy with it. Im mixed so my hair is a little nappy and a pain in my butt to maintain. This product is my absolute favorite.",
        "nickname": "Curlpain",
        "location": "Thousand Oaks, CA",
        "created_date": 1704319661573,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 484326975,
        "rating": 4,
        "headline": "It's my go-to",
        "comments": "Depending on the weather my hair varies from curly to wavy. This gel helps give me consistent results no matter what. After applying gel I diffuse my hair to about 90% dry and then allow to air dry the rest of the way. After it's dry I scrunch my hair and off I go.",
        "nickname": "Andrea",
        "location": "Iowa",
        "created_date": 1702315006339,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 477270719,
        "rating": 1,
        "headline": "Drying",
        "comments": "Leaves your Hair VERY DRY and BRITTLE!!!",
        "nickname": "E",
        "location": "Virginia",
        "created_date": 1697769123659,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 477146213,
        "rating": 1,
        "headline": "For all my curly and natural hair girls DO NOT GET THIS",
        "comments": "There are so many women who have used this. It will damage your curls!! Please as a hair stylist, I'm begging do not use this on your curls.",
        "nickname": "kayla",
        "location": "Tennessee",
        "created_date": 1697644898601,
        "bottom_line": "No",
        "helpful_votes": 12,
        "not_helpful_votes": 18
      },
      {
        "review_id": 475857314,
        "rating": 5,
        "headline": "Love it",
        "comments": "Definitely my favorite gel I've tried. Absolutely no crunch or flakiness. I've been using this for over a year now in conjunction with the Curlbond cleanser and conditioner. Over time it can become a bit drying, so I'd recommend adding in an oil or cream before the gel. It holds my hair for about 5 days, so I only have to wash my hair once a week. I've found that I get the best results when I air dry instead of diffusing. I usually plop up my hair after applying while I do my skincare, so it absorbs for a few minutes before I style it. I have type 3A curls and this is definitely a great product for similar hair types if used properly. It also smells amazing!",
        "nickname": "al",
        "location": "ct",
        "created_date": 1697016105400,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 465076347,
        "rating": 5,
        "headline": "Great hold that controls frizz",
        "comments": "I've been using this for the last 10 years.  It took some time to figure out you really do need to use this in wet, not damp, hair.  It's also heavy on protein so limit it in your other products and dont use every other day or your hair may begin to feel like straw. My hair loves protein bc i use bleach and hair color regularly but for healthier hair, yours may feel like straw if used often.  I can get several good days of hold with this gel. It does have a citrus fragrance so if you're sensitive it may bother you but I dont smell it after my hair is dry.",
        "nickname": "Lee",
        "location": "Texas",
        "created_date": 1689473159162,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 108,
      "pages_total": 6,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2025925/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "bestuses",
          "name": "Best Uses",
          "type": "tag",
          "values": [
            {
              "label": "Use in wet hair",
              "count": 1
            },
            {
              "label": "+ For when you are going to air dry your hair.",
              "count": 1
            },
            {
              "label": "In dump hair",
              "count": 1
            },
            {
              "label": "For styling",
              "count": 1
            }
          ],
          "display_values": [
            "+ For when you are going to air dry your hair.",
            "For styling",
            "In dump hair",
            "Use in wet hair"
          ]
        },
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "Destroys curl pattern",
              "count": 1
            },
            {
              "label": "Will make your hair fall out",
              "count": 1
            },
            {
              "label": "Does not hold curls",
              "count": 1
            },
            {
              "label": "Very thick",
              "count": 1
            },
            {
              "label": "Packaging",
              "count": 1
            },
            {
              "label": "+ Bottle could be slimer, easier to hold.",
              "count": 1
            },
            {
              "label": "None",
              "count": 1
            },
            {
              "label": "Dry",
              "count": 1
            },
            {
              "label": "Frizzy",
              "count": 1
            },
            {
              "label": "Straw feeling",
              "count": 1
            },
            {
              "label": "Formula changed and smells awful compared before",
              "count": 1
            },
            {
              "label": "no shine, no pump, wears of if you touch hair.",
              "count": 1
            }
          ],
          "display_values": [
            "+ Bottle could be slimer, easier to hold.",
            "Destroys curl pattern",
            "Does not hold curls",
            "Dry",
            "Formula changed and smells awful compared before",
            "Frizzy",
            "None",
            "Packaging",
            "Straw feeling",
            "Very thick",
            "Will make your hair fall out",
            "no shine, no pump, wears of if you touch hair."
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "3b, low porosity, fine hair",
              "count": 1
            },
            {
              "label": "Curly hair",
              "count": 1
            },
            {
              "label": "I am Hispanic with natural fine, curly hair.",
              "count": 1
            },
            {
              "label": "Thick asian hair",
              "count": 1
            },
            {
              "label": "I have pretty curly hair",
              "count": 1
            }
          ],
          "display_values": [
            "3b, low porosity, fine hair",
            "Casual Dresser",
            "Comfort-seeking",
            "Curly hair",
            "Energetic/Active",
            "I am Hispanic with natural fine, curly hair.",
            "I have pretty curly hair",
            "Stylish/Fashionista",
            "Thick asian hair",
            "Trendy/Stylish Dresser",
            "Youthful"
          ]
        },
        {
          "display_type": "default",
          "key": "hairtype",
          "name": "Hair Type",
          "type": "tag",
          "values": [
            {
              "label": "Very Curly Hair",
              "count": 8
            },
            {
              "label": "Wavy Hair",
              "count": 5
            }
          ],
          "display_values": [
            "Straight Hair",
            "Very Curly Hair",
            "Wavy Hair"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "THERE ARE NO PROS WITH THIS PRODUCT",
              "count": 1
            },
            {
              "label": "It really holds my curls",
              "count": 1
            },
            {
              "label": "Great hold",
              "count": 1
            },
            {
              "label": "Leaves hair feeling silky",
              "count": 1
            },
            {
              "label": "String hold",
              "count": 1
            },
            {
              "label": "+ Curls keep their shape longer.",
              "count": 1
            },
            {
              "label": "Hold",
              "count": 1
            },
            {
              "label": "Scent",
              "count": 1
            },
            {
              "label": "Makes natural curls",
              "count": 1
            },
            {
              "label": "Cute bottles",
              "count": 1
            },
            {
              "label": "Holds",
              "count": 1
            },
            {
              "label": "Long lasting",
              "count": 1
            },
            {
              "label": "No crunch",
              "count": 1
            },
            {
              "label": "Lightweight formula, Smells great, no crunch",
              "count": 1
            }
          ],
          "display_values": [
            "+ Curls keep their shape longer.",
            "Cute bottles",
            "Great hold",
            "Hold",
            "Holds",
            "It really holds my curls",
            "Leaves hair feeling silky",
            "Lightweight formula, Smells great, no crunch",
            "Long lasting",
            "Makes natural curls",
            "No crunch",
            "Scent",
            "String hold",
            "THERE ARE NO PROS WITH THIS PRODUCT"
          ]
        }
      ],
      "rating_histogram": [
        32,
        22,
        48,
        57,
        103
      ],
      "review_histogram": [
        32,
        22,
        48,
        57,
        103
      ],
      "rating_count": 262,
      "review_count": 262,
      "average_rating": 3.68,
      "recommended_ratio": 0.65,
      "media": [
        {
          "id": "368157671",
          "review_id": 368157687,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/sv7auico4e42lolyw0vh.jpg",
          "headline": "Absolutely great!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Momof3",
          "created_date": 1626194758741
        },
        {
          "id": "368080370",
          "review_id": 368080369,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/lltp1mqn4urf0rgiwbzh.jpg",
          "headline": "Love the lightweight formula, smells fruity.",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Sugar732",
          "created_date": 1626136668086
        },
        {
          "id": "361246570",
          "review_id": 361246611,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/nxp5esjsosucxbcv5nmh.jpg",
          "headline": "Horrible",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Frizz before cast is even formed",
          "nickname": "Needa",
          "created_date": 1625340198693
        }
      ],
      "faceoff_positive": {
        "comments": "Devacurl Ultra Defining Gel has been a real game-changer for my curly hair routine. As someone with naturally curly hair, finding the right product to enhance my curls while controlling frizz has always been a challenge. After using this gel for several months, I can confidently say that it's one of the best styling products I've ever tried.\n\nThe first thing that impressed me is the consistency of the gel. It's neither too thick nor too runny, making it easy to distribute evenly through my hair. I only need a small amount, about a quarter-sized dollop, to achieve the desired results. This means the 12-ounce container lasts a long time, making it a good value for the price.\n\nOnce applied, the gel has a firm hold, but it doesn't leave my hair feeling stiff or crunchy. My curls are left soft, touchable, and bouncy, which is exactly what I want. The formula also doesn't cause any flakiness or residue buildup, even when I reapply it on second-day hair.\n\nOne of the standout features of the Devacurl Ultra Defining Gel is its ability to combat frizz. Living in a humid climate, frizz has always been my arch-nemesis, but this gel does an excellent job of keeping it at bay. My curls stay defined and smooth throughout the day, even in challenging weather conditions.\n\nAnother benefit I noticed is the lightweight feel of the gel. It doesn't weigh down my curls or make them look greasy. My hair still retains its natural volume and movement, which is essential for a more natural and effortless look.\n\nThe gel is also formulated without harsh sulfates, parabens, and silicones, which is a huge plus for those seeking more natural hair care options. It's also safe for color-treated hair, which is fantastic since I have highlights.\n\nThe scent of the Devacurl Ultra Defining Gel is pleasant and not overpowering. It has a mild tropical fragrance that lingers subtly throughout the day, making it a delightful addition to my hair routine.\n\nOverall, I am incredibly satisfied with Devacurl Ultra Defining Gel. It has transformed my curly hair, providing the definition, hold, and frizz control I've always wanted. If you have curly hair and struggle with finding the right product, I highly recommend giving this gel a try. It's a staple in my hair care routine, and I can't imagine styling my curls without it now.",
        "headline": "Game changer",
        "rating": 5,
        "ugc_id": 469834973
      },
      "faceoff_negative": {
        "comments": "So I got to try this DevaCurl Ultra Defining Gel for free for my honest opinion from Influenster and DevaCurl. I also received the DevaCurl Diffuser to use with it. I have some mixed feelings on this product. For reference my hair is very thick, frizzy, wavy and long. I'd say it's either a 2A or 2B in the curl chart. I normally straighten my hair as it doesn't ever look great with just the waves. \n\nProduct Description:\nStrong Hold No-Crunch Styler gives you definition without the crunch. This non-flaking formula with a strong curl-locking blend provides a non-sticky curl cast that defines, fights frizz, and amplifies shine and bounce. Non-flaking formula brings bounce back to your natural texture, minimizes flyaways, encourages curl clumping, improves manageability, and compatibility. Dermatologist co-developed, backed by science & stylist approved. It has a crisp, uplifting juicy Bright Breeze scent. The bottle is made from 50% recycled ocean bound plastics and is gluten-free, cruelty-free, and vegan. \n\nHOW TO USE:\nRub between palms, scrunch into soaking wet curls. Do not rinse, style as usual. Once fully dry, shake at the root and scrunch to soften the cast.\n\nMy review:\nSo I really enjoyed the fragrance of this first off. I felt it wasn't overpowering and pleasant! It's a good size bottle that's easy to work with when you have wet hands. It actually has a more watery consistency compared to most gels out there. I applied in the shower with my hair completely soaked per the instructions. I'd say it kept my hair more wavy then it normally is, but unfortunately I still had a ton of frizz. So I personally couldn't use it as it didn't look good that frizzy. So I had to straighten as I normally do. I think this product would be good for people with curlier hair then mine and is not as frizzy. I'd recommend to others but not for me unfortunately, which is why I have mixed feelings.",
        "headline": "Mixed feelings on this product",
        "rating": 3,
        "ugc_id": 510913809
      },
      "name": "ULTRA DEFINING GEL Strong Hold No-Crunch Styler",
      "native_review_count": 108,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 154,
      "locale": "en_US"
    }
  }
}