{
  "product_id": "pimprod2051077",
  "product_url": "https://www.ulta.com/p/nourishing-cleansing-oil-purify-hydrate-pimprod2051077",
  "extracted_at": "2025-09-23T04:42:39.778908+00:00",
  "product_name": "DIMENourishing Cleansing Oil to Purify + Hydrate",
  "brand": "DIME",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Cleansing Balms & Oils"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "cleansing-balms--oils"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "36.00",
  "availability": "in_stock",
  "rating_avg": "4.8",
  "rating_count": "150",
  "images": [
    "https://media.ulta.com/i/ulta/2637752?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2637752?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637752_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637752_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637752_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637752_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637752_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2637752_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2637752_vid01/thumbs/c92b9cf7-2d19-4437-b2a5-7ce5315ad945?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive BackDIME's Nourishing Cleansing Oil is a 2-in-1 cleanser and makeup remover that dissolves dirt, makeup, and sunscreen without stripping natural oils. Gentle exfoliants purify pores, while nourishing moisturizers hydrate and balance the skin barrier—leaving it soft, supple, and deeply clean.",
  "details": "DetailsBenefitsDissolves and removes dirt, makeup and sunscreenGently exfoliates and removes impuritiesDelivers hydration and balances the skin barrierRinses off without any waxy, greasy, or heavy residueKey IngredientsCaprylic/Capric Triglyceride (Coconut derived) Locks in moisture without greasy residue Helps soften, soothe & replenish skinHelianthus Annuus (Sunflower) Seed Oil Boosts hydration for smoother-looking skin Helps repair & balance the skin barrierSimmondsia Chinensis (Jojoba) Seed Oil Deeply moisturizes for more nourished skin Antioxidant-rich & non-comedogenicFormulated WithoutSulfates: DIME products never contain skin-irritating ingredients such as sulfates. Sulfate-free products are gentle on the skin and can help decrease the chances of an allergic reaction.Parabens: Certain parabens have been linked to hormone disruption. DIME prohibits all parabens, including Ethylparaben, Butylparaben, Isobutylparaben, Isopropylparaben, Methylparaben, and Propylparaben.Phthalates: Certain phthalates (like Dibutyl Phthalate, aka DBP, or DEHP, and DEP) appear on product labels, but most typically remain unlisted, hiding under the term “fragrance.” Since some phthalates have been linked to hormone disruption, DIME avoids them.Item 2637752How To UseApply a quarter-size amount of oil onto dry hands, massage in circular motions on a dry face, and rinse with water. If double cleansing, follow with DIME's Gentle Jelly Cleanser or Creamy Foam Cleanser.IngredientsLimnanthes Alba (Meadowfoam) Seed Oil, Polyglyceryl-10 Diisostearate, Polyglyceryl-10 Dioleate, Caprylic/Capric Triglyceride, Helianthus Annuus (Sunflower) Seed Oil, Cetyl Ethylhexanoate, Ethylhexyl Palmitate, Isododecane, Isohexadecane, Hydrogenated Polyisobutene, Simmondsia Chinensis (Jojoba) Seed Oil, Sambucus Nigra Fruit (Elderberry) Extract, Santalum Spicatum (Sandalwood) Oil, Tocopherol.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Apply a quarter-size amount of oil onto dry hands, massage in circular motions on a dry face, and rinse with water. If double cleansing, follow with DIME's Gentle Jelly Cleanser or Creamy Foam Cleanser.",
  "ingredients": [
    "Limnanthes Alba (Meadowfoam) Seed Oil",
    "Polyglyceryl-10 Diisostearate",
    "Polyglyceryl-10 Dioleate",
    "Caprylic/Capric Triglyceride",
    "Helianthus Annuus (Sunflower) Seed Oil",
    "Cetyl Ethylhexanoate",
    "Ethylhexyl Palmitate",
    "Isododecane",
    "Isohexadecane",
    "Hydrogenated Polyisobutene",
    "Simmondsia Chinensis (Jojoba) Seed Oil",
    "Sambucus Nigra Fruit (Elderberry) Extract",
    "Santalum Spicatum (Sandalwood) Oil",
    "Tocopherol"
  ],
  "extended_contents": {},
  "tags": {
    "product_type": [
      "cleanser",
      "moisturizer",
      "lip gloss",
      "oil"
    ],
    "skin_type": [
      "dry",
      "sensitive"
    ],
    "finish": [
      "sheer",
      "creamy",
      "cream",
      "gel",
      "oil",
      "foam"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "natural",
      "non-comedogenic",
      "sulfate-free",
      "hydrating",
      "exfoliating",
      "soothing",
      "purifying"
    ],
    "category": [],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2051077",
    "total_reviews": 150,
    "reviews": [],
    "paging": {
      "total_results": 0,
      "pages_total": 0,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        2,
        2,
        3,
        11,
        132
      ],
      "review_histogram": [
        2,
        2,
        3,
        11,
        132
      ],
      "rating_count": 150,
      "review_count": 150,
      "average_rating": 4.79,
      "recommended_ratio": 0.0,
      "media": [
        {
          "id": "554571909",
          "review_id": 554572026,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/wtqxl0zf3g2j8xjuwulp.jpg",
          "headline": "Amazing",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Lauren M.",
          "created_date": 1743724800000
        }
      ],
      "faceoff_positive": {
        "comments": "I have had a dry face that I couldn't seem to do anything about for the past year or so - even though I was using the gentlest cleansers and most nourishing moisturizers I could find, my skin would still feel dry again just a few hours after applying moisturizers. Switching to oil cleanser has been a game changer, and there are so many things I LOVE about this one. The texture is rich and velvety and it emulsifies into a light foam, but then it rinses completely clean with water like a regular cleanser (something I really appreciate because other oil cleaners I have tried are removed with a warm washcloth, and I prefer to be able to just rinse). Super hydrating and nourishing while also gently removing impurities. I love it!",
        "headline": "Where has this been all my life??",
        "rating": 5,
        "ugc_id": 561344985
      },
      "faceoff_negative": {
        "comments": "I purchased the Nourishing Cleansing Oil alongside several other products from this line, hoping it would serve as a solid first step in my skincare routine. Instead, it became an early indication of what would become a pattern: overpromised, underperforming products in expensive packaging.  To start, the packaging and fulfillment were unacceptable. The oil had already begun leaking before it was even packed. It soaked the rest of my order and left a mess to clean up—hardly the luxury experience the price implies. When I reached out, I was told that leaking items would not typically be replaced unless shipping protection was purchased. Packaging failures are not the customer's burden, and I was only refunded after pushing back.  As for the product itself: this is a basic cleansing oil, wrapped in a premium price tag. There is nothing here that sets it apart from countless, more affordable alternatives. It removes makeup and sunscreen, yes—but so does any well-formulated oil cleanser at half the cost. It didn't leave my skin feeling particularly nourished or noticeably different, and there was no added benefit that would justify the price.  The overall takeaway? You're paying for the aesthetics—glass bottle, minimalist branding, EWG label—not the formulation. There's no innovation here, no standout ingredients or transformative results. Just another oil cleanser, sold at a markup that feels more about perception than performance.  Save your money.",
        "headline": "A Disappointment in Every Way: Overpriced and Underwhelming",
        "rating": 1,
        "ugc_id": 561345939
      },
      "name": "Nourishing Cleansing Oil to Purify + Hydrate",
      "native_review_count": 0,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 150,
      "locale": "en_US"
    }
  }
}