{
  "product_id": "pimprod2045269",
  "product_url": "https://www.ulta.com/p/la-micellaire-fragrance-free-micellar-water-all-skin-types-pimprod2045269",
  "extracted_at": "2025-09-23T04:20:06.303812+00:00",
  "product_name": "DoreLa Micellaire Fragrance-Free Micellar Water for All Skin Types",
  "brand": "Dore",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wash"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "24.00",
  "availability": "in_stock",
  "rating_avg": "4.3",
  "rating_count": "60",
  "images": [
    "https://media.ulta.com/i/ulta/2626468?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2626468?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2626468_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2626468_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2626468_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2626468_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2626468_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2626468_vid01/thumbs/f4431e8b-db4d-4805-84be-86e306821c5b?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive BackDoré's La Micellaire Botanical Micellar Cleansing Water is a rinse-free everyday micellar water formulated with antioxidant properties to remove excess oil, dirt, and makeup, while soothing tired, puffy, irritated skin with a gentle burst of hydration. Fragrance-free and suitable for all skin types.",
  "details": "DetailsBenefitsEffectively cleanses and reinforces the skin barrierLeaves your skin feeling hydrated with no stickinessFormulated to cleanse and prep your skin before treatment and moisturizingTested under dermatological and ophthalmological controlSuitable for all skin types and for use around the eyesEWG VERIFIED™Certified Plastic Neutral through Doré’s partnership with rePurpose GlobalLa Micellaire’s bottle is made with 30% post consumer recycled plastic (PCR) and can be recycled through curbside recycling programsFragrance-freeNon-comedogenicMade in FranceKey IngredientsCornflower Water: Effectively cleanses the skin with a mild decongesting and astringent effectDamascena Rose Water: Hydrates and soothes irritated skinAloe Vera: Soothes the skin and reinforces the skin barrierResearch ResultsLa Micellaire has been clinically tested under dermatological control with a diverse group of participants, with ages spanning 20s to 70s, over 28 days of use:86% said skin is perfectly cleansed of sebum and impurities86% said skin is clear82% said skin is soft82% said La Micellaire is a hydrating cleansing micellar water, and is not dryingItem 2626468How To UseSoak a cotton round with La Micellaire, swipe across the skin to cleanse and remove makeup as needed. No rinsing required. Suitable to use on eyes. Use within 6 months of opening.Pro tip:Use as a solo cleanser, a makeup remover or as your first cleansing step in a double cleanse. Use instead of water and harsh soap to clean your makeup brushes.Four simple steps, one skincare routine. Suitable for both AM and PM:Step 1: Cleanse with La Micellaire botanical cleansing water and/or Le Cleanser Gel to Milk CleanserStep 2: Reduce puffiness, tighten skin and calm redness with Le Glaçon Facial Ice RollerStep 3: Hydrate, soften and brighten the skin with La Crème All-in-One Daily MoisturizerStep 4: Add extra moisture and repair dry skin with Le Baume All-in-One BalmIngredientsAqua (water/eau), Glycerin, Centaurea Cyanus Flower Water, Xylitylglucoside, Levulinic Acid, Sodium Benzoate, Anhydroxylitol, Sodium Levulinate, Xylitol, Rosa Damascena Flower Water, Sodium Hydroxide, Caprylyl/Capryl Glucoside, Aloe Barbadensis Leaf Extract, Citric Acid, Potassium SorbateAll Doré products are EWG VERIFIED™, which means they meet EWG's strict, scientific standards for transparency and health. Their team of toxicologists, chemists, and epidemiologists scrutinizes every product, empowering you to purchase safer skincare.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Soak a cotton round with La Micellaire, swipe across the skin to cleanse and remove makeup as needed. No rinsing required. Suitable to use on eyes. Use within 6 months of opening.Pro tip:Use as a solo cleanser, a makeup remover or as your first cleansing step in a double cleanse. Use instead of water and harsh soap to clean your makeup brushes.Four simple steps, one skincare routine. Suitable for both AM and PM:Step 1: Cleanse with La Micellaire botanical cleansing water and/or Le Cleanser Gel to Milk CleanserStep 2: Reduce puffiness, tighten skin and calm redness with Le Glaçon Facial Ice RollerStep 3: Hydrate, soften and brighten the skin with La Crème All-in-One Daily MoisturizerStep 4: Add extra moisture and repair dry skin with Le Baume All-in-One Balm",
  "ingredients": [
    "Aqua (water/eau)",
    "Glycerin",
    "Centaurea Cyanus Flower Water",
    "Xylitylglucoside",
    "Levulinic Acid",
    "Sodium Benzoate",
    "Anhydroxylitol",
    "Sodium Levulinate",
    "Xylitol",
    "Rosa Damascena Flower Water",
    "Sodium Hydroxide",
    "Caprylyl/Capryl Glucoside",
    "Aloe Barbadensis Leaf Extract",
    "Citric Acid",
    "Potassium SorbateAll Doré products are EWG VERIFIED™",
    "which means they meet EWG's strict",
    "scientific standards for transparency and health. Their team of toxicologists",
    "chemists",
    "and epidemiologists scrutinizes every product",
    "empowering you to purchase safer skincare"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser"
    ],
    "skin_type": [
      "dry",
      "sensitive",
      "all skin types"
    ],
    "finish": [
      "sheer",
      "gel",
      "oil"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "natural",
      "non-comedogenic",
      "fragrance-free",
      "hydrating",
      "soothing",
      "purifying"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2045269",
    "total_reviews": 60,
    "reviews": [
      {
        "review_id": 563444226,
        "rating": 1,
        "headline": "irritating",
        "comments": "this Dore micellar water caused me chemical burn, severe irritation that lasted for days and it completely dried my skin out. I have never had a product cause that dryness to my face. I have had to moisturize several times a day to restore my skin.",
        "nickname": "Clopita",
        "location": "Fairfield CA",
        "created_date": 1757985560149,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556304739,
        "rating": 2,
        "headline": "So happy I bought this on clearance",
        "comments": "Garnier's the micellar water you can trust at 2am with raccoon eyes and regrets. Doré? She's the girl who flakes on plans and charges extra for nothing. 🧼💅\nI went though 6 cotton rounds to remove a full face while my drugstore micellar water can get the job done with two.",
        "nickname": "Sarahahaha",
        "location": "Spotsylvania VA",
        "created_date": 1751463887838,
        "bottom_line": null,
        "helpful_votes": 47,
        "not_helpful_votes": 1
      },
      {
        "review_id": 549907426,
        "rating": 1,
        "headline": "Doesn't work",
        "comments": "Love the clean ingredients, but unfortunately this doesn't remove makeup, definitely not mascara. Has the effectiveness of tap water. Won't be buying again :(",
        "nickname": "Meeee",
        "location": "Texas",
        "created_date": 1743073997180,
        "bottom_line": "No",
        "helpful_votes": 6,
        "not_helpful_votes": 1
      },
      {
        "review_id": 548613294,
        "rating": 3,
        "headline": "Just ok",
        "comments": "It's a gentle micellar water that doesn't irritate and isn't sticky. However, it isn't great at taking off eye makeup, even regular mascara or eyeliner. I've had to use other makeup remover to take off remaining mascara. The bottle is beautiful.",
        "nickname": "Lisa",
        "location": "Chicago",
        "created_date": 1741752033489,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 545753947,
        "rating": 5,
        "headline": "Great for combination skin!",
        "comments": "DOES NOT DISAPPOINT!! So many Micellar waters seemed to strip and dry out my skin but this one cleans and removes my makeup while still leaving it hydrated.",
        "nickname": "T Willy",
        "location": "Louisville, KY",
        "created_date": 1738360707952,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543610566,
        "rating": 1,
        "headline": "Not for me",
        "comments": "I bought this because I wanted a clean micellar water. I was excited to try but quickly realized it doesn't clean as well as my bioderma. I did a side by side test and the results spoke for themselves. Sadly I returned",
        "nickname": "Jess",
        "location": "Orlando, fl",
        "created_date": 1737301641497,
        "bottom_line": "No",
        "helpful_votes": 8,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542057437,
        "rating": 5,
        "headline": "Works really well",
        "comments": "I like this! It takes off foundation really well. Also takes off mascara and liner, just takes a few more passes to get all of the mascara (regular, I don't know about waterproof). I usually purchase Bioderma, but it's getting harder to find, so I thought I'd try this. It's a good replacement.",
        "nickname": "Colleen",
        "location": "NC",
        "created_date": 1735664796559,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 534079525,
        "rating": 4,
        "headline": "I like it",
        "comments": "The reason for the 4 star review, is it doesn really take off mascara at all. it feels great on the skin. Its lightly scented. \nThe reason I tried this,I met the co owner at Ulta beauty in Garden city. She was very enthusiastic and proud of her products. she took the time to explain a little bit about her line. I will give her other products a try. \nit does take off foundation makeup, and leaves my skin feeling refreshed. \nI'd say if your skeptical, try the trial size.",
        "nickname": "Trish",
        "location": "Queens NY",
        "created_date": 1727197949307,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 527721900,
        "rating": 1,
        "headline": "Don't purchase",
        "comments": "Save ur money and use garnier micellar water. \nThis cause my whole skin to turn lobster red and get a skin burn",
        "nickname": "leslersxD",
        "location": "Santa Ana, ca",
        "created_date": 1724220146943,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 526883723,
        "rating": 5,
        "headline": "best micellar water EVER!",
        "comments": "I have been using this product for the past week and im in LOVE! Ive been seeing a drastic change with my skin as it has been getting more clear. removes makeup gently and thoroughly and leaves my skin so soft. get it!",
        "nickname": "nunu",
        "location": "washington, DC",
        "created_date": 1723356323720,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 525227426,
        "rating": 5,
        "headline": "This product has become a staple in my skincare routine!",
        "comments": "I love cleaning my skin with this micellar water. It's gentle, yet very effective. I also love that it doesn't dry out my skin, which many cleansers do. The packaging is gorgeous and it's a standout on my vanity. And you can't beat the price. Highly, highly recommend!",
        "nickname": "Fran",
        "location": "Bedford, NY",
        "created_date": 1721252641547,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 11,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        7,
        2,
        2,
        2,
        47
      ],
      "review_histogram": [
        7,
        2,
        2,
        2,
        47
      ],
      "rating_count": 60,
      "review_count": 60,
      "average_rating": 4.33,
      "recommended_ratio": 0.85,
      "media": [
        {
          "id": "537408865",
          "review_id": 537408855,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/nkk5mijfy3qvhbactoy5.jpg",
          "headline": "Excellent",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Élisabeth",
          "created_date": 1723075200000
        }
      ],
      "faceoff_positive": {
        "comments": "I have been using le set for several weeks now. These products truly are gentle and effective. I am 43, with fair, sensitive, oily & acne prone skin. I have tried ALL the cleansers & products out there, in search of something both gentle & with the right ingredients that won't contribute to breakouts. Most products left my skin so sensitive and tender! The micellar cleanser is great, even for eye makeup. It is as effective as bioderma sensitive formula, which I have used for many years.The cleanser is the ONLY one I have tried that does not hurt my skin. It does clean thoroughly but I find its texture a bit difficult to work with, as it turns watery and milky very quickly, making it hard to decipher where I have spread it on my face while washing. I do not love the texture. The moisturizer is the best I have ever tried- it is perfect for both day & night as it is so hydrating but lightweight! The moisturizer is my favorite product from Dore. The baume is great- i never need it on my facial skin but I do love it for my lips and cuticles! I also love that Dore sent me the cheek balm from Merit because it is amazing, my new fav beauty product! None of these products cause acne for my reactive skin and they work perfectly with my tretinoin, which I use to manage breakouts and general skin health. I will certainly be a repeat customer :-)",
        "headline": "I have been using le set",
        "rating": 4,
        "ugc_id": 526230058
      },
      "faceoff_negative": {
        "comments": "There is a clear winner in the market for micellar water that is super smooth, glides on, and is great for sensitive skin, and this is NOT it. I appreciate the design, and I love Doré's ethos, so if they can get this product to that standard, I would love to buy again. But for the product as-is, one star actually feels generous. This stuff is not smooth at all and does no better at removing makeup than water from the tap — literally. I didn't have any other makeup remover, so I scrubbed by skin raw getting my makeup off (my bad — that was not related to the product), and it's not like I wear waterproof mascara, or even a lot of it in the first place. \"Cleansing\" is absolutely not a word I would use to describe this micellar water. You might as well get a cotton pad wet and use that to get the makeup off your face.",
        "headline": "I haven't been this disappointed in a product in a while",
        "rating": 1,
        "ugc_id": 549279897
      },
      "native_review_count": 11,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 49,
      "locale": "en_US"
    }
  }
}