{
  "product_id": "pimprod2028052",
  "product_url": "https://www.ulta.com/p/pekee-face-cleansing-bar-pimprod2028052",
  "extracted_at": "2025-09-23T04:46:42.178182+00:00",
  "product_name": "Drunk ElephantPekee Face Cleansing Bar",
  "brand": "Drunk Elephant",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wash"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "90",
  "sale_price": "28.00",
  "availability": "in_stock",
  "rating_avg": "4.7",
  "rating_count": "211",
  "images": [
    "https://media.ulta.com/i/ulta/2588464?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2588464?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2588464_sm?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2588464cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2588464cm_alt02?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeSustainable PackagingDrunk Elephant's Pekee Face Cleansing Bar is a gentle multitasking bar that clarifies, balances, and moisturizes while removing pore-clogging surface debris, impurities, and excess oil.",
  "details": "DetailsBenefitsInfused with blueberry extract, marula oil, and honeyCleanses and calms without drying or stripping skin of its protective barrierPromotes moisture retentionLeaves skin feeling firmer and more elasticFormulated without harsh surfactants (like SLS, i.e. sodium lauryl sulfate)Formulated at a skin-friendly, non-stripping pH of 6.5Dermatologist TestedKey IngredientsBlueberry Extract: A potent antioxidant with soothing and antiglycation propertiesVirgin Marula Oil: A super-absorbable oil - high in critical antioxidants and omega-6 and-9 - that nourishes and visibly rejuvenates the skinHoney: Has antioxidant properties and soothes and nourishes the skinFormulated WithoutMade without the Suspicious 6 - the six ingredients Drunk Elephant believes are at the root of almost every skin issue (Essential oils, Silicones, Chemical sunscreens, SLS, Fragrances + dyes, and Drying alcohols)Item 2588464How To UseWet Pekee Bar and lather until creamy. With your hands, massage over face, neck, and chest. Rinse well withwarm water and pat dry. Use morning or night. Avoid direct contact with eyes.IngredientsSodium Coco-Sulfate, Disodium Lauryl Sulfosuccinate, Triticum Vulgare (Wheat) Starch, Cetearyl Alcohol, Paraffin, Sclerocarya Birrea Seed Oil, Water/Aqua/Eau, Titanium Dioxide (CI 77891), Honey/Mel/Miel, Glycerin, Vaccinium Angustifolium (Blueberry) Fruit Extract.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Wet Pekee Bar and lather until creamy. With your hands, massage over face, neck, and chest. Rinse well withwarm water and pat dry. Use morning or night. Avoid direct contact with eyes.",
  "ingredients": [
    "Sodium Coco-Sulfate",
    "Disodium Lauryl Sulfosuccinate",
    "Triticum Vulgare (Wheat) Starch",
    "Cetearyl Alcohol",
    "Paraffin",
    "Sclerocarya Birrea Seed Oil",
    "Water/Aqua/Eau",
    "Titanium Dioxide (",
    "Honey/Mel/Miel",
    "Glycerin",
    "Vaccinium Angustifolium (Blueberry) Fruit Extract"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser"
    ],
    "skin_type": [
      "dry",
      "sensitive"
    ],
    "finish": [
      "sheer",
      "creamy",
      "cream",
      "oil"
    ],
    "ingredients": [
      "sulfate-free"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "dermatologist-tested",
      "soothing",
      "purifying"
    ]
  },
  "reviews": {
    "product_id": "pimprod2028052",
    "total_reviews": 211,
    "reviews": [
      {
        "review_id": 553497730,
        "rating": 5,
        "headline": "Foaming bar soap",
        "comments": "Purchased because it was 90% off at my local store's clearance section. Was skeptical to use this since my face is very sensitive and DRY. I have patches of discoloration from a pretty bad episode of rosacea. I used this as a second cleanser in the shower for my face, neck, and chest after using my oil based cleanser just to be sure my skin wasnt left too dry(oil breaks out my neck, chest and back, but my face needs an added boost and its best for removing makeup).  Followed through with the glass skin serum from peach slices and then the drunk elephant marula oil before it dried to lock in the moisture. Works like a charm. Sensitive skin approved. Not sure what the other comments were complaining about but I guess everyone has different allergies in the end. This cleanser is Creamy, rinsed off sooo so good you can tell its a high quality bar soap. No scent either, I was kind of bummed out about that but I understand it is a lot safer that way. Noticable difference in my smile lines after using for about 2 weeks. Never realized how long bar soaps last over liquids until now. Id recommed if you have daughters that are getting into skin care to try it out or add it to a gift set. Totally harmless!",
        "nickname": "DramaticSkinHaver",
        "location": "Orlando",
        "created_date": 1747537066388,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 486107307,
        "rating": 5,
        "headline": "The Best",
        "comments": "This is my all time favorite cleanser for my dry skin. I use it as my second cleanser after my oil cleanse. I will use this bar as long as it's available.",
        "nickname": "Jacs",
        "location": "Ohio",
        "created_date": 1703946147472,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 477017376,
        "rating": 5,
        "headline": "my favorite face wash",
        "comments": "Over the past few years I've been switching over to bar soaps. but finding a good face wash bar came with a lot of trial and error. this face wash bar though is my absolute favorite. its super gentle on my sensitive skin, easy to use, and not drying at all. 10/10, i've repurchased this product many times",
        "nickname": "Julia",
        "location": "Philadelphia, PA",
        "created_date": 1697590384184,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 401197204,
        "rating": 5,
        "headline": "GOAT",
        "comments": "I've been using this bar for 1mos. It has to be the best face wash I've used in general.  it does make your skin feel super clean and is perfect for people with a skin care routine. IE: moisturizer, retinol, vitamin-c etc...if you don't then may dry out skin. \n\nlasts a long time too. Favorite. Will buy again.",
        "nickname": "Mandy",
        "location": "Marysville, Washington",
        "created_date": 1646621232458,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 394985728,
        "rating": 5,
        "headline": "LOVE THIS!!!",
        "comments": "I hate soap bars so much but recently I've really loved drunk elephants products so I decided to try this one and I am so glad I did! It is so gentle and smooth! It has also cleared up my complexion on both my face and chest and left them feeling soft and hydrated and looking even toned. I love this product as well as all of Drunk Elephant's products. I wish they weren't as expensive as they are but they are worth it!",
        "nickname": "LaLaLisa",
        "location": "Boise, ID",
        "created_date": 1642954043527,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 392531277,
        "rating": 5,
        "headline": "LOVE!!",
        "comments": "I used this combined with a make up melting balm and I already am seeing results after a few days. Pores are so much smaller.",
        "nickname": "Ave",
        "location": "Wisconsin",
        "created_date": 1640900091420,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 383349727,
        "rating": 5,
        "headline": "Amazing!!!!",
        "comments": "Great for cleaning out pores. Sensitive skin happiness. Love this bar. Makes for easy washing and less mess. Great for travel!",
        "nickname": "Morgandallas93!",
        "location": "california",
        "created_date": 1633300772157,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 382642330,
        "rating": 5,
        "headline": "My favorite cleanser!",
        "comments": "I have incredibly sensitive skin, but I've been able to use this for YEARS without any reactions. Most products start to bother my skin after a few months. I use it every night and one bar lasts me around 6 months or more. I have a plastic soap tray I dry it on so it doesn't get gross. Seriously the best product ever!",
        "nickname": "Buy this!",
        "location": "USA",
        "created_date": 1632692912994,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 8,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        4,
        4,
        6,
        20,
        177
      ],
      "review_histogram": [
        4,
        4,
        6,
        20,
        177
      ],
      "rating_count": 211,
      "review_count": 211,
      "average_rating": 4.72,
      "recommended_ratio": 1.0,
      "media": [],
      "faceoff_positive": {
        "comments": "I'm shocked by this bar! It removes dirt, oil and makeup without leaving my face feeling dry or tight. Never thought I'd be going back to a bar soap and I've already ordered my second!",
        "headline": "Power Bar",
        "rating": 5,
        "ugc_id": 488712262
      },
      "faceoff_negative": {
        "comments": "So I was looking forward to using this cleanser at nighttime to wash off daily residue and oils. I would say that the bar lathers nicely and applies easily to the face. It leaves my skin feeling clean, but I find that it leaves my skin feeling a bit dry. I have dry skin and I usually try to use hydrating cleansers so this was somewhat offputting to me. Not sure if I would repurchase to be honest.",
        "headline": "3 Star Review",
        "rating": 3,
        "ugc_id": 488554014
      },
      "name": "Pekee Face Cleansing Bar",
      "native_review_count": 8,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 203,
      "locale": "en_US"
    }
  }
}