{
  "product_id": "pimprod2033609",
  "product_url": "https://www.ulta.com/p/half-shot-small-round-blow-dryer-brush-pimprod2033609",
  "extracted_at": "2025-09-23T04:04:51.372380+00:00",
  "product_name": "DrybarThe Half Shot Small Round Blow-Dryer Brush",
  "brand": "Drybar",
  "categories": [
    "Home",
    "Tools & Brushes",
    "Hair Styling Tools",
    "Hair Dryers"
  ],
  "category_keys": [
    "home",
    "tools-brushes",
    "hair",
    "hair"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "155.00",
  "availability": "in_stock",
  "rating_avg": "4",
  "rating_count": "214",
  "images": [
    "https://media.ulta.com/i/ulta/2598848?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2598848?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2598848_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2598848_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2598848_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2598848_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2598848_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2598848_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2598848_alt07?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2598848_vid01/thumbs/8a6012f3-ccbf-46a1-aed6-8221d4cfe7c3?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryThe Half Shot Small Round Blow-Dryer Brush from Drybar combines the hot air of a blow-dryer and the structure of a small round brush to create a smooth, shiny blowout in one simple step.",
  "details": "DetailsFeaturesIonic Technology seals the cuticle for less frizz and tons of shine while stylingStrategically-placed vents provide maximum airflow for a faster blowoutErgonomic, lightweight design provides maximum comfortA combination of nylon and tufted bristles allows for exceptional tension and control1.5\" round shape creates defined curls or waves and is perfect for detailed styling3 temperature settings (cool/medium/high) allows for customized styling of all hair typesGuaranteed with a 2-year limited warrantyItem 2598848How To UseAfter shampooing, thoroughly towel-dry hair to remove excess water. Brush out hair using a detangling brush or comb, and separate into large sections. Place The Half Shot underneath each section and work it gradually from roots to ends, until the section is dry and smooth. The Half Shot can also be used on dry hair to create a smooth, finished look. For defined curls and waves, use vertically throughout the hair. For volume at the roots, use horizontally at the crown.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "After shampooing, thoroughly towel-dry hair to remove excess water. Brush out hair using a detangling brush or comb, and separate into large sections. Place The Half Shot underneath each section and work it gradually from roots to ends, until the section is dry and smooth. The Half Shot can also be used on dry hair to create a smooth, finished look. For defined curls and waves, use vertically throughout the hair. For volume at the roots, use horizontally at the crown.",
  "ingredients": "",
  "extended_contents": {},
  "tags": {
    "category": [
      "hair",
      "brushes",
      "tools",
      "haircare"
    ],
    "skin_type": [
      "dry",
      "combination"
    ],
    "finish": [
      "glossy",
      "sheer",
      "creamy"
    ],
    "brand": [
      "mid-range",
      "premium"
    ],
    "product_type": [],
    "ingredients": [],
    "special_features": []
  },
  "reviews": {
    "product_id": "pimprod2033609",
    "total_reviews": 214,
    "reviews": [
      {
        "review_id": 559242498,
        "rating": 5,
        "headline": "I recommend this product",
        "comments": "Works well on my short, fine and wavy hair.  My hair does not get tangled in the brush and the heat level is just right.",
        "nickname": "Carole H",
        "location": "Broomfield",
        "created_date": 1754326121941,
        "bottom_line": "Yes",
        "helpful_votes": 11,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558076277,
        "rating": 5,
        "headline": "Love this dryer!",
        "comments": "Purchased a small dryer from a different company. Wanted it for travel because I use the Dyson Air Wrap at home. Used the other one once and it literally smoked and burned. Returned it quickly but needed something for travel. I don't travel with my Dyson because I've actually had one stolen from my luggage. So i bought thus one for travel. Its a little larger than i wanted, but it is so lightweight it made up for size. I love this dryer. Its perfect for my fine shoulder length hair. Its easy to use and gets hot enough to lock in stule but not cook my hair. In fact i love almost…. Almost as much as my Dyson. So glad i bought and did not wrigh fown my suitcase or dufgle at all!!! Love it!",
        "nickname": "Bentley's Mom",
        "location": "Washington state",
        "created_date": 1753293155899,
        "bottom_line": null,
        "helpful_votes": 11,
        "not_helpful_votes": 1
      },
      {
        "review_id": 557879056,
        "rating": 5,
        "headline": "So glad I splurged",
        "comments": "I have thick frizzy,l hair. This thing was amazing. I dried my hair in no time and didn't have to use my flat iron!",
        "nickname": "Katie",
        "location": "Farmington, CT",
        "created_date": 1753054201325,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 2
      },
      {
        "review_id": 557613377,
        "rating": 2,
        "headline": "It's a no for me",
        "comments": "I'll say it did a good job drying my hair without it getting too hot. However it's uncomfortable to hold while drying my hair. The top part of it is too short to hold on to while running it through my hair. Also the filter on the bottom comes up too far on the handle I felt like my hair was going to get sucked in. I also noticed the barrel itself pulled my hair as I was blow drying it. Not good for long hair.",
        "nickname": "Elizabeth",
        "location": "TX",
        "created_date": 1752931101775,
        "bottom_line": "No",
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556120511,
        "rating": 5,
        "headline": "Happy with this item.",
        "comments": "Works well, great long cord. Not too heavy.",
        "nickname": "Marie",
        "location": "Tucson, AZ",
        "created_date": 1751385613642,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553286755,
        "rating": 2,
        "headline": "Fine hair folks beware",
        "comments": "I have fine hair and the only thing that happens when I use the Half Shot is straight fly away hair. I'm returning it.",
        "nickname": "Beth",
        "location": "Phoenix AZ",
        "created_date": 1747182485193,
        "bottom_line": "No",
        "helpful_votes": 5,
        "not_helpful_votes": 2
      },
      {
        "review_id": 552946902,
        "rating": 5,
        "headline": "I would definitely buy this product again!",
        "comments": "This is a game changer.  I never really liked the curling iron, and this is an all in one hair dryer and styler.  Wish I had found it sooner!",
        "nickname": "Kathy",
        "location": "Austin, TX",
        "created_date": 1746549575015,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551853171,
        "rating": 4,
        "headline": "love it!",
        "comments": "I was gifted the half shot blow dryer brush by dry bar and it does such a nice blowout look! It leaves my hair silky soft and smooth while adding lots of volume! I love using this brush to help achieve the perfect blowout. gifted by dry bar",
        "nickname": "maddie",
        "location": "pittsburgh, pa",
        "created_date": 1744818006921,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551620709,
        "rating": 5,
        "headline": "Love It!!",
        "comments": "Love how this can dry my hair & style perfectly every time without drying it out! Honestly I'm done in 15mins or less. The half shot isn't heavy or loud when using & love the design of the whole tool. I highly recommend for anyone who needs a quick way to dry & style your hair, perfect for the fast pace busy lifestyle! Gifted by drybar",
        "nickname": "Diane C",
        "location": "North Carolina",
        "created_date": 1744466925725,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 1
      },
      {
        "review_id": 551455217,
        "rating": 2,
        "headline": "Not worth it",
        "comments": "The Half Shot small round blow-dryer brush didn't live up to my expectations. It's a basic tool that didn't add any volume or give my wavy, normal-to-dry, shoulder-length hair that polished blowout look I was hoping for. Right from the start, I noticed a burnt smell when I turned it on, which was a bit concerning. The heat settings are located at the bottom, and even the lowest setting felt way too hot for my hair. Overall, it just didn't work for me—I won't be reaching for it again. If you're looking for a better alternative from Drybar that actually delivers salon-quality results, I highly recommend investing in the Triple Shot Interchangeable Blow Dryer. It's 100% worth the splurge! Gifted by Drybar",
        "nickname": "",
        "location": "Texas",
        "created_date": 1744380609304,
        "bottom_line": "No",
        "helpful_votes": 5,
        "not_helpful_votes": 2
      },
      {
        "review_id": 551321342,
        "rating": 4,
        "headline": "Good but not the best",
        "comments": "So, I have some issues as this product was originally going to give us a totally different product with a multi-use attachments. So instead of that I was given a \"half shot\" small round blow dryer brush.  I do have other larger barralled blow dryer brushes and it was hard for me to dry my hair and curl or dry in a more stylized manner.  The smaller barrel allowed my thinner hair to curl or be more easily managed into an upscale look. While it's not my favorite product like this, it is pretty darn close to being a positive and comfortable product that gave me a good and positive look after using. ** this was complimentary from Drybar but the views are all my own **",
        "nickname": "ElisabethDDD",
        "location": "Wisconsin",
        "created_date": 1744238644843,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 3
      },
      {
        "review_id": 551278415,
        "rating": 4,
        "headline": "Solid",
        "comments": "This is a standard blow dryer brush. I have thick, dense, 2c wavy hair. I can't quite master smoothing my hair when my hair is wet. I think this works better on refreshing my hair the day after it's been styled. It is strong, so definitely use a heat protectant and don't use this every day. I received this product complimentary from drybar in exchange for my honest review.",
        "nickname": "Peachy",
        "location": "USA",
        "created_date": 1744219165567,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 2
      },
      {
        "review_id": 551260414,
        "rating": 5,
        "headline": "very convenient to use",
        "comments": "Most often I use the hair dryer brush right after the shower, as I can dry my hair and style it at the same time. I have long hair, so it only takes me 5 minutes to straighten my hair or curl it. I am very pleased with the result, the hair dryer brush does not dry out my hair and is very convenient to use.Gifted by Drybar",
        "nickname": "Raisa",
        "location": "Boiling Springs ,SC",
        "created_date": 1744205722406,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 2
      },
      {
        "review_id": 551248286,
        "rating": 5,
        "headline": "Amazing hair tool",
        "comments": "This Drybar half shot small round blow-dryer brush does a great job at giving me quick blowout. It makes my hair smooth and shiny but doesn't compromise on volume.  There's three heat settings for all hair types and it's lightweight and comfortable to style my whole head of hair. I highly recommend this hair tool that I received complimentary from drybar.",
        "nickname": "Janene",
        "location": "Houston, TX",
        "created_date": 1744170263401,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 2
      },
      {
        "review_id": 551245876,
        "rating": 5,
        "headline": "Game-changer for frizzy hair!",
        "comments": "I have wavy, porous, and frizzy hair, and this blow dryer brush has been a total game-changer for me! I mostly use it on damp hair right after the shower, and I love how fast it dries my hair. It also gives the ends a gentle twist, smooths out the frizz, and makes my hair look sleek and pretty. Overall, I'm really happy with it and would definitely recommend it! Gifted by Drybar",
        "nickname": "Anastasiia",
        "location": "USA",
        "created_date": 1744161506940,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 2
      },
      {
        "review_id": 551224632,
        "rating": 5,
        "headline": "Love this tool",
        "comments": "I recently had the chance to try out this Drybar dryer brush. I love the design as it is compact but sturdy. It is easy to handle without feeling flimsy. The barrel size is perfect for shorter hair or for adding volume at the roots. This is exactly I was looking for. The bristles feel high quality and do not tug in my hair. The air flow is strong. It distributes heat evenly. My hair does not feel frizz or overheated. I noticed that it works well for creating soft waves or a bouncy blowout something I struggle to achieve with a traditional round brush and dryer combo. One thing to keep in mind is that it might not be ideal for super thick or long hair as the barrel is on the smaller side. The quality and ease of use make it feel like a solid hair tool. I would say this tool delivers exactly what it promises, a sleek, voluminous blowout with minimal effort. Gifted by drybar",
        "nickname": "Easha",
        "location": "Boston, MA",
        "created_date": 1744130606667,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551201971,
        "rating": 4,
        "headline": "Solid option",
        "comments": "This is a pretty decent brush - it gets the job done, but for my curly 3a hair, the bristles sometimes pull a bit and it doesn't feel the most comfortable. The handle is also a little chunky for my smaller hands to hold for longer periods of time. The temperature is great and it heats up quickly, and dries my damp hair well. Overall I prefer other tools for my fine-regular curly hair but this one is not bad. Gifted by Drybar",
        "nickname": "daybrighten",
        "location": "Brooklyn, NY",
        "created_date": 1744080857457,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551167201,
        "rating": 2,
        "headline": "Not my favorite",
        "comments": "Not a huge fan. There just aren't enough options on this dryer for my liking. When you plug it in it just goes. There isn't an on or off button, settings to change the pressure or heat. I probably won't grab for this very often. Gifted by drybar",
        "nickname": "Shelby",
        "location": "Dallas",
        "created_date": 1744055381668,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 551141912,
        "rating": 3,
        "headline": "A little pricey for what it is.",
        "comments": "This is yet another heated round brush. Nothing new nothing innovative. If you have a shorter hair or one more distant curl, this is the smallest out of the heat round brushes. It's nice that it's yellow that makes it fun, but nothing exciting. Gifted by dry bar.",
        "nickname": "Amy",
        "location": "Seattle",
        "created_date": 1744035950699,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551121588,
        "rating": 3,
        "headline": "Great for short hair",
        "comments": "The Half Shot Small Round Blow Dryer Brush was gifted by Dry Bar in exchange for an honest review. I have really long, fine hair and I noticed that it was a bit difficult to style my hair with this product. The barrel is too short for the length of my hair and I did notice some tugging when I used it. I think this brush would be great for anyone with shorter or medium length hair.",
        "nickname": "Erika",
        "location": "Sacramento, CA",
        "created_date": 1743995088335,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 1
      }
    ],
    "paging": {
      "total_results": 162,
      "pages_total": 9,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2033609/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "hairtype",
          "name": "Hair Type",
          "type": "tag",
          "values": [
            {
              "label": "Wavy Hair",
              "count": 37
            },
            {
              "label": "Straight Hair",
              "count": 19
            },
            {
              "label": "Very Curly Hair",
              "count": 5
            }
          ],
          "display_values": [
            "Straight Hair",
            "Very Curly Hair",
            "Wavy Hair"
          ]
        }
      ],
      "rating_histogram": [
        20,
        19,
        18,
        37,
        120
      ],
      "review_histogram": [
        20,
        19,
        18,
        37,
        120
      ],
      "rating_count": 214,
      "review_count": 214,
      "average_rating": 4.02,
      "recommended_ratio": 0.84,
      "media": [
        {
          "id": "551260415",
          "review_id": 551260414,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/izmenfnluvhuomuejlko.jpg",
          "headline": "very convenient to use",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Raisa",
          "created_date": 1744205722406
        },
        {
          "id": "551248305",
          "review_id": 551248286,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/lh92hlsaccztuuqxolma.jpg",
          "headline": "Amazing hair tool",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Janene",
          "created_date": 1744170263401
        },
        {
          "id": "551245866",
          "review_id": 551245876,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/i2ziniogim4bozxk9dug.jpg",
          "headline": "Game-changer for frizzy hair!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Anastasiia",
          "created_date": 1744161506940
        },
        {
          "id": "551245865",
          "review_id": 551245876,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/pfyrgzu0epnaup27xzq4.jpg",
          "headline": "Game-changer for frizzy hair!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Anastasiia",
          "created_date": 1744161506940
        },
        {
          "id": "551224655",
          "review_id": 551224632,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ij8bfmx4uirsxw6ymeln.jpg",
          "headline": "Love this tool",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Easha",
          "created_date": 1744130606667
        },
        {
          "id": "551224651",
          "review_id": 551224632,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/vxipwzyycgrbwsfxbbvp.jpg",
          "headline": "Love this tool",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Easha",
          "created_date": 1744130606667
        },
        {
          "id": "551224650",
          "review_id": 551224632,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/uziplwg8p4jkbv5d59y8.jpg",
          "headline": "Love this tool",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Easha",
          "created_date": 1744130606667
        },
        {
          "id": "551224635",
          "review_id": 551224632,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/eepllultn8pd5gunodnc.jpg",
          "headline": "Love this tool",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Easha",
          "created_date": 1744130606667
        },
        {
          "id": "551224633",
          "review_id": 551224632,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/t77psxm0tdtcudjfumj8.jpg",
          "headline": "Love this tool",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Easha",
          "created_date": 1744130606667
        },
        {
          "id": "550885157",
          "review_id": 550885148,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/cpjbwkew7f4r5b28mhhn.jpg",
          "headline": "Worth your coin",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Half shot",
          "nickname": "Sami",
          "created_date": 1743629353778
        },
        {
          "id": "550874723",
          "review_id": 550874722,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/wpvzcc5u1pcswd0vliez.jpg",
          "headline": "Amazing on my hair!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Mira",
          "created_date": 1743617312995
        },
        {
          "id": "550845055",
          "review_id": 550844991,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/duzjfagrdskp1y9qzxsx.jpg",
          "headline": "A two in one styler",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Gine",
          "created_date": 1743548524569
        },
        {
          "id": "550845054",
          "review_id": 550844991,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/knnzhljbfebzbu87isgi.jpg",
          "headline": "A two in one styler",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Gine",
          "created_date": 1743548524569
        },
        {
          "id": "550844464",
          "review_id": 550844413,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/o1iyirsjykwa1iina6sf.jpg",
          "headline": "New fav round brush!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Danielle",
          "created_date": 1743546632314
        },
        {
          "id": "550791959",
          "review_id": 550791957,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/nkehxhsgathbies08bz5.jpg",
          "headline": "Well worth the money",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Anna P",
          "created_date": 1743455179782
        },
        {
          "id": "550791958",
          "review_id": 550791957,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/jwbbiw8pw1zk6ug6ofis.jpg",
          "headline": "Well worth the money",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Anna P",
          "created_date": 1743455179782
        },
        {
          "id": "550759173",
          "review_id": 550759198,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/mwkxciic1wgpwbvzos9u.jpg",
          "headline": "My go to hair styling tool",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Glowhima",
          "created_date": 1743392720214
        },
        {
          "id": "550758918",
          "review_id": 550758924,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/molhuszikckj6j4ottux.jpg",
          "headline": "Great for smoothing",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "B",
          "created_date": 1743391452350
        },
        {
          "id": "550640372",
          "review_id": 550640378,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/oc23hsrwpvsfdprjvfsf.jpg",
          "headline": "Decent",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Courtney",
          "created_date": 1743295304551
        },
        {
          "id": "550501791",
          "review_id": 550501790,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/jg3pdidng0f3fdb9j7hn.jpg",
          "headline": "Easy to use",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Cinthia",
          "created_date": 1743263326981
        },
        {
          "id": "550291800",
          "review_id": 550291809,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/e8ru1boup3sam8soizjd.jpg",
          "headline": "Just alright",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Kana",
          "created_date": 1743202664026
        },
        {
          "id": "550250109",
          "review_id": 550250071,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/nms8g7fqkof1evq4y99s.jpg",
          "headline": "An absolute must have!!!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Easy to hold",
          "nickname": "Iqra",
          "created_date": 1743190652203
        },
        {
          "id": "550239354",
          "review_id": 550239320,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/gry0u3oipm6kpg1tdvbd.jpg",
          "headline": "Amazing smooth hair tool",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Smooth hair",
          "nickname": "Whitney",
          "created_date": 1743187630145
        },
        {
          "id": "514445673",
          "review_id": 514445691,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/fngs2wqsf48afumfwfze.jpg",
          "headline": "The bane of my existence",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Shame",
          "nickname": "BrooklinF",
          "created_date": 1703950141000
        },
        {
          "id": "484421497",
          "review_id": 484421562,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/yblmahgcmkqvxp9su9ed.jpg",
          "headline": "Left my hair silky and shiny",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Left my hair voluminous and shiny.",
          "nickname": "HalieW",
          "created_date": 1700667096000
        },
        {
          "id": "426638571",
          "review_id": 426638590,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/fvbf43ozbc5z1uh51lml.jpg",
          "headline": "Bristles are Cheap and Bend Easily",
          "rating": 3,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "SUZANNE",
          "created_date": 1664388986055
        },
        {
          "id": "426638600",
          "review_id": 426638590,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/lcj7r9guf3ywciiira0p.jpg",
          "headline": "Bristles are Cheap and Bend Easily",
          "rating": 3,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "SUZANNE",
          "created_date": 1664388986055
        },
        {
          "id": "426638591",
          "review_id": 426638590,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/uj3xn3mdfz4bbxjxr9kw.jpg",
          "headline": "Bristles are Cheap and Bend Easily",
          "rating": 3,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "SUZANNE",
          "created_date": 1664388986055
        },
        {
          "id": "420812349",
          "review_id": 420812348,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/obpplcxqjvpmxfrou0bn.jpg",
          "headline": "Love love love!!",
          "rating": 5,
          "helpful_votes": 2,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "LANI",
          "created_date": 1660418561291
        },
        {
          "id": "420812264",
          "review_id": 420812348,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/cm9lktx39izfct7dxgmi.jpg",
          "headline": "Love love love!!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "LANI",
          "created_date": 1660418561291
        },
        {
          "id": "420221433",
          "review_id": 420221477,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ehnw3ok2iqwjsbszxxte.jpg",
          "headline": "Get it!!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Stephanie",
          "created_date": 1659894631732
        },
        {
          "id": "419668097",
          "review_id": 419668065,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/s3i0dbvjzc0ggs83elrb.jpg",
          "headline": "Easy to use and style!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Beautiful packaging!",
          "nickname": "Kylie",
          "created_date": 1659555427432
        },
        {
          "id": "419651041",
          "review_id": 419651001,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/et2woeredrev4ollkb7y.jpg",
          "headline": "Loved this product",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Leslie",
          "created_date": 1659541795630
        },
        {
          "id": "419393543",
          "review_id": 419393566,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/znfqxmjlhhbywf8hagqy.jpg",
          "headline": "Niiice!",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Setitra",
          "created_date": 1659381540735
        },
        {
          "id": "419001276",
          "review_id": 419001233,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/wnlux4nutythimmtusvg.jpg",
          "headline": "Awesome for thin hair",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Patricia",
          "created_date": 1659112451453
        },
        {
          "id": "418589288",
          "review_id": 418589253,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ajuplrah17advng5kvpn.jpg",
          "headline": "Easy to use + lightweight",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Katrina",
          "created_date": 1658849449330
        },
        {
          "id": "418494861",
          "review_id": 418494946,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/pmuxuagnbwuapwaulvil.jpg",
          "headline": "Favorite hair product!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Fav product and must have hair products!",
          "nickname": "Natalie",
          "created_date": 1658762560415
        }
      ],
      "faceoff_positive": {
        "comments": "I really liked how the this product worked! I've tried a few blow dry round brushes and this is my favorite by far. It left my hair shiny and silky with little to no frizz.\nIt didn't feel like it was tugging on my hair at all, like other round blow dry brushes have.",
        "headline": "Left my hair silky and shiny",
        "rating": 5,
        "ugc_id": 484421562
      },
      "faceoff_negative": {
        "comments": "I write this in anguish and agony, this product ruined my life. I'm a 17 year old girl and my hair is gone I thoroughly followed all instructions yet over the course of a few months all of my long luscious blonde hair was ripped from my scalp. I wouldn't wish this product on my worst enemy",
        "headline": "The bane of my existence",
        "rating": 1,
        "ugc_id": 514445691
      },
      "name": "The Half Shot Small Round Blow-Dryer Brush",
      "native_review_count": 162,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 52,
      "locale": "en_US"
    }
  }
}