{
  "product_id": "pimprod2015077",
  "product_url": "https://www.ulta.com/p/pro-collagen-eye-revive-mask-pimprod2015077",
  "extracted_at": "2025-09-23T04:55:18.616797+00:00",
  "product_name": "ELEMISPro-Collagen Eye Revive Mask",
  "brand": "ELEMIS",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Masks"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "masks"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "92.00",
  "availability": "in_stock",
  "rating_avg": "4.4",
  "rating_count": "282",
  "images": [
    "https://media.ulta.com/i/ulta/2564477?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2564477?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2564477cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2564477cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2564477cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2564477cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2564477cm_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2564477cm_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2564477cm_vid01/thumbs/e97c8502-d162-4e96-aaec-4bf18ae25586?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsVeganSustainable PackagingGive BackELEMIS Pro-Collagen Eye Revive Mask is a serum-infused eye mask that minimizes the look of wrinkles, while targeting the look of puffiness and dark circles.",
  "details": "DetailsBenefitsThe bouncy gel texture feels cool and refreshing on the skin and instantly leaves the eye area looking smoother and more youthful.The 3-in-1 formula can be used as an overnight anti-aging mask, a hydrating undereye primer and a moisturizing rescue balm to smooth and rejuvenate the delicate skin around the eyes during the day.Research ResultsClinically proven to reduce the appearance of fine lines and wrinkles*Clinically proven to deliver 24-hour moisturization*100% agreed this helped erase the visible signs of aging overnight.**100% agreed after using this product, the area around their eyes looked brighter and more awake.**100% agreed this helped reduce the appearance of puffiness around the delicate eye area.**100% agreed this helped improve the look of skin firmness and elasticity around the delicate eye area.***Independent Clinical Trials 2019. Results based on 30 people over 4 weeks leaving product on overnight to absorb.**Independent User Trials 2019. Results based on 30 people over 4 weeks leaving product on overnight to absorb.Key IngredientsWatermelon Snow Algae: a naturally red Micro Algae that provides hydration in extreme conditions and has wrinkle-smoothing propertiesBush Clover: an antioxidant-rich plant that helps to reduce the appearance of dark circles and puffiness around the eyesFlash Filler Hyaluronic Acid: creates a plumping effect and improves the look of skin's texturePadina Pavonica is a brown algae found on the Mediterranean coast that is known to support the feeling of hydration.Item 2564477How To UseFor optimal results, use daily or a minimum of 3 times a week.Apply a thin layer to the eye contour and either layer under makeup in the morning, over makeup during the day or leave on overnight to absorb.IngredientsAqua/Water/Eau, Butylene Glycol, Propanediol, Maltodextrin, Carbomer, Phenoxyethanol, Hydroxyacetophenone, Helianthus Annuus (Sunflower) Seed Oil, Glycerin, Sodium Polyacrylate, Lespedeza Capitata Extract, Pentylene Glycol, Disodium EDTA, Sodium Acetylated Hyaluronate, Sodium Hydroxide, Lactic Acid, Serine, Sodium Lactate, Sorbitol, Urea, Rhizobian Gum, Sodium Hyaluronate, Padina Pavonica Thallus Extract, Chlorphenesin, Plankton Extract, Chlorella Vulgaris Extract, Sodium Chloride, Coenochloris Signiensis Extract, Lecithin, Tocopherol, Allantoin.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "For optimal results, use daily or a minimum of 3 times a week.Apply a thin layer to the eye contour and either layer under makeup in the morning, over makeup during the day or leave on overnight to absorb.",
  "ingredients": [
    "Aqua/Water/Eau",
    "Butylene Glycol",
    "Propanediol",
    "Maltodextrin",
    "Carbomer",
    "Phenoxyethanol",
    "Hydroxyacetophenone",
    "Helianthus Annuus (Sunflower) Seed Oil",
    "Glycerin",
    "Sodium Polyacrylate",
    "Lespedeza Capitata Extract",
    "Pentylene Glycol",
    "Disodium EDTA",
    "Sodium Acetylated Hyaluronate",
    "Sodium Hydroxide",
    "Lactic Acid",
    "Serine",
    "Sodium Lactate",
    "Sorbitol",
    "Urea",
    "Rhizobian Gum",
    "Sodium Hyaluronate",
    "Padina Pavonica Thallus Extract",
    "Chlorphenesin",
    "Plankton Extract",
    "Chlorella Vulgaris Extract",
    "Sodium Chloride",
    "Coenochloris Signiensis Extract",
    "Lecithin",
    "Tocopherol",
    "Allantoin"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "mask",
      "treatment",
      "eye cream"
    ],
    "skin_type": [
      "dry",
      "mature"
    ],
    "finish": [
      "sheer",
      "creamy",
      "gel",
      "oil"
    ],
    "ingredients": [
      "lactic-acid"
    ],
    "brand": [
      "mid-range",
      "premium"
    ],
    "special_features": [
      "vegan",
      "natural",
      "anti-aging",
      "hydrating"
    ]
  },
  "reviews": {
    "product_id": "pimprod2015077",
    "total_reviews": 282,
    "reviews": [
      {
        "review_id": 546836082,
        "rating": 1,
        "headline": "Horrible! Evaporates in jar!",
        "comments": "Although I love Elemis face creams, thus eye cream is horrible. It's expensive and the problem with it. Is it dries up and evaporates in the jar so the product disappears. Don't waste your money. I contacted Elemis and they would do nothing.",
        "nickname": "Geckogal",
        "location": "Scottsdale, AZ",
        "created_date": 1739819542604,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 3
      },
      {
        "review_id": 510596060,
        "rating": 5,
        "headline": "Worth the Hype",
        "comments": "I purchased off recommendation of YT Rose & it's worth it! I'm 43 w/dry sensitive skin. Hydrating but light weight it's magic. Works perfectly under makeup. But she's pricey",
        "nickname": "",
        "location": "Texas",
        "created_date": 1712333158638,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 510526419,
        "rating": 1,
        "headline": "Did Not Like at All!",
        "comments": "I have purchased other Elemis products and love them.  This product was a huge miss for me.  It dried out my skin and left me very flakey.  Sadly I will be returning this product.",
        "nickname": "Jenny",
        "location": "Ohio",
        "created_date": 1712243814331,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 509311277,
        "rating": 1,
        "headline": "Causes Rash",
        "comments": "My skin is not that sensitive, but this would make my under eye area break out in irritation every time it on.",
        "nickname": "Jen",
        "location": "Portland, OR",
        "created_date": 1711042444272,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 483303979,
        "rating": 5,
        "headline": "So Good!",
        "comments": "I had this product once as a recommendation and loved it until my toddler scooped it all out 😭. I bought it again recently on sale and I'm on day two of wearing it again. Man, this stuff makes such a difference. I keep looking at my under eyes in a compact and as much as I hate to spend the money, this product really does work. Now I just need to keep it out of my kid's hands!",
        "nickname": "Meg",
        "location": "New Hampshire",
        "created_date": 1701713737042,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 1
      },
      {
        "review_id": 471345116,
        "rating": 5,
        "headline": "From a product connoisseur",
        "comments": "I am always using different products, so i consider myself a good reviewer. I can say this product has helped with the wrinkles and crepe skin under my eyes.",
        "nickname": "Candy",
        "location": "Philadelphia PA",
        "created_date": 1694042525443,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 1
      },
      {
        "review_id": 459771761,
        "rating": 1,
        "headline": "Save your money",
        "comments": "I was def influenced and not worth the money. This eye cream is actually very drying because it ends up piling up. Would not recommend it",
        "nickname": "SR",
        "location": "Chicago, Il",
        "created_date": 1685599702996,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 1
      },
      {
        "review_id": 453361750,
        "rating": 1,
        "headline": "It is drying",
        "comments": "This product makes the skin beneath my eyes feel dry and .ook more crinkly than the previous product I was using.",
        "nickname": "Kelly",
        "location": "Houston TX",
        "created_date": 1681790189698,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 440123586,
        "rating": 3,
        "headline": "pills and doesn't seem effective",
        "comments": "I'm surprised on the rating of this product. I love the pro collagen marine cream, so I got this and this one just isn't it for me. I've tried time and time again to reach for it but within about an hour I get get gooey pilling everywhere that it's applied. I tried it with various combos of brands of products for serums/creams and even by itself, so it's not a reaction to other stuff. And I suppose since it recommends to apply at night pilling alone isn't the biggest deal... However, I don't see a dramatic improvement with my eyes vs any other products. I'm finally just going to toss this one and cut my losses.",
        "nickname": "basschica",
        "location": "Michigan",
        "created_date": 1673461883330,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 429697070,
        "rating": 1,
        "headline": "realistic review",
        "comments": "I don't usually review products, but this one I felt the need to... let's all stop raving about things just be a use they are expensive! more expensive does NOT mean better! and when you're in your 20s, EVERYTHING works well because you havent experienced needing these products yet! I'm 39, most say I look 5-10 years younger than my age. well, let me tell you... I feel all of the elemis products have made my aging process hit fast forward! I had been using it cosmetics confidence line for a few years (day & night creams, eye cream & face wash) and my skin looked and felt great. switched to elemis products because people were raving about the products. SAVE YOUR HARD EARNED MONEY! I'm going back to it cosmetics and hoping it's not too late because the last few months since I've been using the elemis line I look 10 years older!",
        "nickname": "jm",
        "location": "brooklyn, ny",
        "created_date": 1665868490513,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 12
      },
      {
        "review_id": 415587573,
        "rating": 1,
        "headline": "Something was off",
        "comments": "I think I got a bad jar. The product I have has a light bluish tint to it and I notice in the Ulta website's pics that the product has more of a yellow hue. It's also not moisturizing at all and almost felt like Vaseline. I'm thinking someone returned the item with a different product inside the jar and that is very upsetting. Who knows what I applied and these items should not be resold! I'm disgusted!",
        "nickname": "Mad Artist",
        "location": "Los Angeles, CA",
        "created_date": 1656908473554,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 401060946,
        "rating": 5,
        "headline": "Shockingly effective!",
        "comments": "I bought this without having huge expectations but after one use I could see a visible difference. No kidding!  Love it!",
        "nickname": "Tax lady",
        "location": "Virginia Beach",
        "created_date": 1646523964017,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 1
      },
      {
        "review_id": 400718348,
        "rating": 5,
        "headline": "Totally worth it!",
        "comments": "A lovely product! Feels amazing when applying it& actual results! Currently using morning (under full face makeup)& evenings too. Can't imagine not having this going forward. Has made a complete transformation to my eye area. Lifted my eyebrows as well( loveeeeee this! Not to mention how good the eye area feels after fully applied,( it  just makes it feel good/happy) a little goes a long way. Definitely worth the high price, a new true fave. Please never discontinue.",
        "nickname": "Heyyyyy",
        "location": "WPB Florida",
        "created_date": 1646261924161,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 396751916,
        "rating": 5,
        "headline": "Omg soo good",
        "comments": "It's so refreshing it has a cooling effect that is just soo nice",
        "nickname": "SM",
        "location": "CA",
        "created_date": 1644083155615,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 395855342,
        "rating": 5,
        "headline": "Love it",
        "comments": "Love this company and it's products.  Smells great and works to soften fine lines around the eye area.  It is expensive, but all of their products work well.",
        "nickname": "Carol",
        "location": "Virginia",
        "created_date": 1643659284462,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 382644650,
        "rating": 1,
        "headline": "It's a \"NO!\" From Me",
        "comments": "Not a fan of this. Others have said it pills and is gritty, and I agree. It's not gritty when you put it on, but it pills and becomes gritty after it dries. Also, it's a gel, and it's not at all moisturizing. I like most Elemis products, and I'm a huge fan of their cleansing balm, day cream and night cream, but this product might be better suited for someone in their 20s who looking at preventative measures and doesn't expect to see results from their eye cream. I'm in my 50s and I'm looking for results. I want my eye cream to brighten, firm and keep new wrinkles at bay. Sadly, this product isn't it.",
        "nickname": "Desertdweller",
        "location": "Phoenix",
        "created_date": 1632696796573,
        "bottom_line": null,
        "helpful_votes": 13,
        "not_helpful_votes": 1
      },
      {
        "review_id": 379235722,
        "rating": 3,
        "headline": "Liquid lava on your face",
        "comments": "I love all their products, but this burned as soon as I put it on my skin.",
        "nickname": "chris915",
        "location": "Atlanta",
        "created_date": 1630829487591,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 2
      },
      {
        "review_id": 367184602,
        "rating": 4,
        "headline": "very rich and lasts a long time!",
        "comments": "I was not expecting to get as much product as I did or the texture of the product, but so far so good!  It's sort of a rich vaseline like texture so a little goes a VERY long way.  I got this in the set which saved me a ton of money as well.  Keeps my under eyes hydrated and protected for sure.",
        "nickname": "ashxx",
        "location": "MN",
        "created_date": 1625854501309,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 340241123,
        "rating": 5,
        "headline": "Little goes a LONG way",
        "comments": "I am 27 and have suffered from dark circles under my eye that my concealer never seems to cover... I was looking for a more permanent solution and this is what I settled on. This has significantly helped my circles fade into almost the same shade as my skin. I did see another reviewer mention that this should be used after a moisturizer and I agree completely. I just use a little of this after cleaning and moisturizing morning and night. I tap it lightly on and try to avoid rubbing around the eye as to not irritate or stretch the delicate skin. It feels both cooling and hydrating and does not leave an oily residue like a lot of other under eye creams. I only need to use so little of this that it helped me swallow the price tag. I did not notice any flakiness of pilling like others have complained of in the reviews.",
        "nickname": "Brandi",
        "location": "Allentown PA",
        "created_date": 1617456596171,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 333619435,
        "rating": 5,
        "headline": "Can tell a difference!",
        "comments": "First week I used am and pm.  Now using just am. My under eye is smoother and brighter.  The blue circle is not nearly as noticeable!  Tbh I was shocked! Lol.  I highly recommend!",
        "nickname": "Stacy",
        "location": "NC",
        "created_date": 1615121447676,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 1
      }
    ],
    "paging": {
      "total_results": 24,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2015077/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "bestuses",
          "name": "Best Uses",
          "type": "tag",
          "values": [
            {
              "label": "Morning and night before eye cream!",
              "count": 1
            }
          ],
          "display_values": [
            "Morning and night before eye cream!"
          ]
        },
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "Dry",
              "count": 1
            },
            {
              "label": "Pills up",
              "count": 1
            }
          ],
          "display_values": [
            "Dry",
            "Pills up"
          ]
        },
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Dry",
              "count": 2
            },
            {
              "label": "Combination",
              "count": 1
            },
            {
              "label": "Normal",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        25,
        7,
        9,
        22,
        219
      ],
      "review_histogram": [
        25,
        7,
        9,
        22,
        219
      ],
      "rating_count": 282,
      "review_count": 282,
      "average_rating": 4.43,
      "recommended_ratio": 0.86,
      "media": [
        {
          "id": "559294409",
          "review_id": 559294407,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/auitj7wpkp7d2z3ui7xv.jpg",
          "headline": "Will repurchase",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Elemis eye mask",
          "nickname": "Robyn P",
          "created_date": 1751376661000
        },
        {
          "id": "559294408",
          "review_id": 559294407,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/qhqc1xxgl5wisvjv9hwr.jpg",
          "headline": "Will repurchase",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Elemis eye mask",
          "nickname": "Robyn P",
          "created_date": 1751376661000
        },
        {
          "id": "559294318",
          "review_id": 559294317,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/peggbgusns10l3zd7q7u.jpg",
          "headline": "Best mask I tried so far",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Very hydrating! Love it!",
          "nickname": "testrite",
          "created_date": 1750967591000
        },
        {
          "id": "559294355",
          "review_id": 559294345,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/oijufeulk2n7veavoxkx.jpg",
          "headline": "Amazing product",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Hydrating",
          "nickname": "AnnaP",
          "created_date": 1750870548000
        },
        {
          "id": "559294261",
          "review_id": 559294308,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/nycu8qdjfneslj72al2g.jpg",
          "headline": "Healthier appearance",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Package",
          "nickname": "Leli16",
          "created_date": 1750829186000
        },
        {
          "id": "343689936",
          "review_id": 343689926,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/xlme8gc5f9sxaoplthcp.jpg",
          "headline": "Disappointed and surprised",
          "rating": 2,
          "helpful_votes": 0,
          "not_helpful_votes": 1,
          "type": "image",
          "caption": "Disappointing surprise",
          "nickname": "Lkunk498",
          "created_date": 1619478352000
        },
        {
          "id": "333619456",
          "review_id": 333619435,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/h9nn4l75cwnbf9ilo5ad.jpg",
          "headline": "Can tell a difference!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Stacy",
          "created_date": 1615121447676
        },
        {
          "id": "275606176",
          "review_id": 275606120,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/emx0tjuh4zapedzpeqzb.jpg",
          "headline": "Baby skin smooth under eyes!",
          "rating": 5,
          "helpful_votes": 1,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Elemis products are wonderful. No filter for this photo. My skin looks and feels smooth.",
          "nickname": "Simone",
          "created_date": 1587858464000
        }
      ],
      "faceoff_positive": {
        "comments": "I bought the eye revive mask and used it for about 2 weeks applying it every 3 days with no results.  I then decided to use it daily and wow the difference. I had very dark circles under my eyes and they extended down pretty far to my nose. After using this product not only have the dark marks lightened significantly, but the dark area shrank. It has made such a difference and I have removed my color corrector and can just use under eye concealer. I never write reviews for products, but because this one worked so well I had to let others know because I lost hope and actually found a product that worked, and I think it may work for other people as well. My sister tried it and it has been working for her too.",
        "headline": "It really works.",
        "rating": 5,
        "ugc_id": 559294287
      },
      "faceoff_negative": {
        "comments": "I was so excited to try this eye mask after reading such good reviews on websites and blogs. I just opened the brand new jar and... this doesn't look right. Is this really all the product that comes in this jar? It's too expensive to get this little amount of product! I buy a LOT of beauty products and never saw such a tiny amount of new product!",
        "headline": "Disappointed and surprised",
        "rating": 2,
        "ugc_id": 343689926
      },
      "name": "Pro-Collagen Eye Revive Mask",
      "native_review_count": 24,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 258,
      "locale": "en_US"
    }
  }
}