{
  "product_id": "pimprod2021098",
  "product_url": "https://www.ulta.com/p/superfood-aha-glow-cleansing-butter-pimprod2021098",
  "extracted_at": "2025-09-23T05:21:06.704250+00:00",
  "product_name": "ELEMISSuperfood AHA Glow Cleansing Butter",
  "brand": "ELEMIS",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wash"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "46.00",
  "availability": "in_stock",
  "rating_avg": "4.2",
  "rating_count": "136",
  "images": [
    "https://media.ulta.com/i/ulta/2570297?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2570297?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2570297cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2570297cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2570297cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2570297cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2570297cm_alt05?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsVeganSustainable PackagingGive BackELEMIS Superfood AHA Glow Cleansing Butter melts away makeup and daily impurities while leaving skin looking healthy, fresh and glowing.",
  "details": "DetailsBenefitsThis glow-getting facial cleanser removes every last trace of makeup, daily pollutants and daily grime to reveal a healthy-looking radiance.A unique blend of a Fermented Pumpkin Enzymes and Acerola Cherry, naturally rich in AHAs, helps to brighten skin, while Mango Butter and Chia Seed Oil, rich in omega fatty acids, nourish and hydrate the skin.The brightening, buttery formula can be used as a daily cleanser, a deep cleansing mask or a hydrating makeup remover for the eyes and face.Research ResultsWhen used as daily cleanser: 93% agreed this product did not leave their face feeling dry or stripped.*When used as a makeup remover: 95% agreed this product helped remove makeup.*When used as a deep cleansing mask: 95% agreed this product left their skin smooth.**Independent User Trials 2019. Results based on 129 people over 2 weeks.Item 2570297How To UseUse every morning and evening.Step 1 - To use as a makeup remover, apply to a cotton pad and wipe gently over the face and eyes.Step 2 - To use as a daily cleanser, massage a coin-sized amount into dry skin and rinse off with warm water.Step 3 - To use as a deep cleansing mask, apply a thin layer to the face and leave on for 1 minutes before rinsing.IngredientsCaprylic/Capric Triglyceride, Glycerin, Aqua/Water/Eau, Polyglyceryl-3 Methylglucose Distearate, Polysorbate 80, Cetearyl Olivate, Sorbitan Olivate, Hydroxyacetophenone, Phenoxyethanol, Acrylates/Beheneth-25 Methacrylate Copolymer, Mangifera Indica (Mango) Seed Butter, Salvia Hispanica Seed Oil, Lactobacillus/Acerola Cherry Ferment, Lactobacillus/Pumpkin Fruit Ferment Filtrate, Saccharomyces/Rice Ferment Filtrate, Camellia Sinensis Seed Oil, Candida Bombicola/Glucose/Methyl Rapeseedate Ferment, Sodium Hydroxide, Helianthus Annuus (Sunflower) Seed Oil, Beta-Carotene, Capsanthin/Capsorubin, Butylene Glycol, Tocopherol, Leuconostoc/Radish Root Ferment Filtrate, Olea Europaea (Olive) Fruit Oil, 1,2-Hexanediol, Polyglyceryl-3 Diisostearate, Ascorbyl Palmitate, Rosmarinus Officinalis (Rosemary) Leaf Extract, Ascorbic Acid.Please note the ingredient lists are subject to change, customers should refer to the product packaging for the correct ingredient list.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Use every morning and evening.Step 1 - To use as a makeup remover, apply to a cotton pad and wipe gently over the face and eyes.Step 2 - To use as a daily cleanser, massage a coin-sized amount into dry skin and rinse off with warm water.Step 3 - To use as a deep cleansing mask, apply a thin layer to the face and leave on for 1 minutes before rinsing.",
  "ingredients": [
    "Caprylic/Capric Triglyceride",
    "Glycerin",
    "Aqua/Water/Eau",
    "Polyglyceryl-3 Methylglucose Distearate",
    "Polysorbate 80",
    "Cetearyl Olivate",
    "Sorbitan Olivate",
    "Hydroxyacetophenone",
    "Phenoxyethanol",
    "Acrylates/Beheneth-25 Methacrylate Copolymer",
    "Mangifera Indica (Mango) Seed Butter",
    "Salvia Hispanica Seed Oil",
    "Lactobacillus/Acerola Cherry Ferment",
    "Lactobacillus/Pumpkin Fruit Ferment Filtrate",
    "Saccharomyces/Rice Ferment Filtrate",
    "Camellia Sinensis Seed Oil",
    "Candida Bombicola/Glucose/Methyl Rapeseedate Ferment",
    "Sodium Hydroxide",
    "Helianthus Annuus (Sunflower) Seed Oil",
    "Beta-Carotene",
    "Capsanthin/Capsorubin",
    "Butylene Glycol",
    "Tocopherol",
    "Leuconostoc/Radish Root Ferment Filtrate",
    "Olea Europaea (Olive) Fruit Oil",
    "2-Hexanediol",
    "Polyglyceryl-3 Diisostearate",
    "Ascorbyl Palmitate",
    "Rosmarinus Officinalis (Rosemary) Leaf Extract",
    "Ascorbic Acid.Please note the ingredient lists are subject to change",
    "customers should refer to the product packaging for the correct ingredient list"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser",
      "moisturizer"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "dewy",
      "sheer",
      "creamy",
      "oil"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "vegan",
      "natural",
      "hydrating",
      "brightening",
      "purifying"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2021098",
    "total_reviews": 136,
    "reviews": [
      {
        "review_id": 550615269,
        "rating": 5,
        "headline": "Favorite",
        "comments": "I never leave reviews, but this is amazing. It removes all of my makeup and I wear a full face with 24 hour foundation. Also, I breakout easily and this has not caused any breakouts in the several months that I have been using it.",
        "nickname": "Maggie",
        "location": "South carolina",
        "created_date": 1743289342123,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 527480088,
        "rating": 2,
        "headline": "Broke me out",
        "comments": "I really wanted to love this cleanser but it broke me out and didnt melt into skin like most other cleansing balms :(",
        "nickname": "cooper",
        "location": "Paso Robles, Ca",
        "created_date": 1723924492687,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 458164002,
        "rating": 5,
        "headline": "Superfood AHA Glow Cleansing Butter",
        "comments": "The price like all of Elemis' products is my only complaint. I noticed that this product evened out my skin tone, after about 3 uses. I wouldnt call it a cleanser though, more of a mask. I will be repurchasing.",
        "nickname": "Emily",
        "location": "Florida",
        "created_date": 1684279124186,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 449176623,
        "rating": 1,
        "headline": "Allergic Reaction",
        "comments": "I was really excited to try Elemis products because I had heard amazing things. I wanted to try the pro-collagen balm but I have celiac disease and it has wheat ingredients so I decided to try this one instead. My fave immediately broke out into hives. I'm sadly disappointed and will be returning!",
        "nickname": "Regan",
        "location": "Overland Park, KS",
        "created_date": 1679354599671,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 448625617,
        "rating": 1,
        "headline": "Bad Batch?",
        "comments": "The first thing I noticed was the strong chemical smell. It reminded me of the chemicals used to fix car engines, a very toxic odor that smelled like engine grease! I tried applying it to my chin and I felt instant irritation. Into the trash it went. Don't waste your money on this.",
        "nickname": "AB",
        "location": "Seattle, WA",
        "created_date": 1678842400621,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 2
      },
      {
        "review_id": 443902481,
        "rating": 5,
        "headline": "Worth the dollars Added this to my winter skincare",
        "comments": "Elemis face SUPERFOOD felt light on my skin. I used it as a 3 minute mask covered by a warm face cloth. My face felt amazingly soft without an oily feeling. Truly a Wonderful Wednesday skin pick me up.",
        "nickname": "BrndaM",
        "location": "Yuma Arizona",
        "created_date": 1676508816843,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 438781380,
        "rating": 2,
        "headline": "Not as good as the original",
        "comments": "One the things I love about the original is the pleasant very subtle herbal fragrance. This pumpkin stuff smells faintly of chemical smell. It doesn't emulsify eye make up like the original balm or have the same texture. It goes on feeling wet and cold. Yuck. The only positive is that it lasts longer because it's so gross I use less of it. Just put pumpkin baby food on your face, it's far less expensive.",
        "nickname": "Lana",
        "location": "North Carolina",
        "created_date": 1672159219565,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 435064541,
        "rating": 5,
        "headline": "Elemis cleansing balm",
        "comments": "To me this worked just as well as the Banilla cleansing balm but also had added benefits like superfoods and being a chemical exfoliant so, five stars!",
        "nickname": "Full Glam Queen",
        "location": "Idaho",
        "created_date": 1669266597541,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 434814588,
        "rating": 2,
        "headline": "Leaves skin with nice glow but doesn't remove makeup",
        "comments": "This balm does leave your skin with a nice glow and certainly softens your skin. I purchased this to compare against the farmacy cleansing balm. This balm does not remove makeup nearly aswell as the farmacy does. The smell is a little off putting aswell,  but tolerable. I wouldn't repurchase this to remove makeup in the future.",
        "nickname": "Celina6969",
        "location": "Portland, Or",
        "created_date": 1669083332123,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 404927941,
        "rating": 5,
        "headline": "MY HOLY GRAIL CLEANSING BALM",
        "comments": "You know when you find a skincare product that you're positive you will be using for the rest of your life??\n\nThat's this cleansing balm for me.\n\nI honestly cannot even fathom where the negative reviews come from.\n\nI've tried a lot of cleansing balms, & this one is the best. It checks all the boxes for the perfect everyday cleansing balm. Yes, it's scent isn't great. That's because it's not full of artificial fragrance, or essential oils. The texture is absolutely perfect. It has this luxurious, soft, almost \"whipped melted butter\" feel to it, that I cannot get enough of. It's so much better than the typical solid to oil cleansing balms.\n\nIt takes off every single scrap of makeup, even my stubborn mascara (Too Faced Better Than Sex), plus thick/glittery eyeshadow. So, if you're looking for a cleansing balm to remove everyday makeup, or a full glam look, this one is perfect for you.\n\nMy personal favorite way to use this cleansing balm, is almost like a cleanser/mask hybrid. On nights I'm not wearing makeup, I apply this product as you would a cleanser, & then I really take my time working it into my skin. Then, I leave it on for 5-10 minutes, to let the amazing ingredients do their thing. It leaves my skin SO incredibly soft + smooth. Like I just got a nourishing, & a gently resurfacing facial at the same time. *chef's kiss*\n\nI also love that this cleansing balm rinses 100% completely clean, without leaving any residue behind. It does this with ease. You don't have to stand there rubbing, it just comes right off. That's a very important aspect for me, when it comes to an oil-based cleanser.\n\nOne more thing to mention, is that if you're worried about the added AHA's in this product, they are *extremely* gentle. In this case, they are fruit enzymes (fermented pumpkin + acerola cherry), which are one of my favorite ingredients for gently brightening the skin. I have very sensitive eyes (most eye creams even irritate them), & I have never had an issue with this cleansing balm.\n\nOf course, skincare is personal, so to each their own, but I *highly* recommend trying this product out. It really is the best, with Farmacy's Green Clean being a close second. Both preform very well, but I definitely prefer the decadent texture of this one.",
        "nickname": "ila",
        "location": "New York",
        "created_date": 1649675859391,
        "bottom_line": null,
        "helpful_votes": 16,
        "not_helpful_votes": 0
      },
      {
        "review_id": 404587456,
        "rating": 5,
        "headline": "Lovely!",
        "comments": "I received this product as a birthday present. This product is amazing and removes makeup effortlessly. Those product leaves my face smooth as a baby's bottom!",
        "nickname": "Michelle",
        "location": "Texas",
        "created_date": 1649357999049,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 401081107,
        "rating": 5,
        "headline": "fell in love with the sample",
        "comments": "i received a sample of this along with my last ulta order. the most double cleansing i've tried is wiping with micellar water before my cleanser. i tried this tonight and wow. my face has never felt cleaner. perfectly moisturizing but not clogging. my skin is literally glowing. idk if it's because i've never tried any other cleansing balms but i'm blown away and about to buy the full size tub of this.",
        "nickname": "sophie",
        "location": "las vegas",
        "created_date": 1646571477972,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 398588317,
        "rating": 3,
        "headline": "Musty Plastic Smell",
        "comments": "This seemed like a great 1st step for double cleansing. It removed my makeup okay but it smells like...moldy plastic if plastic could get moldy. I thought maybe it was just old so I got another jar and kept it in my skin care fridge, but that one smells the same. Too bad because otherwise I rather like it.",
        "nickname": "Ang",
        "location": "Colorado",
        "created_date": 1644621395244,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 398575562,
        "rating": 5,
        "headline": "Amazing! Exfoliating version of original balm",
        "comments": "I am a longtime fan of the original cleansing balm, and I also love the rose version. This one doesn't have any scent at all, but has wonderful ingredients that gently exfoliate, with the creamiest most luxurious texture. Very spa like experience. A must have for any cleansing balm lover! I don't use this one to take my makeup off, I remove my makeup then use this as a deeper clean that also exfoliates.",
        "nickname": "Cheyenne",
        "location": "Florida",
        "created_date": 1644614063008,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 395836345,
        "rating": 5,
        "headline": "The best balm ever!",
        "comments": "I have no words how I love this balm. It is so soft, easy to use, removes all make up. I love Elemis products, the balm and other, and also Elemis never testing on animals, what ie great!",
        "nickname": "Tori",
        "location": "Cary",
        "created_date": 1643641569834,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 395735167,
        "rating": 5,
        "headline": "Removes make up super fast!",
        "comments": "It is the best, super gentle and removes all make up in 2 seconds. Love Elemis , love this balm.",
        "nickname": "Vi",
        "location": "Wilmington NC",
        "created_date": 1643505463551,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 395712930,
        "rating": 5,
        "headline": "a staple in my skincare routine!",
        "comments": "I cant testify to the makeup removing properties as I use a different product, however this is the cleanser I ALWAYS use afterwards and it removes every little trace if I didn't get any. It's a beautiful texture, though the smell is definitely peculiar and takes some getting used to, however, it does grow on you after awhile. My skin has never been more smooth or clear since I added this to my skin care routine, and cannot recommend it enough for others with combination or dry skin!",
        "nickname": "Madge",
        "location": "Minneapolis, MN",
        "created_date": 1643472796223,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 394480748,
        "rating": 1,
        "headline": "Ehhh...",
        "comments": "First thing I noticed was the smell, it almost smells bad, like it's off. I checked to make sure and its not expired and the other's in the store smelled the same. It has a nice texture, but it doesn't emulsify at all. It rinses away pretty easy but you definitely have to double cleanse using this. It does not remove all makeup and I wear very little makeup on a daily basis. I've noticed since integrating this into my routine, my face now has texture all over which it didn't before. This is the only thing that's new and that I've changed. Just not worth it to me and the price tag makes it a definite no.",
        "nickname": "Holly Ann",
        "location": "Virginia",
        "created_date": 1642644324528,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 392915757,
        "rating": 5,
        "headline": "Yes, I would get another one of these. I love it",
        "comments": "I use this product at night.",
        "nickname": "Minatalisa",
        "location": "CA",
        "created_date": 1641230741584,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 391419674,
        "rating": 1,
        "headline": "Ugh",
        "comments": "Does not remove makeup \nStinks and waste of money \nDon't buy",
        "nickname": "Stephanie",
        "location": "Louisiana",
        "created_date": 1639843467233,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 3
      }
    ],
    "paging": {
      "total_results": 31,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2021098/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "bestuses",
          "name": "Best Uses",
          "type": "tag",
          "values": [
            {
              "label": "Evening",
              "count": 1
            }
          ],
          "display_values": [
            "Evening"
          ]
        },
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "Doesn't emulsify",
              "count": 1
            },
            {
              "label": "Smell",
              "count": 1
            },
            {
              "label": "None",
              "count": 1
            },
            {
              "label": "Expensive",
              "count": 1
            }
          ],
          "display_values": [
            "Doesn't emulsify",
            "Expensive",
            "None",
            "Smell"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "18 years old",
              "count": 1
            },
            {
              "label": "30's",
              "count": 1
            },
            {
              "label": "Dry to combo skin",
              "count": 1
            },
            {
              "label": "Good Power Output",
              "count": 1
            },
            {
              "label": "Combination Skin",
              "count": 1
            },
            {
              "label": "Combination skin",
              "count": 1
            }
          ],
          "display_values": [
            "18 years old",
            "30's",
            "Casual Dresser",
            "Combination Skin",
            "Combination skin",
            "Comfort-seeking",
            "Dry to combo skin",
            "Energetic/Active",
            "Good Power Output",
            "Stylish/Fashionista",
            "Trendy/Stylish Dresser",
            "Youthful"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "Leaves the skin soft and glowing",
              "count": 1
            },
            {
              "label": "Effective",
              "count": 1
            },
            {
              "label": "Removes Everything",
              "count": 1
            },
            {
              "label": "Glow",
              "count": 1
            }
          ],
          "display_values": [
            "Effective",
            "Glow",
            "Leaves the skin soft and glowing",
            "Removes Everything"
          ]
        },
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Dry",
              "count": 2
            },
            {
              "label": "Combination",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        13,
        13,
        4,
        9,
        97
      ],
      "review_histogram": [
        13,
        13,
        4,
        9,
        97
      ],
      "rating_count": 136,
      "review_count": 136,
      "average_rating": 4.21,
      "recommended_ratio": 0.82,
      "media": [
        {
          "id": "559301833",
          "review_id": 559301849,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/gjapumozsguggjh8qiyk.jpg",
          "headline": "A Balm is the BOMB",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "No Foundation",
          "nickname": "WidowTrader78",
          "created_date": 1744314797000
        },
        {
          "id": "443902445",
          "review_id": 443902481,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/zaasdpv1j3zrbhk7ttwm.jpg",
          "headline": "Worth the dollars Added this to my winter skincare",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "ELEMIS Buttery cleaning and SUPERFOOD",
          "nickname": "BrndaM",
          "created_date": 1676508816843
        },
        {
          "id": "351509956",
          "review_id": 351509782,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ny43w0l52tdiorrvkh8j.jpg",
          "headline": "My New Cleansing Staple",
          "rating": 5,
          "helpful_votes": 1,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "My new skincare staple!!!",
          "nickname": "Crmglam82",
          "created_date": 1623515446000
        },
        {
          "id": "351509938",
          "review_id": 351509782,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/mftkvelsk6p5gaa46mcp.jpg",
          "headline": "My New Cleansing Staple",
          "rating": 5,
          "helpful_votes": 1,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Elemis Pumpkin Cleansing Butter",
          "nickname": "Crmglam82",
          "created_date": 1623515446000
        },
        {
          "id": "351509935",
          "review_id": 351509782,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/eaboxjlx3cf5mhr4jkhh.jpg",
          "headline": "My New Cleansing Staple",
          "rating": 5,
          "helpful_votes": 1,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Close up of Elemis Superfood Cleansing Butter",
          "nickname": "Crmglam82",
          "created_date": 1623515446000
        }
      ],
      "faceoff_positive": {
        "comments": "Yes, yes, yes, yes!!!!!!!!!!!! This is my new cleansing balm type staple. Though this is not a balm it's a butter and it is the best!!! No more adding water to emulsify. I just work it in to my skin and it emulsifies itself.  Then I rinse it off. My face feels so good. I received in my BoxyCharm Luxe subscription for June 2021. I will definitely look for this as an add on, choice, or pop up. I would not be mad if I got a duplicate of this in a future BoxyCharm box. BoxyCharm can send me the entire Elemis Superfood line and I would be happy. I am excited about how my skincare is going to improve.",
        "headline": "My New Cleansing Staple",
        "rating": 5,
        "ugc_id": 351509782
      },
      "faceoff_negative": {
        "comments": "First thing I noticed was the smell, it almost smells bad, like it's off. I checked to make sure and its not expired and the other's in the store smelled the same. It has a nice texture, but it doesn't emulsify at all. It rinses away pretty easy but you definitely have to double cleanse using this. It does not remove all makeup and I wear very little makeup on a daily basis. I've noticed since integrating this into my routine, my face now has texture all over which it didn't before. This is the only thing that's new and that I've changed. Just not worth it to me and the price tag makes it a definite no.",
        "headline": "Ehhh...",
        "rating": 1,
        "ugc_id": 394480748
      },
      "name": "Superfood AHA Glow Cleansing Butter",
      "native_review_count": 31,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 105,
      "locale": "en_US"
    }
  }
}