{
  "product_id": "pimprod2017636",
  "product_url": "https://www.ulta.com/p/skinactive-micellar-cleansing-eco-pads-reusable-3-pack-pimprod2017636",
  "extracted_at": "2025-09-23T05:11:00.801693+00:00",
  "product_name": "GarnierSkinActive Micellar Cleansing Eco Pads, Reusable, 3 Pack",
  "brand": "Garnier",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wash"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "11.99",
  "sale_price": "8.39",
  "availability": "in_stock",
  "rating_avg": "4.7",
  "rating_count": "658",
  "images": [
    "https://media.ulta.com/i/ulta/2570026?w=500&h=500"
  ],
  "detailed_images": [],
  "summary": "SummaryUltra-soft reusable Garnier SkinActive Micellar Cleansing Eco Pads activate with Micellar Cleansing Water to thoroughly remove makeup and cleanse skin.",
  "details": "DetailsBenefitsAn ultra-soft reusable microfiber pad that activates with Micellar Cleansing Water to thoroughly remove makeup and cleanse skinRe-usable, lasts up to 1,000 washesZero Cotton Pad WasteHand wash with soap and water after each useRemoves tough makeup even the leading wipes can't, leaves less waterproof mascara residue. Use Waterproof Micellar Cleansing Water and Reusable Eco PadsItem 2570026How To UseRemove Eco Pads from carton. Wash thoroughly with soap & water before 1st use. Use as many Eco Pads as needed to fully remove makeup and cleanse skin. Saturate Eco Pad with the Garnier Micellar Cleansing Water of your choice. Gently swipe eye, face and lip area and continue until make-up is removed. Cleaning your Eco Pads: Easy to wash! Hand wash with soap and water after each use.",
  "how_to_use": "Remove Eco Pads from carton. Wash thoroughly with soap & water before 1st use. Use as many Eco Pads as needed to fully remove makeup and cleanse skin. Saturate Eco Pad with the Garnier Micellar Cleansing Water of your choice. Gently swipe eye, face and lip area and continue until make-up is removed. Cleaning your Eco Pads: Easy to wash! Hand wash with soap and water after each use.",
  "ingredients": "",
  "extended_contents": {
    "images": [
      "https://content.syndigo.com/asset/ed54b2e9-36cc-4559-9417-6ca40c9ae0d5/480.webp",
      "https://content.syndigo.com/asset/43aaeb65-61af-4c34-97c6-a14889b744da/480.webp",
      "https://content.syndigo.com/asset/ca884d5c-2434-476a-a29b-b80cfeeba5a7/480.webp",
      "https://content.syndigo.com/asset/4dc1b2c6-3050-45ca-aede-5fed9a0a8480/300.webp",
      "https://content.syndigo.com/asset/957cf063-8292-429a-9686-f9fb96a0bb77/300.webp",
      "https://content.syndigo.com/asset/f53bd993-88b1-4f26-b7f6-1730a446908f/300.webp",
      "https://content.syndigo.com/asset/050649f3-a21a-47af-8ae7-aa8a57d2bc20/300.webp",
      "https://content.syndigo.com/asset/0e33f007-7d92-4c34-9f47-4492df8ff630/240.jpeg",
      "https://content.syndigo.com/asset/40abf6b0-e335-46ec-9c83-b2b921d92db7/240.jpeg",
      "https://content.syndigo.com/asset/e54ddd40-a529-403a-9219-58fc1a41359b/240.jpeg",
      "https://content.syndigo.com/asset/df1c52f6-fa38-4d6b-b355-01951f607943/240.jpeg",
      "https://content.syndigo.com/asset/636cdba5-1f30-4838-bf59-d034f8aec2cb/240.jpeg"
    ]
  },
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser"
    ],
    "finish": [
      "waterproof"
    ],
    "brand": [
      "mid-range",
      "budget"
    ],
    "special_features": [
      "purifying"
    ],
    "skin_type": [],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2017636",
    "total_reviews": 658,
    "reviews": [
      {
        "review_id": 560057137,
        "rating": 5,
        "headline": "Love reusable multi purpose items",
        "comments": "This 3 pack is a great value item. It is soft and with the right makeup remover oil or dace wash it works very well and doesnt irritate the skin. I have been able to throw it in the washer and its come back to its original soft fluffy clean shape. I even use it for my under arms. I appreciate resusable items like these that help our environment. Works better than the rough makeup wipes too.",
        "nickname": "MnM",
        "location": "Sherman, TX",
        "created_date": 1755056130289,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554792762,
        "rating": 2,
        "headline": "Not worthy",
        "comments": "These pads are too soft, making them difficult to use.   They are not nearly as good as the ones from Tweezerman.",
        "nickname": "AM",
        "location": "Tampa",
        "created_date": 1749482684589,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553781232,
        "rating": 5,
        "headline": "I like the Micellar Cleansing Eco Pads",
        "comments": "I have used both Makeup Eraser pads and the Micellar pads. The Micellar pads work well, wash well and dry fairly quickly. I bought them during a promotion, so the price was better. These pads would work well for travel, too. I'll buy another package soon since there are only 3 in a box.",
        "nickname": "Jo",
        "location": "Washington state",
        "created_date": 1747876345113,
        "bottom_line": "Yes",
        "helpful_votes": 11,
        "not_helpful_votes": 1
      },
      {
        "review_id": 550033203,
        "rating": 5,
        "headline": "Garnier miceller cleansing eco pads",
        "comments": "Omg!! I love these!! They work sooooo well. They are a very big size( you only need one for tour whole face) and they are better for the environment! I wish maybe the pack came with 4 of them or somthing considering the price. But overall great!! I still use cotton pads for toner but i use these for washing my face with miceller water at the end of the day. ( a great steal if you get them on sale!)",
        "nickname": "Ulta girl",
        "location": "USA",
        "created_date": 1743127336438,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550033479,
        "rating": 5,
        "headline": "Garnier miceller cleansing eco pads",
        "comments": "Omg!! I love these!! They work sooooo well. They are a very big size( you only need one for tour whole face) and they are better for the environment! I wish maybe the pack came with 4 of them or somthing considering the price. But overall great!! I still use cotton pads for toner but i use these for washing my face with miceller water at the end of the day. ( a great steal if you get them on sale!)",
        "nickname": "Ulta girl",
        "location": "USA",
        "created_date": 1743127335631,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 544308976,
        "rating": 4,
        "headline": "Would buy again but only on 50% sale",
        "comments": "Kind of pricey for what they are. They are smaller version of make up eraser clothes. So I will use in my  travel bag. They came out great in the wash.",
        "nickname": "Michy",
        "location": "Sunny,  FL",
        "created_date": 1737999935828,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543624349,
        "rating": 5,
        "headline": "Wish I had known these existed sooner! Love!",
        "comments": "These are a game-changer! I always felt guilty about using disposable single-use cotton rounds for removing my makeup--these alleviate that guilt perfectly! These pads are so soft and gentle on your skin (especially when removing mascara from your eyes). They are also very quick and simple to clean: running them under water and rubbing soap into them using your fingers for about a minute until you see no visible signs of makeup anymore, then they dry within a few hours! I highly recommend these and may purchase more just to keep at my boyfriend's place. Definitely try them out if you're looking for a more environmentally-friendly way to remove makeup!",
        "nickname": "B",
        "location": "Bloomington, IN",
        "created_date": 1737326984759,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543598633,
        "rating": 2,
        "headline": "Dupe for Makeup Eraser wipes",
        "comments": "This is the same soft fleece as the Makeup Eraser cloth and smaller reusable wipes.  As such we know that works to remove many types of makeup.  These cloths are very absorbent because they're so fluffy, so one has to take care not to waste too much micellsr water in one use.\n\nI have normal skin that can get dry at times in the winter, slightly oily/dewy in the sunmer.  I find the Makeup Eraser, like these Garnier wipes, is partislly effective.  I don't feel my face gets 100% clean with just the wipes, and the micellar water + wipes do a better job.  Yet, this material can be slightly irritating if used with a heavy hand.  I still need to use these as part of a dual-wash if removing makeup or heavy skincare.\n\nI bought several packs of these when on sale, but will return all but one.  While these are mostly effective at cleaning makeup off the face, I don't using them as much as I'd hoped for two reasons: 1) the slight mechanical irritation my skin feels when using such a soft/densely-packed fleece, even when not rubbing hard; 2) there are two layers only stitched around the circle's circumference, so when gently gliding/moving across the face, one layer bunches and it's difficult to keep from adjusting the grip.  If these layers were diamond quilt-stitched across the entire area of the wipe, this movement/bunching of the plys would not happen and these would be much easier to glide across the face.",
        "nickname": "BAMC",
        "location": "DC",
        "created_date": 1737261473491,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 539786156,
        "rating": 5,
        "headline": "THIS IS AMAZING",
        "comments": "i've been using makeup wipes for soooo long and i finally decided to start using the micellar water and eco friendly makeup cleanser pads, they're amazing!!! they make my face feel so nice unlike when using makeup wipes and its so rough on your face, they're also super easy to clean and they don't break they're good quality!!",
        "nickname": "may",
        "location": "texas",
        "created_date": 1734065985228,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 538960107,
        "rating": 4,
        "headline": "So soft on the skin!",
        "comments": "I love these makeup remover pads! I use them with the Garnier Micellar Water and they work perfectly! The softness of the pads makes them gentle on the face, while still removing the harshest of makeup. The only thing I wish is that they came in a darker color other than the white/pink because they do get stained after using them. They still come out clean and work well though!",
        "nickname": "Jessica",
        "location": "Ohio",
        "created_date": 1733341863173,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 538101300,
        "rating": 5,
        "headline": "Remove Makeup with Just Water",
        "comments": "I'm tired of my eyes being bothered by makeup removers. I use warm/hot water on the pad and hold to my eye for about 20 seconds, and see how it's going. It doesn't take much. It works so well. I love it. I do use my old makeup remover to clean the pad after I use it.",
        "nickname": "Laure",
        "location": "Texas",
        "created_date": 1732034698574,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 531761446,
        "rating": 4,
        "headline": "Perfect for travel",
        "comments": "What a great idea! I love that you can hand wash these in the sink after using.  That makes them perfect for travel.  I just keep them in my travel case and after a few trips give them a good wash in the washing machine.  The only drawback is I wish they were slightly larger in size.  I did have to use all three to get a full face off one night.",
        "nickname": "Heather",
        "location": "Denver, CO",
        "created_date": 1725303169233,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 524490087,
        "rating": 5,
        "headline": "Fabulous item!",
        "comments": "I love these pads so much!!! Tried them once now I have a jar full of them. Will continue to purchase these",
        "nickname": "Meowdy",
        "location": "Texas",
        "created_date": 1720412689856,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 523838456,
        "rating": 2,
        "headline": "Not worth it",
        "comments": "These are overpriced for what you get: two pieces of cloth stitched together around the edges. They are thin and flimsy. I much prefer other brands of makeup rounds I have tried.",
        "nickname": "WB",
        "location": "U.S.A.",
        "created_date": 1719554012947,
        "bottom_line": null,
        "helpful_votes": 8,
        "not_helpful_votes": 1
      },
      {
        "review_id": 511929042,
        "rating": 2,
        "headline": "I'm disappointed",
        "comments": "I admittedly didn't read the details-  but these have no micellar additive.  The product is marketed as part of the line… but what I bought was simply Garnier pads to USE with micellar water.",
        "nickname": "Kat",
        "location": "Massachusetts",
        "created_date": 1713772771931,
        "bottom_line": "No",
        "helpful_votes": 4,
        "not_helpful_votes": 45
      },
      {
        "review_id": 491206180,
        "rating": 5,
        "headline": "Love these",
        "comments": "Very happy with these. They're so soft and they do a great job at getting make up and dirt off without me having to rub my skin too hard. One pad is enough to remove all my makeup vs with cotton rounds, I would have to use about 3 or 4. I'm also really looking forward to not having to spend anymore money on cotton rounds. These are the cheaper option in the long run. I ordered 2 packs but one of them was missing a pad so they sent me another and now I have 8 pads total which is perfect cause they last me a whole week and I throw them in this mesh pouch when I'm done with them, then wash them all at the end of the week. They're very easy to handwash or you can throw them in the washer too. I usually use antibacterial soap or clothes/cotton soap. The soap I use to clean my makeup brushes (IT cosmetics Brush Bath) also works great. I've also heard a lot of people say they use baby shampoo. You can airdry them or throw them in the dryer but if you choose to airdry, make sure you ring them out good or they will take forever to dry. I use a papertowel to squeeze any excess water out after washing and then they dry really fast. Will definitely buy again and will recommend to all my loved ones.",
        "nickname": "Chey",
        "location": "Los Angeles, CA",
        "created_date": 1705299615611,
        "bottom_line": null,
        "helpful_votes": 19,
        "not_helpful_votes": 0
      },
      {
        "review_id": 491205961,
        "rating": 5,
        "headline": "Love these",
        "comments": "Very happy with these. They're so soft and they do a great job at getting my make up off without me having to rub my skin too hard. One pad is enough to remove all my makeup vs with cotton rounds, I would have to use about 3 or 4. I'm also really looking forward to not having to spend anymore money on cotton rounds. These are the cheaper option in the long run. I ordered 2 packs but one of them was missing a pad so they sent me another and now I have 8 pads total which is perfect cause they last me a whole week and I throw them in this mesh pouch when I'm done with them, then wash them all at the end of the week. They're very easy to handwash or you can throw them in the washer too. I usually use antibacterial soap or clothes/cotton soap. The soap I use to clean my makeup brushes (IT cosmetics Brush Bath) also works great. I've also heard a lot of people say they use baby shampoo. Will definitely buy again and will recommend to all my loved ones.",
        "nickname": "Chey",
        "location": "Los Angeles, CA",
        "created_date": 1705299171312,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 482078079,
        "rating": 5,
        "headline": "My daughter just love this.",
        "comments": "She states works better than the wipes and you can reuse them after cleaning",
        "nickname": "Jessica",
        "location": "Tracy, CA",
        "created_date": 1700539528403,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 478916603,
        "rating": 5,
        "headline": "Amazing !!",
        "comments": "Tried this when NikkaLaRose recommended it on her YT channel these are sooo good!! These feel so soft on the face, it feels like a fleece type of material and it doesnt pull on the skin like regular reusable cotton rounds. The pads themselves a great size for the face. I wish they came with a little mesh puch to keep them in for travel and washing them. Will defintely repurchase !! 1000/10",
        "nickname": "DA",
        "location": "Miami, FL",
        "created_date": 1698806439655,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 466224366,
        "rating": 4,
        "headline": "I love these",
        "comments": "So soft, and saves money on reusable pads . Easy to clean also . So glad I finally grabbed them",
        "nickname": "",
        "location": "Ohio",
        "created_date": 1690298539523,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 89,
      "pages_total": 5,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2017636/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "bestuses",
          "name": "Best Uses",
          "type": "tag",
          "values": [
            {
              "label": "Removing Makeup",
              "count": 1
            },
            {
              "label": "Adding face serum",
              "count": 1
            },
            {
              "label": "light makeup removal",
              "count": 1
            },
            {
              "label": "Eye Makeup Removal",
              "count": 1
            },
            {
              "label": "Skin Cleansing",
              "count": 1
            },
            {
              "label": "Waterproof Mascara",
              "count": 1
            },
            {
              "label": "Deeper cleaning and slight exfoliation",
              "count": 1
            },
            {
              "label": "Makeup removal",
              "count": 1
            },
            {
              "label": "Washing off masks",
              "count": 1
            }
          ],
          "display_values": [
            "Adding face serum",
            "Deeper cleaning and slight exfoliation",
            "Eye Makeup Removal",
            "Makeup removal",
            "Removing Makeup",
            "Skin Cleansing",
            "Washing off masks",
            "Waterproof Mascara",
            "light makeup removal"
          ]
        },
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "Doesn't leave skin feeling clean",
              "count": 1
            },
            {
              "label": "difficult to clean makeup off pad",
              "count": 1
            },
            {
              "label": "Daily Cleaning",
              "count": 1
            },
            {
              "label": "Difficult To Use",
              "count": 1
            }
          ],
          "display_values": [
            "Daily Cleaning",
            "Difficult To Use",
            "Doesn't leave skin feeling clean",
            "difficult to clean makeup off pad"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "Dry skin",
              "count": 1
            },
            {
              "label": "I have combination to dry skin.",
              "count": 1
            },
            {
              "label": "daily makeup wearer",
              "count": 1
            },
            {
              "label": "mature skin",
              "count": 1
            },
            {
              "label": "oily complexion",
              "count": 1
            }
          ],
          "display_values": [
            "Casual Dresser",
            "Comfort-seeking",
            "Dry skin",
            "Energetic/Active",
            "I have combination to dry skin.",
            "Stylish/Fashionista",
            "Trendy/Stylish Dresser",
            "Youthful",
            "daily makeup wearer",
            "mature skin",
            "oily complexion"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "Soft",
              "count": 5
            },
            {
              "label": "Easy to Use",
              "count": 2
            },
            {
              "label": "Washable",
              "count": 2
            },
            {
              "label": "Great value",
              "count": 1
            },
            {
              "label": "Save money",
              "count": 1
            },
            {
              "label": "Environmentally Friendly",
              "count": 1
            },
            {
              "label": "Easy to clean",
              "count": 1
            },
            {
              "label": "Eco friendly",
              "count": 1
            },
            {
              "label": "so soft and not abrasive",
              "count": 1
            },
            {
              "label": "Works very well",
              "count": 1
            },
            {
              "label": "Convenient",
              "count": 1
            },
            {
              "label": "Eco Friendly",
              "count": 1
            },
            {
              "label": "Gentle on Skin",
              "count": 1
            },
            {
              "label": "Money Saving",
              "count": 1
            },
            {
              "label": "Easy To Clean",
              "count": 1
            },
            {
              "label": "Not Harsh on Face",
              "count": 1
            },
            {
              "label": "Easy to Clean",
              "count": 1
            },
            {
              "label": "Reusable",
              "count": 1
            },
            {
              "label": "Durable",
              "count": 1
            },
            {
              "label": "Environmentally friendly",
              "count": 1
            },
            {
              "label": "Good Price / Value",
              "count": 1
            },
            {
              "label": "removes most makeup",
              "count": 1
            }
          ],
          "display_values": [
            "Convenient",
            "Durable",
            "Easy To Clean",
            "Easy to Clean",
            "Easy to Use",
            "Easy to clean",
            "Eco Friendly",
            "Eco friendly",
            "Environmentally Friendly",
            "Environmentally friendly",
            "Gentle on Skin",
            "Good Price / Value",
            "Great value",
            "Money Saving",
            "Not Harsh on Face",
            "Reusable",
            "Save money",
            "Soft",
            "Washable",
            "Works very well",
            "removes most makeup",
            "so soft and not abrasive"
          ]
        },
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Normal",
              "count": 4
            },
            {
              "label": "Combination",
              "count": 3
            },
            {
              "label": "Dry",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        4,
        12,
        21,
        84,
        537
      ],
      "review_histogram": [
        4,
        12,
        21,
        84,
        537
      ],
      "rating_count": 658,
      "review_count": 658,
      "average_rating": 4.73,
      "recommended_ratio": 0.94,
      "media": [
        {
          "id": "422349504",
          "review_id": 422349473,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/x8pp2gdiupjgih1vvimh.jpg",
          "headline": "Best Thing Ever!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "After Washing",
          "nickname": "Ecomama",
          "created_date": 1660868381000
        },
        {
          "id": "422349528",
          "review_id": 422349473,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/lqwdezp5o0dpkfsmpdkc.jpg",
          "headline": "Best Thing Ever!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Before Washing",
          "nickname": "Ecomama",
          "created_date": 1660868381000
        }
      ],
      "faceoff_positive": {
        "comments": "I love Garnier Eco Pads! They're just as advertised. I purchased the 3pk in Nov 2021. I wash them as recommended the pads don't fray on the ends plus continues to hold its original shape after washing.",
        "headline": "Best Thing Ever!",
        "rating": 5,
        "ugc_id": 422349473
      },
      "faceoff_negative": {
        "comments": "I was very skeptical of makeup remover cloths that only need water. I found this on sale and picked it up along with some micellar water. The cloths definitely remove makeup wonderfully and absolutely do not need the micellar water. Garnier is just trying to make a little extra cash by getting you to purchase two products (the cloth and the water) instead of just the cloth. I won't be purchasing these Garnier cloths again though. The two sides of the cloth are separate pieces of fabric that are only sewn together around the outside edge so they slide around on top of each other while I use it making the cloth incredibly difficult to maneuver. I end up folding it into a tiny ball which is still unwieldy but better than trying to use it flat. I will 100% buy another brand and use a makeup cloth daily. I do not recommend this brand.",
        "headline": "I love makeup remover cloths but just not this one",
        "rating": 2,
        "ugc_id": 382596712
      },
      "name": "SkinActive Micellar Cleansing Eco Pads, Reusable, 3 Pack",
      "native_review_count": 89,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 569,
      "locale": "en_US"
    }
  }
}