{
  "product_id": "pimprod2033460",
  "product_url": "https://www.ulta.com/p/order-of-eclipse-hyaluronic-cream-pimprod2033460",
  "extracted_at": "2025-09-23T04:45:12.723195+00:00",
  "product_name": "good lightOrder of the Eclipse Hyaluronic Cream",
  "brand": "good light",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Face Moisturizer"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "face"
  ],
  "currency": "USD",
  "list_price": "30.00",
  "sale_price": "21.00",
  "availability": "in_stock",
  "rating_avg": "4.8",
  "rating_count": "133",
  "images": [
    "https://media.ulta.com/i/ulta/2597528?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2597528?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597528cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597528cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597528cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597528cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597528cm_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597528cm_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2597528cm_alt07?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2597528cm_vid01/thumbs/0deb507c-6805-46e4-8a06-19a7dce3c035?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive Backgood light's Order of the Eclipse Hyaluronic Cream is an ultra-nourishing, non-oily moisturizer that goes deep and will hydrate overnight.",
  "details": "DetailsBenefitsDeeply and quickly moisturizesBoosts skin barrier functionCalms rednessRestores dehydrated skinSupports skin rejuvenationFeaturesgood light is a personal care brand that believes in beauty beyond the binary, creating a new space in the market for those who don't quite shop beauty by gender.Dermatologist testedKey IngredientsSqualane: The incorporation of squalane delivers moisture to the skin and aids in cell rejuvenation, making it stronger and smoother without feeling heavy or greasy.Meshima Mushroom: Abundant with polysaccharides and beta- glucans, meshima mushroom helps to improve collagen retention, deeply hydrate, and provide building blocks for firmer skin.Hyaluronic Acid: contains 3 hyaluronic acid molecule sizes which accelerates a process where epithelial cells march towards compromised area to restore.Item 2597528How To UseMassage cream into face and neck both morning and night.IngredientsWater, Glycerin, Squalane, Caprylic/Capric Triglyceride, Butylene Glycol, Propanediol, 1,2-Hexanediol, Cetearyl Alcohol, Caprylyl Methicone, Cetearyl Olivate, Diisostearyl Malate, Glyceryl Stearate, Hydrogenated Vegetable Oil, Hyaluronic Acid, Hydrolyzed Hyaluronic Acid, Sodium Hyaluronate, Phellinus Linteus Extract, Sedum Sarmentosum Extract, Polyglyceryl-6 Stearate, Sorbitan Olivate, Palmitic Acid, Dipentaerythrityl Hexahydroxystearate/Hexastearate/Hexarosinate, Vinyl Dimethicone, Stearic Acid, Carbomer, Tromethamine, Sorbitol, Polyglyceryl-6 Behenate, Myristic Acid, Ethylhexylglycerin.",
  "how_to_use": "Massage cream into face and neck both morning and night.",
  "ingredients": [
    "Water",
    "Glycerin",
    "Squalane",
    "Caprylic/Capric Triglyceride",
    "Butylene Glycol",
    "Propanediol",
    "2-Hexanediol",
    "Cetearyl Alcohol",
    "Caprylyl Methicone",
    "Cetearyl Olivate",
    "Diisostearyl Malate",
    "Glyceryl Stearate",
    "Hydrogenated Vegetable Oil",
    "Hyaluronic Acid",
    "Hydrolyzed Hyaluronic Acid",
    "Sodium Hyaluronate",
    "Phellinus Linteus Extract",
    "Sedum Sarmentosum Extract",
    "Polyglyceryl-6 Stearate",
    "Sorbitan Olivate",
    "Palmitic Acid",
    "Dipentaerythrityl Hexahydroxystearate/Hexastearate/Hexarosinate",
    "Vinyl Dimethicone",
    "Stearic Acid",
    "Carbomer",
    "Tromethamine",
    "Sorbitol",
    "Polyglyceryl-6 Behenate",
    "Myristic Acid",
    "Ethylhexylglycerin"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "moisturizer"
    ],
    "skin_type": [
      "oily",
      "dry"
    ],
    "finish": [
      "sheer",
      "creamy",
      "cream",
      "oil"
    ],
    "ingredients": [
      "hyaluronic-acid"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "dermatologist-tested",
      "hydrating"
    ]
  },
  "reviews": {
    "product_id": "pimprod2033460",
    "total_reviews": 133,
    "reviews": [
      {
        "review_id": 559736558,
        "rating": 5,
        "headline": "Super Moisturizing Night Time Cream!!",
        "comments": "For reference I am 46 years old and have just begun a real skin care regime in the last 6 months. I have started using this cream nightly for the last month. I apply after I cleanse my face with an oil cleanser in the evening. My face usually feels rather tight after cleansing and this product is my go to for bedtime moisturizer. This leaves my skin feeling supple and moisturized without feeling super greasy for bed. This seems to have helped with fine lines and has not had any adverse reaction on my skin. I will definitely repurchase and keep using.",
        "nickname": "Michele",
        "location": "Wisconsin",
        "created_date": 1754576963320,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557072454,
        "rating": 5,
        "headline": "I would buy this product again.",
        "comments": "My skin is so soft, and it has helped with fine lines. I've only been using this product for 2 weeks, but I love it. I would definitely recommend this product to other ladies who want to improve the look and feel of their skin especially in a short amount of time.",
        "nickname": "Michelle",
        "location": "Americus",
        "created_date": 1752443078507,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555998467,
        "rating": 5,
        "headline": "Please Just Get This",
        "comments": "their milky toning lotion has already changed my skin entirely the last few months. like seriously. this cream just made my skin so plump and soft and overnight took away some texture and redness, just like the toner",
        "nickname": "jack",
        "location": "seattle, wa",
        "created_date": 1751131028538,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 1
      },
      {
        "review_id": 553366654,
        "rating": 5,
        "headline": "Would buy again!",
        "comments": "I absolutely loved this product from the first couple times I used it. I have skin that is on the drier side, and this cream made my skin feel so plush, keeps my skin moisturized all day, and It's my winter go-to cream! Please don't stop selling!",
        "nickname": "J",
        "location": "CO",
        "created_date": 1747286099759,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 1
      },
      {
        "review_id": 548455744,
        "rating": 5,
        "headline": "Great daily moisturiser",
        "comments": "Im on my 5th pot and about to order more. My skin looks hydrated and dewy after application. Not sticky, smells clean.",
        "nickname": "LJB",
        "location": "Los Angeles",
        "created_date": 1741667082322,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543507510,
        "rating": 5,
        "headline": "holy grail",
        "comments": "my fav night moisturizer. i have sensitive/dehydrated skin and it is perfect for it, not perfume scented and has really made a difference in my skin. i've purchased twice and recieved as a gift from the bf :) will continue to rebuy for sure.",
        "nickname": "kar",
        "location": "spokane wa",
        "created_date": 1737141540724,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542164239,
        "rating": 5,
        "headline": "Will purchase again",
        "comments": "I was attracted to the packaging and the name of this cream, so I decided to try it. It's nongreasy, unscented formula glides onto the skin smoothly. It's lightweight and is great for morning and night use. I like it so much that I went back to buy more \"good light\" products!",
        "nickname": "Farmer girl",
        "location": "MD",
        "created_date": 1735865921553,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541840146,
        "rating": 4,
        "headline": "Hydration Dream",
        "comments": "My new go to moisturizer! I have sensitive combo skin and my skin just loves the hydration this leaves all day. My skin feels so soft and healthy after using it. Nice enough in the summer alone but even better for the fall/winter in the midwest over their abc oil. Fragrance free too.",
        "nickname": "Beauty Enthusiast",
        "location": "Chicago",
        "created_date": 1735281001843,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541389917,
        "rating": 5,
        "headline": "Great winter cream",
        "comments": "I really like this face cream for the winter. I live in a high desert climate and have combination skin; this isn't great for all year long but in the winter it's perfect especially after a day outside in harsh conditions. Definitely not lightweight and would be too heavy/ oily for someone with oily skin or in a humid climate but it's great when I need it! As a bonus, I love the packaging. It's not my holy grail and it's more expensive for the size than some other creams that do essentially the same thing but it does it's job well!",
        "nickname": "Pyrie",
        "location": "Bend, or",
        "created_date": 1734507385560,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 539194742,
        "rating": 5,
        "headline": "The best I've used",
        "comments": "Im very picky on what i use on my skin, and this is my holy grail!! I just purchased my 4th bottle today. Its thick and will last all night keeping you moisturized. Its light scented as well! The bottle isnt super huge and its a bit pricey but definitely worth it!",
        "nickname": "Courtney",
        "location": "California",
        "created_date": 1733640690399,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 539057199,
        "rating": 5,
        "headline": "Unscented wonder cream!",
        "comments": "This moisturizer is nothing short of amazing! Perfect! I've tried them all. This is rich, thick, and best of all..no scent! This pairs so nicely with the milky toner and my retinol and vitamin C regiment.",
        "nickname": "Julie",
        "location": "Washington",
        "created_date": 1733438022243,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 538688647,
        "rating": 5,
        "headline": "Just as good as the $100+ cremes",
        "comments": "This stuff is by far the top budget-friendly cream I have purchased! It rivals the ones that are over $100.",
        "nickname": "Betsy",
        "location": "Scottsdale",
        "created_date": 1732723830683,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537756819,
        "rating": 5,
        "headline": "The best cream I've tried. Full stop.",
        "comments": "The best cream? Yes. I haven't ever tried this brand until now – and I'm a believer. It's essential for every person who need hydration and loves softer skin!",
        "nickname": "Holly",
        "location": "Dallas, TX",
        "created_date": 1731514876731,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537633646,
        "rating": 3,
        "headline": "Too Heavy for Me",
        "comments": "I thought this meoisturizer was a bit too thick, doesn't seem to absorb very well into skin. Won't be back, probably back to a little lricier option.",
        "nickname": "Tori",
        "location": "Florida",
        "created_date": 1731331956245,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 527734616,
        "rating": 5,
        "headline": "Light Weight",
        "comments": "This is a nice light weight moisturizer. A little goes a long way. It's great for sensitive skin as well.",
        "nickname": "Sherri",
        "location": "Punta Gorda, FL",
        "created_date": 1724253095474,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 526843040,
        "rating": 1,
        "headline": "Ruined my skin",
        "comments": "I tried the Goodlight milky toner and the facewash and thought it was good. I now think over the last year I have been using Goodlight that is has slowly wreaked havoc on my moisture barrier. My skin is now irritated, burning, red, and dry. This is not normal for my skin. Im someone who always gets compliments on my skin, not a brag I just take care good care of my skin and know my ingredients. Looking at this I thought it would be amazing. The ingredients really are great in all of their products. Please dont be fooled like I was. I believe the ingredients are good but the quality and purity of the ingredients may be off because I dont think my skin has ever been worse. Now I must spend months repairing my moisture barrier and getting back to glass skin. Please avoid and if I may recommend something else. The Clinique Moisture Surge overnight mask, it has saved my skin from times like this. I will be returning all of my Goodlight and reupping on that.",
        "nickname": "Jadis",
        "location": "Portland",
        "created_date": 1723286262373,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 30
      },
      {
        "review_id": 522808568,
        "rating": 5,
        "headline": "BEST moisturizer ever",
        "comments": "i love everything about this! it is so moisturizing but not thick. i think it also doubles as a makeup primer. 100% reccomend, i tried something new and cheating on this product did not end well for me.",
        "nickname": "CG",
        "location": "CA",
        "created_date": 1718737244006,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 522657553,
        "rating": 5,
        "headline": "so good",
        "comments": "I usually use Charlotte Tilbury Magic Cream, but this moisturizer is just as amazing and for a fraction of the price! It's so Moisturizing but doesn't leave you feeling greasy.",
        "nickname": "j",
        "location": "FL",
        "created_date": 1718540224999,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 522605068,
        "rating": 5,
        "headline": "Chefs kiss!!",
        "comments": "This moisturizer is truly amazing! I've been using the Tula moisturizer for a long time but it wasn't working for me anymore so I started trying this one and I have no regrets!! I have combo sensitive skin and I found this product to be so hydrating and it gives a supple look and it looks great under makeup. Definitely recommend trying!",
        "nickname": "Blue1024",
        "location": "Beaverton, Oregon",
        "created_date": 1718433588600,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 522363089,
        "rating": 5,
        "headline": "Can I just say WOW!!!!",
        "comments": "I am absolutely amazed by this cream! As someone with combination/ leaning towards oily skin, this has been one of the best moisturizers I've used in a while. Love that it uses truly clean ingredients. Texture and smell are great, I have no notes. Can be used any time of year!",
        "nickname": "Jane",
        "location": "NYC, NY",
        "created_date": 1718045489321,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 84,
      "pages_total": 5,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2033460/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Combination",
              "count": 5
            },
            {
              "label": "Dry",
              "count": 3
            },
            {
              "label": "Normal",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        3,
        1,
        6,
        2,
        121
      ],
      "review_histogram": [
        3,
        1,
        6,
        2,
        121
      ],
      "rating_count": 133,
      "review_count": 133,
      "average_rating": 4.78,
      "recommended_ratio": 0.96,
      "media": [
        {
          "id": "486030324",
          "review_id": 486030353,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/fuzvsy17ymbrikbxfklk.jpg",
          "headline": "Absolutely superb, lightweight, moisturizer.",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Corbin",
          "created_date": 1703841270260
        }
      ],
      "faceoff_positive": {
        "comments": "I'm a 40+ female plagued with acne and oily skin since I was a teen. I still have significant black heads and occasional cystic acne breakouts which is hormonal. Acne products seem to be too drying to me nowadays and I want to have a healthy glow. I heard JVN interview David Yi, the Good Light creator and made a comment on how gorgeous was David's skin. In the tradition of trying anything once, I went to the nearest Ulta and purchased this with the milky toner. \n\nFor full disclosure, I also combined this product in a regimen of milky toner after my face wash, niacinamide serum, vitamin c serum and 1-2x a week of prescription retinol 0.05%.\n\nWhen I initially started using this cream, I was concerned about it being thick. Felt tacky on my face but somehow in 2 weeks, it's started to feel more easily absorbed and not as tacky.  \n\nIn a short span of 2 weeks, I cannot believe how gorgeous my skin looks. So luminous! When I realized how pretty my skin became, I started doing it twice a day. And I got even better results.\n\nI have tried a lot of other moisturizers, from drug store to luxe. This is the 1st and only product that gave me the results I have been searching for. \n\nGranted, my enlarged pores and old acne scars are still there but there is some magic this cream does to smooth out the over all texture of the skin. I just cannot believe how good my skin looks. Super confidence boosting! \n\nIt's winter so I'm happily using it to protect my skin. I still will have to figure out how this will work in the summer. \n\nI wholeheartedly recommend this product. Life changing.",
        "headline": "Glass skin",
        "rating": 5,
        "ugc_id": 439870718
      },
      "faceoff_negative": {
        "comments": "I tried the Goodlight milky toner and the facewash and thought it was good. I now think over the last year I have been using Goodlight that is has slowly wreaked havoc on my moisture barrier. My skin is now irritated, burning, red, and dry. This is not normal for my skin. Im someone who always gets compliments on my skin, not a brag I just take care good care of my skin and know my ingredients. Looking at this I thought it would be amazing. The ingredients really are great in all of their products. Please dont be fooled like I was. I believe the ingredients are good but the quality and purity of the ingredients may be off because I dont think my skin has ever been worse. Now I must spend months repairing my moisture barrier and getting back to glass skin. Please avoid and if I may recommend something else. The Clinique Moisture Surge overnight mask, it has saved my skin from times like this. I will be returning all of my Goodlight and reupping on that.",
        "headline": "Ruined my skin",
        "rating": 1,
        "ugc_id": 526843040
      },
      "name": "Order of the Eclipse Hyaluronic Cream",
      "native_review_count": 84,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 49,
      "locale": "en_US"
    }
  }
}