{
  "product_id": "pimprod2007172",
  "product_url": "https://www.ulta.com/p/pore-cleansing-oil-bha-pimprod2007172",
  "extracted_at": "2025-09-23T04:51:41.955808+00:00",
  "product_name": "HanskinPore Cleansing Oil - BHA",
  "brand": "Hanskin",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Cleansing Balms & Oils"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "cleansing-balms--oils"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "27.00",
  "availability": "in_stock",
  "rating_avg": "4.3",
  "rating_count": "76",
  "images": [
    "https://media.ulta.com/i/ulta/2551558?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2551558?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2551558_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2551558_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2551558_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2551558cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2551558cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2551558cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2551558cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2551558cm_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2551558cm_alt06?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryFormulated specifically for oily and acne-prone skin, Hanskin's Pore Cleansing Oil BHA removes makeup and prevents pore congestion in a single step.",
  "details": "DetailsBenefitsThoroughly removes makeup, including waterproof makeupA blend of nourishing oils softens and maintains skin health and hydrationSalicylic acid helps dissolve sebum and keep pores clearEasy-to-use pump makes application sanitary and mess-freeKey IngredientsSalicylic Acid: A beta hydroxy acid that dissolves excess sebum that causes breakoutsOrange Peel Oil: A refreshing fruit extract packed with antioxidantsJojoba Oil: A plant-based oil that improves skin texture and hydrationEucalyptus Oil: A purifying plant extract that gives skin a fresh feelingFormulated WithoutParabensDyesArtificial FragrancesAlcoholItem 2551558How To UseUse it as the first step of your double cleansing routine. Dispense 2-3 pumps into dry palms and massage over dry skin. Wet your hands with a little water and massage the face to emulsify the oil. Rinse well with warm water and pat dry. Follow with a water-based cleanser.Precautions: For external use only. Do not get into eyes.IngredientsWater, Peg-7 Glyceryl Cocoate, Dipropylene Glycol, Ethylhexyl Palmitate, Glycerin, 1,2-Hexanediol, Dicaprylyl Ether, Coco-Caprylate/Caprate, Hydroxyacetophenone, Citric Acid, Litsea Cubeba Fruit Oil, Disodium Edta, Ethylhexylglycerin, Butylene Glycol, Citrus Aurantium Dulcis (Orange) Peel Oil, Lavandula Angustifolia (Lavender) Oil, Betaine Salicylate, Sodium Citrate, Simmondsia Chinensis (Jojoba) Seed Oil, Pelargonium Graveolens Oil, Canarium Luzonicum Gum Nonvolatiles, Rosmarinus Officinalis (Rosemary) Leaf Oil, Eucalyptus Globulus Leaf Oil, Citrus Aurantium Amara (Bitter Orange) Flower Oil, Anthemis Nobilis Flower Oil, Enantia Chlorantha Bark Extract, Rhus Semialata Gall Extract, Camellia Japonica Flower Extract, Chenopodium Quinoa Seed Extract, Oenothera Biennis (Evening Primrose) Flower Extract, Ulmus Davidiana Root Extract, Pinus Palustris Leaf Extract, Pueraria Lobata Root Extract, Oleanolic Acid, Oxygen.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Use it as the first step of your double cleansing routine. Dispense 2-3 pumps into dry palms and massage over dry skin. Wet your hands with a little water and massage the face to emulsify the oil. Rinse well with warm water and pat dry. Follow with a water-based cleanser.Precautions: For external use only. Do not get into eyes.",
  "ingredients": [
    "Water",
    "Peg-7 Glyceryl Cocoate",
    "Dipropylene Glycol",
    "Ethylhexyl Palmitate",
    "Glycerin",
    "2-Hexanediol",
    "Dicaprylyl Ether",
    "Coco-Caprylate/Caprate",
    "Hydroxyacetophenone",
    "Citric Acid",
    "Litsea Cubeba Fruit Oil",
    "Disodium Edta",
    "Ethylhexylglycerin",
    "Butylene Glycol",
    "Citrus Aurantium Dulcis (Orange) Peel Oil",
    "Lavandula Angustifolia (Lavender) Oil",
    "Betaine Salicylate",
    "Sodium Citrate",
    "Simmondsia Chinensis (Jojoba) Seed Oil",
    "Pelargonium Graveolens Oil",
    "Canarium Luzonicum Gum Nonvolatiles",
    "Rosmarinus Officinalis (Rosemary) Leaf Oil",
    "Eucalyptus Globulus Leaf Oil",
    "Citrus Aurantium Amara (Bitter Orange) Flower Oil",
    "Anthemis Nobilis Flower Oil",
    "Enantia Chlorantha Bark Extract",
    "Rhus Semialata Gall Extract",
    "Camellia Japonica Flower Extract",
    "Chenopodium Quinoa Seed Extract",
    "Oenothera Biennis (Evening Primrose) Flower Extract",
    "Ulmus Davidiana Root Extract",
    "Pinus Palustris Leaf Extract",
    "Pueraria Lobata Root Extract",
    "Oleanolic Acid",
    "Oxygen"
  ],
  "extended_contents": {},
  "tags": {
    "product_type": [
      "cleanser",
      "moisturizer",
      "lip gloss",
      "oil"
    ],
    "skin_type": [
      "oily",
      "dry",
      "acne-prone"
    ],
    "finish": [
      "waterproof",
      "oil"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "vegan",
      "hydrating",
      "purifying"
    ],
    "category": [],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2007172",
    "total_reviews": 76,
    "reviews": [
      {
        "review_id": 542711274,
        "rating": 2,
        "headline": "sticky",
        "comments": "i bought this because its advertised as light but it was so thick and sticky i felt like i was pulling on my skin. i'm going to keep buying my Anua cleanser",
        "nickname": "starr",
        "location": "Seattle",
        "created_date": 1736735411436,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 3
      },
      {
        "review_id": 526383331,
        "rating": 4,
        "headline": "pretty good, not for me",
        "comments": "i bought this when i thought i had oily skin (its actually combination) so i wont be repurchasing. however, this product removes makeup effectively and does wonders for my waterproof mascara. my one issue was that the pump on the bottle was finnicky for me, so i transfered to a different bottle. the product itself was effectice and nonstripping, however.",
        "nickname": "elle",
        "location": "chicago, il",
        "created_date": 1722822325990,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 513860401,
        "rating": 5,
        "headline": "fell in love after one use!",
        "comments": "I just received this in my ULTA order that arrived today. I used it on dirty but no makeup skin using the oil gritting method (massage oil into dry skin for 15-20 minutes). Oh my goodness - it cleared most of my sebaceous filaments in my cheeks and chin in one use! My nose is a bit more stubborn and will probably need more consistent use to fully remove the filaments. It smells PHENOMENAL; it's a natural herbal citrus scent that's remniscent of professional spa treatments. Lightweight formula and glides across the skin. I used about three pumps and it did not drag at all. I have not used it for makeup removal yet, but the consistency and the way it broke my sebaceous filaments down make me feel like it will do a great job on that too. Oh, and a bonus - it does NOT sting my eyes!!!! I am happy to have added this to my skincare arsenal as I prepare for my upcoming summer wedding.",
        "nickname": "Stacie",
        "location": "Michigan",
        "created_date": 1715724364846,
        "bottom_line": null,
        "helpful_votes": 17,
        "not_helpful_votes": 1
      },
      {
        "review_id": 486945785,
        "rating": 1,
        "headline": "not good for acne prone skin",
        "comments": "I used this product for about 3 weeks when my face began to break out in painful spots in a way it has never done before.",
        "nickname": "tm",
        "location": "des moines",
        "created_date": 1704664022998,
        "bottom_line": null,
        "helpful_votes": 11,
        "not_helpful_votes": 2
      },
      {
        "review_id": 486475940,
        "rating": 5,
        "headline": "Combo Skin",
        "comments": "i've used this cleanser for about two weeks now, and i personally really enjoy it! i have sebaceous filaments from an oily t zone, and i have been oil cleansing with this on my nose for about 3 minutes and most of my nose is clear :) it's really light and doesn't leave an oily feeling and easy to rinse off. i use the pha oil for removing makup since it's more gentle, and go in with this one to actually cleanse my face.",
        "nickname": "Nuri",
        "location": "Union City, TN",
        "created_date": 1704346485881,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 1
      },
      {
        "review_id": 479382212,
        "rating": 4,
        "headline": "Not bad",
        "comments": "Honestly i prefer the DHC one. This one stings my eyes which sucks bc i didnt want to have to use a different cleanser for the eyes. It is a thinner oil.",
        "nickname": "Ms",
        "location": "Wa",
        "created_date": 1698983646384,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 476873772,
        "rating": 3,
        "headline": "The jury is still out",
        "comments": "I've been using this product for over a month. I have sensitive, reactive, acne prone, combo skin and I really wanted to love this, but i don't see much improvement. It don't emulsify well, although it does leave my skin soft. It's on the thinner side of cleansing oils (as opposed to say DHC), and I haven't seen much change in my texture, but I'll keep using it as nothing has seemed to worsen, which for me, is a W. Hope to return with a better update in a few.",
        "nickname": "Trei'",
        "location": "Houma, LA",
        "created_date": 1697507121132,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 469156904,
        "rating": 5,
        "headline": "Amazing cleansing oil for oily skin",
        "comments": "I decided to try this simply because I LOVE their cleansing balm- BHA.  This works as good as the balm.  I just switch around between two products. - The days with heavy makeup, I go for balm and the days with light or no makeup, I use the oil.  Both works great.  LOVE LOVE LOVE",
        "nickname": "Jen",
        "location": "Los Angeles. CA",
        "created_date": 1692391930676,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 468052113,
        "rating": 5,
        "headline": "Game changer for oily skin",
        "comments": "I have both the balm and oil from this brand. I really like both of them. - they work great on my super oily skin. My blackheads disappeared after a few washes. My skin is less oily when I use this product. I would highly recommend this cleansing oil for anyone who has severe oily skin.",
        "nickname": "M June",
        "location": "Los Angeles. CA",
        "created_date": 1691711575176,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 444852249,
        "rating": 2,
        "headline": "Not really an oil cleanser",
        "comments": "The 1st ingredient is water... which isn't something you'd expect to find in a 1st cleanse, in which one would apply to a dry face & then emulsify with water. This is more of a thin gel. Definitely not an oil cleanser. Also it has a strong herbal stench which I don't really appreciate. It also feels cool on the skin when applied. Not great. I'm sure there's oil somewhere in its ingredient list, making it an oil containing cleanser but, this is most emphatically not an oil cleanser.",
        "nickname": "Nicholas Name",
        "location": "The Moon, Kansas",
        "created_date": 1676850965506,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 4
      },
      {
        "review_id": 443500506,
        "rating": 2,
        "headline": "Pass :/",
        "comments": "Was super excited to try this but ended up kinda disappointed. I have tried dozens of cleansing oils and balms and was looking to try something with BHAs in it. The bottle and price point are great, and I believe it probably works well for many people. However for me, it is super watery and doesn't work into my skin like other products do. It doesn't feel like an oil or emulsify; however, it doesn't leave behind a film which is a positive.",
        "nickname": "T",
        "location": "FL",
        "created_date": 1676134778476,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 0
      },
      {
        "review_id": 416236486,
        "rating": 5,
        "headline": "My Holy Grail Skincare Line",
        "comments": "I love the PHA version of this cleansing oil and have been using it for about two years. There was a recent Hanskin sale and I was already running low on the hyaluron moisturizer that I love so I thought I would give this a try, plus a few other things. I have to say, I'm once again, very impressed with the results. I've been using this as the first step of my night time routine in combination with the Hyaluron Bubble Pop Foam cleanser and I haven't found a better duo for my summer skincare routine! I have combination skin and with the right serum this stuff given me petal soft, glassy skin! In the winter I will probably switch back to the PHA version and a gentler cleanser, but this stuff is amazing. I've found using BHA cleansing oils and essence toners have been the best combatant to summer acne for my dry/oily combination skin.",
        "nickname": "Desert Miku",
        "location": "AZ",
        "created_date": 1657241218646,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 400668979,
        "rating": 5,
        "headline": "Great first impression!",
        "comments": "So, I've only used this cleanser once-but so far, I love it! I'm usually able to get an idea on wether a cleanser will work for me right off the bat. This cleanser is gentle, but still super effective. It removed ALL of my eye makeup and left my skin feeling soft and clean. \nI followed it with another cleanser, and I'm satisfied so far.",
        "nickname": "Gem25",
        "location": "Chi",
        "created_date": 1646228871259,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 393629026,
        "rating": 4,
        "headline": "Light, nice smelling- what I was looking for",
        "comments": "Am enjoying this oil cleanser so far! It should be made clear on Ulta's website but on the Hanskin website it says that this cleanser should be followed by a water-based cleanser as part of a two step process. There have been times I haven't done this and I think you can easily go without step 2 since it doesn't leave an oily feel afterwards. For me the two step makes my skin feel \"too clean\". Im very particular about fragrances in face products and really like how this smells expensive and its very subtle- slightly citrusy maybe. Would recommend and will probably buy again.",
        "nickname": "lindhous",
        "location": "orlando, fl",
        "created_date": 1641833545522,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 392547010,
        "rating": 5,
        "headline": "Great cleanser that leaves skin silky smooth",
        "comments": "I use this product in the shower in the mornings to cleanse my face.  I love the citrus scent.  I have sensitive skin; this product works for me.  It leaves my skin silky smooth after using it.",
        "nickname": "LA gal",
        "location": "Los Angeles",
        "created_date": 1640921476719,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 390114491,
        "rating": 5,
        "headline": "Highly Recommended! I will buy this product again.",
        "comments": "Smooth and so soft to my skin. I love how great this product to my skin while still being effective. You don't get a stinging or burning sensation like other products I've used. I highly recommend it if your looking for something to improve your skins texture while also keeping it glow!",
        "nickname": "Alona",
        "location": "Hayward, CA.",
        "created_date": 1638939206154,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 389178319,
        "rating": 5,
        "headline": "Dependable Gentle Cleanser",
        "comments": "This cleanser is really gentle and has an oil/water like consistency. It wipes away all of my makeup without feeling harsh on my skin. There is a slight citrus smell, which for me I really liked. It's a staple! If you're looking for a cleanser I definitely recommend.",
        "nickname": "Cloudy Day",
        "location": "Los Angeles, CA",
        "created_date": 1638256271087,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 388829811,
        "rating": 4,
        "headline": "Good oil based cleanser",
        "comments": "Good oil based cleanser that doesn't leave a very slick oily feeling after. I usually use a foaming cleanser after this to really get my skin clean. There is minimal scent to it which I like since I have sensitive skin. Great buy for its price point.",
        "nickname": "Mei",
        "location": "San Francsico",
        "created_date": 1637924029879,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 388746798,
        "rating": 4,
        "headline": "Gentile and Effective!",
        "comments": "I really enjoyed this oil cleanser as a first step of my cleansing routine. Because it is exfoliating I only use it twice a week. I like how gentile it is while still being effective. You don't get a stinging or burning sensation like other products I've tried. I highly recommend it if your looking for something to improve your skins texture while also keeping it glowy and clear!",
        "nickname": "Steph P.",
        "location": "Fremont CA",
        "created_date": 1637816322524,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 388746012,
        "rating": 5,
        "headline": "Good cleanser",
        "comments": "This is a pretty good oil cleanser, and I have used many in the past. I like using it especially in the winter time. My skin is pretty dry in the winter and I feel like it doesn't strip my skin while still making it feel clean. It has a pretty citrusy smell, so if you're sensitive to scents I would not get it. Overall, I really like this cleanser and I would recommend it.",
        "nickname": "Viv",
        "location": "Portland, OR",
        "created_date": 1637815191572,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 76,
      "pages_total": 4,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2007172/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "bestuses",
          "name": "Best Uses",
          "type": "tag",
          "values": [
            {
              "label": "Makeup Removal",
              "count": 2
            },
            {
              "label": "Facial cleanser",
              "count": 1
            },
            {
              "label": "Cleansing",
              "count": 1
            },
            {
              "label": "Exfoliation",
              "count": 1
            },
            {
              "label": "Cleans and shrinks pores",
              "count": 1
            },
            {
              "label": "Oil Cleansing",
              "count": 1
            },
            {
              "label": "Best used as first cleanser",
              "count": 1
            },
            {
              "label": "Massaging face as you cleanse",
              "count": 1
            },
            {
              "label": "Dry skin",
              "count": 1
            },
            {
              "label": "First cleanse",
              "count": 1
            },
            {
              "label": "First step to cleanse",
              "count": 1
            }
          ],
          "display_values": [
            "Best used as first cleanser",
            "Cleans and shrinks pores",
            "Cleansing",
            "Dry skin",
            "Exfoliation",
            "Facial cleanser",
            "First cleanse",
            "First step to cleanse",
            "Makeup Removal",
            "Massaging face as you cleanse",
            "Oil Cleansing"
          ]
        },
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "Stings Eyes",
              "count": 1
            },
            {
              "label": "Wish it emulsified a little more",
              "count": 1
            },
            {
              "label": "Smell",
              "count": 1
            },
            {
              "label": "two many steps",
              "count": 1
            },
            {
              "label": "Have to rinse very, very thoroughly",
              "count": 1
            },
            {
              "label": "Doesn't emulsify",
              "count": 1
            },
            {
              "label": "Must rub intensely",
              "count": 1
            },
            {
              "label": "Work in required",
              "count": 1
            }
          ],
          "display_values": [
            "Doesn't emulsify",
            "Have to rinse very, very thoroughly",
            "Must rub intensely",
            "Smell",
            "Stings Eyes",
            "Wish it emulsified a little more",
            "Work in required",
            "two many steps"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "adult acne, clogged skin",
              "count": 1
            },
            {
              "label": "Asian skin",
              "count": 1
            },
            {
              "label": "Oily/acne prone Skin",
              "count": 1
            },
            {
              "label": "Oily skin",
              "count": 1
            },
            {
              "label": "Combination skin",
              "count": 1
            },
            {
              "label": "Occasional adult acne",
              "count": 1
            },
            {
              "label": "Sensitive skin",
              "count": 1
            },
            {
              "label": "Use daily make-up/SPF on skin",
              "count": 1
            },
            {
              "label": "Not acne-prone",
              "count": 1
            },
            {
              "label": "Not sensitive",
              "count": 1
            },
            {
              "label": "Oily",
              "count": 1
            },
            {
              "label": "oily skin",
              "count": 1
            },
            {
              "label": "Combination",
              "count": 1
            }
          ],
          "display_values": [
            "Asian skin",
            "Casual Dresser",
            "Combination",
            "Combination skin",
            "Comfort-seeking",
            "Energetic/Active",
            "Not acne-prone",
            "Not sensitive",
            "Occasional adult acne",
            "Oily",
            "Oily skin",
            "Oily/acne prone Skin",
            "Sensitive skin",
            "Stylish/Fashionista",
            "Trendy/Stylish Dresser",
            "Use daily make-up/SPF on skin",
            "Youthful",
            "adult acne, clogged skin",
            "oily skin"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "Moisturizing",
              "count": 2
            },
            {
              "label": "Easy to use",
              "count": 2
            },
            {
              "label": "2nd cleanse may not be needed",
              "count": 1
            },
            {
              "label": "nice smell not too strong",
              "count": 1
            },
            {
              "label": "not too greasy",
              "count": 1
            },
            {
              "label": "Nice citrus scent",
              "count": 1
            },
            {
              "label": "Effective",
              "count": 1
            },
            {
              "label": "Exfoliating",
              "count": 1
            },
            {
              "label": "Removes makeup fast, and hydrates skin",
              "count": 1
            },
            {
              "label": "cleansing",
              "count": 1
            },
            {
              "label": "Bottle size",
              "count": 1
            },
            {
              "label": "Texture",
              "count": 1
            },
            {
              "label": "Deep cleans my pores",
              "count": 1
            },
            {
              "label": "Rinses off clean",
              "count": 1
            },
            {
              "label": "Smells amazing",
              "count": 1
            },
            {
              "label": "removes makeup without leaving your skin dry",
              "count": 1
            },
            {
              "label": "Does not cause breakout",
              "count": 1
            },
            {
              "label": "Does not leave skin dry",
              "count": 1
            },
            {
              "label": "Gentle",
              "count": 1
            },
            {
              "label": "Light",
              "count": 1
            },
            {
              "label": "Smells nice naturally",
              "count": 1
            },
            {
              "label": "Cleans without stripping skin",
              "count": 1
            },
            {
              "label": "Hydrates skin",
              "count": 1
            },
            {
              "label": "Removes makeup and dirt",
              "count": 1
            },
            {
              "label": "Smells great",
              "count": 1
            },
            {
              "label": "Good for combination skin",
              "count": 1
            },
            {
              "label": "Light scent",
              "count": 1
            },
            {
              "label": "Cleanses pores well",
              "count": 1
            },
            {
              "label": "Doesn't dry out skin",
              "count": 1
            },
            {
              "label": "Easier to remove makeup",
              "count": 1
            },
            {
              "label": "Smells incredible",
              "count": 1
            },
            {
              "label": "Double Cleansing",
              "count": 1
            },
            {
              "label": "Removing Makeup",
              "count": 1
            }
          ],
          "display_values": [
            "2nd cleanse may not be needed",
            "Bottle size",
            "Cleans without stripping skin",
            "Cleanses pores well",
            "Deep cleans my pores",
            "Does not cause breakout",
            "Does not leave skin dry",
            "Doesn't dry out skin",
            "Double Cleansing",
            "Easier to remove makeup",
            "Easy to use",
            "Effective",
            "Exfoliating",
            "Gentle",
            "Good for combination skin",
            "Hydrates skin",
            "Light",
            "Light scent",
            "Moisturizing",
            "Nice citrus scent",
            "Removes makeup and dirt",
            "Removes makeup fast, and hydrates skin",
            "Removing Makeup",
            "Rinses off clean",
            "Smells amazing",
            "Smells great",
            "Smells incredible",
            "Smells nice naturally",
            "Texture",
            "cleansing",
            "nice smell not too strong",
            "not too greasy",
            "removes makeup without leaving your skin dry"
          ]
        },
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Oily",
              "count": 2
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        2,
        6,
        4,
        22,
        42
      ],
      "review_histogram": [
        2,
        6,
        4,
        22,
        42
      ],
      "rating_count": 76,
      "review_count": 76,
      "average_rating": 4.26,
      "recommended_ratio": 0.93,
      "media": [],
      "faceoff_positive": {
        "comments": "I used it daily - morning and night. I found it so gentle on my sensitive skin and didn't leave my skin \"bare\" or \"stripped\". I would recommend it do anyone with combo skin or dry skin -- really does leave your skin hydrated without residue. I do think it helps to rinse thoroughly to give you that \"fully cleansed\" feeling vs. oil is left over. Other than that, I'd highly recommend massaging your face as you cleanse -- helps to relax at night.",
        "headline": "Gentle on sensitive skin, but need to rinse thoroughly",
        "rating": 4,
        "ugc_id": 294654033
      },
      "faceoff_negative": {
        "comments": "I first found Hanskin on Soko Glam and tried out their PHA oil because I wanted something gentler first. I love, love that one. The PHA one doesn't match my skin needs entirely but it works wonderfully as a first cleanse. This one, however, doesn't emulsify (no milky afterwash), has a slightly thicker consistency, smells much less appealing than the PHA one, and I don't know if it even works on my oily skin even though it says it does. When I apply it to my skin, the oil seems to disappear a little and my palms/fingers end up dragging on my skin as if I need to apply more product. It's unlike the PHA where I pump 1-2 times and can massage the oil onto my skin for at least a minute; for the PHA it feels like I can gently rub the oil to get it to interact with the surface of my skin. Maybe my skin is absorbing a lot of the BHA? Granted, BHA works differently than PHA so the effects and overall experience while using it may be different. I'll keep using it and update later, but I'm a little worried the bottle I received went bad somehow(??) because it smells so off from the PHA.",
        "headline": "Unlike the Hanskin-PHA Cleansing Oil",
        "rating": 2,
        "ugc_id": 301762397
      },
      "name": "Pore Cleansing Oil - BHA",
      "native_review_count": 76,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 0,
      "locale": "en_US"
    }
  }
}