{
  "product_id": "pimprod2047221",
  "product_url": "https://www.ulta.com/p/super-serum-skin-tint-spf-40-pimprod2047221",
  "extracted_at": "2025-09-23T05:19:57.254944+00:00",
  "product_name": "ILIASuper Serum Skin Tint SPF 40",
  "brand": "ILIA",
  "categories": [
    "Home",
    "Makeup",
    "Face",
    "Foundation"
  ],
  "category_keys": [
    "home",
    "makeup",
    "face",
    "foundation"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "48.00",
  "availability": "in_stock",
  "rating_avg": "4.5",
  "rating_count": "6452",
  "images": [
    "https://media.ulta.com/i/ulta/2629320?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2629320?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629320_sm?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629320_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629320_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629320_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629320cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629320cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629320cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629320cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2629320cm_vid01/thumbs/765e860b-a252-4275-a531-40a9cc3b8ffd?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganGive BackAward-winning ILIA Super Serum Skin Tint SPF 40 is a clean tinted serum that delivers light, dewy coverage, potent skincare, and mineral SPF.",
  "details": "DetailsBenefitsDewy finishLight coverageDermatologist-tested30 seamless shadesMakeup + skincare + SPF in one easy stepFormulated without fragrance, gluten, or siliconeClinically proven to improve the look of dryness, blemishes, redness, wrinkles, and uneven tone over timeKey IngredientsHyaluronic Acid - Draws hydration into skin to visibly plump and replenishNiacinamide - Minimizes the look of pores, smooths skin texture, and refines uneven tonePlant-Based Squalane - Seals in moisture and boosts elasticity without clogging poresNon-Nano Zinc Oxide - Safely shields skin from UV rays, blue light, and pollutionResearch ResultsClinically proven to improve and protect skin*100% said moisture was boosted**94% saw improvement of blemishes, redness, and uneven tone***90% said wrinkles and fine lines were reduced****Based on clinical study of 52 women from 19-60, and instrumental studies**Clinical study of 52 women from 19-60. Results after application.***Clinical study of 52 women from 19-60. Results after 28 days of use.Item 2629320How To UseShake the bottle well. Because Skin Tint is formulated without silicone, some separation is normal. Squeeze the dropper to pick up freshly mixed pigment and dispense half a dropper into palms. Smooth onto clean skin, blending well for even coverage.If your skin is dry, you can apply a moisturizer formulated without silicone first. To help guide your SPF application, your shade will appear lighter before adjusting to its true tone within 60 seconds.IngredientsAqua/Water/Eau, Squalane*, Polyglyceryl-3 Ricinoleate, Shea Butter Ethyl Esters, Isoamyl Laurate*, Butyloctyl Salicylate, Propanediol, Isopropyl Isostearate, Polyglyceryl-3 Diisostearate, Methylpropanediol, Niacinamide, Sodium Chloride, Lecithin, Caprylyl Glycol, Silica, Aloe Barbadensis Leaf Juice Powder, Bisabolol, Hydrolyzed Sodium Hyaluronate, Allantoin, Phenylpropanol, Sodium Myristoyl Glutamate, Sodium Hyaluronate, Tetrasodium Glutamate Diacetate, Aluminum Hydroxide, Polyhydroxystearic Acid. May Contain: CI 77491, CI 77492, CI 77499 (Iron Oxides), CI 77891 (Titanium Dioxide). *Organic Ingredients.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Shake the bottle well. Because Skin Tint is formulated without silicone, some separation is normal. Squeeze the dropper to pick up freshly mixed pigment and dispense half a dropper into palms. Smooth onto clean skin, blending well for even coverage.If your skin is dry, you can apply a moisturizer formulated without silicone first. To help guide your SPF application, your shade will appear lighter before adjusting to its true tone within 60 seconds.",
  "ingredients": [
    "Aqua/Water/Eau",
    "Squalane*",
    "Polyglyceryl-3 Ricinoleate",
    "Shea Butter Ethyl Esters",
    "Isoamyl Laurate*",
    "Butyloctyl Salicylate",
    "Propanediol",
    "Isopropyl Isostearate",
    "Polyglyceryl-3 Diisostearate",
    "Methylpropanediol",
    "Niacinamide",
    "Sodium Chloride",
    "Lecithin",
    "Caprylyl Glycol",
    "Silica",
    "Aloe Barbadensis Leaf Juice Powder",
    "Bisabolol",
    "Hydrolyzed Sodium Hyaluronate",
    "Allantoin",
    "Phenylpropanol",
    "Sodium Myristoyl Glutamate",
    "Sodium Hyaluronate",
    "Tetrasodium Glutamate Diacetate",
    "Aluminum Hydroxide",
    "Polyhydroxystearic Acid. May Contain:"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "makeup",
      "face",
      "cosmetics"
    ],
    "product_type": [
      "serum",
      "sunscreen",
      "foundation"
    ],
    "skin_type": [
      "dry",
      "acne-prone",
      "mature",
      "normal"
    ],
    "finish": [
      "dewy",
      "sheer",
      "light coverage",
      "creamy",
      "powdery"
    ],
    "ingredients": [
      "niacinamide"
    ],
    "brand": [
      "clean-beauty",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "organic",
      "dermatologist-tested",
      "spf",
      "anti-aging"
    ]
  },
  "reviews": {
    "product_id": "pimprod2047221",
    "total_reviews": 6452,
    "reviews": [
      {
        "review_id": 563406207,
        "rating": 5,
        "headline": "Love This Tint",
        "comments": "This is my first time trying an ILIA product.  The Super Serum Skin Tint is easy to apply.  The consistency is light and smooth; not heavy at all.  I am impressed!",
        "nickname": "Chris",
        "location": "El Monte",
        "created_date": 1757955503145,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 563230500,
        "rating": 5,
        "headline": "Great product, lightweight, good coverage",
        "comments": "Very nice product. Not too heavy. Very good coverage. Good sun protection.",
        "nickname": "Cynthia",
        "location": "PA",
        "created_date": 1757627102197,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 563229707,
        "rating": 4,
        "headline": "Love this so far",
        "comments": "A friend recommended this to me because it has cleaner ingredients and I don't wear much makeup. Safe to say I love it so far. It goes on easily ( I found applying it with fingers works best) and stays all day. It doesn't feel heavy and has a pleasant enough scent. I have sensitive skin and have had no issues since I've started using the product.",
        "nickname": "Sam",
        "location": "Montana",
        "created_date": 1757625531009,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 561480328,
        "rating": 5,
        "headline": "Really like this",
        "comments": "I really like this it's enough coverage for me that I don't need a foundation a little goes a long way it is buildable and goes on nicely I would recommend this to others and it is something I would purchase in the future it's heavier than me elta md",
        "nickname": "Liz",
        "location": "Roseburg oregon",
        "created_date": 1756740009258,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 561029387,
        "rating": 4,
        "headline": "Love this!!",
        "comments": "I have wanted to purchase this but was so scared because of the price point. But especially over the summer it's very hard to get foundation to stay put and stay in place. I live in a hot climate over 100° in the summer.  I finally decided to give it a try and I was not disappointed! \n\nHowever I don't understand the reviews claiming that it doesn't stay. I had no problem wearing this under my blush and setting powder and everything stayed in place all day. And it left my skin feeling soft. It's a good amount of product for the container, and a little bit goes such a long way.",
        "nickname": "Pris",
        "location": "Las Vegas",
        "created_date": 1756009530693,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560874854,
        "rating": 2,
        "headline": "One time buy",
        "comments": "It is not as light weight as I hoped. Definitely felt like I was wearing full coverage foundation",
        "nickname": "Brystal",
        "location": "Odessa tx",
        "created_date": 1755892156312,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560502746,
        "rating": 2,
        "headline": "Not sure why the hype",
        "comments": "Maybe im doing somethjnf wrong but this just sits on my skin and if i touch my face or hug someone it transfers to things - just looked at my coffee mug and it had tan fingerprints on it. Has an odd smell but it is not terrible. Coversge is mediocre. Just on the fence with this one.",
        "nickname": "Jc2222",
        "location": "Maryland",
        "created_date": 1755696226052,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 1
      },
      {
        "review_id": 560465413,
        "rating": 5,
        "headline": "love",
        "comments": "I tried a sample and I had to go buy the full size. I have textured fair freckle mature skin and I love how this made me glowy and such a good coverage without it setting into fine lines and caking up. I used the thayers milky toner then the maybelline grippy primer underneath and it wore great. This skin tint is my new go to!!",
        "nickname": "ellie B",
        "location": "nc",
        "created_date": 1755629061527,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560446170,
        "rating": 3,
        "headline": "perfect color match, but terrible staying power",
        "comments": "the color of this skin tint is spot on for me. however, nothing I try keeps the product on! it literally looks perfect for the first 15 minutes, but it never settles on my skin. I can touch my skin and it'll remove all the product. so frustrating! don't recommend for anyone who doesn't have dry to super dry skin.",
        "nickname": "megstenzow",
        "location": "Stafford, VA",
        "created_date": 1755611034778,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560333411,
        "rating": 5,
        "headline": "Just Right!",
        "comments": "I love this serum.  It blocks sun, gives  smooth finish for everyday skin.  And mostly it helps my skin to look great!",
        "nickname": "Debbie",
        "location": "Fayetteville, AR",
        "created_date": 1755367181019,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560173437,
        "rating": 2,
        "headline": "wanted to love it",
        "comments": "my skin is combination but more on the oilier side around my nose and chin. this product seperated very badly on my skin and i tried different primers and setting powders to get it to work… but it just didnt. i also noticed acne appearing ok my face in the middle of the day on two different occasions while wearing this product. i love how well the color matched my skin but the formula is just not compatible with me.",
        "nickname": "aliyah",
        "location": "charlotte, nc",
        "created_date": 1755192010846,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560119435,
        "rating": 1,
        "headline": "Nope",
        "comments": "Right off the bat this product had a wet dog+play dough smell. Just foul. I thought maybe I was given something expired, but after reading others' reviews this is just what it's supposed to smell like. Secondly, this made my face look like it was covered in oil, and I like dewy finishes, but this is not it. I was so sad that the skin tint didn't work out because I love Ilia's concealer.",
        "nickname": "Sai",
        "location": "Pittsburgh, PA",
        "created_date": 1755111109000,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559891412,
        "rating": 3,
        "headline": "The smell is strong",
        "comments": "This is the best match I have ever had. The problem is the smell is so strong! It's like having play-dough stuffed up your nose.",
        "nickname": "N/A",
        "location": "Wisconsin",
        "created_date": 1754835786885,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559412311,
        "rating": 2,
        "headline": "Not for acne-prone skin",
        "comments": "I ordered this through ILIA, and the first few times I used it, I loved it. then came the breakouts. It's got shea butter as one of its main ingredients, and as most acne-prone people will know, that's going to clog our sensitive little pores. I couldn't stop breaking out. I was able to get past the god awful smell, but this destroyed my skin. if you have acne-prone, oily skin, do NOT use this.",
        "nickname": "The Original New Girl",
        "location": "New York, New York",
        "created_date": 1754498833107,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559405891,
        "rating": 1,
        "headline": "Great product, leaky bottle.",
        "comments": "This tinted skin serum is exactly what I want. Perfect. Light coverage. However, the bottle leaks no matter how tightly it is closed. I travel (so it's impossible to keep the bottle upright at all times) and lost about half the bottle to leakage. Very disappointing.  Same thing happened to my daughter. I was warned but wanted to try the product.",
        "nickname": "Terry",
        "location": "Portland, ME",
        "created_date": 1754485780878,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559384558,
        "rating": 1,
        "headline": "Not For Me",
        "comments": "There's a funny review buried in here calling this product an \"oil spill on their face\", and I have to agree. \n\nI tried using as little as possible, different setting sprays/powders, but I could not get this to be manageable. Even wearing mascara only on my top lashes, within an hour I would have black smudged all around my eyes. \n\nFor the price, pungent smell, and oiliness - would not recommend it.",
        "nickname": "Kay",
        "location": "WA",
        "created_date": 1754460670363,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559380901,
        "rating": 5,
        "headline": "love the consistency",
        "comments": "My daughter turned me on to this b/c her skin looked tan, Dewey and natural!\nIm 64 and was unsure until I went to the Ulta near me. I got the wrong color\nand the lady helped me find the right one. 13.5 I believe is what I picked.\nIts the best feeling tint with a color that Ive ever tried and Ive tried a lot.\nNO smell, easy to apply and stays throughout the day. Looks so natural\nand at my age that's important. Only tried it for a couple of days so far it's\nworth the buy!",
        "nickname": "carol",
        "location": "Annapolis, Maryland",
        "created_date": 1754444228847,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559317705,
        "rating": 2,
        "headline": "Bad texture and thick on skin",
        "comments": "I was expecting a serum like texture that spreads easily, and it was thick and chalky",
        "nickname": "Jordan",
        "location": "North Carolina",
        "created_date": 1754407611954,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559245993,
        "rating": 2,
        "headline": "What a complete time consuming struggle this skin tint is...",
        "comments": "While working on the island of Kauai my BFF recommended this product to me. Of course, I bought two colors which both turned out to be wrong. At that point I will say ILIA was so kind and exchanged both which is when I found the two shades that work best for this surfer + beach bum.\n\nAt that point the drama and love hate relationship began. It takes a lot of time to apply this right. I know peeps say that this is LIGHT coverage but for me it was always super HEAVY. The Skin Tint never genuinely dries or soaks into your skin. This leaves a greasy layer just sitting in there. \n\nNow, I was hoping this would be the one as it is presented like a skin treatment not just a tint. Sadly this product just gave me clogged pores and left residue in my facial lines. The oily texture really brings forward every single imperfection on your face! Dang. I look better after freshly washing up then with this stuff on.\n\nLastly - and this is a BIG one. Why, oh why, does no one talk about how ILIA Skin Tint destroys clothing???!!!! Literally if a drop gets on anything you have to throw it away! Not a joke. I have never in my 3 years of attempting to wear this product been able to salvage a single piece of clothing that got this ILIA tint on it. I finally found out that Oil Soap takes out about 70% but still the clothes are trash. OIL REMOVER SOAP - let that sink in. And if it won't come out of clothes think about how it is jamming up your skin!!!\n\nThis product has taken up too much of my time and money. Honestly I would rather have my clothing that it ruined back then ever wearing it again.",
        "nickname": "Rachel",
        "location": "South OC, Cali",
        "created_date": 1754328058142,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559004762,
        "rating": 4,
        "headline": "great for me",
        "comments": "I took a chance ordering this online since I couldn't try the shades in the store, but I used Ulta's find-my-shade option in the app and bought the one that was recommended. I was shocked how perfect the shade was for my skin! I have cool undertones and my skin is rosy pink; I've been searching for years for a tint that wasn't too tan, yellow, orange, or grey, and I FINALLY found something that matches my cool pink skin! \"Kai ST6.5\" is the shade I ended up with. \n\nI don't like full foundation coverage and this provides nice light/medium coverage that's really perfect for me; I don't want something to cover my skin I just want something to compliment it and even everything out. This is nice for my dry skin and doesn't flake. It takes about 20-30 minutes to dry down though, so give it some time to settle in your skin. \n\nI don't have any problems with the smell but as others have pointed out, the dropper style of the bottle is annoying (hence the 4 stars instead of 5). Having said that, it's not a big deal to me because I don't carry it around in a makeup bag and give it a chance to leak, it just sits upright on a shelf in my bathroom. When I'm traveling I don't want to take the whole big bottle anyway so I just transfer a small amount into a different tiny container and I'm good to go. \n\nIt's expensive, but to me it's worth it, I will definitely buy again.",
        "nickname": "Tesee",
        "location": "San Diego",
        "created_date": 1754017723659,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 253,
      "pages_total": 13,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2047221/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        244,
        235,
        461,
        911,
        4601
      ],
      "review_histogram": [
        244,
        235,
        461,
        911,
        4601
      ],
      "rating_count": 6452,
      "review_count": 6452,
      "average_rating": 4.46,
      "recommended_ratio": 0.69,
      "media": [
        {
          "id": "549857029",
          "review_id": 549857055,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/tdop3oixsnzwex5m1zkg.jpg",
          "headline": "Ditched my bareMinerals powder foundation",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Direct sunlight w/ blush",
          "nickname": "Rilee",
          "created_date": 1743006018942
        },
        {
          "id": "542497873",
          "review_id": 542497811,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ojlr8zrp9njbrbkab8z9.jpg",
          "headline": "I love it",
          "rating": 5,
          "helpful_votes": 1,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Jocelyn",
          "created_date": 1736371609767
        }
      ],
      "faceoff_positive": {
        "comments": "My Skin Type: I've got some skin problems. Don't we all? Mine revolve around battling inherently dry skin in a very dry environment. Add very sensitive type 2 rosacea, and you've got the perfect storm of redness, dryness, and sensitivity.  My Preferences: I've been in a years long relationship with Maybelline Radiant Dream Liquid. I like a medium, buildable coverage, dewy finish/natural look, and hydrating properties. Now that I'm healing my skin, I had to take a hard look at what drug store foundations were doing to my skin. I was looking for something sustainable that would HELP/add value to my skin instead of relying on drug store products that required additional skin care to prevent/mitigate breakouts. #toxic relationship   Pros:  - Finish. So dewy and glowy. Perfect shade match which was a huge bonus. Exactly what I was looking for in terms of finish and look.  - Coverage. Eliminates the redness of my rosacea. Just zoinks the redness right out of my skin. Incredible shade matching for me. Gives a very natural and hydrated looks which is what I wanted.  - Sustainability. Really happy with their sustainability commitments and packaging.  - Skin Effects. My skin loves how hydrating this is. It doesn't negatively impact my skin at all and in fact, really helps with hydration. This is huge for me as my skin is sensitive and I've been working hard to improve my skin so that one day I don't need foundation or tint to cover redness.   Cons:  - I would love to see better build-age in future formulas!! Though, I would say this product is more buildable than their actual foundation.  - It does transfer a tad so you need a good setting spray, but what foundation/serum/tint doesn't? This might be less of a con and more of an observation as it's way better than other formulas I've tried.   - The dropper/lid presented two issues for me. First, the dropper doesn't go all the way to the bottom, so once I got to the end, there was a week's worth of product in there but the dropper wasn't picking it up. I was able to get a week's worth of daily use out of the last bit by shaking the bottle upside down to get the last bits out. Second, the lid leaks. Traveling with the product resulted in massive product spillage and waste (even with the lid tightly screwed on). Massive bummer.   What would make this 5 stars for me? Improved packaging to prevent leakage and improve product use + more ability to build to stronger coverage.   I tried to go back to Maybelline and it just wasn't the same. Sorry, babe. Looks likes Ilia and I are going steady now.    This review is not paid in anyway. I just wanted to provide honest thoughts for folks like me!",
        "headline": "Breaking Up with Maybelline",
        "rating": 4,
        "ugc_id": 527310145
      },
      "faceoff_negative": {
        "comments": "I've been using this product consistently since last summer because I liked that it was skincare, makeup and sunscreen in one and made my skin look good. During this time I started to struggle with acne breakouts along my chin and nose. I attributed these to hormones and stress and did my best to keep them at bay. I used this product every morning after washing my face in order to hide the spots and mask the redness. I even used it on my wedding day as a sunscreen base and to help conceal the giant pimples on my chin.   Fast forward several months and I found myself consistently complaining to my husband about how my acne and breakouts won't go away even though I was doing everything right and using non skin clogging products. As a suggestion, he said I should start to go make up free (aka not use Ilia skin tint) to help my skin. So I tried and it and within a week my usually zitty chin cleared up. Because I didn't believe it, I tried using the skin tint again and within two days I had three new pimples.   Here's my theory: from research and reviews I can generally see that the product works for most. The product is branded as non-com. (Aka safe for acne prone skin) but for us super acne prone people there ARE ingredients that can be super skin clogging such as Isopropyl I sostearate and Polyglyceryl-3 Diisosterate. An emollient and emulsifier. The product is also very sticky and hard to wash off with just normal facial cleanser. So my hunch is that because I was wearing it a lot (I thought it was helping!) and was not double cleansing with oil or makeup remover to get it off, it was causing havoc to my pores.   It's a cool product and seems to work for most but since I've stopped using it in my routine my skin looks soooo much better. I really loved this product and trusted the cleanness of the brand but personally won't use it again. Others on Reddit have confirmed my experiences with it.",
        "headline": "Thought I loved this but it was the cause of my breakouts!",
        "rating": 3,
        "ugc_id": 527286213
      },
      "native_review_count": 253,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 6199,
      "locale": "en_US"
    }
  }
}