{
  "product_id": "pimprod2047205",
  "product_url": "https://www.ulta.com/p/cleanse-soft-foaming-cleanser-makeup-remover-pimprod2047205",
  "extracted_at": "2025-09-23T03:36:10.255737+00:00",
  "product_name": "ILIAThe Cleanse Soft Foaming Cleanser + Makeup Remover",
  "brand": "ILIA",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Makeup Remover"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "makeup"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "32.00",
  "availability": "in_stock",
  "rating_avg": "4.3",
  "rating_count": "622",
  "images": [
    "https://media.ulta.com/i/ulta/2629448?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2629448?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629448_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629448_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629448_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629448_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629448_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629448_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629448_alt07?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2629448_vid01/thumbs/576c4887-660e-4b75-be6e-420479c400af?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganGive BackILIA The Cleanse Soft Foaming Cleanser is gentle enough for all skin types and removes makeup, mineral SPF, and pollution without stripping.",
  "details": "DetailsBenefitsSafe for sensitive eyes and skinHydratingpH balancedFormulated without fragranceRecyclable bottle and cap packagingKey IngredientsHydrating Sugar Complex - Natural sugars draw moisture into skin to replenish hydration, even after rinsingPlant-Based Surfactants - Gentle sulfate alternatives create a soft lather that dissolves buildup without dryingResearch ResultsClinically proven to hydrate skin and maintain pH*Clinically proven to remove makeup, mineral SPF, and pollution*96% said skin felt soothed, supple, and soft**96% said the appearance of pores was reduced***In an instrumental study.**In a 21-day clinical study of 50 women and men ages 18-60.Item 2629448How To UseIn the morning and at night, massage 2-3 pumps of foam into damp or dry skin. Rinse thoroughly with warm water. Repeat if needed to remove long-wear makeup.IngredientsAqua/Water/Eau, Glycerin, Decyl Glucoside, Sodium Methyl Cocoyl Taurate, Polyglyceryl-10 Laurate, Sodium Lauroyl Lactylate, Hydroxyacetophenone, Saccharide Isomerate, 1,2-Hexanediol, Caprylyl Glycol, Sodium Phytate, Citric Acid, Sodium Citrate.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "In the morning and at night, massage 2-3 pumps of foam into damp or dry skin. Rinse thoroughly with warm water. Repeat if needed to remove long-wear makeup.",
  "ingredients": [
    "Aqua/Water/Eau",
    "Glycerin",
    "Decyl Glucoside",
    "Sodium Methyl Cocoyl Taurate",
    "Polyglyceryl-10 Laurate",
    "Sodium Lauroyl Lactylate",
    "Hydroxyacetophenone",
    "Saccharide Isomerate",
    "2-Hexanediol",
    "Caprylyl Glycol",
    "Sodium Phytate",
    "Citric Acid",
    "Sodium Citrate"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "makeup",
      "cosmetics"
    ],
    "product_type": [
      "cleanser"
    ],
    "skin_type": [
      "dry",
      "sensitive",
      "normal",
      "all skin types"
    ],
    "finish": [
      "sheer",
      "long-wear",
      "foam"
    ],
    "brand": [
      "clean-beauty",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "natural",
      "spf",
      "hydrating",
      "soothing"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2047205",
    "total_reviews": 622,
    "reviews": [
      {
        "review_id": 541997928,
        "rating": 2,
        "headline": "Doesnt remove makeup",
        "comments": "I've used this a few times, it dries out my skin and doesnt thoroughly remove the makeup.",
        "nickname": "Jay",
        "location": "Kansas city",
        "created_date": 1735568861697,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 1
      }
    ],
    "paging": {
      "total_results": 1,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        6,
        18,
        84,
        179,
        335
      ],
      "review_histogram": [
        6,
        18,
        84,
        179,
        335
      ],
      "rating_count": 622,
      "review_count": 622,
      "average_rating": 4.32,
      "recommended_ratio": 0.0,
      "media": [],
      "faceoff_positive": {
        "comments": "The Cleanse is a great way to end the day with soft skin and a glowing, clean shine! It smells delicious and soft, which is exactly how the foam feels when I apply it to my wet face.  I know it states that it's fragrance-free, so it must just be the smell of good-quality ingredients, which I show in my picture below.  There are only a few ingredients!  This is pretty effective except on my mascara, which is waterproof.  But if I simply use one more pump and do another soft massage of my eyelashes, it comes right off.  I like to wash my face twice anyway to give myself the extra assurance that I have cleaned all the daily grime off.  With this cleanser, you can use it several times without worrying that it will strip away or dry out your skin.    Ilia's The Cleanse seems like the bottle is too small to provide more than eight washes, but two or three pumps are all you need to super-clean your face in the most gentle way possible.  This is a foaming product, and there are tons of uses in this bottle. This was obvious after using it for the first time last week.  Since then, I've used The Cleanse several times and it seems like none is missing from the bottle.  Thank you to PINCHme for the opportunity to try this product!",
        "headline": "So Gentle Yet So Effective!",
        "rating": 5,
        "ugc_id": 527296857
      },
      "faceoff_negative": {
        "comments": "I recently had the opposite to try Ilia's The Cleanse Soft Foaming Cleanser + Makeup Remover in exchange for my honest opinion. My review is based on my experience using the product to remove makeup and to clean my skin.  First of all, I love the light fluffy whipped texture of this cleanser. It was super easy to spread across my skin and rinsed quickly without leaving any residue. When used on bare skin, my skin felt soft and clean afterwards. It wasn't super drying but I do prefer a milky cleanser since my skin tends to be dry. In terms of removing makeup, this product didn't deliver. I'm including an arm swatch of UD's 24/7 Glide-On Eye Liner. This is one of the more stubborn to remove products I own but I also feel like my daily tinted sunscreen is not easy to remove, but it's not as visible after washing (more just that I can still feel it). This did not perform like a makeup remover and it took more scrubbing than I'd use on my facial skin to get the eyeliner to fade. It took several washes to fully remove it. I'm low maintenance when it comes to washing my face. I like using one product and washing one time. If you don't tend to wear makeup or like double-cleansing, this might be a great fit for you. I'd have rated it higher if it wasn't marketed as a makeup remover.",
        "headline": "Gentle but Didn't Remove Makeup",
        "rating": 2,
        "ugc_id": 527293297
      },
      "name": "The Cleanse Soft Foaming Cleanser + Makeup Remover",
      "native_review_count": 1,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 621,
      "locale": "en_US"
    }
  }
}