{
  "product_id": "pimprod2047199",
  "product_url": "https://www.ulta.com/p/multi-stick-pimprod2047199",
  "extracted_at": "2025-09-23T04:39:38.095432+00:00",
  "product_name": "ILIAMulti-Stick",
  "brand": "ILIA",
  "categories": [
    "Home",
    "Makeup",
    "Face",
    "Blush"
  ],
  "category_keys": [
    "home",
    "makeup",
    "face",
    "blush"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "36.00",
  "availability": "in_stock",
  "rating_avg": "4.6",
  "rating_count": "2348",
  "images": [
    "https://media.ulta.com/i/ulta/2629734?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2629734?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629734_sm?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629734_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629734cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629734cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2629734cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2629734cm_vid01/thumbs/b0c17cca-e09d-4f68-bd19-2471b8165d6d?w=600&h=337&fmt=auto",
    "https://media.ulta.com/v/ulta/2629734cm_vid02/thumbs/3dc72efc-e4d6-4e47-953d-434c5031033f?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeGive BackILIA Multi-Stick is a buildable wash of color for cheeks and lips in 10 easy to apply, swipe-and-go shades.",
  "details": "DetailsBenefitsBuildableBlendableVersatile formula for cheeks + lipsTwist-up stick for easy applicationFormulated without fragrance or siliconeCertified gluten-freeKey IngredientsShea Butter - Nourishes skin and creates a creamy texturethat melts on contactAvocado Oil - Antioxidant-rich oil that helps soften and replenish skinOrange Peel Wax - Helps protect and condition skin with a breathable feelItem 2629734How To UseBefore using Multi-Stick for the first time, you may need to warm the surface with your finger to ensure a smooth glide. Apply to cheeks and lips straight from the tube, or pick up color with the ILIA Perfecting Buff Brush and gently press it into the cheek. Use your fingers or a brush to blend in, and repeat for more color payoff.IngredientsTenderly: Helianthus Annuus (Sunflower) Seed Oil, Ricinus Communis (Castor) Seed Oil, Theobroma Cacao(Cocoa) SeedButter, Cera Alba/Beeswax/Cire d'abeille,Candelilla Cera/Euphorbia Cerifera (Candelilla) Wax/Cire deCandelilla, Mica, Sesamum Indicum (Sesame) Seed Oil, Butyrospermum Parkii (Shea Butter), Citrus AurantiumDulcis (Orange) Peel Cera/Wax, ZeaMays (Corn) Starch, Persea Gratissima (Avocado) Oil, Tocopherol. May Contain: CI 77891 (Titanium Dioxide), CI 77491, CI 77492, CI 77499 (Iron Oxides), CI 15850 (Red 7), CI 45410 (Red 28), CI 19140 (Yellow 5).Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Before using Multi-Stick for the first time, you may need to warm the surface with your finger to ensure a smooth glide. Apply to cheeks and lips straight from the tube, or pick up color with the ILIA Perfecting Buff Brush and gently press it into the cheek. Use your fingers or a brush to blend in, and repeat for more color payoff.",
  "ingredients": [
    "Tenderly: Helianthus Annuus (Sunflower) Seed Oil",
    "Ricinus Communis (Castor) Seed Oil",
    "Theobroma Cacao(Cocoa) SeedButter",
    "Cera Alba/Beeswax/Cire d'abeille",
    "Candelilla Cera/Euphorbia Cerifera (Candelilla) Wax/Cire deCandelilla",
    "Mica",
    "Sesamum Indicum (Sesame) Seed Oil",
    "Butyrospermum Parkii (Shea Butter)",
    "Citrus AurantiumDulcis (Orange) Peel Cera/Wax",
    "ZeaMays (Corn) Starch",
    "Persea Gratissima (Avocado) Oil",
    "Tocopherol. May Contain:"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "makeup",
      "face",
      "cosmetics"
    ],
    "product_type": [
      "blush"
    ],
    "finish": [
      "sheer",
      "medium coverage",
      "creamy",
      "cream",
      "oil"
    ],
    "color": [
      "pink"
    ],
    "brand": [
      "clean-beauty",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free"
    ],
    "skin_type": [],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2047199",
    "total_reviews": 2348,
    "reviews": [
      {
        "review_id": 560133462,
        "rating": 5,
        "headline": "Great blush",
        "comments": "🥰💕💕💕💕",
        "nickname": "",
        "location": "Dallas",
        "created_date": 1755125206689,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558432137,
        "rating": 2,
        "headline": "Perfect shade! Poor formula",
        "comments": "I bought the shade Tenderly. While the shade is absolutely for my fair, cool-toned skintone, it doesn't show up. I have to put a ton of product on the back of my hand and use a brush to even start to see color build up. Which means i would go through it quickly. Too expensive for that. Returning.",
        "nickname": "Jlee",
        "location": "NY",
        "created_date": 1753734133573,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556004747,
        "rating": 5,
        "headline": "Love ATLAST",
        "comments": "Love this color and will continue to purchase but it's so big and heavy.  Adds needless weight to my purse",
        "nickname": "Jemma13",
        "location": "Plainview, NY",
        "created_date": 1751145472012,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555809016,
        "rating": 4,
        "headline": "Best consistency in a multi stick",
        "comments": "I have tried many multi sticks: Boom, Westman Atelier, Nars, Jane Iredale, and Chanel. ILIA is the best consistency; not too dry for lips, but not sticky on the cheek/face area.  Tenderly is a soft pink shade and very  natural. 4 stars instead of 5 as the prices on the luxury brands are getting so high.",
        "nickname": "Angela",
        "location": "Florida",
        "created_date": 1750764399190,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555619265,
        "rating": 5,
        "headline": "Multi-use Miracle Worker",
        "comments": "This stick feels so luxurious and soft on my skin. The pigment is great and long lasting. I honestly didn't like the price tag but I took a gamble and this is now my go to!",
        "nickname": "GenXbeauty",
        "location": "Philadelphia,  PA",
        "created_date": 1750449957863,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555008081,
        "rating": 5,
        "headline": "Love this",
        "comments": "Not sticky like other multi users that have tried",
        "nickname": "Yael",
        "location": "Nyc",
        "created_date": 1749763768361,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553290042,
        "rating": 5,
        "headline": "Love it!!",
        "comments": "I absolutely love the lip and blush combination multi stick. The color is fantastic. When I wear it, I receive so many compliments. It gives me a nice glow to the skin without it being obnoxious.\n\nFor skin tone reference, I'm in NC 17 MAC serum to foundation and Melrose in Tower 28.",
        "nickname": "Lo",
        "location": "Atlanta",
        "created_date": 1747194022304,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552865964,
        "rating": 5,
        "headline": "Tenderly is the perfect light cool pink color",
        "comments": "I have had such a hard time finding the perfect pink for my fair/light coloring. This one is perfect and light!",
        "nickname": "Britton",
        "location": "Austin, TX",
        "created_date": 1746459782283,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552705000,
        "rating": 3,
        "headline": "too light",
        "comments": "the color tenderly barely shows up on my skin tone, feels creamy the whole time not drying down. I have light to medium skin tone too.",
        "nickname": "Jenna",
        "location": "South Carolina",
        "created_date": 1746122913438,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551365932,
        "rating": 3,
        "headline": "eh",
        "comments": "idk how to feel. the color is beautiful and does well on bare skin leaving a dewy natural finish. it also never caused a reaction for me which is great since i have eczema proned skin and tend to have issues with facial products. however, it picks up makeup underneath it, whether it's foundation or a skin tint, which creates patchiness. i've tried multiple ways to apply it and it still turns out patchy. this blush also tends to fade completely, no matter how much i put on, after about 4 hours. i think this would be great if you want a natural flush to your skin on a \"no makeup makeup look\" day but not good if you like your blush to pop and last long.",
        "nickname": "P",
        "location": "Wisconsin",
        "created_date": 1744306512004,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 2
      },
      {
        "review_id": 549955659,
        "rating": 5,
        "headline": "My everyday blush",
        "comments": "I love this stuff! it's not super pigmented, but it is buildable and gives a lovely, natural finish. I rub the product on the back of my hand and use a brush to apply it. I find it to be the best way to apply it!",
        "nickname": "Char",
        "location": "San Antonio, TX",
        "created_date": 1743105206177,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 548632746,
        "rating": 5,
        "headline": "I would buy this product over and over again",
        "comments": "It goes on smoothly and stays put.  It looks very natural.  I love the dewy look for my cheeks.  I use it both on my cheeks and on my lips.  Great for travel especially given it's multi-use.",
        "nickname": "Alicia",
        "location": "Whittier, CA",
        "created_date": 1741799099816,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547837627,
        "rating": 1,
        "headline": "eh",
        "comments": "tried to use this with a dewy for about two weeks. applying straight onto the cheeks picked up my tinted moisturizer. i had to rub it onto the back of my hand and pick up color with my fingers to apply. even then the color payoff was underwhelming. i noticed through the day there was absolutely no color.",
        "nickname": "Nicole",
        "location": "Chicago",
        "created_date": 1741223587971,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 547163985,
        "rating": 3,
        "headline": "Not Sure How I Feel About This Product Yet",
        "comments": "I've been using this product every day for approximately  a month now and have purchased two colors: \"In the City\" and \"Dreamer.\" I'm still undecided on how I feel about it. One thing I am a bit disappointed in is that the colors aren't as vibrant as I expected. I read a review where someone mentioned that it smudges on foundation, and unfortunately, that's true. I've found that I almost have to set my face with powder first before applying it. When I apply it over powder, it looks nice, though. \n\n\"In the City\" is quite shimmery, and I blend it in with two fingers, which works fine. Its really pretty. However, \"Dreamer\" was harder to blend with my fingers—it almost disappeared after I tried to blend it out, which was frustrating. On the plus side, the product is very creamy, and I do think it would look great and more natural on clean, makeup-free skin. Overall, I'm still trying to figure out how best to use it, but it has potential for a more subtle, fresh look.",
        "nickname": "Feeeeeee",
        "location": "Mt Pocono, PA.",
        "created_date": 1740341457802,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543827709,
        "rating": 3,
        "headline": "Smudges Foundation if applied straight on",
        "comments": "Only gave it a 3 bc I like the colors and shades available. I had like 5 or 6 different shades. I does smudge foundation if trying to apply it stick-to-face. But if you use a brush to collect product off the stick , it does apply better. \n\nHowever, it gets my brushes oily and forces me to clean them more often. And it takes alot of effort to really get the product on the brush. (Pinching bristles together so that they fit the circumference of the brush stick and swirling around for like 20 spins). I just feel like a regular powder blush is still my favorite way to go- even though I know liquid blushes are really \"in\". \n\nI just feel like if its going to be a liquid blush, it needs to be more liquidy to glide across the face. This doesn't do that.",
        "nickname": "Bekah",
        "location": "Columbus, Ohio",
        "created_date": 1737561076603,
        "bottom_line": "No",
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 542658069,
        "rating": 5,
        "headline": "Excellent product",
        "comments": "I just received my second ILIA multi-stick in the color Whisper.  I use it under my powder blush and together the color stays and looks great.I have used it alone on my cheeks and lips, looks nice but on my mature skin it is not enough color.",
        "nickname": "Jan",
        "location": "Northern NJ",
        "created_date": 1736620401702,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542609675,
        "rating": 5,
        "headline": "Obsessed!",
        "comments": "I like to wear a natural look as I am from Hawaii and always in the ocean. Love this product! I can't say enough, I wear it on my eyes, lips  and cheeks! Just a perfect amount of color! I purchased 'At Last', it is so incredibly beautiful on my olive tanned skin! A must have in every womans make-up bag!",
        "nickname": "Kilikina",
        "location": "Hawaii",
        "created_date": 1736507482502,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541830343,
        "rating": 4,
        "headline": "It's pretty good!",
        "comments": "I like this blush! I like how its small so I can keep it in my bag and reapply when needed. The color options are so good too!",
        "nickname": "Georgia W.",
        "location": "TX",
        "created_date": 1735257286342,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541798459,
        "rating": 1,
        "headline": "Moldy within 3 months (bought 2 and both went bad)",
        "comments": "I've bought this multi-stick for years- multiple shades and probably 7-8 yearly. Most recent purchase was Sept 2024. By december 2024 - horrible smell from one I was using. Had another \"backup\" one that I kept in dance bag- pulled it out and could see what appears to be mold on it (also has horrible smell). Will not purchase Ilia again and back to drawing board for a brand that works.",
        "nickname": "April",
        "location": "Pittsburgh PA",
        "created_date": 1735217409182,
        "bottom_line": "No",
        "helpful_votes": 5,
        "not_helpful_votes": 6
      },
      {
        "review_id": 539123624,
        "rating": 4,
        "headline": "Yes",
        "comments": "I really like the smoth feeling on my skin. Not heavy at all.",
        "nickname": "Kymberly",
        "location": "Blue Springs Mo",
        "created_date": 1733520688606,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 32,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2047199/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        46,
        54,
        131,
        379,
        1738
      ],
      "review_histogram": [
        46,
        54,
        131,
        379,
        1738
      ],
      "rating_count": 2348,
      "review_count": 2348,
      "average_rating": 4.58,
      "recommended_ratio": 0.81,
      "media": [],
      "faceoff_positive": {
        "comments": "So, most of us are in a rush these days- and if you're not, you just don't want to have to use a bunch of products to create a beautiful/fresh looking face. Having a multi-stick in your make up routine is a game changer, it creates a cohesive look in a matter of seconds. I received a free sample of Ilia's multi-stick in the shade Dear Ruby, from pinchme in exchange for my honest review.  I want to be clear, I would purchase any of Ilia's products (whether I was incentivized or not), they are an awesome clean brand. I absolutely adore the color of this multi-stick,  It's a poppy red and it just makes me look and feel more alive. I have very pale skin, and naturally dark circles under my eyes. When I don't wear make up, my dark circles are the first thing that you notice. If you look at my before and after pictures, you'll see that my face looks more alive after using Ilia's multi-stick on my cheeks and lips (and it detracts from my dark circles). It's pretty amazing that using a multi stick and taking 30 seconds to apply it and blend would make that big of a difference, but it really does! Why I love this Ilia multi-stick: all of the ingredients are natural so it's like skin care and make up in one (think skin benefits),  It has a nice texture that blends beautifully on skin, It feels light on my skin and never sticky, and it wears well throughout the day. Not to mention it's a space saver, having one multi stick for multiple purposes. It has no scent which I love, because It is unnecessary for beauty products to be scented. It is super easy to use and quick as quick can be (when you are running late and look like death, just take 30 seconds to apply the multi-stick and it's like a new you). Clean ingredients, amazing color pay off (buildable coverage which is great), a smooth texture, and a healthy looking face. Need I say more?!",
        "headline": "A gorgeous time saver!",
        "rating": 5,
        "ugc_id": 527305659
      },
      "faceoff_negative": {
        "comments": "I ABSOLUTELY LOVE the Multistick shade SUMMERTIME. As an African-American woman with reddish undertones to my skin, the Summertime Multistick gave me a beautiful wash of color and fantastic highlights for my brows, cheeks, Cupid's Bow and a ABSOLUTELY  BEAUTIFUL lip color shade! I knew I should've purchased a few more tubes of Summertime before it sold out. Unfortunately, I didn't and it has been discontinued. I reached out to Ilia via email to inquire which shade would be a close match to Summertime and I was informed \"In The City\" was a very close match. So I ordered it. Not even close. Maybe the associate assumed I was Caucasian or had a light skin tone and maybe \"In The City\" would work as a great highlighter on those types of skin tones, however it is completely invisible on my shin tone.  \"In The City\" completely disappears on my skin. No wash of color, no shimmer, no highlight...Nothing. Looks like I have nothing on my face at all. I purchased a few months ago, tried it a few times and I put it back in the box. A complete waste of money. I wish I could return it for another Multistick but NOTHING will bring me the joy that the utterly beautiful shade of SUMMERTIME did. I hope Ilia reconsiders bringing SUMMERTIME back again because \"In The City\" ain't it for me.",
        "headline": "Not even close to the Multisick shade \"SUMMERTIME\"...",
        "rating": 1,
        "ugc_id": 527298209
      },
      "name": "Multi-Stick",
      "native_review_count": 32,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 2316,
      "locale": "en_US"
    }
  }
}