{
  "product_id": "pimprod2024973",
  "product_url": "https://www.ulta.com/p/retinol-reface-eye-cream-with-retinol-ester-ribose-pimprod2024973",
  "extracted_at": "2025-09-23T05:03:01.054758+00:00",
  "product_name": "Indeed LabsRetinol Reface Eye Cream with Retinol Ester and Ribose",
  "brand": "Indeed Labs",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Cream"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "eye-cream"
  ],
  "currency": "USD",
  "list_price": "13.99",
  "sale_price": "10.49",
  "availability": "in_stock",
  "rating_avg": "4.6",
  "rating_count": "126",
  "images": [
    "https://media.ulta.com/i/ulta/2583886?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2583886?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2583886_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2583886_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2583886_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2583886_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2583886_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2583886_vid01/thumbs/cda0b7d9-1a66-4d27-881b-c48c1a331fee?w=600&h=750&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsIndeed Labs Retinol Reface Eye Cream delicately treats the eye area to improve skin texture by instantly reducing the appearance of crow's feet and wrinkles. When used daily, it restores skin texture and hydration, and diminishes the look of wrinkle depth for smoother skin.",
  "details": "DetailsBenefitsHarnessing powerful ingredients that tackle visible signs of aging, Retinol Reface Eye Cream is an absolute must-have in your skincare arsenaGentle enough for even the most sensitive skin types, with powerful ingredients that are proven to reveal renewed and younger skinImprove the appearance of crow's feetDeliver softer, smoother, and visibly younger-looking skinSmooth skin and reduce visible signs of agingKey IngredientsFormulated with a next-generation Retinol ester, which combines vitamins A and F to combat the appearance of crow's feet, dark circles and puffinessRibose rejuvenates tired looking skinHoney locust seed extract instantly helps to minimize the appearance of fine lines and wrinklesItem 2583886How To UseAfter cleansing, gently pat a small amount around the contour of your eye. Use daily in the PM for optimal results.Precautions: For external use only. Avoid contact with eyes. If product gets into eyes, immediately rinse well with water. If irritation occurs, discontinue use.IngredientsWater (Aqua/Eau), Myristyl Myristate, Squalane, Glycerin. Isoamyl Laurate, Cetearyl Alcohol, Behenyl Alcohol, Arachidyl Alcohol, Persea Gratissima (Avocado) Oil, Phenoxyethanol, Ribose, Caprylyl Glycol, Cetearyl Glucoside, Arachidyl Glucoside, Retinyl Linoleate, Polyacrylamide, Allantoin, C13-14 Isoparaffin, Disodium Edta, Laureth-7, Daucus Carota Sativa (Carrot) Extract, Gleditsia Triacanthos Seed Extract, Tocopherol, Citric Acid.",
  "how_to_use": "After cleansing, gently pat a small amount around the contour of your eye. Use daily in the PM for optimal results.Precautions: For external use only. Avoid contact with eyes. If product gets into eyes, immediately rinse well with water. If irritation occurs, discontinue use.",
  "ingredients": [
    "Water (Aqua/Eau)",
    "Myristyl Myristate",
    "Squalane",
    "Glycerin. Isoamyl Laurate",
    "Cetearyl Alcohol",
    "Behenyl Alcohol",
    "Arachidyl Alcohol",
    "Persea Gratissima (Avocado) Oil",
    "Phenoxyethanol",
    "Ribose",
    "Caprylyl Glycol",
    "Cetearyl Glucoside",
    "Arachidyl Glucoside",
    "Retinyl Linoleate",
    "Polyacrylamide",
    "Allantoin",
    "C13-14 Isoparaffin",
    "Disodium Edta",
    "Laureth-7",
    "Daucus Carota Sativa (Carrot) Extract",
    "Gleditsia Triacanthos Seed Extract",
    "Tocopherol",
    "Citric Acid"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "moisturizer",
      "mask",
      "treatment",
      "eye cream"
    ],
    "skin_type": [
      "sensitive",
      "mature"
    ],
    "finish": [
      "sheer",
      "creamy",
      "cream",
      "oil"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "anti-aging",
      "soothing",
      "purifying"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2024973",
    "total_reviews": 126,
    "reviews": [
      {
        "review_id": 554139396,
        "rating": 4,
        "headline": "It worked really well for me!",
        "comments": "after almost a year of using this i can say it actually did something for my dark circles and fine lines. i tried to be consistent with it and put it on every morning or afternoon when i wake up and at first i thought it wasn't doing  if anything but looking back on photos after almost a year i can say it did something. im not disappointed. its a little bit oily when i put it on but its so hydrating and i would say if you have really oily skin to stay away from this or use very little, and trust me a little goes a long way. i try to use a pea sized dot and put it over my lids and massage it under my eye lightly.",
        "nickname": "cassie",
        "location": "New Jersey",
        "created_date": 1748525328770,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554139407,
        "rating": 4,
        "headline": "It worked really well for me!",
        "comments": "after almost a year of using this i can say it actually did something for my dark circles and fine lines. i tried to be consistent with it and put it on every morning or afternoon when i wake up and at first i thought it wasn't doing  if anything but looking back on photos after almost a year i can say it did something. im not disappointed. its a little bit oily when i put it on but its so hydrating and i would say if you have really oily skin to stay away from this or use very little, and trust me a little goes a long way. i try to use a pea sized dot and put it over my lids and massage it under my eye lightly.",
        "nickname": "cassie",
        "location": "New Jersey",
        "created_date": 1748525327845,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551787280,
        "rating": 1,
        "headline": "Nothing",
        "comments": "Purchased February 6th it is now April 15th, applied every night before bed and absolutely no difference. I feel like my eyes are even darker and my eyelids look darker now too. almost and orange yellow color.",
        "nickname": "Ri",
        "location": "Pennsylvania",
        "created_date": 1744765468967,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 476373860,
        "rating": 5,
        "headline": "So far so good!",
        "comments": "I've spent 3x this much on other eye creams and had zero results. Specifically Senegence's Neotight Eye Serum...it's over $60 and does nothing at all. \nBut Indeed's Retinol eye cream is already showing a change in my fine lines. I'm really pleased.",
        "nickname": "Katie W",
        "location": "NY",
        "created_date": 1697128012805,
        "bottom_line": "Yes",
        "helpful_votes": 10,
        "not_helpful_votes": 0
      },
      {
        "review_id": 443170769,
        "rating": 5,
        "headline": "I LOVE IT",
        "comments": "I needed a new nighttime eye cream and wanted to make sure I didn't waste money. I did a lot of reading on ingredients and reviews and decided on this one out of a list of 10. I've only been using this for about 2 weeks but i can tell a difference as soon as I put it on! Which is hard because I don't really have eye wrinkles, I'm using this to prevent getting them but I have had a couple fine lines under each eye my whole life and when I put this on they are so much less noticeable. So happy I tried this!",
        "nickname": "_jennaplt",
        "location": "US",
        "created_date": 1675910065179,
        "bottom_line": null,
        "helpful_votes": 10,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 5,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Normal",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        3,
        0,
        0,
        34,
        89
      ],
      "review_histogram": [
        3,
        0,
        0,
        34,
        89
      ],
      "rating_count": 126,
      "review_count": 126,
      "average_rating": 4.63,
      "recommended_ratio": 0.98,
      "media": [],
      "faceoff_positive": {
        "comments": "This retinol eye cream is phenomenal!  I have used many retinol products, so I don't ever usually feel anything from retinol, but from using this cream once, I noticed my eye area was more sensitive  (which I know is a side effect when starting a new retinol). I am so happy!  I know it is working, and I have slowly incorporated this into my nighttime routine , using it every other to every two nights, and my eye area is much smoother and makeup sits much better! I can't believe the changes I have seen so quickly and for such a good price. My other eye creams have been over $50 and this one is a bargain AND works!!!  Just be patient when using retinol and let your skin adjust and I promise you won't regret it!",
        "headline": "This ACTUALLY WORKS!",
        "rating": 5,
        "ugc_id": 400692493
      },
      "faceoff_negative": {
        "comments": "As a loyal customer, who refills her produts bi monthly, for the past several years... I never had any issues, or needed to contact customer service... until I bought this product a month ago to try add to my routine. I pumped it a million times and nothing would come out... I even made a video of me pumping continuously for a minute and sent it via Indeed Labs Instagram chat to seek help. Only to keep being told it's an airless pump and it need to be pumped a few times to start it up. Yes, I know this and it does not work. That's what you do with any pump product... but this product just would not give me anything.  And despite my video proving that I was pumping forever... I still kept gettin told the same thing to the point that I had to open it and use a Qtip to get it out. Which probably defeated the anti degrading properties the \"airless pump\" was for. Finally, I was told they would ship me another one and she took me information... it has been 4 weeks and nothing. I an extremely disappointed that the 1 time I had an issue in the many years of purchasing... that this was the outcome.",
        "headline": "Had to remove lid to Qtip the product out. Wouldn't pump. Ba",
        "rating": 1,
        "ugc_id": 472660839
      },
      "name": "Retinol Reface Eye Cream with Retinol Ester and Ribose",
      "native_review_count": 5,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 121,
      "locale": "en_US"
    }
  }
}