{
  "product_id": "pimprod2014422",
  "product_url": "https://www.ulta.com/p/brightening-cleanser-pimprod2014422",
  "extracted_at": "2025-09-23T03:27:16.275203+00:00",
  "product_name": "INDIE LEEBrightening Cleanser",
  "brand": "INDIE LEE",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wash"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "27",
  "sale_price": "38.00",
  "availability": "in_stock",
  "rating_avg": "4.7",
  "rating_count": "743",
  "images": [
    "https://media.ulta.com/i/ulta/2563191?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2563191?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2563191cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2563191cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2563191cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2563191cm_alt04?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryIndie Lee Brightening Cleanser is a three-in-one cleanser that gently removes makeup (even stubborn mascara) and washes away impurities leaving skin feeling luminous and hydrated. Plus, leave it on for five minutes, and it's an exfoliating mask!",
  "details": "DetailsBenefitsRemoves dirt, debris, sunscreen, makeup and even eye makeup without stripping skinDoubles as an exfoliating mask if left on for 5 -10 minutes before rinsingRich in vitamins that help deliver a brighter glowKey IngredientsCoconut and Sunflower Oils help remove makeup without stripping skinStrawberry Seed Oil, hydrolyzed Wheat Protein and Tomato extracts provide antioxidant benefits for firmer-looking skinLycopene is rich in vitamins A, C & K and acts as a gentle skin exfoliant to help deliver a brighter glowFormulated WithoutSiliconeEssential oilsAlways formulated without 1,300+ banned ingredients, including: Parabens, Mineral Oil, Sulfate-based detergents, Synthetic Fragrance, Petroleum-based ingredients, Phthalates, Phenoxyethanol, Formaldehyde and GMO ingredientsItem 2563191How To UseApply this brightening face wash to damp skin, massage and rinse. For an exfoliating mask, leave the brightening facial cleanser on for five minutes before rinsing. Gentle formula can be used to cleanse everyday.Precautions: For external use only. This brightening facial cleanser contains Gluten and is formulated with Glycerin.IngredientsWater (Aqua/Eau), Decyl Glucoside (Veg. Oils & Sugar), Disodium Coco-Glucoside Citrate, Coco Glucoside (Coconut and Sunflower Oil), Glyceryl Oleate, Hydrolyzed Wheat Protein, Xanthan Gum, Fragaria Chiloensis (Strawberry) Seed Oil, Lycopene (Tomato), Propanediol, Ethylhexylglycerin, Potassium Sorbate.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Apply this brightening face wash to damp skin, massage and rinse. For an exfoliating mask, leave the brightening facial cleanser on for five minutes before rinsing. Gentle formula can be used to cleanse everyday.Precautions: For external use only. This brightening facial cleanser contains Gluten and is formulated with Glycerin.",
  "ingredients": [
    "Water (Aqua/Eau)",
    "Decyl Glucoside (Veg. Oils & Sugar)",
    "Disodium Coco-Glucoside Citrate",
    "Coco Glucoside (Coconut and Sunflower Oil)",
    "Glyceryl Oleate",
    "Hydrolyzed Wheat Protein",
    "Xanthan Gum",
    "Fragaria Chiloensis (Strawberry) Seed Oil",
    "Lycopene (Tomato)",
    "Propanediol",
    "Ethylhexylglycerin",
    "Potassium Sorbate"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser"
    ],
    "skin_type": [
      "sensitive"
    ],
    "finish": [
      "dewy",
      "oil"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "exfoliating",
      "brightening",
      "soothing"
    ],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2014422",
    "total_reviews": 743,
    "reviews": [
      {
        "review_id": 556645691,
        "rating": 5,
        "headline": "Obsessed",
        "comments": "I love this product! Smells AMAZING (sweet strawberry) and leaves my face feeling refreshed and bright! I use it to clean as well as a mask and the somewhat gel-ish consistency feels great! 10/10 will be buying again!",
        "nickname": "Brande",
        "location": "Colorado",
        "created_date": 1751653542787,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555172065,
        "rating": 5,
        "headline": "The Absolute Best Gentle and Natural Brightening Cleanse",
        "comments": "This is my go to cleanser for a simple routine. I'm 55yo and less is more. No harsh chemicals are included and the strawberry scent is wonderful. I have read that the owner uses her home grown botanicals. It is steep in price but one pump lathers up nicely, so it lasts a long time. Remember, a little goes a long way. I buy the large bottle to save more.",
        "nickname": "Sandra",
        "location": "Groton, MA",
        "created_date": 1750003420452,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549692914,
        "rating": 5,
        "headline": "My Go-To For Years",
        "comments": "I've been this product for years and don't plan on stopping any time soon! I remember when I started using this; after a few weeks, my friends and family complimented my skin. I have combination skin, some redness, never acne prone, and started using this when I was 27, now 31. \nI try other face cleansers from trial sizes, but they never do as well as this one!",
        "nickname": "lilcutie",
        "location": "Morgantown, WV",
        "created_date": 1742664113968,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549381440,
        "rating": 5,
        "headline": "My Fav Cleanser for 10 years",
        "comments": "The founder of the line says you can eat her products. They are that clean and natural. I've tries many, orher cleansers but always come back to this. It keeps my aging skin youthful, clean and refreshed. Worth every penny!!!",
        "nickname": "Not Aging Gracefully",
        "location": "Alexandria, VA",
        "created_date": 1742347467886,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 545749804,
        "rating": 2,
        "headline": "I can't with the scent",
        "comments": "I feel its an ok cleanser but didnt smell it before buying. Smells like kids medicine or something. Smell before you buy it! Also doesnt really remove make up as much as i would like. I just use a tinted spf and even after using it 2x it still leaves some make up.",
        "nickname": "Vieve",
        "location": "Bend Oregon",
        "created_date": 1738352791363,
        "bottom_line": null,
        "helpful_votes": 11,
        "not_helpful_votes": 7
      },
      {
        "review_id": 537947389,
        "rating": 5,
        "headline": "love",
        "comments": "the Indie Lee cleanser smells fantastic and does a great job cleaning and leaves my skin feeling soft!",
        "nickname": "Nancy",
        "location": "Maryland",
        "created_date": 1731790390193,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537802215,
        "rating": 1,
        "headline": "Smells atrocious",
        "comments": "I got a sample of this product in a gift bag and I am convinced most of these reviews are fake. This stuff smells absolutley heinous. I put it on my hands and couldn't bring myself to use it. The scent is so bitter, so pungent and awful.",
        "nickname": "HaulinUlta",
        "location": "Chicago IL",
        "created_date": 1731554098838,
        "bottom_line": null,
        "helpful_votes": 20,
        "not_helpful_votes": 22
      },
      {
        "review_id": 537226503,
        "rating": 4,
        "headline": "found another use, not good for makeup",
        "comments": "I thought I would love this cleanser. It's nice as a morning cleanser. This doesn't cleanse thoroughly enough for me as a p.m. cleanser. If I have worn spf and makeup, even after mascara removal AND an oil cleanse, it leaves a lot behind. However, it has been fantastic as a…vulva wash. I like the texture, and it's nice as a steam mask (for my already cleansed face). It doesn't take the day off, but it works in other ways. Only buy at a discount unless you don't wear makeup! Also, the review about the pump is correct. Rinse between each use, or you will have a ball of product that makes the cleanser squirt all over the shower. I just saw that someone recommended a cloth. I dont think a cleanser should require a cloth in 2024. but i guess \"clean beauty\" strikes again lol",
        "nickname": "musique",
        "location": "philly",
        "created_date": 1730596739187,
        "bottom_line": null,
        "helpful_votes": 8,
        "not_helpful_votes": 13
      },
      {
        "review_id": 536853177,
        "rating": 5,
        "headline": "Favorite cleanser",
        "comments": "Ive bought this cleanser at least three times. It's really expensive , so I always wait till it's half off. I love its a pump so I don't have to pick up the bottle. Sometimes the pump gets a little clogged so you have to be careful you don't accidentally squirt too much out all of the sudden. The smell is amazing, it doesn't dry out my face, but it makes me feel fresh and clean.",
        "nickname": "MW",
        "location": "Ohio",
        "created_date": 1730027854306,
        "bottom_line": null,
        "helpful_votes": 8,
        "not_helpful_votes": 0
      },
      {
        "review_id": 531343726,
        "rating": 3,
        "headline": "Lives up to the hype but is it worth $",
        "comments": "I dont have any cons about the product other than its very pricy. I wasn't disappointed with its perfomance per say, but I was expecting something like a new face with the price tag. Lol\n\nThere are equally great facial cleansers out there with all the great ingredients that are 1/4 or 1/3 of the sales price, let alone the regular price.",
        "nickname": "SkincareAddict",
        "location": "DC",
        "created_date": 1725134869742,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 527650272,
        "rating": 5,
        "headline": "My favorite!",
        "comments": "This facewash has all natural ingredients and no harmful chemicals thag many brands use. It keeps my skin feeling good!!",
        "nickname": "Cat",
        "location": "Beaumont, Tx",
        "created_date": 1724118261031,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 526356269,
        "rating": 1,
        "headline": "Allergic Reaction",
        "comments": "I bought this thinking it would work on my acne-prone skin. Like many others, I'm getting allergic reactions from the product, swelling on my face and itchy red patches. Do not reccomend this one.",
        "nickname": "Sissy",
        "location": "Grand Rapids",
        "created_date": 1722774147232,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 525608580,
        "rating": 5,
        "headline": "I was skeptical but I love it",
        "comments": "When I first got this I was concerned that I had just spent a bunch of money on a cleanser that wouldn't be worth the cost. I used it until the bottle was empty and bought a different cleanser once I was out. I am definitely re-purchasing this cleanser. It made my skin so bright and clear and left it feeling clean but soft--not overly dry. The strawberry smell is delightful and made cleansing a really enjoyable experience. The formula suds nicely and removes all makeup. It actually lasted quite a while as a little goes a long way. I definitely recommend this product. I have normal-combination skin depending on the season.",
        "nickname": "ForestCat",
        "location": "PNW",
        "created_date": 1721920970704,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 523503661,
        "rating": 5,
        "headline": "Love",
        "comments": "I love everything about this face wash. It is the only one I have ever re-purchased. I think I must be on my 8th bottle!",
        "nickname": "Jay",
        "location": "Grand Forks, ND",
        "created_date": 1719023045471,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 516073453,
        "rating": 5,
        "headline": "Indee Lee brightening cleanser ￼",
        "comments": "My absolute favorite face cleanser and has no bad chemicals and is all natural and makes face feel hydrated and non drying.",
        "nickname": "Kev",
        "location": "Fraser Michigan",
        "created_date": 1716336502358,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 511707079,
        "rating": 5,
        "headline": "A Cleanser I Really Like",
        "comments": "I haven't had a cleanser that I have strongly liked in over a decade.  I have tried many and most I feel just do a fine job but don't compel me to repurchase. \n\nThis cleanser is gentle yet works very well.  It leaves my skin feeling clean, smooth, and not stripped of moisture - something that many other gentle or hydrating cleansers have done.  \n\nThe packaging is wonderful,  the scent is subtle and refreshing, and it has lasted me forever. \n\nI will absolutely purchase again.",
        "nickname": "Lyndsey516",
        "location": "Chicago, IL",
        "created_date": 1713499241550,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 509637872,
        "rating": 1,
        "headline": "bad reaction",
        "comments": "i've never had a bad reaction to a skincare before, and thought maybe it was caused by a serum i also added into my routine at the same time i added this cleanser. i stopped using the serum to see, and was still using this cleanser for about two weeks (bad idea, i know). i patch tested it and everything and it was fine. i've been having itchy cheeks and neck for about two weeks now and didnt think it was this facewash because i've used other indie lee cleansers before. my neck is now patchy and my skin is super tender and texturized. i don't have sensitive skin whatsoever, so i would definitely be careful with this product and make it the only \"new\" part of your routine so it's easier to identify the problem product. wish I would have realized it sooner before using it for 2 weeks already:( i'm so sad, i wanted to love this product like the other cleansers!!",
        "nickname": "Rayna",
        "location": "California",
        "created_date": 1711301065142,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 509037861,
        "rating": 5,
        "headline": "Can't live without!",
        "comments": "Over the years I always go back to this cleanser. When I don't have it I miss it. I have extremely sensitive skin, plus it's been the greatest option while pregnant for a cleanser that helps with light exfoliation and clogged pores. It is pricey to me but worth the investment.",
        "nickname": "Sunnyshinerae",
        "location": "Michigan",
        "created_date": 1710913335278,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 501821737,
        "rating": 5,
        "headline": "One of the best!",
        "comments": "This is truly one of the best facial cleansers I have ever used. Anytime I see a big, red pimple start to pop-up on my face, I use this cleanser as a mask and it clears up my skin seemingly overnight. It's truly wild! I also just use it daily in my normal routine. Love it!!!",
        "nickname": "Meg",
        "location": "Valparaiso IN",
        "created_date": 1706761060776,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 485955018,
        "rating": 5,
        "headline": "Like not love",
        "comments": "I do like this cleanser and recommend it, there are others I've used I like more. I didn't notice a strong scent and it is very gentle. The bottle and pump are nice.",
        "nickname": "Nicole",
        "location": "Clovis, Ca",
        "created_date": 1703739606153,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 234,
      "pages_total": 12,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2014422/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "bestuses",
          "name": "Best Uses",
          "type": "tag",
          "values": [
            {
              "label": "Cleansing and masking",
              "count": 1
            },
            {
              "label": "Daily/Nighttime  skincare routine.",
              "count": 1
            }
          ],
          "display_values": [
            "Cleansing and masking",
            "Daily/Nighttime  skincare routine."
          ]
        },
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "Irritating",
              "count": 1
            },
            {
              "label": "burned",
              "count": 1
            },
            {
              "label": "redness",
              "count": 1
            },
            {
              "label": "doesn't clear up acne",
              "count": 1
            },
            {
              "label": "Drying",
              "count": 1
            },
            {
              "label": "Smells like pez?",
              "count": 1
            },
            {
              "label": "Scared glass bottle might fall and break",
              "count": 1
            },
            {
              "label": "price",
              "count": 1
            },
            {
              "label": "Not a fan of the smell.",
              "count": 1
            }
          ],
          "display_values": [
            "Drying",
            "Irritating",
            "Not a fan of the smell.",
            "Scared glass bottle might fall and break",
            "Smells like pez?",
            "burned",
            "doesn't clear up acne",
            "price",
            "redness"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "18-25",
              "count": 1
            },
            {
              "label": "dry to combo skin",
              "count": 1
            },
            {
              "label": "medium skin tone",
              "count": 1
            },
            {
              "label": "49 years old",
              "count": 1
            },
            {
              "label": "Mid 30s,Fine lines, uneven tone, minor breakouts",
              "count": 1
            },
            {
              "label": "Acne Prone",
              "count": 1
            },
            {
              "label": "Combination Skin",
              "count": 1
            },
            {
              "label": "Late 20's",
              "count": 1
            },
            {
              "label": "Sensitive Skin",
              "count": 1
            },
            {
              "label": "Oily skin",
              "count": 1
            },
            {
              "label": "Slightly hiperpigmentation",
              "count": 1
            },
            {
              "label": "combination skin",
              "count": 1
            },
            {
              "label": "Olive/tan, dry/combination skin",
              "count": 1
            },
            {
              "label": "Laid back and casual.",
              "count": 1
            },
            {
              "label": "oily acne prone skin",
              "count": 1
            },
            {
              "label": "sensitive",
              "count": 1
            },
            {
              "label": "I have normal and dry skin",
              "count": 1
            }
          ],
          "display_values": [
            "18-25",
            "49 years old",
            "Acne Prone",
            "Casual Dresser",
            "Combination Skin",
            "Comfort-seeking",
            "Energetic/Active",
            "I have normal and dry skin",
            "Laid back and casual.",
            "Late 20's",
            "Mid 30s,Fine lines, uneven tone, minor breakouts",
            "Oily skin",
            "Olive/tan, dry/combination skin",
            "Sensitive Skin",
            "Slightly hiperpigmentation",
            "Stylish/Fashionista",
            "Trendy/Stylish Dresser",
            "Youthful",
            "combination skin",
            "dry to combo skin",
            "medium skin tone",
            "oily acne prone skin",
            "sensitive"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "not stripping",
              "count": 2
            },
            {
              "label": "Brightening",
              "count": 1
            },
            {
              "label": "Cleared Acne",
              "count": 1
            },
            {
              "label": "Cute Packaging",
              "count": 1
            },
            {
              "label": "Even Skin Tone",
              "count": 1
            },
            {
              "label": "Smooths Textured Skin",
              "count": 1
            },
            {
              "label": "Lasts a long time",
              "count": 1
            },
            {
              "label": "Smells amazing",
              "count": 1
            },
            {
              "label": "Works well",
              "count": 1
            },
            {
              "label": "Clean product",
              "count": 1
            },
            {
              "label": "brightens",
              "count": 1
            },
            {
              "label": "eco friendly",
              "count": 1
            },
            {
              "label": "leaves skin feeling clean",
              "count": 1
            },
            {
              "label": "Brightens",
              "count": 1
            },
            {
              "label": "Cleanses",
              "count": 1
            },
            {
              "label": "Evens Tone",
              "count": 1
            },
            {
              "label": "Skin feels extra clean",
              "count": 1
            },
            {
              "label": "Leaves skin soft",
              "count": 1
            },
            {
              "label": "Smells Great",
              "count": 1
            },
            {
              "label": "Smells good, keeps complexion clear and bright",
              "count": 1
            },
            {
              "label": "The Smell!",
              "count": 1
            },
            {
              "label": "gentle",
              "count": 1
            },
            {
              "label": "lasts for a long time",
              "count": 1
            },
            {
              "label": "light smell",
              "count": 1
            },
            {
              "label": "Convenient pump.",
              "count": 1
            },
            {
              "label": "Does not strip your face of moisture.",
              "count": 1
            },
            {
              "label": "The packaging is very nice.",
              "count": 1
            },
            {
              "label": "brighter skin",
              "count": 1
            },
            {
              "label": "organic",
              "count": 1
            },
            {
              "label": "smells good",
              "count": 1
            },
            {
              "label": "All natural but smells amazing",
              "count": 1
            },
            {
              "label": "Can remove makeup if used with cloth",
              "count": 1
            },
            {
              "label": "Doesn't burn your eyes!",
              "count": 1
            },
            {
              "label": "Doesn't irritate eczema",
              "count": 1
            }
          ],
          "display_values": [
            "All natural but smells amazing",
            "Brightening",
            "Brightens",
            "Can remove makeup if used with cloth",
            "Clean product",
            "Cleanses",
            "Cleared Acne",
            "Convenient pump.",
            "Cute Packaging",
            "Does not strip your face of moisture.",
            "Doesn't burn your eyes!",
            "Doesn't irritate eczema",
            "Even Skin Tone",
            "Evens Tone",
            "Lasts a long time",
            "Leaves skin soft",
            "Skin feels extra clean",
            "Smells Great",
            "Smells amazing",
            "Smells good, keeps complexion clear and bright",
            "Smooths Textured Skin",
            "The Smell!",
            "The packaging is very nice.",
            "Works well",
            "brightens",
            "brighter skin",
            "eco friendly",
            "gentle",
            "lasts for a long time",
            "leaves skin feeling clean",
            "light smell",
            "not stripping",
            "organic",
            "smells good"
          ]
        },
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Normal",
              "count": 3
            },
            {
              "label": "Combination",
              "count": 1
            },
            {
              "label": "Dry",
              "count": 1
            },
            {
              "label": "Oily",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        26,
        16,
        20,
        49,
        632
      ],
      "review_histogram": [
        26,
        16,
        20,
        49,
        632
      ],
      "rating_count": 743,
      "review_count": 743,
      "average_rating": 4.68,
      "recommended_ratio": 0.93,
      "media": [
        {
          "id": "405227837",
          "review_id": 405227828,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ktay31qnmyu6yg2d5gk8.jpg",
          "headline": "Loved it",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Dash",
          "created_date": 1650033787715
        },
        {
          "id": "375560555",
          "review_id": 375560709,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/sy4op4hduwxug9i5tetk.jpg",
          "headline": "This product is now part of my must have tool box",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Ai Natural & feeling bright!",
          "nickname": "Leslie",
          "created_date": 1628772210904
        },
        {
          "id": "343149896",
          "review_id": 343149882,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/nmq8u8nfosveif3nwbqu.jpg",
          "headline": "Made me breakout in a rash",
          "rating": 2,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Nyss",
          "created_date": 1619832401196
        },
        {
          "id": "329704141",
          "review_id": 329704177,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/clmzewmy0e1gnwe6wjtd.jpg",
          "headline": "Smells Amazing, Works Even Better!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Heaven!",
          "nickname": "Denise",
          "created_date": 1613300710475
        },
        {
          "id": "308931636",
          "review_id": 308931626,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/inwml77tqrbwhzxsl4po.jpg",
          "headline": "Soft and subtle",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Alexandra P.",
          "created_date": 1577577600000
        }
      ],
      "faceoff_positive": {
        "comments": "i've been using this cleanser for about two weeks and it's done exactly what is described. i was having bad flare ups with texture and my skin was looking dull and tight. i have combo/dry skin, in the winter my skin gets pretty dehydrated and it's easy for fine lines to appear. this face wash worked just days after using it. my texture improved so much and i'm so surprised at how well it works with brightening my skin, i'm really noticing a glow with consistent use. my fine lines have reduced significantly so my skin looks really healthy and supple. started off using morning and night, but since it's more of a gel consistency i switched to only using in the morning and added a cream cleanser at night for added moisture. only three minor cons - 1. you'll definitely notice the strawberry seed oil. it's not super overpowering and i personally love the scent, but if you have sensitive skin or aren't a fan of scented products it may be unflattering. i do think it lingers a bit throughout the day as well. 2. the gel consistency means it doesn't lather like other cleansers might, which is something i'm used to. i use 2-3 pumps and that's usually enough. if you really want to see a lather would def recommend doing like the instructions say and make sure your face is WET and hands are too. i've found using in the shower gets a better lather. 3. doesn't really clear up acne. i have hormonal breakouts and occasional maskne, and this doesn't make my breakouts any worse but also doesn't clear my skin up any faster. not a deal breaker since it doesn't advertise for that, and even with the occasional breakout this does wonders for fading post acne dark marks, so i just use an acne specific cleanser some nights. overall 1000/10, will probably try the purifying face wash next to see which i like more, but if you're even on the fence - this is a cosign to definitely try this.",
        "headline": "favorite cleanser in a while",
        "rating": 5,
        "ugc_id": 333814183
      },
      "faceoff_negative": {
        "comments": "I LOVED the packaging, LOVED the scent. \nI have combination skin (forehead and nose are oil prone, everywhere else dry like the Sahara dessert), and have used CeraVe Salicylic cleaner at night forever (it was like it fought a battle every night to keep my breakouts a way and woke up with a win each morning), but I ran out and had a couple friends hype this cleanser up so I decided why the truck not, ya know? Yikes yikes yikes. First morning after I woke up with little angry red white topped demons all over in places I usually don't break out... thought,\"you're over reacting, use it a week, then decide\" .... y'all. A week later and I not only have angry red white topped devils, but I have pustules on my chin, and CYSTIC ACNE FOR THE FIRST TIME EVER. I am so bummed. Sadly will be switching back to my other ): but like I sad, packaging is 5 stars, smells like fresh strawberries, and the consistency is light which is a go. Hope this helps someone!",
        "headline": "Not bad, just not for me",
        "rating": 2,
        "ugc_id": 339681622
      },
      "name": "Brightening Cleanser",
      "variant_names": [
        "Brightening Cleanser",
        "Brightening Cleanser Travel",
        "Jumbo Brightening Cleanser"
      ],
      "native_review_count": 234,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 509,
      "locale": "en_US"
    }
  }
}