{
  "product_id": "pimprod2052121",
  "product_url": "https://www.ulta.com/p/caffeine-de-puffing-dark-circle-eye-cream-pimprod2052121",
  "extracted_at": "2025-09-23T03:29:45.698751+00:00",
  "product_name": "INKEYCaffeine De-puffing + Dark Circle Eye Cream",
  "brand": "INKEY",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Cream"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "eye-cream"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "12.00",
  "availability": "in_stock",
  "rating_avg": "4.1",
  "rating_count": "451",
  "images": [
    "https://media.ulta.com/i/ulta/2641805?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2641805?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641805_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641805_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641805_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641805_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641805_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641805_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641805_alt07?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeSustainable PackagingGive BackINKEY Caffeine De-puffing + Dark Circle Eye Cream is a lightweight, hydrating eye cream with a blend of caffeine and peptides, clinically proven to reduce the appearance of puffiness & dark circles.",
  "details": "DetailsBenefitsClinically proven to deliver instant hydration, this targeted treatment is an instant wake-up call for tired eyesThe fast-absorbing formula instantly cools the under-eye area and leaves it perfectly primed for makeupKey IngredientsCaffeine: Antioxidant that helps reduce dark circles and de-puffMatrixyl 3000™ Peptide: Plumps, firms and smooths skin's appearanceAlbizia Julibrissin Bark Extract: Helps to exfoliate, resurface and smooth skin textureResearch ResultsClinically proven to improve the appearance of puffiness & dark circles from 1st use*Clinically proven to deliver instant hydration**4-week independent clinical study of 22 people under dermatological & ophthalmological controlItem 2641805How To UseSuggested Usage:-Use daily, morning and night-Squeeze a pea-sized amount onto the tip of your ring finger-Gently pat around the contour of the eye-Follow with preferred serums and moisturizer to complete your skincare routine-Always finish with SPF for your AM routineINKEY Tip: Keeping your Caffeine Eye Cream in the fridge will give an extra cooling benefit on application to leave the skin looking depuffed and instantly cool.IngredientsWater, Glycerin, Dicaprylyl Carbonate, Propanediol, Polyglyceryl-6 Distearate, Cetyl Alcohol, Glyceryl Behenate, Phenoxyethanol, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Jojoba Esters, Albizia Julibrissin Bark Extract, Squalane, Caffeine, Polyglyceryl-3 Beeswax, Phospholipids, Xanthan Gum, Ethylhexylglycerin, Glycine Soja (Soybean) Oil, Polysorbate 60, Sodium Phytate, Glycolipids, Sorbitan Isostearate, Butylene Glycol, Glycine Soja (Soybean) Sterol, Citric Acid, Leuconostoc/Radish Root Ferment Filtrate, Hyaluronic Acid, Sodium Benzoate, Tocopherol, Darutoside, Carbomer, Sodium Lactate, Polysorbate 20, Palmitoyl Tripeptide-1, Palmitoyl Tetrapeptide-7.",
  "how_to_use": "Suggested Usage:-Use daily, morning and night-Squeeze a pea-sized amount onto the tip of your ring finger-Gently pat around the contour of the eye-Follow with preferred serums and moisturizer to complete your skincare routine-Always finish with SPF for your AM routineINKEY Tip: Keeping your Caffeine Eye Cream in the fridge will give an extra cooling benefit on application to leave the skin looking depuffed and instantly cool.",
  "ingredients": [
    "Water",
    "Glycerin",
    "Dicaprylyl Carbonate",
    "Propanediol",
    "Polyglyceryl-6 Distearate",
    "Cetyl Alcohol",
    "Glyceryl Behenate",
    "Phenoxyethanol",
    "Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer",
    "Jojoba Esters",
    "Albizia Julibrissin Bark Extract",
    "Squalane",
    "Caffeine",
    "Polyglyceryl-3 Beeswax",
    "Phospholipids",
    "Xanthan Gum",
    "Ethylhexylglycerin",
    "Glycine Soja (Soybean) Oil",
    "Polysorbate 60",
    "Sodium Phytate",
    "Glycolipids",
    "Sorbitan Isostearate",
    "Butylene Glycol",
    "Glycine Soja (Soybean) Sterol",
    "Citric Acid",
    "Leuconostoc/Radish Root Ferment Filtrate",
    "Hyaluronic Acid",
    "Sodium Benzoate",
    "Tocopherol",
    "Darutoside",
    "Carbomer",
    "Sodium Lactate",
    "Polysorbate 20",
    "Palmitoyl Tripeptide-1",
    "Palmitoyl Tetrapeptide-7"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "moisturizer",
      "mask",
      "treatment",
      "eye cream"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "sheer",
      "creamy",
      "cream",
      "oil"
    ],
    "ingredients": [
      "hyaluronic-acid",
      "peptides"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "spf",
      "hydrating"
    ]
  },
  "reviews": {
    "product_id": "pimprod2052121",
    "total_reviews": 451,
    "reviews": [
      {
        "review_id": 563543716,
        "rating": 4,
        "headline": "Yes would buy again",
        "comments": "Works better than other products that I have tried.",
        "nickname": "Maree",
        "location": "Picayune, MS",
        "created_date": 1758120509446,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 561192773,
        "rating": 2,
        "headline": "Not for Me",
        "comments": "I can't say whether this works or not because I've had to stop using it after maybe two weeks.  Problem?  It makes my eye area itchy ,which is really uncomfortable.  I used to have this problem often with eye creams, but this hasn't been much of a problem for the last 20 years, when companies may have become more attuned to skin sensitivities.  So I was surprised and unhappy to have this happen to me again.  The cream didn't much for me in the short time I used it so I won't miss it.",
        "nickname": "Rosie",
        "location": "SoCal",
        "created_date": 1756318952193,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560502967,
        "rating": 5,
        "headline": "Love",
        "comments": "This works great and I can't believe how inexpensive it is! Don't let the low price fool you! I'm 59 years old and this works. It didn't work overnight for me but I've seen a difference over the past two weeks using in the morning and night before bed. This doesn't leave a residue or oil slick. It soaks into my skin completely in about a minute which is when I then moisturize.",
        "nickname": "Tami",
        "location": "Jax, FL",
        "created_date": 1755696578892,
        "bottom_line": "Yes",
        "helpful_votes": 9,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560473712,
        "rating": 5,
        "headline": "My second purchase I love it",
        "comments": "This tube lasted me a month and a half, not only is the price reasonable but a little goes a long way with this product…no burning no fragrance, I'm not trying their hydrating serum because my skin did so well with the eye cream",
        "nickname": "Jay",
        "location": "Maryland",
        "created_date": 1755639047737,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 1
      },
      {
        "review_id": 560359297,
        "rating": 5,
        "headline": "Finally",
        "comments": "This eye cream smooths out my eye area and doesn't cause irritation. I'm nearly 60 and this does a great job, for a very reasonable price.  I prefer it to my previous product that was around $80.",
        "nickname": "Emily",
        "location": "PCB, FL",
        "created_date": 1755437545014,
        "bottom_line": "Yes",
        "helpful_votes": 8,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558829238,
        "rating": 5,
        "headline": "Works!",
        "comments": "I apply this cream every night and I have genuinely noticed an improvement in my dark under eye circles. I am 23 and this is one of my first eye creams, so I'm sure this is not some miracle product. But I have seen improvement and I would recommend for the price point!!",
        "nickname": "Stack",
        "location": "Utah",
        "created_date": 1753986165024,
        "bottom_line": null,
        "helpful_votes": 14,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558044755,
        "rating": 5,
        "headline": "IN AWE!",
        "comments": "I never write reviews, but I had to for this product. I have hereditary eye bags under my eyes and was recommended this eye cream because it contains caffeine. I applied it, and about 10 minutes later, I looked in the mirror — I was in shock at how quickly it worked! My eye bags were reduced by around 50%! I'm not sure if it will provide long-term results, but as long as it works while I have it on, I'm more than happy. Nothing else has ever worked for my eye bags so i'm excited to see how this continues to work.",
        "nickname": "Cam",
        "location": "Texas",
        "created_date": 1753226766583,
        "bottom_line": null,
        "helpful_votes": 23,
        "not_helpful_votes": 1
      }
    ],
    "paging": {
      "total_results": 7,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        34,
        21,
        46,
        115,
        235
      ],
      "review_histogram": [
        34,
        21,
        46,
        115,
        235
      ],
      "rating_count": 451,
      "review_count": 451,
      "average_rating": 4.1,
      "recommended_ratio": 0.8,
      "media": [],
      "faceoff_positive": {
        "comments": "I'm a very minimalist girly so I don't like to wear too much makeup. When I go to work, I try and hide my baggy under-eyes and dark circles. But even the concealer couldn't hide my baggy eyes, just the dark circles. I was a little nervous about trying to a new product because I have highly sensitive skin and can break out or develop a rash/dry skin if I use the wrong product. I was hesitant, but followed the instructions of applying once in the morning and once at a night. In a week or so, I began to notice a change in my baggy eyes. I didn't seem as tired without makeup and could get away with just concealer. It made my under eye look less dry as well after applying makeup. I feel my under eye looks better than it has in years. This is my new favorite go-to product!! Highly recommend!",
        "headline": "Works wonders!",
        "rating": 5,
        "ugc_id": 554480943
      },
      "faceoff_negative": {
        "comments": "So far, this cream has just been ok. It's my first eye cream, I've never invested in my under eyes or included them in my skin routine. But first off, this cream is for puffiness and I didn't have super puffy under eyes before, but I do see a slight difference. I also have noticed that they are smoother. That's awesome that this smoothed out my skin, but it didn't lighten my circles at all, at least based on my pictures. Maybe I'm not putting enough, but my under eyes are small. If I use anything more than half a pea-size, patting that into my skin would take forever. I feel like my dark circles are a little lighter, but I don't see a huge difference right now looking at my side to side pictures. My biggest concern with my under eyes is the dark circles, which I haven't seen a huge difference in. That's why my rating is a 3. It does everything it says, except the dark circles. At least for me and my skin and how I've been using it. I'll continue to use the tube until it runs out. If it doesn't give me the results I want then I just won't repurchase. The first 2 pics are before I started using this. The last 3 are recent, and I've been using the cream morning & night for about 2 months.",
        "headline": "It's ok, it's decent overall",
        "rating": 3,
        "ugc_id": 554479011
      },
      "name": "Caffeine De-puffing + Dark Circle Eye Cream",
      "native_review_count": 7,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 444,
      "locale": "en_US"
    }
  }
}