{
  "product_id": "pimprod2052119",
  "product_url": "https://www.ulta.com/p/salicylic-acid-acne-blackhead-cleanser-pimprod2052119",
  "extracted_at": "2025-09-23T05:06:32.219058+00:00",
  "product_name": "INKEYSalicylic Acid Acne + Blackhead Cleanser",
  "brand": "INKEY",
  "categories": [
    "Home",
    "Skin Care",
    "Treatment & Serums",
    "Acne & Blemish Treatments"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "men",
    "men"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "14.00",
  "availability": "in_stock",
  "rating_avg": "4.6",
  "rating_count": "459",
  "images": [
    "https://media.ulta.com/i/ulta/2641992?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2641992?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641992_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641992_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641992_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641992_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641992_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641992_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641992_alt07?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeSustainable PackagingGive BackINKEY Salicylic Acid Acne + Blackhead Cleanser is a non-drying, daily face wash that effectively removes impurities & excess oil to visibly reduce acne blemishes & blackheads for clearer-looking skin.",
  "details": "DetailsBenefitsVisibly reduce breakoutsThis powerful, yet gentle, exfoliating gel cleanser is formulated with Salicylic Acid and Zinc to help unclog pores while minimizing excess oilsIdeal for acne blemishes, combination and oily skin this lightly foaming cleanser leaves a visibly clearer complexionKey IngredientsSalicylic Acid 2%: Combats blackheads and breakoutsZinc Compound: Helps reduce excess oilAllantoin 0.5%: Soothes skin post-exfoliation to help protect and comfort the skinResearch Results90% agree skin looks visibily clearer after 3 days*93% agree skin looks instantly less oily*89% agree pores look less noticable after 3 days*84% agree blemishes and blackheads appeared reduced**4-week independent consumer trial of 66 peopleItem 2641992How To UseSuggested Usage:--For daily usage, AM and PM-Use a quarter-sized amount-Gently massage onto dry skin for at least 60 seconds-Add a splash of warm water to emulsify-Rinse thoroughlyINKEY tip: Salicylic Acid Cleanser can be used on other acne-prone areas, including the back and chest to help reduce appearance of breakouts.IngredientsAqua (Water), Propanediol, Glycerin, Sodium Methyl Cocoyl Taurate, Cocamidopropyl Betaine, PEG-120 Methyl Glucose Dioleate, Salicylic Acid, PEG-150 Pentaerythrityl Tetrastearate, PEG-6 Caprylic/Capric Glycerides, Betaine, Zinc PCA, Phenoxyethanol, Sodium Chloride, Allantoin, Sodium Hydroxide, Coco-Glucoside, Glyceryl Oleate, Benzyl Alcohol, Coconut Acid, Ethylhexylglycerin, Sodium Benzoate, Citric Acid, Dehydroacetic Acid, Trisodium Ethylenediamine Disuccinate, Tocopherol, Hydrogenated Palm Glycerides Citrate.",
  "how_to_use": "Suggested Usage:--For daily usage, AM and PM-Use a quarter-sized amount-Gently massage onto dry skin for at least 60 seconds-Add a splash of warm water to emulsify-Rinse thoroughlyINKEY tip: Salicylic Acid Cleanser can be used on other acne-prone areas, including the back and chest to help reduce appearance of breakouts.",
  "ingredients": [
    "Aqua (Water)",
    "Propanediol",
    "Glycerin",
    "Sodium Methyl Cocoyl Taurate",
    "Cocamidopropyl Betaine",
    "PEG-120 Methyl Glucose Dioleate",
    "Salicylic Acid",
    "PEG-150 Pentaerythrityl Tetrastearate",
    "PEG-6 Caprylic/Capric Glycerides",
    "Betaine",
    "Zinc PCA",
    "Phenoxyethanol",
    "Sodium Chloride",
    "Allantoin",
    "Sodium Hydroxide",
    "Coco-Glucoside",
    "Glyceryl Oleate",
    "Benzyl Alcohol",
    "Coconut Acid",
    "Ethylhexylglycerin",
    "Sodium Benzoate",
    "Citric Acid",
    "Dehydroacetic Acid",
    "Trisodium Ethylenediamine Disuccinate",
    "Tocopherol",
    "Hydrogenated Palm Glycerides Citrate"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "men",
      "mens"
    ],
    "product_type": [
      "cleanser",
      "serum",
      "mask",
      "treatment"
    ],
    "skin_type": [
      "oily",
      "dry",
      "combination",
      "sensitive",
      "acne-prone"
    ],
    "finish": [
      "sheer",
      "gel",
      "oil",
      "foam"
    ],
    "color": [
      "black"
    ],
    "ingredients": [
      "salicylic-acid"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "exfoliating",
      "soothing"
    ]
  },
  "reviews": {
    "product_id": "pimprod2052119",
    "total_reviews": 459,
    "reviews": [
      {
        "review_id": 563619041,
        "rating": 2,
        "headline": "Doesnt work",
        "comments": "I bought this from Inkey's website not ulta, and i can tell you the reviews there are not as high as they are here. Probably because *someone* decided to be shady and add reviews for the cleanser instead of the actual product hoping people wouldn't actually read the reviews. I gave this stuff about a month of using and it did literally nothing for my pimples. Gave it to my husband and didnt work for his either. Theres was better products out there for the same price. Dont waste your money",
        "nickname": "Kristina",
        "location": "Savannah, GA",
        "created_date": 1758243331641,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557301412,
        "rating": 5,
        "headline": "My Breakout Go-To",
        "comments": "I see a lot of reviews on this product talking about a cleanser, something that this is not. This is an acne treatment. I use it as a spot treatment for individual zits, or sometimes an area treatment for when I have whole sections of my face breaking out. What I've noticed is that my acne goes away over the course of a few days. This is an excellent and affordable option for a spot treatment.",
        "nickname": "Cora",
        "location": "Albany, NY",
        "created_date": 1752617878249,
        "bottom_line": null,
        "helpful_votes": 17,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 2,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        11,
        14,
        9,
        86,
        339
      ],
      "review_histogram": [
        11,
        14,
        9,
        86,
        339
      ],
      "rating_count": 459,
      "review_count": 459,
      "average_rating": 4.59,
      "recommended_ratio": 0.0,
      "media": [],
      "faceoff_positive": {
        "comments": "I am in my 50s and still have incredibly oily skin extending beyond my T-zone. I do not suffer from acne usually except the occasional light head and some large pores on my nose. Only one Chanel gel face wash works on me and it's been discontinued. An extremely long time. I have tried many, including the Farmacy face wash and their Sweep Toner these are designed for especially oily skin. It would get my skin very clean, but only for a few minutes, then I would get oily again more than I was in the first place. The salicylic acid face wash is incredible. I wet my skin then I put some dots of it on my fingers and emulsify it which it doesn't really need and said it says it up it doesn't said incredibly, but it set up some and work it all around my face and get it really clean. I even concentrate on my eyes and lashes and eyebrows and under eyes where I get especially oily. I'm just careful not to open my eyes. Then I rinse it all off and gently use a clean paper towel to dab dry. I love this product and this is the first time I can say this about a face wash in years actually decades. It leaves my skin feeling perfect. Not coated, not stripped. I do use a small face cloth made to wash your face with that helps helps me to clean my skin with the wash a little bit deeper. I will use the skin wash as long as it is made. Thank you Inkey List! Next time I order the larger size: one for the shower, one for the bathroom / make up room. I haven't worn eyeshadow , liner, lipstick, nor lipstick since I've had it so I don't know how it washes them off, but I think it would do well with the washcloth. I have washed off tinted moisturizer with SPF and it did just fine.",
        "headline": "Best face wash ever",
        "rating": 5,
        "ugc_id": 554460643
      },
      "faceoff_negative": {
        "comments": "This and the other products that were recommended to me by the Inkey List quiz have absolutely ravaged my skin. I've gone from one breakout to the next, progressively getting worse and more sore as I've used it. Been using it continously as per instructions twice a day for the last two months, believing the breakouts are from purging, however as there is only signs of this getting worse I have stopped using the products altogether. The lower half of my face is sore, damaged, spotty and inflammed. The first two photos were from 3 weeks ago after I'd been using the products for 6 weeks, the last photo is from today. The Salicylic Acid Cleanser leaves my skin feeling tight and dry so I think the acid percentage must be too high for my skin. The Omega Water Cream doesn't do enough to moisturise my face after. I had been using the Dewy Sunscreen SPF 30 but stopped after three uses because it was leaving such heavy oily residue on my face that was evident for hours afterwards. I don't believe these products to be compatible with sensitive skin. I can, however, recommend the Hydrocolloid Invisible Pimple Patches - these have been wonderful at quickly dealing with white heads and healing them without any side affects. They stick amazingly to the skin, they are totally invisible and easy to remove.",
        "headline": "Will not be using again",
        "rating": 1,
        "ugc_id": 554460641
      },
      "native_review_count": 2,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 457,
      "locale": "en_US"
    }
  }
}