{
  "product_id": "pimprod2052152",
  "product_url": "https://www.ulta.com/p/tripeptide-plumping-lip-balm-pimprod2052152",
  "extracted_at": "2025-09-23T05:33:15.389052+00:00",
  "product_name": "INKEYTripeptide Plumping Lip Balm",
  "brand": "INKEY",
  "categories": [
    "Home",
    "Makeup",
    "Lips",
    "Lip Balms & Treatments"
  ],
  "category_keys": [
    "home",
    "makeup",
    "lips",
    "men"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "14.00",
  "availability": "in_stock",
  "rating_avg": "3.9",
  "rating_count": "444",
  "images": [
    "https://media.ulta.com/i/ulta/2642012?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2642012?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2642012_sm?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2642012_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2642012_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2642012_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2642012_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2642012_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2642012_vid01/thumbs/cc9d87e7-e889-4817-885e-8f9a44246e99?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeSustainable PackagingGive BackINKEY Tripeptide Plumping Lip Balm works over time to visibly increase lip volume- formulated to hydrate, repair & plump without tingle or irritation.",
  "details": "DetailsBenefitsYour lips, but fullerA non-sticky alternative to lip gloss, the tinted lip balm leaves a sheer warm red berry hue which can be layered to increase the vibrancy of the color.This balm contains a 6% Tripeptide Complex to instantly hydrate lips and maintain skin barrier2% Ultra Filling Spheres with Hyaluronic Acid work to gently plump lips over time with no irritationWith continued use lips are plumped up to 40% in 4 weeksKey Ingredients6% Tripeptide Complex: Visibly increases lip volume for plumper-looking, more defined lips.2% Ultra Filling Spheres: Deliver hyaluronic acid within the lip to visibly plump, retain moisture, and help fill fine lines.Research ResultsClinically prove to plump lips by up to 40% in 4 weeks*95% Of people felt the balm instantly nourished and hydrated the lips**Visibly smoothed fine lines on lips in 2 weeks**4-week independent clinical study of 20 people under dermatological control**4-week independent consumer trial of 20 people under dermatological controlItem 2642012How To UseSuggested Usage:-For best results, use in the morning and evening, at least three times a day.-Apply a small amount to clean, dry lips.IngredientsRicinus Communis (Castor) Seed Oil, Hydroxystearic/Linolenic/Oleic Polyglycerides, Glyceryl Rosinate, Theobroma Grandiflorum (Cupuaçu) Seed Butter, Butyrospermum Parkii (Shea) Butter, Ethylhexyl Palmitate, Candelilla Cera, Mangifera Indica (Mango) Seed Butter, Orbignya Oleifera (Babassu) Seed Oil, Squalane, Cetearyl Ethylhexanoate, Hydrogenated Olive Oil, Salvia Hispanica (Chia) Seed Oil, Caprylic/Capric Triglyceride, Glyceryl Behenate, Olea Europaea (Olive) Oil Unsaponifiables, Tribehenin, Sorbitan Isostearate, Tocopherol, Portulaca Pilosa Extract, Trihydroxystearin, Helianthus Annuus (Sunflower) Seed Oil, Sucrose Cocoate, Brassica Alba Sprout Extract, Sodium Hyaluronate, Palmitoyl Tripeptide-1, Palmitoyl Tripeptide-38, Glucomannan.",
  "how_to_use": "Suggested Usage:-For best results, use in the morning and evening, at least three times a day.-Apply a small amount to clean, dry lips.",
  "ingredients": [
    "Ricinus Communis (Castor) Seed Oil",
    "Hydroxystearic/Linolenic/Oleic Polyglycerides",
    "Glyceryl Rosinate",
    "Theobroma Grandiflorum (Cupuaçu) Seed Butter",
    "Butyrospermum Parkii (Shea) Butter",
    "Ethylhexyl Palmitate",
    "Candelilla Cera",
    "Mangifera Indica (Mango) Seed Butter",
    "Orbignya Oleifera (Babassu) Seed Oil",
    "Squalane",
    "Cetearyl Ethylhexanoate",
    "Hydrogenated Olive Oil",
    "Salvia Hispanica (Chia) Seed Oil",
    "Caprylic/Capric Triglyceride",
    "Glyceryl Behenate",
    "Olea Europaea (Olive) Oil Unsaponifiables",
    "Tribehenin",
    "Sorbitan Isostearate",
    "Tocopherol",
    "Portulaca Pilosa Extract",
    "Trihydroxystearin",
    "Helianthus Annuus (Sunflower) Seed Oil",
    "Sucrose Cocoate",
    "Brassica Alba Sprout Extract",
    "Sodium Hyaluronate",
    "Palmitoyl Tripeptide-1",
    "Palmitoyl Tripeptide-38",
    "Glucomannan"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "makeup",
      "lips",
      "lip",
      "cosmetics"
    ],
    "product_type": [
      "moisturizer",
      "mask",
      "lip gloss",
      "treatment",
      "lip balm"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "sheer",
      "creamy",
      "oil"
    ],
    "color": [
      "purple"
    ],
    "ingredients": [
      "peptides"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free"
    ]
  },
  "reviews": {
    "product_id": "pimprod2052152",
    "total_reviews": 444,
    "reviews": [
      {
        "review_id": 560381411,
        "rating": 5,
        "headline": "Works with consistency",
        "comments": "I am almost 50 and have lines creasing my lips. I'm addicted to lip balm,  use it multiple times a day. Constantly trying out new ones. I saw this said it plumps lips over time with peptides and thought I'd give it a go for the vertical crease where my skin meets my lips on the top. I noticed after 2 weeks the crease is almost gone. I think this is a good deal and apparently effective. I bought clear.",
        "nickname": "Impressed",
        "location": "Pennsylvania",
        "created_date": 1755486228105,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560344530,
        "rating": 2,
        "headline": "Liquidy and smells like rancid oil!",
        "comments": "Purchased this in berry. The color is pretty but the product is so thin it barely tints the lips. It's very liquidy. Pretty sure the product I received is old because it smells exactly like rancid oil. I've had old makeup smell that way and even old oil in my kitchen. It's very offputting. It also dried my lips out considerably. I applied it on the way to an event and even though it was nasty I kept having tonreapply apply it because it made my lips feel so dry. I finally quit reapplying and they felt normal again after a few hous. I would not recommend!",
        "nickname": "Robyn",
        "location": "Arlington TX",
        "created_date": 1755388594439,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558416465,
        "rating": 5,
        "headline": "Favorite Lip Balm",
        "comments": "This is NOT a plumping balm! Idk why it's advertised that way, but it hurts what is ultimately a FANTASTIC product! It's my favorite balm, very nourishing and not scented. Don't buy it thinking it's a plumper. It's just a great balm!",
        "nickname": "Tait",
        "location": "Washington",
        "created_date": 1753720630049,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558350732,
        "rating": 2,
        "headline": "There's better peptide balms",
        "comments": "I've been on a streak of trying various peptide lip balm this year and this is probably the worst one - it's grainy, it's super thin so it doesn't last, the \"mocha\" tint is more orange than brown, and the smell/taste is absolutely atrocious. There's better balms out there at a similar price point and I will be returning this because it's so disgusting I can't reasonably pass it on to a friend.",
        "nickname": "Rey",
        "location": "Pennsylvania",
        "created_date": 1753559864435,
        "bottom_line": "No",
        "helpful_votes": 4,
        "not_helpful_votes": 1
      }
    ],
    "paging": {
      "total_results": 4,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        50,
        23,
        52,
        129,
        190
      ],
      "review_histogram": [
        50,
        23,
        52,
        129,
        190
      ],
      "rating_count": 444,
      "review_count": 444,
      "average_rating": 3.87,
      "recommended_ratio": 0.0,
      "media": [],
      "faceoff_positive": {
        "comments": "I recently tried the new Inkey List Tripeptide Plumping Lip Balm in the mocha tint and have been quite pleased with its performance. The subtle mocha color adds a lovely hint of tint to my lips, which is perfect for a natural look. Applying it 2-3 times a day, I have noticed a significant improvement in my lips' moisture levels. They remain well-hydrated throughout the day, and I haven't experienced any chapping since I started using it. However, the flavour of the balm leaves much to be desired. It has an unpleasant taste that lingers, often making me want to brush my teeth right after application. Despite this drawback, the balm's moisturising and gradual plumping effects make it a worthwhile addition to my daily routine. If the flavour could be improved, it would be nearly perfect. Gifted by inkey list",
        "headline": "Good performance but Leaves a strange taste",
        "rating": 4,
        "ugc_id": 554462310
      },
      "faceoff_negative": {
        "comments": "My lips were very chapped and peeled a lot. At first, when I started using the product (Berry Tint Lip Balm), I did not like the texture as it felt watery and did not really stay on - my lips remained dry. But I kept it at my desk and continued to used it several times a day for several weeks as I worked. Well lo and behold to my surprise, the texture of my lips started to improve - it no longer felt chapped and peeling stopped even when I didn't have the lip balm on. When I apply lip balm it stays on my lips better but it does easily come off after eating and/or drinking. I did take 2 stars off as the tint really didn't add any color to my lips and are not plumper than before I started using this product so be aware if those 2 features are important for you. Would be great if it was just a tad bit thicker and tint more noticeable. Regardless, I am a fan!! I will continue to use this lip balm as the health of my lips have improved significantly.",
        "headline": "Lip Texture Improved",
        "rating": 3,
        "ugc_id": 554459798
      },
      "native_review_count": 4,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 440,
      "locale": "en_US"
    }
  }
}