{
  "product_id": "pimprod2052120",
  "product_url": "https://www.ulta.com/p/bio-active-ceramide-repairing-plumping-moisturizer-pimprod2052120",
  "extracted_at": "2025-09-23T03:24:05.739902+00:00",
  "product_name": "INKEYBio-Active Ceramide Repairing and Plumping Moisturizer",
  "brand": "INKEY",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Face Moisturizer"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "21.50",
  "availability": "in_stock",
  "rating_avg": "4.6",
  "rating_count": "1022",
  "images": [
    "https://media.ulta.com/i/ulta/2641993?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2641993?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641993_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641993_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641993_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641993_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641993_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641993_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2641993_alt07?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeSustainable PackagingGive BackINKEY Bio-Active Ceramide Repairing and Plumping Moisturizer is a velvety moisturizer to defend against visible signs of aging, powered by bioactive ceramides for visible fine-line and wrinkle reduction.",
  "details": "DetailsBenefitsThis ceramide-rich moisturizer is clinically shown to improve six key signs of aging: fine lines and wrinkles, plumpness, firmness, lift, elasticity, and barrier functionThe next-gen formula also delivers up to 24 hours of hydration and supports skin barrier from first useKey Ingredients0.2% Bioactive Ceramides: Visibly smooth, firm, and support skin's moisture barrier5% Gransil Blur: Blurs the appearance of fine lines3.5% Shea Butter: Nourishes and reduces skin's water loss to help protect the moisture barrierResearch ResultsIn a 4-week clinical study of 20 people:Clinically proven to firm, plump and visibly lift in 28 daysClinically proven to strengthen skin barrier from first use100% saw a clinical improvement in 6 signs of aging (wrinkles, fine lines, plumpness, firmness, lift, elasticity, and barrier function)In a 12-week independent clinical study of 30 people, comparing the performance of the ingredient Ceramide NP at 0.2% vs a placebo formulation:Bioactive ceramides deliver up to 4X visible fine-line and wrinkle reductionItem 2641993How To UseSuggested Usage:-Use AM and PM.-Massage into face and neck.-Always finish with SPF if using in your AM routine.IngredientsWater (Aqua/Eau), Glycerin, Butyrospermum Parkii (Shea) Butter, C12-15 Alkyl Benzoate, Propanediol, Polysilicone-11, C10-18 Triglycerides, Caprylic/Capric Triglyceride, Pentaerythrityl Tetraisostearate, Cetearyl Olivate, Sorbitan Olivate, Cetyl Alcohol, Phenoxyethanol, Ceramide NP, Polyacrylate-13, Hydrogenated Polyisobutene, Ethylhexylglycerin, Polyglyceryl-10 Laurate, Ethylhexyl Palmitate, Laureth-12, Sorbitan Isostearate, HDI/Trimethylol Hexyllactone Crosspolymer, Polymethylsilsesquioxane, Citric Acid, Sodium Hydroxide.",
  "how_to_use": "Suggested Usage:-Use AM and PM.-Massage into face and neck.-Always finish with SPF if using in your AM routine.",
  "ingredients": [
    "Water (Aqua/Eau)",
    "Glycerin",
    "Butyrospermum Parkii (Shea) Butter",
    "C12-15 Alkyl Benzoate",
    "Propanediol",
    "Polysilicone-11",
    "C10-18 Triglycerides",
    "Caprylic/Capric Triglyceride",
    "Pentaerythrityl Tetraisostearate",
    "Cetearyl Olivate",
    "Sorbitan Olivate",
    "Cetyl Alcohol",
    "Phenoxyethanol",
    "Ceramide NP",
    "Polyacrylate-13",
    "Hydrogenated Polyisobutene",
    "Ethylhexylglycerin",
    "Polyglyceryl-10 Laurate",
    "Ethylhexyl Palmitate",
    "Laureth-12",
    "Sorbitan Isostearate",
    "HDI/Trimethylol Hexyllactone Crosspolymer",
    "Polymethylsilsesquioxane",
    "Citric Acid",
    "Sodium Hydroxide"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "moisturizer"
    ],
    "skin_type": [
      "mature"
    ],
    "finish": [
      "sheer",
      "long-wear",
      "creamy"
    ],
    "color": [
      "purple"
    ],
    "ingredients": [
      "ceramides"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "spf",
      "anti-aging",
      "repairing"
    ]
  },
  "reviews": {
    "product_id": "pimprod2052120",
    "total_reviews": 1022,
    "reviews": [
      {
        "review_id": 563503201,
        "rating": 5,
        "headline": "So good for dry skin.",
        "comments": "I am so happy this brand came to Ulta! I've been using this product for a while now as my nighttime moisturizer and am almost finished with my second jar. I have combo skin that leans dry even in the summer time, and this has worked WONDERS for me. It feels super moisturizing after application, and in the morning my skin feels plump and hydrated. The formula is thick but not too thick, and soaks in without feeling greasy. I'm really hoping this will save my skin in the winter. I will say there are times when if I apply this after a chemical exfoliant that my skin feels an subtle stinging effect, but it never lasts long and my skin still looks great in the morning.",
        "nickname": "Dani",
        "location": "MI",
        "created_date": 1758049009107,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 1,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        22,
        14,
        37,
        193,
        756
      ],
      "review_histogram": [
        22,
        14,
        37,
        193,
        756
      ],
      "rating_count": 1022,
      "review_count": 1022,
      "average_rating": 4.61,
      "recommended_ratio": 1.0,
      "media": [],
      "faceoff_positive": {
        "comments": "I was super hesitant to try this for the same reason many are/were... Shea Butter. I've suffered from breakouts my entire life, my skin is EXTREMELY prone to congestion and acne. However, ya girl is getting old now... I recently hit 30 and my combo skin definitely leans dry in the winter. I also use a lot of acids&actives (including retinol) in my routine which can make things even more dry/sensitive. This stuff is AMAZING. I was previously using the Omega Water Cream- good stuff but for me there was a fine line between feeling hydrated&feeling a bit \"greasy\" while using it. Even though it's marketed to be on the heavier side, I feel like the Bio-Active Ceramide Moisturizer is potentially lighter! If you need/prefer a heavier layer, it's super build able. I use a bit extra in the PM and the dry down is always relatively quick. I haven't had to touch a single barrier support product since using this. It's also allowed me to re-introduce a product that was effective but causing irritation- I feel like this is an awesome product for not only moisture but \"sandwiching\" harsh actives. I've had zero dryness, stinging nor irritation while using this. My skin is obviously more hydrated and glowy-from-within. The only reason I gave it 4 stars instead of 5 was because I personally don't enjoy creamy textures. I also think a tiny spatula in the box would be helpful and keep the jar a bit more hygienic. All in all- I love this. It doesn't feel heavy, super velvety application. Plays well with other serums/products. Rapidly repairs redness/irritation from a compromised skin barrier. And the best part... ZERO BREAKOUTS!!!! If the Omega Moisturizer is like a drink of water for the skin, the Bio-Active is a smoothie and I'm here for it!",
        "headline": "Don't let the Shea Butter scare you!!!!!",
        "rating": 4,
        "ugc_id": 554429680
      },
      "faceoff_negative": {
        "comments": "I received this as a gift in return for my review. WHAT IS IT The primary objective of this Bio-Active Ceramide Repairing formula is to effectively enhance the skin's texture & elasticity, while reinforcing the skin's protective barrier. It claims to be suitable for all skin types, however, I personally found it unsuitable for my highly sensitive skin. Moreover, if you have excessively dry skin that requires a lot of nourishing, this product may not to provide the desired level of hydration. INGREDIENTS The standout ingredient in this is bio-active Ceramide-NP. Ceramides play a vital role as lipids in forming the skin's inherent protective barrier. The term \"bio-active\" signifies that an ingredient has the ability to stimulate collagen synthesis & reduce skin inflammation. Its primary function is to restore & strengthen a compromised skin barrier. Moreover, the formulation incorporates Peptides, Hyaluronic Acid, & a blend of emollients like Shea Butter and Glycerin, all working together to enhance hydration & promote a plump appearance. Notably, this moisturiser is completely devoid of any fragrance. MY EXPERIENCE Regrettably, there are several ingredients in this product that have the potential to irritate individuals with sensitive skin (listed below). Every time I applied this, my skin had a negative reaction, resulting in a red rash & increased sensitivity. Sodium Hydroxide: can cause an unwanted reaction including: hives, rash, or itchy skin, flaking, dryness, & increased skin sensitivity. Citric Acid: can cause skin irritation & make certain skin conditions worse. Cetyl Alcohol: can cause irritation, stinging, burning, redness, or inflammation. Phenoxyethanol: a potential skin irritation or allergic reactions in individuals with sensitive skin. Ethylhexylglycerin: can be irritating to some, especially those who are predisposed to skin irritation (such as people who suffer from sensitive skin, eczema, or psoriasis). FINAL THOUGHTS This moisturiser potentially offers an excellent choice for individuals in search of hydration & restoration of the skin barrier, while still maintaining their signature affordable price range. Whether you are combating dryness, dehydration, or simply aiming to improve your skin's overall health, this moisturiser could be a good fit you. Always do a patch test first.",
        "headline": "Has potential!",
        "rating": 3,
        "ugc_id": 554432108
      },
      "name": "Bio-Active Ceramide Repairing and Plumping Moisturizer",
      "native_review_count": 1,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 1021,
      "locale": "en_US"
    }
  }
}