{
  "product_id": "pimprod2040143",
  "product_url": "https://www.ulta.com/p/i-create-definition-styling-foam-pimprod2040143",
  "extracted_at": "2025-09-23T04:14:53.827354+00:00",
  "product_name": "Innersense Organic BeautyI Create Definition Styling Foam",
  "brand": "Innersense Organic Beauty",
  "categories": [
    "Home",
    "Hair",
    "Styling Products",
    "Curl Enhancing"
  ],
  "category_keys": [
    "home",
    "hair",
    "styling-products",
    "curl-enhancing"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "28.00",
  "availability": "in_stock",
  "rating_avg": "3.8",
  "rating_count": "385",
  "images": [
    "https://media.ulta.com/i/ulta/2614274?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2614274?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2614274_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2614274_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2614274_alt03?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive BackInnersense Organic Beauty's I Create Definition is a firm hold styling foam to separate and set curls.",
  "details": "DetailsBenefitsDefines and separates curlsProvides strong, lasting holdSmooths frizz and tames flyawaysKey IngredientsAloe VeraAmaranth Seed ExtractPequi OilFormulated WithoutPhthalatesEthoxylatesSulfatesSilicones1,4 dioxaneParabensPetro compoundsPropylene and butylene glycolPEGMEATEAMIAEDTA artificial dyesSynthetic fragrancesItem 2614274How To UseTake a deep breath and become centered. Dispense 1-2 pumps into hands, awaken by massaging product between palms then rake through or scrunch into wet hair. Air dry for a natural finish or diffuse for maximum defined texture.IngredientsWater/Aqua/EAU, Sucrose, Pullulan, Aloe Barbadensis Leaf Juice*, Glycerin*, Caprylyl/Capryl Glucoside, Galactoarabinan, Pyrus Malus (Apple) Fruit Extract, Potassium Sorbate, Sodium Levulinate, Citric Acid, Lavandula Angustifolia (Lavender) Oil, Amaranthus Caudatus Seed Extract, Sodium Gluconate, Phospholipids, Linum Usitatissimum (Linseed) Seed Oil, Glycine Soja (Soybean) Oil, Sodium Benzoate, Caryocar Brasiliense (pequi) Fruit Oil, Linaloolᵻ.*Certified OrganicShipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Take a deep breath and become centered. Dispense 1-2 pumps into hands, awaken by massaging product between palms then rake through or scrunch into wet hair. Air dry for a natural finish or diffuse for maximum defined texture.",
  "ingredients": [
    "Water/Aqua/EAU",
    "Sucrose",
    "Pullulan",
    "Aloe Barbadensis Leaf Juice*",
    "Glycerin*",
    "Caprylyl/Capryl Glucoside",
    "Galactoarabinan",
    "Pyrus Malus (Apple) Fruit Extract",
    "Potassium Sorbate",
    "Sodium Levulinate",
    "Citric Acid",
    "Lavandula Angustifolia (Lavender) Oil",
    "Amaranthus Caudatus Seed Extract",
    "Sodium Gluconate",
    "Phospholipids",
    "Linum Usitatissimum (Linseed) Seed Oil",
    "Glycine Soja (Soybean) Oil",
    "Sodium Benzoate",
    "Caryocar Brasiliense (pequi) Fruit Oil",
    "Linaloolᵻ.*Certified Organic"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "hair",
      "haircare"
    ],
    "product_type": [
      "cleanser"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "sheer",
      "creamy",
      "oil",
      "foam"
    ],
    "ingredients": [
      "organic"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "organic",
      "natural"
    ]
  },
  "reviews": {
    "product_id": "pimprod2040143",
    "total_reviews": 385,
    "reviews": [
      {
        "review_id": 560347477,
        "rating": 5,
        "headline": "Works REALLY well if you want a strong cast!",
        "comments": "I prefer my hair to have a strong cast, so I layered this foam between I Create Curl Memory and I Create Hold and it works really well! But if you DON'T want a strong, crunchy cast, either use Innersense I Create Lift instead or try layering one of Innersense's cream stylers or the leave in underneath to soften the hold",
        "nickname": "Dawn",
        "location": "Georgia",
        "created_date": 1755397688448,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559234083,
        "rating": 5,
        "headline": "EXTRA FIRM HOLD",
        "comments": "I have thick coily hair and i love this lroduct paired with i create hold gel. This product has a very firm hold and a little goes a long way. I pair a teeny tiny bit of this product with my gel for curls that will hold for 5+ days. It does take a bit of trial and error but the hold and definition i get is top tier.",
        "nickname": "Alyoop",
        "location": "Los Angeles",
        "created_date": 1754310532088,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558786450,
        "rating": 1,
        "headline": "Be careful if you have endocrine issues",
        "comments": "I really like this product and been using for a few months but found the brain fog and neck muscle pain was increasing. This has Glycine Soja (Soybean) Oil.   I have stopped using for a week now and feel better.  I have issues with soy and flaxseed.",
        "nickname": "PJ",
        "location": "Oregon",
        "created_date": 1753921344139,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 2
      },
      {
        "review_id": 557989925,
        "rating": 1,
        "headline": "Hold for days…and dry for days too!",
        "comments": "This is by far the strongest hold in a mousse I have ever seen! With that hold comes a price…extreme dryness. This is a very firm holding mousse, coupled with the fact that it will dry your hair to the point where you are gonna wash it out. I have coily 3c/4a afro-ethnic hair for reference. I would not recommend this mousse as it will suck your curls completely dry.",
        "nickname": "Phx40",
        "location": "Phoenix",
        "created_date": 1753151470122,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556074731,
        "rating": 1,
        "headline": "Disappointed",
        "comments": "This product made my hair stringy and tangled. I wanted to love this, but not for my hair",
        "nickname": "Tanya",
        "location": "Claremont",
        "created_date": 1751311912648,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555894695,
        "rating": 5,
        "headline": "My go to product!",
        "comments": "I love this product I have fine curly/wavy hair I tried many mousses for my hair they didnt have enough hold. I tried many gels they either didnt have enoguh hold or weighed down my fine hair. Curl creams were way to heavy. This is perfect lots of hold cruelty free and clean ingredients. Omly complaint is it is pricey and definitely drying if you dont use a moisturizing leave in with it.",
        "nickname": "Mckenzie",
        "location": "Philadelphia, PA",
        "created_date": 1750896632319,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553429324,
        "rating": 1,
        "headline": "Horrible",
        "comments": "My hair looks its worst when i use this product. Ive had it for a while thinking if i mix it with different products or style my hair a certian way then maybe the product will deliver what it promises, but no. Every time i use it my hair is rock hard, stiff, sticky, and has no curl. Ive tried so many times to like this product but its just awful.",
        "nickname": "Shelly",
        "location": "Austin",
        "created_date": 1747367893849,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551790331,
        "rating": 5,
        "headline": "I would buy this product again and again!",
        "comments": "Strong hold which is perfect for my 4a curls and coils.  My style lasts for many days.  Love this stuff, I usually have to use many products and strong gel to achieve same look.  Thanks Innersense!",
        "nickname": "Dee",
        "location": "Denver, CO",
        "created_date": 1744775696992,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543429414,
        "rating": 5,
        "headline": "the best for fine curls",
        "comments": "After my favorite gel got discontinued my hairdresser mentioned this product. Now just a warning, it's like a foam like gel. A LITTLE goes a long way. I wouldn't use more than 4 pumps on SOAKING wet hair. The results are amazing and I get lasting definition for my fine toddler silky hair.",
        "nickname": "Tasha",
        "location": "Oregon",
        "created_date": 1737117741137,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541194960,
        "rating": 3,
        "headline": "okay",
        "comments": "makes your hair super hard and do not use a blow dryer with it. it'll make it worse some how. felt like I just sprayed hair spray all over my hair.",
        "nickname": "jp",
        "location": "wisconsjn",
        "created_date": 1734397316166,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541109831,
        "rating": 5,
        "headline": "For those who think this is too crispy, READ THIS",
        "comments": "This product is awesome IF you use it right. As some mention in reviews, it's very firm hold and can be crunchy or crispy if you overdo it. The perfect hack though is to combine this in a roughly 1:1 ratio with I create lift foam. Mix one or two pumps of each in your palm and then apply in sections. This combo gives amazing volume with good definition that is still pliable, touchable, and flexible. The combination of these two together is so good. But alone, this product is definitely not my favorite and I know I've used too much when my hair breaks and snaps as I tousle it.",
        "nickname": "Molly",
        "location": "AZ",
        "created_date": 1734289847674,
        "bottom_line": "Yes",
        "helpful_votes": 25,
        "not_helpful_votes": 0
      },
      {
        "review_id": 539409532,
        "rating": 1,
        "headline": "A dry, gluey mess",
        "comments": "I ruined my hair by using this stuff! It's so filthy and sticky and hard that I have to wash it again the next day to get this stuff out.",
        "nickname": "Jbee",
        "location": "Austin, TX",
        "created_date": 1733932534674,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 4
      },
      {
        "review_id": 539317461,
        "rating": 3,
        "headline": "A little reeeeeeally goes a long way",
        "comments": "I've been using innersense for years and I absolutely love it. This product was not as user friendly at first glance. Bring a foam, most would think you would need more than the recommended amount. Not with this one!!! It says 1-2 pumps and I believe it. At first, I did maybe 8, but the cast in my hair would not crumch out, no matter how much oil or scrunching I did. Disaster. So I started using less and less and realized the 1-2 pump recommendation is actually the perfect amount. I paired it with the leave in from innersense and a little bit of curly cream to control the frizz and only 1-2 pumps. Brushed through, diffused, and scrunched out without any issues. Curls looked clean and defined but not overly saturated in product. Needless to say, I'll never second guess their directions!",
        "nickname": "V20Toria",
        "location": "Miami, FL",
        "created_date": 1733832454711,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 536874263,
        "rating": 1,
        "headline": "Total nightmare",
        "comments": "Was excited to try this on my 3A/B curls. HUGE MISTAKE! Waste of a wash n go! I echo the previous review about scarecrow crispy crunchy. This stuff is like burnt sugar that dries into hard candy. My hair was a mess, couldn't get my fingers, a comb, nothing through it! ended up having to wash it all out! Stay far away!",
        "nickname": "Kiki",
        "location": "NC",
        "created_date": 1730060835409,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 3
      },
      {
        "review_id": 533654140,
        "rating": 1,
        "headline": "Don't do it",
        "comments": "You know how hairspray leaves you hair feeling a bit gritty? This leaves the same feeling. Unusally im able to run my fingers through my curls with no problem but with this product my fingers kept getting caught in tangles. And the gritty dry feeling was the worse.",
        "nickname": "Jessimar",
        "location": "Odessa tx",
        "created_date": 1726798877058,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 2
      },
      {
        "review_id": 531745140,
        "rating": 5,
        "headline": "Good for my tight coils",
        "comments": "I am Caucasian and have type 4C curly hair. It is a challenge. The inner sense foam mixed with weed. Bad advanced climate control makes a perfect combination for my coils. I use a very small amount of climate control with three pumps of inner sense foam.  This defines my curls and does not weigh them down, so I still have a volume with definition.",
        "nickname": "",
        "location": "Georgia",
        "created_date": 1725276014020,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 8
      },
      {
        "review_id": 527325451,
        "rating": 3,
        "headline": "Some positives",
        "comments": "I have frizzy, curly hair and live in fl (steambath central).  For some reason this makes my hair look great on the second day (soft, defined, not flat). On the first day, though, it keeps my hair wet four at least four hours which is much longer than when I use regular mousse. When it dries the curls are bouncy, but still have a lot of frizz. I don't ever get any flakes like some reviews mentioned though. I do have to use a lot more than two pumps to properly work it through but have long and thick hair",
        "nickname": "",
        "location": "Fl",
        "created_date": 1723684097740,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 526396932,
        "rating": 4,
        "headline": "Good medium hold foam",
        "comments": "I started using this after my stylist recommended it to me; she only does curly hair. I have very fine but very curly hair. For styling, I use it in combination with Innersense's \"I Create Volume\" and now \"I Create Lift\" Volumizing Foam (the latter only on my roots, then raked through the rest of the length of my hair). I thought I needed only 1 or 2 pumps but I would end up with stringy, frizzy curls still. So I asked my stylist, what to do, she said you're not using enough product. So now I use 2 pumps on the underside of my hair, then another 2-3 on the top side, finger combed through. If your hair is longer, you need to use more. Mine is currently slightly shorter than chin length when it's curly and dry.\n\nI give it 4 stars because while I really like it, it's not really a firm hold like it claims. It's more of a medium hold, which is fine, but it also means I need an additional product for more hold.",
        "nickname": "Robyn",
        "location": "Washington DC",
        "created_date": 1722860574344,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 524219459,
        "rating": 1,
        "headline": "I would NOT buy this product again!",
        "comments": "I'm not sure I've ever bought a mousse or gel that made my hair feel like this. I tried using their cream and leave-in to help, but the hold is still so strong. My hair feels like crunchy ramen noodles. Their I Create Lift is way better for me, but depending on the weather that sometimes is not enough hold.",
        "nickname": "Tw",
        "location": "TX",
        "created_date": 1720019035542,
        "bottom_line": "No",
        "helpful_votes": 6,
        "not_helpful_votes": 6
      },
      {
        "review_id": 514279600,
        "rating": 4,
        "headline": "Love, with one complaint",
        "comments": "I love this mousse. It holds well without being crunchy. The issue is it doesn't travel well at all. The bottle leaks really bad and makes a mess. I travel a fair amount so that part is a let down.",
        "nickname": "Megan",
        "location": "Alabama",
        "created_date": 1715909925181,
        "bottom_line": "Yes",
        "helpful_votes": 7,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 34,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2040143/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "hairtype",
          "name": "Hair Type",
          "type": "tag",
          "values": [
            {
              "label": "Very Curly Hair",
              "count": 10
            },
            {
              "label": "Wavy Hair",
              "count": 3
            }
          ],
          "display_values": [
            "Straight Hair",
            "Very Curly Hair",
            "Wavy Hair"
          ]
        }
      ],
      "rating_histogram": [
        62,
        45,
        28,
        29,
        221
      ],
      "review_histogram": [
        62,
        45,
        28,
        29,
        221
      ],
      "rating_count": 385,
      "review_count": 385,
      "average_rating": 3.78,
      "recommended_ratio": 0.69,
      "media": [],
      "faceoff_positive": {
        "comments": "Innersense I Create Definition foam has quickly become my favorite hair product since I purchased it two months ago and has taken the place of gel in my wash day routines because there really is no need for gel with this foam. It is also very concentrated and strong, so you don't need to use very much at all like you do with other foams. Don't be afraid to try this due to some of the reviews - I'm hoping people read my review with my usage tips that have made my wash days incredibly consistent with very good results every single time. I have very fine, low density, looser curls (mostly 2C on my top layer, and 3A-3B on my lower layer) and my hair is cut short to about an inch past my jaw. TL/DR: This has worked best for me by starting with a moisturizing base of leave-in or low-hold curl cream/serum, followed by a light foam (can skip this step), followed by a very small amount of Innersense I Create Definition foam emulsified first in your hands, followed by I Create Lift foam (do not skip this step) and then diffuse.   Detailed: I have experimented with different products paired with this/product order/application and the way I found to use Innersense I Create Definition foam that works for my fine hair is to be sure to have a moisture base or it can be a bit drying - the best has been using a light creamy leave-in, but I have tried a couple curl creams instead of leave-in as well. Then I use a small amount of light foam (my favorite to use as the first foam is by another brand but I did like Innersense I Create Lift foam here as well). I have also done a wash day skipping this step which was successful, but I prefer this way. I then form my curl clumps by brushing through and scrunching. I scrunch with a microfiber towel to remove a little water, but make sure my hair is still wet. I then use about a quarter-sized amount of the Innersense I Create Definition per side and a little more for the back, emulsified first in my hands as per the instructions, and lightly glaze it over all my curls and then scrunch so everything is coated. Lightly spraying my hands with water before this step has also worked well. IMPORTANT LAST STEP if you have had trouble with scrunching out the cast with Innersense I Create Definition or any hard hold gels: Glaze a small amount of Innersense I Create Lift foam (preferred when using I Create Definition) or another lighter hold foam on top. I then diffuse. I do NOT use any gel when using the I Create Definition foam - it replaces gel in my routine. When I tried using a gel in addition to I Create Definition foam (I tried I Create Hold which is my favorite gel, as well as another brand's lighter hold gel), It was too much.   This routine is the best I've tried since I started wearing my natural curls two years ago - my curls are super defined and the hold lasts with minimal refreshing needed. After other hair product routines in the past, my hair would be pretty stretched/wild/flat after sleeping, even with sleep protection, but this has mostly eliminated that issue. Also, I got my hair cut a couple days ago and my curly cut hairstylist even commented on how much more curly my hair was looking and that it had more volume than usual. I truly can't rave about this foam enough!",
        "headline": "Favorite hair product for my super fine curls!",
        "rating": 5,
        "ugc_id": 536521217
      },
      "faceoff_negative": {
        "comments": "I try my best not to speak in hyperbole, but I can legitimately say this is *the* worst hair product I've ever used. I am literally typing this out before I hop in the shower to rinse this foam out of my hair. I made sure to read the negative reviews before purchasing this, but the idea of having a curl enhancing foam that wouldn't aggravate my seborrheic dermatitis made me take the risk. And oh man the risk did not pay off.     Yesterday as I was applying the foam, I noticed that it did not feel moisturizing and was not viscous. I saw certain parts of my hair begin to frizz up, leaving me with no definition, while other parts of my hair were able to retain definition. I then noticed how sticky the foam is, literally the skin on my neck stuck together. To make this experience even worse, I noticed after diffusing my hair, the defined parts were very very hard, and the frizzy parts were still wet.    Now a day later, my hair is crunchy to the touch, you can literally hear my hair stretching out as I pull on a strand because of how crispy the foam made my hair. Not only that, my hair is so dry and hard, the rat tail comb I usually use to part my hair in sections cannot go through my hair. I am literally nervous about attempting this because I know parts of my hair at the root will break even though I dampen my hair with water.    I am so disappointed. I can't believe this product is still being sold, when it needs to be pulled and reformulated. Something in this foam is not working and I don't believe that it is healthy for anyone's hair strands long term. I am very happy I bought the smallest size to try out and didn't waste my money on the regular sized bottle.    To give some of you background, I style my hair by doing wash and goes and I am very low maintenance. I use a good quality shampoo and conditioner, and a curly enhancing foam, that is all. I've used foams from The Doux, Design Essentials, The Pattern, Mielle Organics and I have not had any issues with moisture, crunchiness or major tangling.    Innersense needs to go back to the drawing board cause this is not it. I appreciate the efforts in making a clean, scalp and hair friendly product, but what is being offered here is the complete opposite.",
        "headline": "omg",
        "rating": 1,
        "ugc_id": 536521419
      },
      "name": "I Create Definition Styling Foam",
      "native_review_count": 34,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 351,
      "locale": "en_US"
    }
  }
}