{
  "product_id": "pimprod2044177",
  "product_url": "https://www.ulta.com/p/i-create-curl-memory-gelee-pimprod2044177",
  "extracted_at": "2025-09-23T04:14:51.202337+00:00",
  "product_name": "Innersense Organic BeautyI Create Curl Memory Gelee",
  "brand": "Innersense Organic Beauty",
  "categories": [
    "Home",
    "Hair",
    "Styling Products",
    "Curl Enhancing"
  ],
  "category_keys": [
    "home",
    "hair",
    "styling-products",
    "curl-enhancing"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "28.00",
  "availability": "in_stock",
  "rating_avg": "4.3",
  "rating_count": "183",
  "images": [
    "https://media.ulta.com/i/ulta/2622690?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2622690?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2622690_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2622690_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2622690_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2622690_vid01/thumbs/d4ae4e0c-a2ad-4656-8b3d-326353f46027?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeSustainable PackagingGive BackInnersense Organic Beauty's I Create Curl Memory Gelee is a styling gelee for long lasting, hydrated curls.",
  "details": "DetailsBenefitsGenerous slip for easy applicationFlexible and soft castCreate smooth and elongated curlsKey IngredientsBamboo Extract promotes style retention and nourishes hair with strengthening minerals that keep strands resilient against breakageSugar Complex provides hold, amplifies thickness and improves manageabilityFormulated WithoutPhthalatesEthoxylatesSulfatesSilicones1,4 dioxaneParabensPetro compoundsPropylene and butylene glycolPEGMEATEAMIAEDTA artificial dyesSynthetic fragrancesItem 2622690How To UseTake a deep breath and become present. Section wet hair. Distribute 1 to 2 pumps into hands and awaken the formula by rubbing palms together. Apply from roots to ends. Diffuse or air dry to define texture and style. Your beautifully styled hair is a reflection of you.IngredientsWater/Aqua/EAU, Sucrose, Xanthan Gum, Glycerin, Aloe Barbadensis Leaf Juice*, Oryza Sativa (Rice) Extract*, Phyllostachys Bambusoides (Bamboo) Extract, Aspalathus Linearis Leaf Extract*, Chamomilla Recutita (Matricaria) Flower Extract*, Eucalyptus Globulus Leaf Extract*, Ginkgo Biloba Leaf Extract*, Honey Extract*, Hydroxypropyltrimonium Honey, Propanediol, Capryloyl Glycerin/Sebacic Acid Copolymer, Diheptyl Succinate, Potassium Sorbate, Sodium Levulinate, Citric Acid, Caprylic/Capric Triglyceride, Citrus Aurantium Dulcis (Orange) Peel Oil Expressed, Sodium Gluconate, Leuconostoc/Radish Root Ferment Filtrate, Sorbic Acid, Limonene†. *Certified Organic †A natural component of essential oilsShipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Take a deep breath and become present. Section wet hair. Distribute 1 to 2 pumps into hands and awaken the formula by rubbing palms together. Apply from roots to ends. Diffuse or air dry to define texture and style. Your beautifully styled hair is a reflection of you.",
  "ingredients": [
    "Water/Aqua/EAU",
    "Sucrose",
    "Xanthan Gum",
    "Glycerin",
    "Aloe Barbadensis Leaf Juice*",
    "Oryza Sativa (Rice) Extract*",
    "Phyllostachys Bambusoides (Bamboo) Extract",
    "Aspalathus Linearis Leaf Extract*",
    "Chamomilla Recutita (Matricaria) Flower Extract*",
    "Eucalyptus Globulus Leaf Extract*",
    "Ginkgo Biloba Leaf Extract*",
    "Honey Extract*",
    "Hydroxypropyltrimonium Honey",
    "Propanediol",
    "Capryloyl Glycerin/Sebacic Acid Copolymer",
    "Diheptyl Succinate",
    "Potassium Sorbate",
    "Sodium Levulinate",
    "Citric Acid",
    "Caprylic/Capric Triglyceride",
    "Citrus Aurantium Dulcis (Orange) Peel Oil Expressed",
    "Sodium Gluconate",
    "Leuconostoc/Radish Root Ferment Filtrate",
    "Sorbic Acid",
    "Limonene†. *Certified Organic †A natural component of essential oils"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "hair",
      "haircare"
    ],
    "product_type": [
      "cleanser"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "sheer",
      "creamy",
      "gel",
      "oil"
    ],
    "ingredients": [
      "organic",
      "natural"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "organic",
      "natural"
    ]
  },
  "reviews": {
    "product_id": "pimprod2044177",
    "total_reviews": 183,
    "reviews": [
      {
        "review_id": 563385542,
        "rating": 5,
        "headline": "Just what hair needs",
        "comments": "This is what I use after washing hair.  It holds my hair fine 3-4 days without having to te-apply.",
        "nickname": "Carenda",
        "location": "Durham,NC",
        "created_date": 1757905133418,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559211237,
        "rating": 2,
        "headline": "Causes flaking and leaves hair stringy",
        "comments": "Doesn't play well with my leave-in products because the negative charge Xantham gum reacts with other ingredients and causes flaking. It also leaves my hair stringy and doesn't improve after day 2. Might work for you if you don't need leave-in.",
        "nickname": "Allison",
        "location": "New York, NY",
        "created_date": 1754253088082,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 2
      },
      {
        "review_id": 559181926,
        "rating": 5,
        "headline": "Hold, hold, hold!!!",
        "comments": "My stylist used this gel at my last visit and loved it. You have to know how to style with this gel, just like any other very strong hold gel. For example, I add my leave in conditioner (my hair doesn't like creams), a base light gel. Then; when styling with something like a denman brush, I add this gel to every section as I go. If finger raking, I just add this gel at the end with praying hands and scrunch.  \n\nYou can see my results in the pictures. I washed today and didn't have much time to use my denman brush so, instead, I finger raked and scrunched. Then I plopped with a T-shirt while I did my makeup and diffused after about 15 minutes. Most times I go straight to diffusing.  \n\nMy daughter, who also has curly hair (2b/3a) also liked this gel so will continue to buy it. :-)",
        "nickname": "Virginia",
        "location": "Cupertino, CA",
        "created_date": 1754178995889,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558152154,
        "rating": 5,
        "headline": "Hold, hold, hold",
        "comments": "I typically like gels that leave a good cast on my curly hair. I recently stopped using Garnier Pure Clean as their ingendients changed and I can't get it to work any longer.\n\nI tried this gel as my hairstylist used it on me at my last cut and I fell in love with the results. OH, there's the cast I haven't achieved in quite sometime. Actually more than I bargained.\n\nA little goes a long way but I didn't know so used a little more and left a lot of cast. Usually I have to touch up my hair on 2nd day, not today. Still, I know next time to use a little less. The weather where I live is dry so I always need hold.\n\nI will be using this alternating with another (less hold) gel when I don't need that much if I am just staying home. But this will be a keeper for me.",
        "nickname": "VP",
        "location": "Cupertino, CA",
        "created_date": 1753396038239,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556975776,
        "rating": 1,
        "headline": "Not again",
        "comments": "Just because it's a clean brand doesn't need the ingredients are going to work well with your hair type. My hair type is medium length, medium hair shaft, thick and dry because I live on the West Coast. And even though the climate is dry and has little humidity but dry heat. This product does terrible for my hair. I had hope for it but with all the oils in it it doesn't really do What it's supposed to and there's botanicals like lavender oil in it. Well it doesn't cause me of itchy my scalp it had to return it because I couldn't break the cast to wear my hair ended up being soft. Does it hold the curl? Yes absolutely but the drying effect was not pleasant.",
        "nickname": "Nic",
        "location": "West coast",
        "created_date": 1752299947246,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555995013,
        "rating": 5,
        "headline": "Left my hair feeling soft and my curls look so good",
        "comments": "For some reason my hair dried super fast using this product, left my hair soft and my curls have lasted a long time.",
        "nickname": "Alondra",
        "location": "Denver",
        "created_date": 1751120639521,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553503790,
        "rating": 5,
        "headline": "Better than expected",
        "comments": "I was worried that my hair wasn't the right e tire for this product. I was so wrong. As soon as I put it in my hair, it started curling up better than any product has affected my hair. My favorite part has to be how fast it made my hair dry tho.",
        "nickname": "Sara",
        "location": "Jamestown NY",
        "created_date": 1747562030502,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552486666,
        "rating": 3,
        "headline": "STRONG hold (but sensitive skin beware)",
        "comments": "STRONGEST hold I've found, AMAZING for frizz, or creating a curl cast/gelled back short styles (air dries to a little \"crispy\" but workable and high hold lasting all day). However… wearing this in hot humid weather on vacation made my forehead breakout.",
        "nickname": "Alex",
        "location": "Miami, CA",
        "created_date": 1745640207835,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549729104,
        "rating": 3,
        "headline": "revised review",
        "comments": "As I cultivate my curls, I'm understanding more and more what a product should deliver. There are a lot of products out there and a lot of trial and error, which gets expensive. At Innersense's price point, their products should be excellent as well as clean. This is the third time I have reviewed this product. For reference my hair is 2a-3a, thick, graying, undamaged, on the drier side, and prone to frizz. At first, on wash day, I loved I Create Curl Memory Gelee. Now, here is what I know: 1) My waves/curls look great at first. 2) It's a little difficult to completely break the cast. A little almost always remains. 3) The hold is pretty good, but doesn't really last. 4) The frizz control is fair at first and non-existent within hours. \nI keep trying different combinations, but in the end, I would not purchase this again, especially for what it delivers for the cost. The search continues.",
        "nickname": "Tracey",
        "location": "Redmond, WA",
        "created_date": 1742752437870,
        "bottom_line": "No",
        "helpful_votes": 14,
        "not_helpful_votes": 1
      },
      {
        "review_id": 547703397,
        "rating": 3,
        "headline": "revised review",
        "comments": "I left a previous review and this is a slight modification. For me, this is a good gel in that it does offer moderate hold, but even using a small amount of product with a lot of water, the caste is a little difficult to \"scrunch out,\" and stays a little crispy. I have a lot of frizz at my crown, but don't like when that area feels crispy, so I can't really apply this product there. Still haven't found the Holy Grail.",
        "nickname": "Tracey",
        "location": "WA",
        "created_date": 1741117634524,
        "bottom_line": "No",
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 545967074,
        "rating": 2,
        "headline": "Not the best.",
        "comments": "I tried this gel and it combines with pretty much no leave ins except for one. When I tried the products, Day 1 hair was actually solid. But going onto Day 2, my hair was flaking and very dry. It felt brittle to the touch. The only good thing was the hold. I won't be repurchasing.",
        "nickname": "Gannon",
        "location": "Los Angeles, CA",
        "created_date": 1738815282934,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 3
      },
      {
        "review_id": 544329253,
        "rating": 4,
        "headline": "Like the cast",
        "comments": "I just purchased the Color Awakening Hairbath, Color Radiance Conditioner, and the I Create Curl Gel at the recommendation of my curly hair stylist.  So, far, the gel is the only product I am happy with.  It creates a good cast on my hair, which I personally like.  However, it does not control the \"halo\" of frizzles on the very top of my head.  I often have to reapply the next day in order to keep those down.  Also, along with the shampoo and conditioner it is VERY heavy.  I am going to try just using the get with my old shampoo and conditioner, and see if I still like it.  We'll see...",
        "nickname": "Julie",
        "location": "Birmingham, AL",
        "created_date": 1738007509865,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 544122654,
        "rating": 5,
        "headline": "Longest lasting curls of my life",
        "comments": "I absolutely love this! I have 3a/3b curls that have thinned over the years, but with this gel the volume came back! Im currently on day 7, no refreshing and my hair still looks great with so much more volume. Be prepared for the hard cast though! I love it though because that means my hair lasts longer, I'm obsessed. No flaking either so this is now my go to.",
        "nickname": "Elisa",
        "location": "Indiana",
        "created_date": 1737741138390,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543220776,
        "rating": 2,
        "headline": "Heartbreaking :(",
        "comments": "I have fine, mid-back length coily hair & have tried a lot of gels over the years. This is the only one that keeps my hair defined for days without making it crunchy, stringy, or weighed down. It holds up through humidity & refresh days. However, I get painful cysts & red, rashy skin wherever it touches me. I subtracted things from my routine to be sure, & unfortunately it's definitely this gel. :(  Innersense foam & conditioner cause a similar issue. I wish they'd make a sensitive line or something free of strong plant oils, because their products work so well. If you don't have reactive skin, this is definitely worth the money.",
        "nickname": "charl22",
        "location": "San Jose, CA",
        "created_date": 1737041177750,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542690562,
        "rating": 5,
        "headline": "Love this!",
        "comments": "For reference, I have thin and fine 2c/3a hair. I used this product alone with a heat protectant spray, and hover diffused until dry. Dont let the cast this product creates scare you! I scrunched it out with a light hair oil. My hair gets easily weighed down by most gels/mousses, and this felt weightless but it held my curl perfectly. Love this sm!",
        "nickname": "Catie",
        "location": "Chicago",
        "created_date": 1736698691993,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542628649,
        "rating": 3,
        "headline": "Hard caste",
        "comments": "The gel holds your curls well but it creates that crunchy look that I am not fond of   It works better for me when i combine it with a curl cream- mix the two together and then apply.",
        "nickname": "Brydie",
        "location": "Chicago",
        "created_date": 1736545579522,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542291568,
        "rating": 5,
        "headline": "Long lasting hold",
        "comments": "As someone with wavy/thick hair, I'm so excited to have found THE product that can keep my curls defined for 4-6 days. I use this gel outside the shower after I've applied I Create Hold in the shower.",
        "nickname": "Andy",
        "location": "Akron, OH",
        "created_date": 1736129856817,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542117082,
        "rating": 5,
        "headline": "Amazing gel",
        "comments": "This reminds me of a mix between I Create Hold & I Create Volume; its thick enough to coat yiur hair strands but loose enough or has wnough slip to where you dont have to use a lot to cover a lot. My hair is bob/neck length, i am transitioning from processed to natural and this has helped a wirh defining my curls ans adding some volume too. I always start with a little before i adjust and add more; definitely a produt that highlights \"a little goes a long way\". Havent seen how it holds up in guam humidity, I'm guessing it won't hold up well since it has glycerin.",
        "nickname": "Shiela E",
        "location": "Guam",
        "created_date": 1735789288868,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542005701,
        "rating": 5,
        "headline": "Amazing product!",
        "comments": "I love this product! Can you please carry more of this brand in your Vacaville store?",
        "nickname": "Trini",
        "location": "Vacaville Ca",
        "created_date": 1735576332775,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 541727223,
        "rating": 5,
        "headline": "Best gel ever!",
        "comments": "I was skeptical about this making a good enough gel cast for me, but it is the absolute best and it really goes a long way so great quality for a reasonable price.",
        "nickname": "Michele",
        "location": "Northeast Georgia",
        "created_date": 1735044224050,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 47,
      "pages_total": 3,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2044177/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "hairtype",
          "name": "Hair Type",
          "type": "tag",
          "values": [
            {
              "label": "Very Curly Hair",
              "count": 10
            },
            {
              "label": "Wavy Hair",
              "count": 7
            },
            {
              "label": "Straight Hair",
              "count": 1
            }
          ],
          "display_values": [
            "Straight Hair",
            "Very Curly Hair",
            "Wavy Hair"
          ]
        }
      ],
      "rating_histogram": [
        8,
        18,
        17,
        17,
        123
      ],
      "review_histogram": [
        8,
        18,
        17,
        17,
        123
      ],
      "rating_count": 183,
      "review_count": 183,
      "average_rating": 4.25,
      "recommended_ratio": 0.76,
      "media": [
        {
          "id": "559181927",
          "review_id": 559181926,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/smmiheuvhfbxt952lfvt.jpg",
          "headline": "Hold, hold, hold!!!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Virginia",
          "created_date": 1754178995889
        },
        {
          "id": "559181934",
          "review_id": 559181926,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/dqk98bc71yodh8dytjw3.jpg",
          "headline": "Hold, hold, hold!!!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Virginia",
          "created_date": 1754178995889
        },
        {
          "id": "559181833",
          "review_id": 559181926,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/zpcfd4c0pobdp6jcjboh.jpg",
          "headline": "Hold, hold, hold!!!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Virginia",
          "created_date": 1754178995889
        },
        {
          "id": "555995064",
          "review_id": 555995013,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/dz2x3rpseckd5lyy676h.jpg",
          "headline": "Left my hair feeling soft and my curls look so good",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Alondra",
          "created_date": 1751120639521
        },
        {
          "id": "555995055",
          "review_id": 555995013,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/rt1phazvsfjil0hndv6k.jpg",
          "headline": "Left my hair feeling soft and my curls look so good",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Alondra",
          "created_date": 1751120639521
        },
        {
          "id": "555995054",
          "review_id": 555995013,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/az6z3fd25rqh7s2aj8ma.jpg",
          "headline": "Left my hair feeling soft and my curls look so good",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Alondra",
          "created_date": 1751120639521
        },
        {
          "id": "555995023",
          "review_id": 555995013,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/lcowjoo3dekirdnvj6ub.jpg",
          "headline": "Left my hair feeling soft and my curls look so good",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Alondra",
          "created_date": 1751120639521
        },
        {
          "id": "512476445",
          "review_id": 512476457,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/g5bvrxpi4vm6fqvbs6n8.jpg",
          "headline": "Awesome product but………..",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Juicy curls!",
          "nickname": "LV_Curlzzzzz",
          "created_date": 1714347741227
        },
        {
          "id": "512476386",
          "review_id": 512476457,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ufibsfhkxxwz5n5xdxwo.jpg",
          "headline": "Awesome product but………..",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "A winning Duo",
          "nickname": "LV_Curlzzzzz",
          "created_date": 1714347741227
        }
      ],
      "faceoff_positive": {
        "comments": "My stylist used this gel at my last visit and loved it. You have to know how to style with this gel, just like any other very strong hold gel. For example, I add my leave in conditioner (my hair doesn't like creams), a base light gel. Then; when styling with something like a denman brush, I add this gel to every section as I go. If finger raking, I just add this gel at the end with praying hands and scrunch.  \n\nYou can see my results in the pictures. I washed today and didn't have much time to use my denman brush so, instead, I finger raked and scrunched. Then I plopped with a T-shirt while I did my makeup and diffused after about 15 minutes. Most times I go straight to diffusing.  \n\nMy daughter, who also has curly hair (2b/3a) also liked this gel so will continue to buy it. :-)",
        "headline": "Hold, hold, hold!!!",
        "rating": 5,
        "ugc_id": 559181926
      },
      "faceoff_negative": {
        "comments": "As I cultivate my curls, I'm understanding more and more what a product should deliver. There are a lot of products out there and a lot of trial and error, which gets expensive. At Innersense's price point, their products should be excellent as well as clean. This is the third time I have reviewed this product. For reference my hair is 2a-3a, thick, graying, undamaged, on the drier side, and prone to frizz. At first, on wash day, I loved I Create Curl Memory Gelee. Now, here is what I know: 1) My waves/curls look great at first. 2) It's a little difficult to completely break the cast. A little almost always remains. 3) The hold is pretty good, but doesn't really last. 4) The frizz control is fair at first and non-existent within hours. \nI keep trying different combinations, but in the end, I would not purchase this again, especially for what it delivers for the cost. The search continues.",
        "headline": "revised review",
        "rating": 3,
        "ugc_id": 549729104
      },
      "name": "I Create Curl Memory Gelee",
      "native_review_count": 47,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 136,
      "locale": "en_US"
    }
  }
}