{
  "product_id": "pimprod2005754",
  "product_url": "https://www.ulta.com/p/retinol-vitamin-c-moisturizer-pimprod2005754",
  "extracted_at": "2025-09-23T05:03:08.339191+00:00",
  "product_name": "Kate Somerville+Retinol Vitamin C Moisturizer",
  "brand": "Kate Somerville",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Face Moisturizer"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "119.00",
  "availability": "in_stock",
  "rating_avg": "4.7",
  "rating_count": "1187",
  "images": [
    "https://media.ulta.com/i/ulta/2547441?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2547441?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2547441cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2547441cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2547441cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2547441cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2547441cm_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2547441cm_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2547441cm_vid01/thumbs/e021dd35-6b8a-4fec-991f-e16c0ab81086?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryStep into your most radiant and healthy-looking complexion with Kate Somerville's lightweight and luxe +Retinol Vitamin C Moisturizer. This transformative turnaround cream features a clinical-grade formulation of ageless skin superstars Retinol and Vitamin C to nourish skin all night long.",
  "details": "DetailsBenefitsClinical-grade Retinol + Vitamin CFirm + smooth + hydrate overnightBrighten + soften the look of fine linesKey IngredientsRetinol - Helps diminish the appearance of lines and wrinkles while improving skin firmness.Hyaluronic Acid - Deeply hydrates skin, instantly smoothing fine lines and wrinkles.Ascorbic Acid (Pure Vitamin C) - Is wrapped in volcanic soil from Jeju Island in South Korea and helps reduces the appearance of lines and wrinkles while visibly brightening and evening skin tone.Wild Gooseberry Extract - Defends skin against free radicals that can cause premature aging while helping to soothe any potential sensitivity to Retinol or Vitamin C.Formulated WithoutParabensSulfatesPhthalatesItem 2547441How To UseGood for: EveningHow often: NightlyApplication: After cleansing, apply a thin, even layer to face and neck. Reduce the frequency of use if sensitivity occurs.Our Skin Health Experts' Approach To Retinol: Because Retinol is such an effective and active ingredient, only use one product containing it on any given day. Monitor any skin sensitivity and adjust product use accordingly.IngredientsAqua/Water/Eau, Neopentyl Glycol Diheptanoate, Caprylic/Capric Triglyceride, Propanediol, Cetearyl Alcohol, Cocoglycerides, Cetyl Esters, Parfum/Fragrance, Stearyl Alcohol, Glyceryl Stearate, Dimethicone, Tridecyl Neopentanoate, PPG-26-Buteth-26, Glycerin, Bis-Stearyl Dimethicone, Retinol, Ascorbic Acid, Tocopheryl Acetate, Panthenol, Physalis Angulata Extract, Volcanic Soil, Tocopherol, Adenosine, Hyaluronic Acid, Ethylhexylglycerin, Amylopectin, PEG-40 Stearate, PEG-40 Hydrogenated Castor Oil, 1,2-Hexanediol, Polyacrylate Crosspolymer-6, Polysorbate 20, Ceteareth-20, Polysilicone-11, Caprylhydroxamic Acid, Arachidyl Alcohol, T-butyl Alcohol, BHA, Citric Acid, Disodium EDTA, Cetyl Alcohol, BHT, Linalool, Limonene.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Good for: EveningHow often: NightlyApplication: After cleansing, apply a thin, even layer to face and neck. Reduce the frequency of use if sensitivity occurs.Our Skin Health Experts' Approach To Retinol: Because Retinol is such an effective and active ingredient, only use one product containing it on any given day. Monitor any skin sensitivity and adjust product use accordingly.",
  "ingredients": [
    "Aqua/Water/Eau",
    "Neopentyl Glycol Diheptanoate",
    "Caprylic/Capric Triglyceride",
    "Propanediol",
    "Cetearyl Alcohol",
    "Cocoglycerides",
    "Cetyl Esters",
    "Parfum/Fragrance",
    "Stearyl Alcohol",
    "Glyceryl Stearate",
    "Dimethicone",
    "Tridecyl Neopentanoate",
    "PPG-26-Buteth-26",
    "Glycerin",
    "Bis-Stearyl Dimethicone",
    "Retinol",
    "Ascorbic Acid",
    "Tocopheryl Acetate",
    "Panthenol",
    "Physalis Angulata Extract",
    "Volcanic Soil",
    "Tocopherol",
    "Adenosine",
    "Hyaluronic Acid",
    "Ethylhexylglycerin",
    "Amylopectin",
    "PEG-40 Stearate",
    "PEG-40 Hydrogenated Castor Oil",
    "2-Hexanediol",
    "Polyacrylate Crosspolymer-6",
    "Polysorbate 20",
    "Ceteareth-20",
    "Polysilicone-11",
    "Caprylhydroxamic Acid",
    "Arachidyl Alcohol",
    "T-butyl Alcohol",
    "BHA",
    "Citric Acid",
    "Disodium EDTA",
    "Cetyl Alcohol",
    "BHT",
    "Linalool",
    "Limonene"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "moisturizer"
    ],
    "skin_type": [
      "mature"
    ],
    "finish": [
      "dewy",
      "sheer",
      "creamy",
      "cream",
      "gel",
      "oil"
    ],
    "ingredients": [
      "hyaluronic-acid",
      "retinol",
      "fragrance"
    ],
    "brand": [
      "mid-range",
      "premium"
    ],
    "special_features": [
      "anti-aging",
      "brightening",
      "purifying"
    ]
  },
  "reviews": {
    "product_id": "pimprod2005754",
    "total_reviews": 1187,
    "reviews": [
      {
        "review_id": 551088341,
        "rating": 1,
        "headline": "Not for sensitive skin girlies",
        "comments": "I was unsure of this product because of active ingredients. Patch test was fine, but my skin became leathery and sensitive within a week of use, but week 2 destroyed my skin barrier and gave me a rash. My skin was red and painful. Do not recommend.",
        "nickname": "Jillian",
        "location": "MI",
        "created_date": 1743900752565,
        "bottom_line": "No",
        "helpful_votes": 9,
        "not_helpful_votes": 0
      },
      {
        "review_id": 542265113,
        "rating": 4,
        "headline": "Nice anti-aging moisturizer!",
        "comments": "If you have the money, this moisturizer has a great dispenser and is moisturizing with being too greasy. Not sure I would purchase this at full price though",
        "nickname": "Dulcinea18",
        "location": "NYC",
        "created_date": 1736086938073,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 537804805,
        "rating": 4,
        "headline": "Nice!",
        "comments": "My skin looks and feels softer& smoother with this cream. I love the light citrus scent! The dispenser is also great for avoiding contamination and spoilage of product. I also use it on the backs of my hands to hopefully discourage age spots down the road.",
        "nickname": "Joanslp",
        "location": "Minneapolis, MN",
        "created_date": 1731563753882,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 1
      },
      {
        "review_id": 536391017,
        "rating": 1,
        "headline": "Horrible",
        "comments": "I do not have 'sensitive skin' type and yet this severly dried out my skin and it felt painful like a sunburn. I gave it a few tries I thought my skin was drying out because of the cooler weather but nope, this was the culprit! I cannot even fathom paying full price for this product.",
        "nickname": "Brenda",
        "location": "Dallas, Texas",
        "created_date": 1729395955464,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 2
      },
      {
        "review_id": 534852111,
        "rating": 2,
        "headline": "Dried out my face horribly",
        "comments": "I dont like the scent. It smells good when you're putting it on, but then it makes your pillow smell like wet dog. This dried out my face horribly and created big dry patches under my eyes and above my eyelids. I have to return it.",
        "nickname": "A Nev",
        "location": "New Boston, NH",
        "created_date": 1727609916083,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 506051461,
        "rating": 5,
        "headline": "Give it time… this stuff works!",
        "comments": "My skin is extremely sensitive to new products, especially retinols. This took a few weeks to get used to, but I'm now using it almost every night. My skin has SO much more life to it!",
        "nickname": "Ellie",
        "location": "Virginia",
        "created_date": 1707829380933,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 485295012,
        "rating": 5,
        "headline": "Only a few weeks in and I am loving it!",
        "comments": "I recently switched my skincare line from Lancôme to Kate Somerville and let me just say that my face hasn't looked or felt this good in years. I have seen more results in only a few short weeks than I ever did with Lancôme. AND this line is less expensive. It's a win win!",
        "nickname": "Janet",
        "location": "North Carolina",
        "created_date": 1703004037017,
        "bottom_line": "Yes",
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 479448612,
        "rating": 3,
        "headline": "BE CAREFUL",
        "comments": "For the first two weeks, everything was fine. Last night, I put it on and it literally burnt the skin off around my eyes. I love the smell and feel of it, but I please be careful if you aren't used to using retinol. Avoid adding near your eyes or mouth",
        "nickname": "Cayce",
        "location": "Knoxville, TN",
        "created_date": 1699033551802,
        "bottom_line": "No",
        "helpful_votes": 11,
        "not_helpful_votes": 0
      },
      {
        "review_id": 471877343,
        "rating": 5,
        "headline": "Moisture for dry sensitive skin",
        "comments": "Texture-creamy yet light weight \nSmell- think of a orange creamsicle \nSkin type: dry and sensitive \nProvides a nice glow with the perfect amount of moisture. I apply this cream 2-3 times a night other nights I apply the ordinary rose hip oil",
        "nickname": "",
        "location": "California",
        "created_date": 1694498555211,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 463686353,
        "rating": 5,
        "headline": "Wow!",
        "comments": "First, AMAZING smell! Like waffles & orange juice! 😁 I am 45 with normal to dry skin. I have not noticed any sensitivity after using. As soon as I put it on I can tell it's doing something. Feels like drinking a cold glass of water on a hot day. My skin drinks it up. After several weeks of using, my face is smoother, more evenly toned, and brighter. I REALLY like this product!",
        "nickname": "Dana D",
        "location": "Meridian, Idaho",
        "created_date": 1688844525925,
        "bottom_line": null,
        "helpful_votes": 10,
        "not_helpful_votes": 3
      },
      {
        "review_id": 443866838,
        "rating": 4,
        "headline": "This stuff works!",
        "comments": "I am approaching forty and did not wear sunscreen daily when I was younger. This has dramatically improved my dark spots and smell amazing. I need one pump for my whole face. It is too harsh to use daily on my neck so it's definitely trial and error. I will be buying again!",
        "nickname": "Erin H",
        "location": "Philly",
        "created_date": 1676492841468,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 436117496,
        "rating": 1,
        "headline": "DO NOT USE IF YOU HAVW SENSITIVE SKIN!!",
        "comments": "So I tried this out for 4 days as recommended. Did fine until 4th day. My face is burning itching red and irritated. May be my skin type. But I have a waisted my money and I'm very upset.",
        "nickname": "Miranda",
        "location": "Spartanburg sc",
        "created_date": 1670014395465,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 5
      },
      {
        "review_id": 408106019,
        "rating": 3,
        "headline": "Made my face extremely dry",
        "comments": "I used this for a solid week, and my face got so dry. I'd wake up with flakey white patches on my face. I've been moisturizing my skin 3-4x a day to help clear this dry skin up.I'm a combination type of skin and I do not have acne. I'm going to try for 2x a week once my face clears up. If you already have dry skin, I would not recommend. Other than that, it's good on my neck and don't recommend on or near sensitive skin on the face like eyelids.",
        "nickname": "Awattee",
        "location": "Texas",
        "created_date": 1652239773666,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 395181981,
        "rating": 3,
        "headline": "not meant for sensitive skin and does not moisturize",
        "comments": "very potent and burns my neck. not a good moisturizer.",
        "nickname": "ironmegan",
        "location": "dallas, tx",
        "created_date": 1643123093958,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 387167049,
        "rating": 5,
        "headline": "Truly effective",
        "comments": "I'm so happy to find that this product does what it sets out to do! Only 1 week in and my tone is more even, skin is overall brighter and healthy looking. I use it nightly with an added super-moisturizing moisturizer on top to help with any dryness and have not had any irritation or dry patches. Pretty strongly scented but the scent is pleasant and citrusy. So happy with this product!",
        "nickname": "Maddie",
        "location": "Toledo, OH",
        "created_date": 1636515040637,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 386330460,
        "rating": 5,
        "headline": "great",
        "comments": "no problem but do purge. Like pimples, dry and flaky skin. I incorporate it 2x a week. Start slow with any retinol and retnoids products. I do the sandwich method so it wont irritate as much. So guys and girls moisturize than put this on then moisturize again. It helps so much. You can moisturize and just put this on after and stop. Remember it takes 4 to 6 months to see any results with retinol or retinoids use. Please hydrate your skin good. I mean I slap my moisturizer like no tomorrow. This kind of method works for me. Please give it a try. The only thing I dont like about this retinol is the artificial citrus smell. Not alot of people love retinol because of their side effects then they just stop using it. If you cannot stand 4 to 6 months to see any results with these type of products dont do it. Maybe find a low dosage.",
        "nickname": "suebeautyjunkie",
        "location": "highland ca",
        "created_date": 1635765714837,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 374598980,
        "rating": 1,
        "headline": "NOT For Everyone's Skin!",
        "comments": "Have used many different skincare products over the years, including this brand, with no skin reactions or sensitivity.  BUT ... Kate's retinol products caused my fact to break out in an acnelike sensitivity that took a week to resolve.  Wasn't sure it was the result of these products so tried them again (have used other retinol pdts before w/no reactions) over 4 more weeks w/same result.  Don't know what is in her products beyond retinol but whatever it is know that it is CAN cause a major dermatological outbreak.  I threw all of my newly purchased Kate retinol products away!  BIG waste of $$$.  Live and learn.  Bummer!!  In retrospect would only try samples first of any new skincare products.  Never have written a negative review but in view of all the accolades for this just wanted to share this product is not universally good for all skin types.",
        "nickname": "Doogiesmom",
        "location": "New Orleans",
        "created_date": 1628263561199,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 339677532,
        "rating": 5,
        "headline": "glow getter",
        "comments": "beautiful, rich cream that transforms dull skin. has a potent retinol and vitamin c blend so it should only be used at night and two to three nights a week, with no other retinol. but honestly, your skin will look amazing by adding it to your routine.",
        "nickname": "divadollnik-e",
        "location": "Charlotte nc",
        "created_date": 1616889386570,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 326646056,
        "rating": 2,
        "headline": "Cannot finish container, abrasions on skin.",
        "comments": "For the first 2 weeks (early September 2020) using this, it was fine. No noticeable changes in my skin, as it was too soon. Around the 3rd or 4th week, I would wake up with very sensitive skin. I changed morning cleansers to something very very light for about 2 weeks with no change. I intended to stop using it if sensitivity did not decline.\n\nTHEN I was forced to completely discontinued use when severe dry patches, bumps, and redness appeared at the beginning of December 2020... all over my forehead, cheeks, and chin. \n\nI gave my skin almost 2 months off and did not use the product again until last night. I woke up this morning with ALL those previous issues. Dry patches that feel like sandpaper, bumps all over my forehead, and redness on my cheeks.\n\nI'm biracial; PR and black. I do not have issues with acne, dryness, or any other conditions. This is all new. \n\nI will not continue use and will be seeing a dermatologist to ensure that using this product did not permanently damage my skin in any way.",
        "nickname": "Mrs A",
        "location": "Mississippi",
        "created_date": 1611879367040,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 2
      },
      {
        "review_id": 318488106,
        "rating": 1,
        "headline": "Not good for me.",
        "comments": "I used this product a couple times and woke up with my face in a rash burning and itching. It's a shame that this expensive product does this. Won't be able to use it again.",
        "nickname": "Ca6",
        "location": "White lake. MI",
        "created_date": 1607095716546,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 2
      }
    ],
    "paging": {
      "total_results": 31,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2005754/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "Price",
              "count": 1
            },
            {
              "label": "No change to fine lines",
              "count": 1
            },
            {
              "label": "Scent",
              "count": 1
            }
          ],
          "display_values": [
            "No change to fine lines",
            "Price",
            "Scent"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "Medium warm skin tone, acne prone, oily skin, 40",
              "count": 1
            }
          ],
          "display_values": [
            "Casual Dresser",
            "Comfort-seeking",
            "Energetic/Active",
            "Medium warm skin tone, acne prone, oily skin, 40",
            "Stylish/Fashionista",
            "Trendy/Stylish Dresser",
            "Youthful"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "Scent",
              "count": 1
            },
            {
              "label": "Works",
              "count": 1
            },
            {
              "label": "Brighten skin tone",
              "count": 1
            },
            {
              "label": "Dispenser",
              "count": 1
            },
            {
              "label": "Lighten spots",
              "count": 1
            },
            {
              "label": "Pleasant citrus smell",
              "count": 1
            }
          ],
          "display_values": [
            "Brighten skin tone",
            "Dispenser",
            "Lighten spots",
            "Pleasant citrus smell",
            "Scent",
            "Works"
          ]
        },
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Combination",
              "count": 1
            },
            {
              "label": "Dry",
              "count": 1
            },
            {
              "label": "Normal",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        46,
        12,
        29,
        113,
        987
      ],
      "review_histogram": [
        46,
        12,
        29,
        113,
        987
      ],
      "rating_count": 1187,
      "review_count": 1187,
      "average_rating": 4.67,
      "recommended_ratio": 0.46,
      "media": [
        {
          "id": "273990416",
          "review_id": 273990394,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/tlzug3d9s9ke1rzl8ptv.jpg",
          "headline": "Stick It Out Through the Irritation - Worth It!!!!!",
          "rating": 5,
          "helpful_votes": 2,
          "not_helpful_votes": 1,
          "type": "image",
          "nickname": "Sydney",
          "created_date": 1588082686382
        }
      ],
      "faceoff_positive": {
        "comments": "I do not have sensitive skin at all, but I am genetically doomed to acne and I tan when the shade hits my face. Something to consider with my review. Because I'm not sensitive I go full blast with everything. I use this every night After I wash my face. I only need one pump. I kid you not guys! The brown spots from my acne have dramatically improved and my skin tone has dramatically brightened. All in a weeks use. I wish I had pictures. Might add some later since I have new spots from my current breakouts. The packaging is lovely with the white and gold, but I mostly love how it dispenses. You press down on the top and out pops a bead of cream. Keeps it sterile and limits air and sun exposure (my thoughts at least). I hope I can get everything out when it's low though. I don't think I can go without this and will gladly pay the price. The smell though......it's like putting fruity pebbles or fruit loops all over your face. Not a fan of the scent at all.",
        "headline": "Amazing results but the scent.....",
        "rating": 4,
        "ugc_id": 264624578
      },
      "faceoff_negative": {
        "comments": "For the first 2 weeks (early September 2020) using this, it was fine. No noticeable changes in my skin, as it was too soon. Around the 3rd or 4th week, I would wake up with very sensitive skin. I changed morning cleansers to something very very light for about 2 weeks with no change. I intended to stop using it if sensitivity did not decline.\n\nTHEN I was forced to completely discontinued use when severe dry patches, bumps, and redness appeared at the beginning of December 2020... all over my forehead, cheeks, and chin. \n\nI gave my skin almost 2 months off and did not use the product again until last night. I woke up this morning with ALL those previous issues. Dry patches that feel like sandpaper, bumps all over my forehead, and redness on my cheeks.\n\nI'm biracial; PR and black. I do not have issues with acne, dryness, or any other conditions. This is all new. \n\nI will not continue use and will be seeing a dermatologist to ensure that using this product did not permanently damage my skin in any way.",
        "headline": "Cannot finish container, abrasions on skin.",
        "rating": 2,
        "ugc_id": 326646056
      },
      "name": "+Retinol Vitamin C Moisturizer",
      "native_review_count": 31,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 1156,
      "locale": "en_US"
    }
  }
}