{
  "product_id": "",
  "product_url": "https://www.ulta.com/p/travel-size-exfolikate-cleanser-daily-foaming-wash-xlsImpprod18731193",
  "extracted_at": "2025-09-23T05:28:47.326696+00:00",
  "product_name": "Kate SomervilleTravel Size ExfoliKate Cleanser Daily Foaming Wash",
  "brand": "Kate Somerville",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Face Wash"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "24.00",
  "availability": "in_stock",
  "rating_avg": "4.8",
  "rating_count": "3099",
  "images": [
    "https://media.ulta.com/i/ulta/2531090?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2531090?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2531090cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2531090cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2531090cm_alt03?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryKate's clinic-perfected foaming face wash gently cleanses away oil, makeup and surface impurities to reveal softer, smoother, glowing skin.",
  "details": "DetailsBenefitsGently removes surface impurities, oil and makeupRefines the appearance of skin texture without over-dryingRefreshes, softens and conditions skinHelps reduce the appearance of poresKey IngredientsGlycolic Acid & Lactic Acid refine the appearance of pores and help clear buildup on skin's surfacePapaya, Pineapple & Pumpkin Enzymes naturally enhance skin exfoliation without overdryingResearch ResultsAFTER JUST 1 USE*94% reported product thoroughly cleanses dirt, oil and makeup94% said it leaves skin soft and refreshedAFTER 7 DAYS*94%reported pores feel thoroughly clean and purified*Clinically proven results based on independent clinical studyItem 2531090How To UseAM and PM. Use twice a day. Apply a small amount to wet face and neck and massage gently for 30 seconds. Rinse and gently pat dry. For optimal results, use with the ExfoliKate Exfoliating Treatment appropriate for your skin type 1 to 2 times a week.Kate's Tip: If you wear a lot of makeup, do a double cleanse before bed. The first wash removes surface impurities, and the second will keep your complexion healthy and clean.IngredientsWater/Aqua/Eau, Stearic Acid, Sodium Cocoyl Glycinate, Lauramidopropyl Betaine, Glycerin, Hydroxypropyl Starch Phosphate, Cetearyl Phosphate, Xylitylglucoside, Dimethicone PEG-8 Meadowfoamate, Anhydroxylitol, Xylitol, Leuconostoc/Radish Root Ferment Filtrate, Bromelain, Papain, Lactobacillus/Pumpkin Fruit Ferment Filtrate, Lauramide DIPA, Aloe Barbadensis Leaf Juice Powder, Lactic Acid, Glycolic Acid, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Aniba Rosaeodora (Rosewood) Wood Extract, Citrus Aurantium Dulcis (Orange) Peel Oil, Geranium Maculatum Oil, Benzyl Alcohol, Sodium Hydroxide, Chlorphenesin, Chlorophyllin-Copper Complex (CI 75810), Maltodextrin.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "AM and PM. Use twice a day. Apply a small amount to wet face and neck and massage gently for 30 seconds. Rinse and gently pat dry. For optimal results, use with the ExfoliKate Exfoliating Treatment appropriate for your skin type 1 to 2 times a week.Kate's Tip: If you wear a lot of makeup, do a double cleanse before bed. The first wash removes surface impurities, and the second will keep your complexion healthy and clean.",
  "ingredients": [
    "Water/Aqua/Eau",
    "Stearic Acid",
    "Sodium Cocoyl Glycinate",
    "Lauramidopropyl Betaine",
    "Glycerin",
    "Hydroxypropyl Starch Phosphate",
    "Cetearyl Phosphate",
    "Xylitylglucoside",
    "Dimethicone PEG-8 Meadowfoamate",
    "Anhydroxylitol",
    "Xylitol",
    "Leuconostoc/Radish Root Ferment Filtrate",
    "Bromelain",
    "Papain",
    "Lactobacillus/Pumpkin Fruit Ferment Filtrate",
    "Lauramide DIPA",
    "Aloe Barbadensis Leaf Juice Powder",
    "Lactic Acid",
    "Glycolic Acid",
    "Citrus Aurantium Bergamia (Bergamot) Fruit Oil",
    "Aniba Rosaeodora (Rosewood) Wood Extract",
    "Citrus Aurantium Dulcis (Orange) Peel Oil",
    "Geranium Maculatum Oil",
    "Benzyl Alcohol",
    "Sodium Hydroxide",
    "Chlorphenesin",
    "Chlorophyllin-Copper Complex (",
    "Maltodextrin"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "cleanser"
    ],
    "skin_type": [
      "dry"
    ],
    "finish": [
      "dewy",
      "creamy",
      "powdery",
      "oil",
      "foam"
    ],
    "ingredients": [
      "glycolic-acid",
      "lactic-acid"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "natural",
      "exfoliating"
    ]
  },
  "reviews": {
    "product_id": "xlsImpprod18731193",
    "total_reviews": 3099,
    "reviews": [
      {
        "review_id": 557018639,
        "rating": 5,
        "headline": "Great for face AND body",
        "comments": "I had a sample of this collecting dust and grabbed it to use one day to as a pre-self tan exfoliant for my whole body. I loved how soft it made my skin feel and took it on vacation with me. After using it all week, I discovered that a little goes a long way and it makes a great body wash. I just bought the full size on sale and figure I will splurge on using it as my body wash for the rest of the summer. The cost and size of the product is comparable to other expensive body scrubs and serums that I have purchased in the past. Loving my soft, glowing skin!",
        "nickname": "Suz K",
        "location": "Atlanta",
        "created_date": 1752347388107,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549625936,
        "rating": 5,
        "headline": "My fav face wash",
        "comments": "This was first recommended to me when I was breaking out pretty bad, and it all went away in less than a week. It is expensive and only lasts me 4-5 months (I use AM & PM), but whenever I try a new facewash it just doesnt compare. However, I noticed toward the end of the bottle I tend to break out a little for some reason, but it all goes away when I replace it. My skin tends to be dry then oilly at the end of the day. My acne also isnt that bad, its mostly little bumps so im unsure how this effects white heads or cystic acne",
        "nickname": "Haley",
        "location": "MI",
        "created_date": 1742525327224,
        "bottom_line": null,
        "helpful_votes": 12,
        "not_helpful_votes": 0
      },
      {
        "review_id": 544121678,
        "rating": 5,
        "headline": "Versatile cleanser for all skin types",
        "comments": "I love the Kate Somerville Exfolikate cleanser and the moisturizer! It's perfect and gentle enough for daily use and doesn't make my skin feel tight or stripped after washing. A little goes a long way too, will be repurchasing for sure!",
        "nickname": "Vanessa",
        "location": "San Francisco CA",
        "created_date": 1737739571094,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 535813116,
        "rating": 5,
        "headline": "Favorite Skin Care Line",
        "comments": "This face wash and skin care line has been a game changer for me! When I first started using this a few years back, I was really struggling with my moisture barrier and acne, and couldn't seem to find the right combo of products to get my skin under control. When I switched my routine and started using this face wash on my face, my skin really started to improve within a few weeks and breakouts had pretty much stopped. I hadn't realized I stripped my skin of its' natural moisture barrier because I was using too many products to treat my acne and this product broke the cycle I was stuck in by balancing getting the skin clean without stripping it. It feels great on the skin and leaves my face feeling fresh and clean. My skin texture has improved over time as well. While this skin care line is pricey, it has been worth every penny for me.",
        "nickname": "DoMoGo",
        "location": "Greeley, CO",
        "created_date": 1728576537275,
        "bottom_line": null,
        "helpful_votes": 13,
        "not_helpful_votes": 1
      },
      {
        "review_id": 534304580,
        "rating": 5,
        "headline": "Awesome product",
        "comments": "I love this cleanser",
        "nickname": "Cleanser",
        "location": "Ripley West Virginia",
        "created_date": 1727281242985,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 532742024,
        "rating": 1,
        "headline": "Didn't work for me",
        "comments": "I have combination skin and I'm pretty sensitive. Ordered this based on high ratings, but it irritated my skin so bad that my cheeks are broken out with red cystic acne. I looked up the ingredients and it has a ton of fragrance in it. While it smells pretty nice, it really took a toll on my skin. Now I'm off to find a different product to fix this issue.",
        "nickname": "goth2be453",
        "location": "denver, co",
        "created_date": 1726102890559,
        "bottom_line": null,
        "helpful_votes": 8,
        "not_helpful_votes": 1
      },
      {
        "review_id": 531704061,
        "rating": 2,
        "headline": "ExfoliKate  Cleanser",
        "comments": "I love this product I   will ALWAYS from now on buy this when run out of this botte and teh nxt after that and so on !!",
        "nickname": "Nae",
        "location": "New York",
        "created_date": 1725207258310,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 20
      },
      {
        "review_id": 526374778,
        "rating": 4,
        "headline": "I was in denial",
        "comments": "I absolutely loved this product after receiving a sample. After running out I bought the 4 oz cleanser. During the time I was using it, I developed rashes around my eyes, swollen eyes, itchy skin, allergic reaction. At first, I was sure this wasnt the cause and that something else was causing it. I was nearing my birthday and didn't want my eyes to ruin my birthday so I rushed to the dr got a steroid prescribed and my skin cleared up, at this point i didnt think it was the cleanser causing my reaction. After a month and a half and not being on steroids all my symptoms returned and I went to my dermatologist that told me i was having an allergic reaction to something i was using. He prescribed another cream but i still had no clue what was causing it. Ive had reactions to other face products and decided to read reviews to check if anyone else had had the same reaction. I finally decided to stop using the cleaser a week before a wedding and my skin started feeling better. Its been two weeks now since Ive used the cleanser and my skin is clear. I really love this product and loved hwo it left the rest of my skin feeling but I do not enjoy the reaction around my eyes.",
        "nickname": "GreatSkin_puffyEYES",
        "location": "Dallas, Tx",
        "created_date": 1722806676606,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 6
      },
      {
        "review_id": 523964646,
        "rating": 3,
        "headline": "Made me breakout",
        "comments": "I really wanted to love this brand. I used it for 2 weeks and concluded it was making me breakout into small little bumps. Like an allergic reaction. I think it was just too harsh for my skin. For context, I have dark skin, and typically have oily skin in the summer. Aside from reaction, a small amount goes a long way and makes your face feel really clean.",
        "nickname": "Ash",
        "location": "Pennsylvania",
        "created_date": 1719761881019,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 507616310,
        "rating": 4,
        "headline": "Daily cleanser",
        "comments": "My skin felt so nice after using this it smells great and I love only having to use one cleaner AM and PM",
        "nickname": "Shannon",
        "location": "Red Bank, NJ",
        "created_date": 1709696059213,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 476410194,
        "rating": 1,
        "headline": "Not Great",
        "comments": "I purchased this last year when it was 50% off.  I purchased 2.  Been using for well over 8 months and i STILL have to use Philosophy (you know which one made simple \"hint\").  I think its too high priced.  I will stick with Philosophy products.  Period.",
        "nickname": "MamasMakeup",
        "location": "Phoenix, AZ",
        "created_date": 1697140660425,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 474599000,
        "rating": 1,
        "headline": "Made me break out",
        "comments": "Did not liek this oroduct. It didnt exfoliate better than other cleansers and it made me break out.",
        "nickname": "Emeles",
        "location": "Cali",
        "created_date": 1696046482173,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 1
      },
      {
        "review_id": 457490271,
        "rating": 5,
        "headline": "Gives face the peachy cokor and no pores",
        "comments": "This does not increase oil production later in the day as salicilic acid does for me. \nReally good at minimising pores and it gives the face the beautiful glow.\nI also not using it for back acne \nSo far best face wash tried",
        "nickname": "Iryna",
        "location": "Frisco, TC",
        "created_date": 1683725429296,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 449644169,
        "rating": 4,
        "headline": "Was impressed",
        "comments": "Got this product as a sample mystery box and I was pleasantly surprised. This probably wouldn't have been a cleanser I'd of picked out myself bc the appeal but I found it to be soft, gentle and very delightful smelling, like fresh oranges. I would reconsider repurchasing if it was an option and I didn't want to try anything new at the time.",
        "nickname": "alissa",
        "location": "little rock",
        "created_date": 1679719657036,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 448673396,
        "rating": 4,
        "headline": "Amazing smell, excellent cleanser",
        "comments": "As other reviews mention, I got this on sale (50% off). I LOVE everything about it but it works just as well as drug store brands. The smell is my favorite, but I cannot justify spending that much on a 4 oz. Face wash. A little does go a long way. I used a pea sized amount and made it last ~6 Months. I just ran out and will be looking out for another sale. Until then, back to my basic drug store brand.",
        "nickname": "Bratneu",
        "location": "San Diego, CA",
        "created_date": 1678899935410,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 1
      },
      {
        "review_id": 448634774,
        "rating": 5,
        "headline": "Never going back",
        "comments": "Once you try it, you'll never go back. Leaves skin the nicest it's ever been. Now I get the price, and I'm tortured because I can't live without it anymore! So long are the days of being low maintenance.",
        "nickname": "Cookie",
        "location": "Los Angeles",
        "created_date": 1678856717685,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 445600830,
        "rating": 5,
        "headline": "Gentle Yet Effective",
        "comments": "I bought this cleanser on a whim during a sale and decent reviews but I am SO glad I did. It's gentle on my skin, it doesn't get try or tight or rubbery or itchy after use. A little goes a long way, it lathers just right. I Absolutely love this cleanser. Gentle enough for my combo sensitive skin. I recommend trying this!",
        "nickname": "Jae",
        "location": "Anaheim, CA",
        "created_date": 1677568031005,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 441862929,
        "rating": 3,
        "headline": "No difference",
        "comments": "Expensive line. Smells and feels great but no results.",
        "nickname": "Megan B",
        "location": "Fort Worth, TX",
        "created_date": 1674762668123,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 1
      },
      {
        "review_id": 441401080,
        "rating": 5,
        "headline": "Smooth sailing",
        "comments": "This product l leaves your skin smooth and clean. Just as good as her other products.",
        "nickname": "Robin",
        "location": "Fresno",
        "created_date": 1674355400940,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 439782580,
        "rating": 5,
        "headline": "Great cleanser!",
        "comments": "full disclosure I got this half off and can't afford to buy this full price but I love this cleanser. I use it after a makeup wipe to remove any additional makeup and it actually gets all of it off and usually I don't have to double cleanse. I have acne prone oily skin and this works great and leaves my skin feeling clean. Make sure to moisturize afterwards and you're set",
        "nickname": "na",
        "location": "chicago",
        "created_date": 1673105534327,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 134,
      "pages_total": 7,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/xlsImpprod18731193/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "bestuses",
          "name": "Best Uses",
          "type": "tag",
          "values": [
            {
              "label": "Daily Use",
              "count": 8
            },
            {
              "label": "All Skin Types",
              "count": 6
            },
            {
              "label": "Sensitive Skin",
              "count": 3
            },
            {
              "label": "Acne-Prone Skin",
              "count": 2
            },
            {
              "label": "Combination Skin",
              "count": 2
            },
            {
              "label": "Adult Acne",
              "count": 2
            },
            {
              "label": "Fine Lines/Wrinkles",
              "count": 1
            },
            {
              "label": "Redness/ Blotchiness",
              "count": 1
            },
            {
              "label": "Uneven Skin Tone",
              "count": 1
            },
            {
              "label": "Daily use",
              "count": 1
            },
            {
              "label": "Once a week",
              "count": 1
            },
            {
              "label": "dark spots",
              "count": 1
            },
            {
              "label": "oily skin",
              "count": 1
            },
            {
              "label": "Good for me and twenty year old daughters!",
              "count": 1
            },
            {
              "label": "Dry Skin",
              "count": 1
            },
            {
              "label": "Oily Skin",
              "count": 1
            },
            {
              "label": "Mature Skin",
              "count": 1
            },
            {
              "label": "Even Tone",
              "count": 1
            },
            {
              "label": "Lighten Dark Spots",
              "count": 1
            },
            {
              "label": "Smooth Rough Skin",
              "count": 1
            },
            {
              "label": "Daily cleanser",
              "count": 1
            },
            {
              "label": "before morning and nightly routine",
              "count": 1
            },
            {
              "label": "Twice a day face wash",
              "count": 1
            }
          ],
          "display_values": [
            "Acne-Prone Skin",
            "Adult Acne",
            "All Skin Types",
            "Combination Skin",
            "Daily Use",
            "Daily cleanser",
            "Daily use",
            "Dry Skin",
            "Enlarged Pores",
            "Even Tone",
            "Fine Lines/Wrinkles",
            "Good for me and twenty year old daughters!",
            "Lighten Dark Spots",
            "Mature Skin",
            "Oily Skin",
            "Once a week",
            "Redness/ Blotchiness",
            "Sensitive Skin",
            "Smooth Rough Skin",
            "Twice a day face wash",
            "Uneven Skin Tone",
            "before morning and nightly routine",
            "dark spots",
            "oily skin"
          ]
        },
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "expensive",
              "count": 1
            },
            {
              "label": "fragrance",
              "count": 1
            },
            {
              "label": "overpriced",
              "count": 1
            },
            {
              "label": "doesn't remove makeup well",
              "count": 1
            },
            {
              "label": "not very exfoliating",
              "count": 1
            },
            {
              "label": "on the pricey side if use to drugstore prices",
              "count": 1
            },
            {
              "label": "online only, no longer an in store pickup",
              "count": 1
            },
            {
              "label": "Cost",
              "count": 1
            },
            {
              "label": "Dries Out Skin",
              "count": 1
            },
            {
              "label": "Irritates Skin",
              "count": 1
            },
            {
              "label": "None",
              "count": 1
            },
            {
              "label": "Expensive but WORTH IT!",
              "count": 1
            },
            {
              "label": "Stings the eyes slightly",
              "count": 1
            },
            {
              "label": "Pricey / Poor Value",
              "count": 1
            },
            {
              "label": "Acne",
              "count": 1
            },
            {
              "label": "Price",
              "count": 1
            }
          ],
          "display_values": [
            "Acne",
            "Bad Smell",
            "Cost",
            "Doesn't Remove Makeup",
            "Doesn't Work",
            "Dries Out Skin",
            "Expensive but WORTH IT!",
            "Greasy",
            "Irritates Skin",
            "Messy",
            "None",
            "Price",
            "Pricey / Poor Value",
            "Stings the eyes slightly",
            "doesn't remove makeup well",
            "expensive",
            "fragrance",
            "not very exfoliating",
            "on the pricey side if use to drugstore prices",
            "online only, no longer an in store pickup",
            "overpriced"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "Brand Buyer",
              "count": 6
            },
            {
              "label": "Budget Shopper",
              "count": 3
            },
            {
              "label": "Beauty Conscious",
              "count": 2
            },
            {
              "label": "Over 45; African American Woman",
              "count": 1
            },
            {
              "label": "Beauty Expert",
              "count": 1
            },
            {
              "label": "Minimalist",
              "count": 1
            },
            {
              "label": "30 female midwest",
              "count": 1
            },
            {
              "label": "mild rosacea",
              "count": 1
            },
            {
              "label": "Easy breezy",
              "count": 1
            },
            {
              "label": "Maintenance",
              "count": 1
            },
            {
              "label": "Makeup junkie",
              "count": 1
            },
            {
              "label": "I am 58 years old and take care of my skin.",
              "count": 1
            },
            {
              "label": "Adult Acne",
              "count": 1
            },
            {
              "label": "Combo Skin",
              "count": 1
            },
            {
              "label": "Dry Skin in Winter",
              "count": 1
            },
            {
              "label": "Larges Pores",
              "count": 1
            },
            {
              "label": "Oily Skin in Humid Southern Summer",
              "count": 1
            },
            {
              "label": "Sensitive acne prone rosacea",
              "count": 1
            },
            {
              "label": "Mature skin with oily pores in the t-zone",
              "count": 1
            },
            {
              "label": "combo skin",
              "count": 1
            },
            {
              "label": "Black Heads",
              "count": 1
            },
            {
              "label": "Hormonal Acne",
              "count": 1
            },
            {
              "label": "Oil Skin",
              "count": 1
            }
          ],
          "display_values": [
            "30 female midwest",
            "Adult Acne",
            "Beauty Conscious",
            "Beauty Expert",
            "Black Heads",
            "Brand Buyer",
            "Budget Shopper",
            "Casual Dresser",
            "Combo Skin",
            "Comfort-seeking",
            "Dry Skin in Winter",
            "Easy breezy",
            "Energetic/Active",
            "Hormonal Acne",
            "I am 58 years old and take care of my skin.",
            "Larges Pores",
            "Maintenance",
            "Makeup junkie",
            "Mature skin with oily pores in the t-zone",
            "Minimalist",
            "Oil Skin",
            "Oily Skin in Humid Southern Summer",
            "Over 45; African American Woman",
            "Sensitive acne prone rosacea",
            "Skin Care Professional",
            "Stylish/Fashionista",
            "Trendy/Stylish Dresser",
            "Youthful",
            "combo skin",
            "mild rosacea"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "Smells Great",
              "count": 10
            },
            {
              "label": "Gentle",
              "count": 10
            },
            {
              "label": "Leaves Clean Feel",
              "count": 9
            },
            {
              "label": "Balances Skin",
              "count": 8
            },
            {
              "label": "Improves Skin Texture",
              "count": 6
            },
            {
              "label": "Not Greasy",
              "count": 6
            },
            {
              "label": "Moisturizing",
              "count": 5
            },
            {
              "label": "Softens Skin",
              "count": 3
            },
            {
              "label": "Lightweight",
              "count": 2
            },
            {
              "label": "Moisturizes",
              "count": 2
            },
            {
              "label": "Soothes Skin",
              "count": 2
            },
            {
              "label": "Great quality!",
              "count": 1
            },
            {
              "label": "Keeps my skin clear or breakouts and blackouts",
              "count": 1
            },
            {
              "label": "Makes my skin smooth and bright",
              "count": 1
            },
            {
              "label": "Clears Hormonal Acne",
              "count": 1
            },
            {
              "label": "Clears Acne",
              "count": 1
            },
            {
              "label": "doesn't leave residue",
              "count": 1
            },
            {
              "label": "non-irritating",
              "count": 1
            },
            {
              "label": "not drying",
              "count": 1
            },
            {
              "label": "smells good",
              "count": 1
            },
            {
              "label": "can be used daily",
              "count": 1
            },
            {
              "label": "Great exfoliating wash",
              "count": 1
            },
            {
              "label": "Not too drying",
              "count": 1
            },
            {
              "label": "a little goes a very long way",
              "count": 1
            },
            {
              "label": "gentile on skin with mild sensitivity",
              "count": 1
            },
            {
              "label": "skin instantly feels smoother",
              "count": 1
            },
            {
              "label": "Cleansing brightens moisturizing",
              "count": 1
            },
            {
              "label": "Only need a little",
              "count": 1
            },
            {
              "label": "exfoliates",
              "count": 1
            },
            {
              "label": "works on dark spots",
              "count": 1
            },
            {
              "label": "HOLY GRAIL!!",
              "count": 1
            },
            {
              "label": "Minimizes Pores!",
              "count": 1
            },
            {
              "label": "Works Best with ExfoliKate + Moisturizer",
              "count": 1
            },
            {
              "label": "Gently exfoliates",
              "count": 1
            },
            {
              "label": "Gentle but effective",
              "count": 1
            },
            {
              "label": "Cures adult acne",
              "count": 1
            },
            {
              "label": "Good for sensitive skin",
              "count": 1
            },
            {
              "label": "Light fregrance",
              "count": 1
            },
            {
              "label": "Cleansing",
              "count": 1
            },
            {
              "label": "Clears pores",
              "count": 1
            },
            {
              "label": "works well",
              "count": 1
            },
            {
              "label": "worth the cost",
              "count": 1
            },
            {
              "label": "Good smell, clean face",
              "count": 1
            },
            {
              "label": "Deep Cleaning",
              "count": 1
            },
            {
              "label": "Removes Every Trace of Makeup",
              "count": 1
            }
          ],
          "display_values": [
            "Balances Skin",
            "Cleansing",
            "Cleansing brightens moisturizing",
            "Clears Acne",
            "Clears Hormonal Acne",
            "Clears pores",
            "Cures adult acne",
            "Deep Cleaning",
            "Gentle",
            "Gentle but effective",
            "Gently exfoliates",
            "Good for sensitive skin",
            "Good smell, clean face",
            "Great exfoliating wash",
            "Great quality!",
            "HOLY GRAIL!!",
            "Improves Skin Texture",
            "Keeps my skin clear or breakouts and blackouts",
            "Leaves Clean Feel",
            "Light fregrance",
            "Lightweight",
            "Makes my skin smooth and bright",
            "Minimizes Pores!",
            "Moisturizes",
            "Moisturizing",
            "Non-Greasy",
            "Not Greasy",
            "Not too drying",
            "Only need a little",
            "Removes Every Trace of Makeup",
            "Smells Great",
            "Softens Skin",
            "Soothes Skin",
            "Works Best with ExfoliKate + Moisturizer",
            "a little goes a very long way",
            "can be used daily",
            "doesn't leave residue",
            "exfoliates",
            "gentile on skin with mild sensitivity",
            "non-irritating",
            "not drying",
            "skin instantly feels smoother",
            "smells good",
            "works on dark spots",
            "works well",
            "worth the cost"
          ]
        },
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Combination",
              "count": 4
            },
            {
              "label": "Dry",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        20,
        27,
        55,
        256,
        2741
      ],
      "review_histogram": [
        20,
        27,
        55,
        256,
        2741
      ],
      "rating_count": 3099,
      "review_count": 3099,
      "average_rating": 4.83,
      "recommended_ratio": 0.87,
      "media": [
        {
          "id": "425897975",
          "review_id": 425897981,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/sbqplfblwykkn4pcgjse.jpg",
          "headline": "My new favorite!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Love it!",
          "nickname": "Mindy",
          "created_date": 1664029703192
        }
      ],
      "faceoff_positive": {
        "comments": "In the past I would just accept defeat when a pimple popped up and once it went away, I'd resign myself to covering up the horrible dark spot with heavy makeup. All of that changed when I went into Ulta for an unrelated purchase with a gigantic & horribly ugly pimple that could only kind of be concealed. After hazarding into the skincare area and talking to a wonderful employee, this was recommended to me along with a peel. I wasn't too pleased about the price, but i knew the pimple would leave a really nasty dark scar so i took a risk and bought both products. \n\nNow, I've tried loads of drugstore face washes and a few of the more popular tv brands. some would help a tiny bit, but most made my skin far worse & nothing ever fixed the dark spot. After using the combo daily for a few days, the pimple had dried out and the dark spot was barely visible! After 2 weeks, my skin was noticeably less oily, way smoother, and the dark spot that should have taken months to fade was almost gone! \n\nIt has been 9 months since i started using this product and while i've had the occasional small hormone related white head, I haven't had a single large pimple. All of the dark scars that I once spent so much time covering are gone as well. So while i dislike the higher cost for this product, it has forever changed my skin for the better. If you have oily skin & battle pimples or dark spots, this will change your life!",
        "headline": "Life Changing",
        "rating": 5,
        "ugc_id": 286860761
      },
      "faceoff_negative": {
        "comments": "I left 3 stars for this product because it's only been a week since I started using it and I can't tell if my skin is breaking out because I'm going through a purge or if it's the ingredients that's breaking me out. What I will say is that this cleanser thoroughly cleanses your skin. I have very sensitive skin + hormonal acne and it's been pretty difficult trying to find facial products because I am currently pregnant. I tried Ceramic Slip by Sunday Riley first and loved it in combination with the Tidal moisturizer, but had to stop using the moisturizer after a week because of the ingredients. Ceramic Slip made me feel like although it was helping clear my acne, it was clogging my pores. I feel like this cleanser is helping declog my pores, which may be the cause of my breakouts. I'm going to give this product a few more weeks and see if my acne and skin texture improves and give an updated review.",
        "headline": "Not sure",
        "rating": 3,
        "ugc_id": 255512216
      },
      "name": "Travel Size ExfoliKate Cleanser Daily Foaming Wash",
      "native_review_count": 134,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 2965,
      "locale": "en_US"
    }
  }
}