{
  "product_id": "pimprod2049699",
  "product_url": "https://www.ulta.com/p/impress-long-lasting-self-adhesive-eyelashes-pimprod2049699",
  "extracted_at": "2025-09-23T04:15:45.428809+00:00",
  "product_name": "KissimPRESS Long Lasting Self Adhesive Eyelashes",
  "brand": "Kiss",
  "categories": [
    "Home",
    "Makeup",
    "Eyes",
    "Eyelashes"
  ],
  "category_keys": [
    "home",
    "makeup",
    "eyes",
    "eyelashes"
  ],
  "currency": "USD",
  "list_price": "17.99",
  "sale_price": "13.49",
  "availability": "in_stock",
  "rating_avg": "4.4",
  "rating_count": "408",
  "images": [
    "https://media.ulta.com/i/ulta/2633737?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2633737?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2633737_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2633737_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2633737_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2633737_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2633737_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2633737_alt06?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsVeganSustainable PackagingGive BackKISS imPRESS Long Lasting NO GLUE Press On Lashes are redefining false eyelashes. Designed for the lash lover who’s looking for long-lasting use with easy application. These pre-bonded lash clusters are waterproof, reusable, and stay on for up to 5 days.",
  "details": "DetailsFeaturesPre-bonded lashes press on & last for up to 5 days with no glue, easy application & removal, with no damage to natural lashesInvisible, natural-based self-stick technology for long-lasting adhesionLash wisps are reusable up to 2 times with every application being as strong as the firstCrafted with a special natural ingredient that repels water so lashes will not fall offLong Lasting press on lash extension kit comes with 24 natural volume lash clusters (5,6,8,10,12, & 14mm) with a precision non-stick applicatorItem 2633737How To UseHOW TO APPLY:Pluck a cluster from the trayPlace the cluster underneath your natural lashesTIP FOR RE-USE:Reactivate the adhesive by simply rinsing with waterAvoid oil-base removers to re-use the lashesHOW TO REMOVESaturate a cotton ball with oil-based removerPlace it over the eyesHold for 10 seconds and gently wipe away the clustersPrecautions: KEEP OUT OF REACH OF CHILDRENIngredientsPetroleum Resins, Styrene/Butadiene Copolymer, Mineral Oil.",
  "how_to_use": "HOW TO APPLY:Pluck a cluster from the trayPlace the cluster underneath your natural lashesTIP FOR RE-USE:Reactivate the adhesive by simply rinsing with waterAvoid oil-base removers to re-use the lashesHOW TO REMOVESaturate a cotton ball with oil-based removerPlace it over the eyesHold for 10 seconds and gently wipe away the clustersPrecautions: KEEP OUT OF REACH OF CHILDREN",
  "ingredients": [
    "Petroleum Resins",
    "Styrene/Butadiene Copolymer",
    "Mineral Oil"
  ],
  "extended_contents": {
    "text": "Show less"
  },
  "tags": {
    "category": [
      "makeup",
      "eyes",
      "eye",
      "cosmetics"
    ],
    "finish": [
      "sheer",
      "long-wear",
      "waterproof",
      "oil"
    ],
    "ingredients": [
      "mineral"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "vegan",
      "natural"
    ],
    "product_type": [],
    "skin_type": []
  },
  "reviews": {
    "product_id": "pimprod2049699",
    "total_reviews": 408,
    "reviews": [
      {
        "review_id": 559990044,
        "rating": 4,
        "headline": "Easy to use",
        "comments": "Hard to remove but easy to install. Wish they were a little shorter and more natural",
        "nickname": "Jenn",
        "location": "Lafayette. La.",
        "created_date": 1755012010220,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559218474,
        "rating": 4,
        "headline": "Love",
        "comments": "Super easy to apply. I dont need all the clusters. I usually dont use the two inner ones. Just dont leave them out in the open or i saw someone said on tiktok, dont leave them in the bathroom as the shower steam will lessen the stickiness of the adhesive. Not sure if that is true but i notice i pack ive opened and left out wasnt as sticky as they are brand new. Dab some glue on your lashes too so they last even longer that advertised. I will keep buying this until i find a cheaper alternative thay works as good. I can make it last up to 5 days without adding anything.",
        "nickname": "Aika",
        "location": "NY",
        "created_date": 1754270882671,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558818779,
        "rating": 5,
        "headline": "In love",
        "comments": "Decided to give myself a break with lash extensions and this definitely got the job done! Very essy to apply and gave me a lash extension look. \nI will definitely buy this product again",
        "nickname": "Lula",
        "location": "Chicago",
        "created_date": 1753976858698,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558418606,
        "rating": 1,
        "headline": "I would not buy this product again ever!",
        "comments": "It didn't even last me a whole day! And no need for removing liquid because it came right off when I washed my face the same night!",
        "nickname": "Patti",
        "location": "Carrollton, TX",
        "created_date": 1753722309323,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555676830,
        "rating": 1,
        "headline": "Barely works for a few hours",
        "comments": "Not worth the money when these are supposedly 5 days of wear and they only last a few hours. I tried a few different varieties and none of them work. The 24 hour press ons last longer than these and are cheaper.",
        "nickname": "Mariah",
        "location": "Kansas City, MO",
        "created_date": 1750534640633,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553488761,
        "rating": 3,
        "headline": "Only a few worked",
        "comments": "This set comes with many clusters, only 3 or 5 stayed glued on.\nThe first time I wore them it was perfect, only did a couple on the outer edges of ny eyes and it looked so natural.\nTried again a couple of times more and they kept falling before I even left the house.\nI don't think the glue is consistent througout or maybe it looses grip after being stored a while. In any case, I've only had them for 2 months so it shouldn't have degraded in that timeframe.",
        "nickname": "Maria",
        "location": "Anchorage, AK",
        "created_date": 1747512689411,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553430039,
        "rating": 2,
        "headline": "eh",
        "comments": "they look cute on but fell if after washing my face so they aren't waterproof at all.",
        "nickname": "N/A",
        "location": "wichita,ks",
        "created_date": 1747371491180,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 553074448,
        "rating": 3,
        "headline": "meh at best",
        "comments": "For all of the money and time that it took to apply these lashes, I'd have been better off just using another coat of mascara. A few of my lashes fell out too. I just want to look a little bit more glamorous and this was a failure. They barely lasted 2 days before starting to unstick from my lashes. Maybe I'd use them again if I had a special occasion...but IDK if I'd waste the money.",
        "nickname": "Nurse Marsha",
        "location": "Louisville",
        "created_date": 1746727183374,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551746342,
        "rating": 5,
        "headline": "I would absolutely buy it again!!",
        "comments": "Easy to put on and it does last days if you take care of it .",
        "nickname": "Dena",
        "location": "Lewisville, tx",
        "created_date": 1744730482841,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550990077,
        "rating": 2,
        "headline": "Comes off if you cry!!",
        "comments": "I bought these to use for a bridal makeup trial but also bought one for myself to test out beforehand. I cried and the lashes started coming undone! 3 clusters came off. The 2nd time I wore them was better but I was at the beach with 25 mile winds and my eyes started watering because of the sand getting in my eyes. One of the clusters almost came off. These are definitely not for brides or for those with watery eyes. They're only meant for indoor activities that don't involve sad movies or crazy elements.",
        "nickname": "Deb",
        "location": "Los Angeles, CA",
        "created_date": 1743741657416,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550740792,
        "rating": 5,
        "headline": "Great lashes!",
        "comments": "I am so impressed with these lashes! I was looking to get a cluster lash that didn't need adhesive applied and these are perfect! They add a little extra to the lash look and blend in with the natural lashes really well. I've only worn them for a day at a time, and they stick well for that time. They're also pretty easy to take off when I want. Honestly perfect for my needs.",
        "nickname": "Natalie",
        "location": "Greenville, SC",
        "created_date": 1743350520128,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550177631,
        "rating": 4,
        "headline": "Easy",
        "comments": "I have kind of small eyes, lashes are usually hard for me to put on and uncomfortable to wear. These were super easy to on and stayed on a whole 12 hour shift at work, the adhesive was way easier than glue for me. Oh and i did cry and they didnt come off (restaurant things lol) They came off pretty easy with some miceller water. The box says they can last 5 days, i cant really speak on that since i only wore them for one. I could see them lasting longer than one tho.",
        "nickname": "Warner",
        "location": "Philadelphia pa",
        "created_date": 1743170069668,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549897753,
        "rating": 2,
        "headline": "Easy to apply but does not stay in place",
        "comments": "I was really excited to try these lashes because I love when they have adhesive and it eliminates the step of applying a bond. They were super easy to apply & sticky but after wesring for about 6-8 hours, I noticed that they do not stay put where I originally applied them. They lift off the lash & no longer look natural so there is no way these can't last up to 5 days as advertised. I've used better self adhesive products that don't move after a few hours.",
        "nickname": "Kayla",
        "location": "Cleveland Ohio",
        "created_date": 1743039765257,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549393422,
        "rating": 4,
        "headline": "Using them for my wedding!",
        "comments": "They're actually really easy to apply as they are quite sticky. Clusters are quite sticky so be careful when pulling them off the holder. I washed my face with them on & they didn't budge, but I took them off after that. The instructions say not to use oil-based remover if planning to reuse, but suggest using an oil-based remover to remove them… so thats a bit unclear.",
        "nickname": "DW",
        "location": "Wichita, KS",
        "created_date": 1742351588802,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547963223,
        "rating": 5,
        "headline": "Wispy lash extensions for days",
        "comments": "I bought these for s recent trip to FL and they stayed on for 4 days of swimming in the pool and several days of makeup looks (lots of makeup removal). I had one cluster slightly move after a couple of days but it reattached perfectly. My new favorite go-to!",
        "nickname": "J",
        "location": "Boston, MA",
        "created_date": 1741418588943,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547963269,
        "rating": 5,
        "headline": "Wispy lash extensions for days",
        "comments": "I bought these for s recent trip to FL and they stayed on for 4 days of swimming in the pool and several days of makeup looks (lots of makeup removal). I had one cluster slightly move after a couple of days but it reattached perfectly. My new favorite go-to!",
        "nickname": "J",
        "location": "Boston, MA",
        "created_date": 1741418588407,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547571356,
        "rating": 5,
        "headline": "Impressive",
        "comments": "I got these on sale just to try them out but definitely doubted the claims to be wearable for up to 5 days and reusable. I love the 24 hour kiss underlash lashes but they always would come off the second I took a shower even after I saw some reviews that people said they lasted for multiple days. \n\nI can say these stayed put for 5 days after multiple showers, heavy workouts, and rough sleeping. As for the reusable part they definitely didn't stick as well on second use but I'm fine with as it I'm still super impressed they lasted the full 5 days as I did not take it easy on them! I will definitley keep buying these I just hope they make some more dramatic and voluminous styles in the future.",
        "nickname": "Jess",
        "location": "Saratoga NY",
        "created_date": 1740879932078,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547487062,
        "rating": 3,
        "headline": "Meh",
        "comments": "I really wanted to love these but they're basically just like the other ones. Don't waste your money.",
        "nickname": "Isa",
        "location": "Burke, VA",
        "created_date": 1740688452224,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 546844865,
        "rating": 5,
        "headline": "Yea, get them!!",
        "comments": "Im allergic to lash glue to the kiss impress lash line has saved me since 2023. Ive tried all variations of the inpress lashes these are obviously more pricey but worth it!! They stick firm and provide a beautiful flare. I take a clean spoolie and a bit of running alcohol and run that through my lashes to remove makeup/oil and then stick. They last for a few\ndays. At night i took them off and put them back in the case soo ill see how they do woth reattaching",
        "nickname": "Kels",
        "location": "New York, NY",
        "created_date": 1739829134311,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 546738627,
        "rating": 3,
        "headline": "stay on but not waterproof",
        "comments": "I love the og Kiss press on lashes so I wanted to try these because they claim to be waterproof and stay on up to 5 days. As soon as I washed my face and showered they started falling off. In comparison to the og press ons, these are more comfy to wear and look more natural.",
        "nickname": "serena mac",
        "location": "Atlanta, GA",
        "created_date": 1739631239855,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 23,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2049699/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        12,
        15,
        52,
        59,
        270
      ],
      "review_histogram": [
        12,
        15,
        52,
        59,
        270
      ],
      "rating_count": 408,
      "review_count": 408,
      "average_rating": 4.37,
      "recommended_ratio": 0.57,
      "media": [],
      "faceoff_positive": {
        "comments": "These lashes would wear beautifully on someone with a little fuller lashes. I lost a lot of my lashes because I've won't lash clusters with the strong glue and primer for 2 years and it's took a toll on my lashes. So my inner lash is more sparse and harder to stick these on. But they're gorgeous. They look like my lashes, but if they were full and longer. They stick really well I wore them for a whole week. And they're not sticky afterwards like my lashes with my glue usually are. I do suggest them but I had to wear glue on the inner lash part because I've lost so many lashes. If I had worn lashes like this more I wouldn't have lost so many. They stick great and are one of the top 3 most beautiful lashes I've worn. Maybe number one. I do suggest them especially good for beginners who have been wanting to wear them. They have them set up in the box easy to know which one to put on from first to last lash. The price point is a downfall because it's a little high since you only get 2 sets. But if you don't mind getting 2 weeks out of these for the price I highly suggest! Thank you Kiss!",
        "headline": "Perfect for beginners who have wanted lashes",
        "rating": 4,
        "ugc_id": 549398887
      },
      "faceoff_negative": {
        "comments": "I had high hopes for the imPRESS Falsies Long Lasting Self-Adhesive Eyelashes in Demi Wispy, but unfortunately, they didn't live up to my expectations. The concept of self-adhesive lashes sounded perfect for a quick and easy glam look, but in practice, they fell short—literally.\n\nFrom the start, I noticed the adhesive wasn't strong enough, especially for watery eyes. Even with careful application, the corners started lifting within minutes. I found myself constantly pressing them back down, which was not only frustrating but also defeated the purpose of a \"long-lasting\" hold.\n\nWhile the lash style itself was beautiful—natural yet flirty—the lack of staying power was a deal-breaker. I'd need to buy lash glue to make them work, which kind of defeats the purpose of a self-adhesive product. Overall, these might work for those with dry eyes or short-term use, but if you need reliability, you might want to look elsewhere.",
        "headline": "Wasn't for me",
        "rating": 2,
        "ugc_id": 548460781
      },
      "native_review_count": 23,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 385,
      "locale": "en_US"
    }
  }
}