{
  "product_id": "pimprod2039052",
  "product_url": "https://www.ulta.com/p/impress-press-on-falsies-eyelash-curly-clusters-refill-pack-pimprod2039052",
  "extracted_at": "2025-09-23T04:15:46.960699+00:00",
  "product_name": "KissimPRESS Press-On Falsies Eyelash Curly Clusters Refill Pack",
  "brand": "Kiss",
  "categories": [
    "Home",
    "Makeup",
    "Eyes",
    "Eyelashes"
  ],
  "category_keys": [
    "home",
    "makeup",
    "eyes",
    "eyelashes"
  ],
  "currency": "USD",
  "list_price": "14.99",
  "sale_price": "11.24",
  "availability": "in_stock",
  "rating_avg": "4.2",
  "rating_count": "230",
  "images": [
    "https://media.ulta.com/i/ulta/2610988?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2610988?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2610988_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2610988_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2610988_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2610988_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2610988_alt05?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsVeganSustainable PackagingGive BackLash in a flash with No Glue Needed - Just Press On & Go! Kiss imPRESS Press-on Falsies, with Pre-Bonded Breakthrough Technology, are a game changer. The first ever press-on under lash application lets you lash in 1 simple step. With no mistakes and no mess, these lashes are for everyone!",
  "details": "DetailsFeaturesClassic style lash clusters with light glam volume, customizable shape, & a split tipEnough for 2-3 applicationsIncludes30 Pre-Bonded ClustersItem 2610988How To UsePluck a cluster from the tray.Place the cluster underneath your natural lashes.Squeeze clusters and natural lashes together with the applicator.How to Remove: With clean hands, use your finger to remove the clusters by gently lifting them off, starting with the band side.Keep out of reach of children.IngredientsRosin (Colophonium, Colophane), Styrene/Isoprene Copolymer, Polyethylene Terephthalate.",
  "how_to_use": "Pluck a cluster from the tray.Place the cluster underneath your natural lashes.Squeeze clusters and natural lashes together with the applicator.How to Remove: With clean hands, use your finger to remove the clusters by gently lifting them off, starting with the band side.Keep out of reach of children.",
  "ingredients": [
    "Rosin (Colophonium",
    "Colophane)",
    "Styrene/Isoprene Copolymer",
    "Polyethylene Terephthalate"
  ],
  "extended_contents": {
    "text": "Show less"
  },
  "tags": {
    "category": [
      "makeup",
      "eyes",
      "eye",
      "cosmetics"
    ],
    "finish": [
      "sheer"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "vegan",
      "natural"
    ],
    "product_type": [],
    "skin_type": [],
    "ingredients": []
  },
  "reviews": {
    "product_id": "pimprod2039052",
    "total_reviews": 230,
    "reviews": [
      {
        "review_id": 559894347,
        "rating": 5,
        "headline": "I will definitely buy this product again!",
        "comments": "I love these press on lashes, I come into Ulta just for my lashes and I always get compliments on them.",
        "nickname": "Martha",
        "location": "Searcy Arkansas",
        "created_date": 1754843831528,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556266506,
        "rating": 5,
        "headline": "BEST LASHES EVER",
        "comments": "I am a beauty advisor at ulta and came across a customer that wears these lashes. They looked so beautiful on her and she said how easy they are to apply, I thought it was too go to true at first but let me tell you. They are so so easy to just stick underneath your natrual lash line, they are comfortable dont cause irritation which i have had from other lashes. Because they are already preglued, it helps from getting bond all over your lashes and clumping them together, which is my issue w clusters. These somehow gently grip to your natrual lashes without damaging them or leaving a residue. I was balling my eyes out last night and i only had to replace one lash in the morning because it was lifting, they are definitely good for at least one or two night and can be reused if fallen off. If you want them to be stronger you might want to add a later of glue to the strip. These are just so amazing and i cant express how much i love them. I am also really like not the best at figuring things out so the fact that i could do it, definitely means you can!",
        "nickname": "Emilie",
        "location": "Kansas",
        "created_date": 1751427484150,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555189241,
        "rating": 2,
        "headline": "Not buying again",
        "comments": "The lashes barely last not even a day and the package came all messed up and my lashes were all over in the little box",
        "nickname": "A",
        "location": "North Dakota",
        "created_date": 1750049265605,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 554822348,
        "rating": 5,
        "headline": "my FAVORITE lashes :)",
        "comments": "I have been using these lashes for about a year now. These are my absolute favorite lashes I've ever worn!! You have to apply them with lash glue for it to stay on for a few days, but its really not that hard to glue on once you've got it down. You can shower with them on, but if you do get them wet they will fall off so just be mindful of that. i always get compliments and people always ask me what lashes im wearing. 1000/10 would recomment buying you wont be disappointed !! :)",
        "nickname": "gracie",
        "location": "Springfield Il",
        "created_date": 1749537441368,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553996898,
        "rating": 5,
        "headline": "Obsessed!",
        "comments": "I literally wear these every day. I love them. They are quick and easy, and always look so good! Once you learn to put them on. It does take some practice. I've learned to use my tweezers and pinch them to my lashes very gently. They almost always last literally all day unless I cry or something then they are more likely to come off. But I just carry the package and tweezers in my bag and throw one back on real quick. Like the title says, I'm obsessed!",
        "nickname": "Cass",
        "location": "Jackson, TN",
        "created_date": 1748274746884,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553961870,
        "rating": 1,
        "headline": "KISS lost a customer",
        "comments": "I've bought these lashes for the last couple years and loved them & recommended them to everyone! I'm not sure if they changed the formula, but they no longer stick, and glue must be used to keep them stuck to your lashes and that's not how they're advertised. \n\nThese used to be my absolute favorite, but after the last couple boxes I bought I will be returning and not purchasing again. Such a bummer since I haven't been able to find any other lashes that are easy to apply like these used to be.",
        "nickname": ":(",
        "location": "Lawrenceville, NJ",
        "created_date": 1748186756155,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 1
      },
      {
        "review_id": 553623052,
        "rating": 1,
        "headline": "Never buying these again",
        "comments": "I used to purchase these religiously because they're so cute and were easy to apply. Now, the glue doesn't stick. I've purchased multiple packs and they all have this issue.",
        "nickname": "Clair",
        "location": "Charlotte NC",
        "created_date": 1747756830390,
        "bottom_line": "No",
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553100542,
        "rating": 2,
        "headline": "Do not recommend",
        "comments": "These do not work after one application, unlike what the packaging says. The glue is so weak I'm surprised that they last for even one application.",
        "nickname": "",
        "location": "New Jersey",
        "created_date": 1746791191670,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552047336,
        "rating": 1,
        "headline": "Don't Stick",
        "comments": "Ive used these lashes for atleast 2 years now and never had a problem until recently. The lashes dont stick and flake off black bits. Even when applied the flakes get into my eyes and become uncomfortable to wear.  Thinking I bought a bad batch I bought a few more and they all came out the same. Im so disappointed.",
        "nickname": "Seré",
        "location": "Chicago, IL",
        "created_date": 1745042727770,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552047276,
        "rating": 1,
        "headline": "Don't Stick",
        "comments": "Ive used these lashes for atleast 2 years now and never had a problem until recently. The lashes dont stick and flake off black bits. Even when applied the flakes get into my eyes and become uncomfortable to wear.  Thinking I bought a bad batch I bought a few more and they all came out the same. Im so disappointed.",
        "nickname": "Seré",
        "location": "Chicago, IL",
        "created_date": 1745042727158,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551800466,
        "rating": 2,
        "headline": "they used to be better",
        "comments": "these eyelashes used to last me a week, so I stopped getting eyelash extensions. about a year ago, they only lasted me about 3 days. now they only last me 1 day. I've learned, that this is what Kiss as a brand does. they get you hooked on a good product, then they cheapen it over time, thinking you're loyal to the product and the brand. ardell press on lashes aren't as long, but they last.",
        "nickname": "former loyal user",
        "location": "Boston",
        "created_date": 1744793990488,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550973714,
        "rating": 5,
        "headline": "Good Lashes",
        "comments": "These lashes have been so good in my opinion. They last me a few days including getting in the shower…",
        "nickname": "Smithwitch",
        "location": "Philly, PA",
        "created_date": 1743710544769,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550805067,
        "rating": 3,
        "headline": "Fix the glue on the clusters!",
        "comments": "Im so sad these lashes have been my holy grail for almost a year now, I loved them because I was able to comfortably wear them for at least 4 days in a row! \nBut as of recent, it seems like there is no adhesive on the clusters anymore? Kiss, please please fix this issue! \nI miss my pretty, yet affordable lashes 😭",
        "nickname": "luci",
        "location": "California",
        "created_date": 1743494397205,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550734653,
        "rating": 5,
        "headline": "Kiss lashes press & go",
        "comments": "Use kiss glue with these",
        "nickname": "Deb R",
        "location": "Conway",
        "created_date": 1743335834186,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549745627,
        "rating": 4,
        "headline": "Needs better glue",
        "comments": "Ive been using these as a way to introduce myself to cluster lashes and while they look and feel really good they dont stick or stay on longer than a day and you end up going through the pack very fast. I would recommend them if you want them for a single day or night. Don't expect anything longer than that.",
        "nickname": "Grl",
        "location": "Bakersfield CA",
        "created_date": 1742792909591,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 548735318,
        "rating": 1,
        "headline": "Doesn't stick",
        "comments": "I have used this brand of lashes for months and this is the first time i've had a problem with them. I can not get them to stick to my lashes no matter what i do. Waste of money",
        "nickname": "Celina",
        "location": "bel air",
        "created_date": 1741973354284,
        "bottom_line": "No",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 548511406,
        "rating": 5,
        "headline": "Great lashes",
        "comments": "I have been using these lashes for a year and they never fail me. I like that there are different styles to choose from to make your look perfect. When I put these on they last a week for me each time I use them. These are super easy to use!",
        "nickname": "Jennifer",
        "location": "Houston, TX",
        "created_date": 1741706988593,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547434726,
        "rating": 1,
        "headline": "did not stick",
        "comments": "cute style, did not stick at all",
        "nickname": "jaz",
        "location": "cali",
        "created_date": 1740604083271,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 545835383,
        "rating": 2,
        "headline": "Don't stick",
        "comments": "These used to last really well and now although they lift from the tray more easily, sometimes they don't stay on my lashes for 30 minutes, and I've even tried prepping my lashes with alcohol on a sponge tip applicator if you can believe. They used to last me for 2 weeks now I'm lucky sometimes if they last a few hours or the next day.",
        "nickname": "Deborah",
        "location": "California",
        "created_date": 1738535367025,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 543563611,
        "rating": 4,
        "headline": "These work better than expected",
        "comments": "Will purchase again",
        "nickname": "JJ",
        "location": "Hickory NC",
        "created_date": 1737176573061,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 56,
      "pages_total": 3,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2039052/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        20,
        18,
        17,
        26,
        149
      ],
      "review_histogram": [
        20,
        18,
        17,
        26,
        149
      ],
      "rating_count": 230,
      "review_count": 230,
      "average_rating": 4.16,
      "recommended_ratio": 0.67,
      "media": [],
      "faceoff_positive": {
        "comments": "Empress Press-On False Lashes: A Lash Lover's Dream?\nDisclaimer: As of now, there doesn't seem to be a brand specifically called \"Empress\" for press-on false lashes. However, I can provide a general review based on popular press-on lash brands like KISS imPRESS. Please let me know if you have a specific brand in mind.\nA Quick Glance at Press-On Lashes\nPress-on false lashes have revolutionized the beauty industry by offering a hassle-free alternative to traditional lash extensions and glue-on falsies. Brands like KISS imPRESS have gained popularity for their ease of application and long-lasting wear.\nWhat to Expect from Press-On Lashes\n * Convenience: The biggest perk is their simplicity. No glue, no mess, just press and go!\n * Natural Look: Many brands offer various styles, from natural to dramatic, to suit different occasions.\n * Longevity: While they can last for multiple wears, the lifespan depends on the brand, application, and individual lash care.\n * Comfort: Generally comfortable, but some users might experience slight discomfort initially.\nPotential Drawbacks\n * Limited Customization: Unlike traditional lashes, you might have fewer options for customizing the length, curl, and thickness.\n * Cost: Press-on lashes can be pricier than traditional falsies, especially if you use them frequently.\nFactors to Consider\n * Brand Reputation: Research different brands to find one that aligns with your desired look and budget.\n * Style: Choose a style that complements your eye shape and desired level of drama.\n * Application Technique: Follow the instructions carefully for optimal results.\n * Care: Proper care can extend the life of your press-on lashes.\nWould you like me to review a specific brand of press-on lashes? Or perhaps you have questions about application, removal, or care? Feel free to ask!\nNote: I can also provide comparisons between different brands if you'd like.",
        "headline": "Nice curl",
        "rating": 5,
        "ugc_id": 542463605
      },
      "faceoff_negative": {
        "comments": "I love these kiss impress lashes, but we gonna need some more variety. Personally I didn't like this \"Curly\" style, but I do love the other styles. My only complaint is that theres got to be more variation, especially for the price. They're nearing almost $20 after tax and the only row I really only wear in all the styles is the first \"short\" row. My eyes are too small and the other sizes look horrendous. & i'm sure theres other out there with bigger eyes who may have no use for the short row and only prefer the long row. While these multiple length packs are really cool, there should also be other packs featuring only short lashes, and others featuring only longer lashes. That and the fact that there should be more \"refill\" packs in more styles as well, because right now 2 is ridiculous. The other styles don't have a refill pack and I don't wanna keep collecting lash appliers..",
        "headline": "Needs more variety!!",
        "rating": 3,
        "ugc_id": 463919074
      },
      "name": "imPRESS Press-On Falsies Eyelash Curly Clusters Refill Pack",
      "native_review_count": 56,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 174,
      "locale": "en_US"
    }
  }
}