{
  "product_id": "pimprod2051329",
  "product_url": "https://www.ulta.com/p/plumping-firming-eye-cream-pimprod2051329",
  "extracted_at": "2025-09-23T04:50:48.055873+00:00",
  "product_name": "Knours.Plumping + Firming Eye Cream",
  "brand": "Knours.",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Cream"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "eye-cream"
  ],
  "currency": "USD",
  "list_price": "28.00",
  "sale_price": "21.00",
  "availability": "in_stock",
  "rating_avg": "4.8",
  "rating_count": "91",
  "images": [
    "https://media.ulta.com/i/ulta/2640415?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2640415?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2640415_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2640415_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2640415_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2640415_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2640415_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2640415_alt06?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganKnours. One Perfect Plumping + Firming Eye Cream is a smoothing, instant boost of radiance for your eyes. Featuring a contoured metal tip that cools and helps depuff the eye's surface, the cream moisturizes intensively to visibly brighten the eye and minimize fine lines & wrinkles.",
  "details": "DetailsBenefitsReplenishes moisture, visibly brightens, and improves the appearance of fine lines for a refreshed and youthful lookContoured metal tip provides a cooling effect, helping to soothe and depuffThe multi-benefits make for one truly perfect eye creamFormula is non-toxic and fragrance-freeKey IngredientsHyaluronic Acid to deliver deep and lasting hydrationCeramide to help replenish moisture and strengthen skin barrierNiacinamide to help improve uneven skin tone and maintain skin elasticityShea Butter to provide deep hydration and soothe irritationFruit + Flower Oils to help protect skin from environmental stressors and prevent premature agingItem 2640415How To UseDab and pat a small amount of cream on the undereye, and using metal tip, glide gently around entire undereye area being careful not to tug.Precautions: For external use only. Do not swallow. Keep out of reach of children. Avoid direct contact with eyes.IngredientsWater, Butyrospermum Parkii (Shea) Butter, Hydrogenated Polydecene, Butylene Glycol, Glycerin, 1,2-Hexane-diol, Glyceryl Stearate, Niacinamide, Isoamyl Laurate, Cetearyl Alcohol, Cetearyl Olivate, Helianthus Annuus (Sunflower) Seed Oil, Sorbitan Olivate, Cetyl Alcohol, Hedera Helix (Ivy) Leaf/Stem Extract, Sodium Hyaluronate, Hydrolyzed Hyaluronic Acid, Hyaluronic Acid, Hippophae Rhamnoides Fruit Extract, Pentylene Glycol, Iris Florentina Root Extract, Allantoin, Xanthan Gum, Caprylic/Capric Triglyceride, Dipeptide Diaminobutyroyl Benzylamide Diacetate, Adenosine, Hydrogenated Lecithin, Disodium EDTA, Glycine, Ceramide NP, Tocopherol, Agastache Mexicana Flower/Leaf/Stem Extract, Poria Cocos Extract, Passiflora Incarnata Flower Extract, Vitex Agnus-Castus Extract, Serine, Glutamic Acid, Aspartic Acid, Leucine, Alanine, Lysine, Arginine, Tyrosine, Phenylalanine, Valine, Threonine, Proline, Isoleucine, Histidine, Methionine, Cysteine, Caprylyl Glycol, Rosmarinus Officinalis (Rosemary) Leaf Extract, Acetyl Hexapeptide-8.",
  "how_to_use": "Dab and pat a small amount of cream on the undereye, and using metal tip, glide gently around entire undereye area being careful not to tug.Precautions: For external use only. Do not swallow. Keep out of reach of children. Avoid direct contact with eyes.",
  "ingredients": [
    "Water",
    "Butyrospermum Parkii (Shea) Butter",
    "Hydrogenated Polydecene",
    "Butylene Glycol",
    "Glycerin",
    "2-Hexane-diol",
    "Glyceryl Stearate",
    "Niacinamide",
    "Isoamyl Laurate",
    "Cetearyl Alcohol",
    "Cetearyl Olivate",
    "Helianthus Annuus (Sunflower) Seed Oil",
    "Sorbitan Olivate",
    "Cetyl Alcohol",
    "Hedera Helix (Ivy) Leaf/Stem Extract",
    "Sodium Hyaluronate",
    "Hydrolyzed Hyaluronic Acid",
    "Hyaluronic Acid",
    "Hippophae Rhamnoides Fruit Extract",
    "Pentylene Glycol",
    "Iris Florentina Root Extract",
    "Allantoin",
    "Xanthan Gum",
    "Caprylic/Capric Triglyceride",
    "Dipeptide Diaminobutyroyl Benzylamide Diacetate",
    "Adenosine",
    "Hydrogenated Lecithin",
    "Disodium EDTA",
    "Glycine",
    "Ceramide NP",
    "Tocopherol",
    "Agastache Mexicana Flower/Leaf/Stem Extract",
    "Poria Cocos Extract",
    "Passiflora Incarnata Flower Extract",
    "Vitex Agnus-Castus Extract",
    "Serine",
    "Glutamic Acid",
    "Aspartic Acid",
    "Leucine",
    "Alanine",
    "Lysine",
    "Arginine",
    "Tyrosine",
    "Phenylalanine",
    "Valine",
    "Threonine",
    "Proline",
    "Isoleucine",
    "Histidine",
    "Methionine",
    "Cysteine",
    "Caprylyl Glycol",
    "Rosmarinus Officinalis (Rosemary) Leaf Extract",
    "Acetyl Hexapeptide-8"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "moisturizer",
      "mask",
      "treatment",
      "eye cream"
    ],
    "skin_type": [
      "mature"
    ],
    "finish": [
      "sheer",
      "creamy",
      "cream",
      "oil"
    ],
    "color": [
      "purple"
    ],
    "ingredients": [
      "hyaluronic-acid",
      "niacinamide",
      "peptides",
      "ceramides"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "fragrance-free",
      "anti-aging"
    ]
  },
  "reviews": {
    "product_id": "pimprod2051329",
    "total_reviews": 91,
    "reviews": [
      {
        "review_id": 555685105,
        "rating": 5,
        "headline": "AMAZING!",
        "comments": "Does as it claims! My only complaint is that it does take several minutes to dry down if wearing under makeup (or primer). Small price to pay for instantly noticeable results. I have super sensitive eyes and have had no issues from this product.  Please, keep this in stock, as it's my new go- to for eyes!",
        "nickname": "J",
        "location": "Midwesr",
        "created_date": 1750556964512,
        "bottom_line": "Yes",
        "helpful_votes": 7,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 1,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        1,
        3,
        0,
        8,
        79
      ],
      "review_histogram": [
        1,
        3,
        0,
        8,
        79
      ],
      "rating_count": 91,
      "review_count": 91,
      "average_rating": 4.77,
      "recommended_ratio": 1.0,
      "media": [],
      "faceoff_positive": {
        "comments": "After 6 months of using this, I decided to write a review. I have noticed a visible change in my dark circles, and that alone told me that the eye cream was working. Since I don't have wrinkles around my eyes yet, I can't say that it has helped with prevention. But the texture is smooth, buttery, not too heavy/thick, and applies so easily. I love the applicator because you don't have to use your fingers. You just swipe and go over a few more times under your eyes. I use it both in the AM and PM. I want to try other eye creams just to see whats out there. But this one would be a repurchase should I find that other brands don't exceed the bar that Knours has set. If you are hesitant, I would go ahead and try this out to see if its for you.",
        "headline": "Post 6 month purchase review",
        "rating": 5,
        "ugc_id": 552951811
      },
      "faceoff_negative": {
        "comments": "This is an updated post and PSA/caveat emptor (buyer be ware) share. i purchased the eye cream as part of the duo with one perfect face moisturizer and reviewed it under that bundle product as excellent. it was, until last night when i was doing to night routine. when i squeezed the eye cream tube to apply using the ceramic tip, i didn't see that the cream dispensed on tip included a 1cm long hard plastic long stick shaped shard and another small dot sized plastic piece. i have photos but this review section doesn't seem to have an option to post photos (did send to customer service). i applied the cream directly from the ceramic tip on to under my eye as i have in the last couple of weeks i've been using it and felt something sharp scratching my under eye area. i thought at first it was glass b/c it was very hard and scratched under my eye so easily. needless to say, no matter how amazing the product is, if it contains foreign objects that can damage your face, it's a negative 5 star for me. very disappointed as i have been over the moon about all knours products i've tried so far and have been recommending it to everyone i know. ive written to notify their customer service (about 12 hours ago) but have not heard back. I'm not sure if anyone else has experienced this issue but once is sufficient to consider recall. imagine if i had squeezed the tube close enough to my eye that it could've spurted into my eye?",
        "headline": "broken sliver of hard plastic spurted out scratching underey",
        "rating": 2,
        "ugc_id": 552952219
      },
      "name": "Plumping + Firming Eye Cream",
      "native_review_count": 1,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 90,
      "locale": "en_US"
    }
  }
}