{
  "product_id": "pimprod2016440",
  "product_url": "https://www.ulta.com/p/hydra-zen-glow-lightweight-liquid-moisturizer-with-hyaluronic-acid-pimprod2016440",
  "extracted_at": "2025-09-23T04:10:52.960055+00:00",
  "product_name": "LancomeHydra Zen Glow Lightweight Liquid Moisturizer with Hyaluronic Acid",
  "brand": "Lancome",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Face Moisturizer"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "face"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "55.00",
  "availability": "in_stock",
  "rating_avg": "4.1",
  "rating_count": "57",
  "images": [
    "https://media.ulta.com/i/ulta/2562193?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2562193?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2562193cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2562193cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2562193cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2562193cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2562193cm_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2562193cm_vid01/thumbs/3fa3267b-e540-4e94-976d-3ef54589020f?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryLancôme Hydra Zen Anti-Stress Glow Liquid Moisturizer is a light-weight moisturizer, made with 11 amino acids and hyaluronic acid, that will deeply hydrate, visibly de-stress and strengthen the skin's moisture barrier for an instant all day glow, and leaves skin softer, smoother and revitalized.",
  "details": "DetailsFeaturesHydra Zen Anti-Stress Glow Liquid Moisturizer is a non-sticky, ultra light-weight moisturizer that has a silky, liquid cream textureIt feels like a fresh burst of water upon application and nourishes skin with 24-hour hydrationBenefitsIts gentle, alcohol-free formula mimics skin's natural moisture functions to reveal an improved glow and more beautiful, radiant complexionImproves skin's natural ability to prevent water loss, defends against pollution and provides anti-oxidant protectionSkin is instantly re-energized and looks softer with a more even toneFine lines, redness, discomfort and fatigue also appear visibly reducedMade with 11 amino acids, hyaluronic acid, aloe vera and rose extractSuitable for all skin types, including dry and sensitive skinDermatologist-tested for safetyNon-comedogenicResearch ResultsInstantly:Skin looks satiny and soft, revitalized and re-energized, visibly refreshed with a more beautiful toneSigns of stress are visibly reduced, including: fine lines from dehydration, redness, discomfort and signs of fatigueAfter Four Hours:42% improvement in moisture, skin is significantly hydratedAfter One Day:Skin is visibly more radiant and luminous, and feels moisturizedSigns of fatigue look reduced, skin looks as if renewedAfter Two Weeks:Skin seems stronger and bouncierSkin looks smoother and younger, with a more even toneSkin feels less irritated, less itchyAfter Four-Weeks:89% reduction in facial stinging sensations, and dryness and feelings of tightness and itching reducedSkin is soothed, less reactive to external aggressors such as pollutionItem 2562193How To Use• Use daily, in the morning and at night, after cleansing and applying your face serum.• Apply 2-3 pumps of the liquid moisturizer onto the face and neck, and evenly spread the formula until absorbed. Follow with your eye care and/or makeup routine.IngredientsAqua/Water/Eau, Glycerin, Pentylene Glycol, Octyldodecanol, Butylene Glycol, Caprylic/Capric Triglyceride, Butyrospermum Parkii Butter/Shea Butter, Simmondsia Chinensis Seed Oil/Jojoba Seed Oil, Beheneth-10, Squalane, Glycol Palmitate, Pca, Alanine, Cocos Nucifera Oil/Coconut Oil, Tocopherol, Macadamia Ternifolia Seed Oil, Hydroxyacetophenone, Sodium Polyacrylate, Sodium Hyaluronate, Sodium Pca, Sodium Lactate, Paeonia Suffruticosa Root Extract, Phenylalanine, Arginine, Helianthus Annuus Seed Oil / Sunflower Seed Oil, Valine, Palmitoyl Tripeptide-8, Xanthan Gum, Menthol, Aloe Barbadensis Leaf Juice Powder, Propylene Glycol, Proline, Isoleucine, Aspartic Acid, Coriandrum Sativum Fruit Oil/Coriander Fruit Oil, Sorbitol, Serine, Threonine, Passiflora Edulis Seed Oil, Rosa Gallica Flower Extract, Histidine, Citric Acid, Prunus Armeniaca Kernel Oil/Apricot Kernel Oil, Dextran, Glycine, Parfum/Fragrance.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "• Use daily, in the morning and at night, after cleansing and applying your face serum.• Apply 2-3 pumps of the liquid moisturizer onto the face and neck, and evenly spread the formula until absorbed. Follow with your eye care and/or makeup routine.",
  "ingredients": [
    "Aqua/Water/Eau",
    "Glycerin",
    "Pentylene Glycol",
    "Octyldodecanol",
    "Butylene Glycol",
    "Caprylic/Capric Triglyceride",
    "Butyrospermum Parkii Butter/Shea Butter",
    "Simmondsia Chinensis Seed Oil/Jojoba Seed Oil",
    "Beheneth-10",
    "Squalane",
    "Glycol Palmitate",
    "Pca",
    "Alanine",
    "Cocos Nucifera Oil/Coconut Oil",
    "Tocopherol",
    "Macadamia Ternifolia Seed Oil",
    "Hydroxyacetophenone",
    "Sodium Polyacrylate",
    "Sodium Hyaluronate",
    "Sodium Pca",
    "Sodium Lactate",
    "Paeonia Suffruticosa Root Extract",
    "Phenylalanine",
    "Arginine",
    "Helianthus Annuus Seed Oil / Sunflower Seed Oil",
    "Valine",
    "Palmitoyl Tripeptide-8",
    "Xanthan Gum",
    "Menthol",
    "Aloe Barbadensis Leaf Juice Powder",
    "Propylene Glycol",
    "Proline",
    "Isoleucine",
    "Aspartic Acid",
    "Coriandrum Sativum Fruit Oil/Coriander Fruit Oil",
    "Sorbitol",
    "Serine",
    "Threonine",
    "Passiflora Edulis Seed Oil",
    "Rosa Gallica Flower Extract",
    "Histidine",
    "Citric Acid",
    "Prunus Armeniaca Kernel Oil/Apricot Kernel Oil",
    "Dextran",
    "Glycine",
    "Parfum/Fragrance"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "face"
    ],
    "product_type": [
      "moisturizer"
    ],
    "skin_type": [
      "dry",
      "sensitive",
      "all skin types"
    ],
    "finish": [
      "dewy",
      "satin",
      "sheer",
      "creamy",
      "powdery",
      "liquid",
      "cream",
      "oil"
    ],
    "ingredients": [
      "peptides",
      "fragrance"
    ],
    "brand": [
      "luxury",
      "premium"
    ],
    "special_features": [
      "natural",
      "dermatologist-tested",
      "non-comedogenic",
      "alcohol-free",
      "brightening",
      "soothing",
      "purifying"
    ]
  },
  "reviews": {
    "product_id": "pimprod2016440",
    "total_reviews": 57,
    "reviews": [
      {
        "review_id": 561184121,
        "rating": 3,
        "headline": "I normally love this but…",
        "comments": "This bottle seems a bit old. The smell is off. Not like my last few bottles.",
        "nickname": "Mick",
        "location": "Tennessee",
        "created_date": 1756309110112,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551231039,
        "rating": 5,
        "headline": "LOVE",
        "comments": "This is a wonderful moisturizer. I have maturing skin, i am 50yo, and this is a perfect daytime moisturizer, light but very moisturizing.  It makes an awesome canvas for makeup or alone gice you a slight glow.  It works well with the other serums I use.  I use it daily every morning and at night i use the hydra zen cream.",
        "nickname": "S.S.",
        "location": "Alabama",
        "created_date": 1744140464768,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547014719,
        "rating": 5,
        "headline": "My absolute fav go to product ❤️",
        "comments": "I've been wearing this for about a couple years now. This is a must have. I do have the whole pink Hydra Zen collection. I do use the other products occasionally, the Rose Facial Scrub a couple times a week. I use Hyra Zen twice a day - morning and when i get home from work i wash my face and apply it again. I also been keeping it in the fridge lately and love it. I have gotten many compliments. I facetimed my brother one day - he said sis you look good! He said your skin looks great, what are you using lol. I laughed, thanked him, told him I have no makeup on, then told him I use Lancome Hydra Zen Glow but I put it on like 10-12 hours ago, like at 5am when I was getting ready for work lol  When I finally got home I put all the Lancome products I have together, took a pic and sent it to him.",
        "nickname": "Sylvia",
        "location": "61467",
        "created_date": 1740055463013,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 546076039,
        "rating": 5,
        "headline": "Best lightweight moisturizer",
        "comments": "Ive been using this product for 6 months and the benefits have been amazing. I have a dark complexion and it does wonders on my wintery dry skin. I am about to purchase my second bottle!!!!",
        "nickname": "Em",
        "location": "Daphne",
        "created_date": 1738955063089,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 536673238,
        "rating": 2,
        "headline": "not for under makeup",
        "comments": "messed up my makeup every time I used it. had to trash all my makeup sponges",
        "nickname": "e",
        "location": "jacksonville fl",
        "created_date": 1729813543248,
        "bottom_line": null,
        "helpful_votes": 8,
        "not_helpful_votes": 4
      },
      {
        "review_id": 535190536,
        "rating": 5,
        "headline": "I would buy this again",
        "comments": "It feels great in my face",
        "nickname": "Joanna",
        "location": "Fisherville, Ky",
        "created_date": 1727836266001,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 532644687,
        "rating": 3,
        "headline": "Not for me",
        "comments": "Too sticky and didn't get any benefit from this one.",
        "nickname": "Myra",
        "location": "TX",
        "created_date": 1726021602284,
        "bottom_line": "No",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 523586225,
        "rating": 5,
        "headline": "Wonderful Summer Moisturizer",
        "comments": "A beautiful moisturizer for the Summer.  I have very dry and mature skin and generally need a very thick moisturizer so, thus one surprised me!  It's super light, absorbs very quickly and keeps my skin moisturized all night.",
        "nickname": "Christine",
        "location": "Chicago",
        "created_date": 1719195752629,
        "bottom_line": null,
        "helpful_votes": 7,
        "not_helpful_votes": 0
      },
      {
        "review_id": 513482434,
        "rating": 5,
        "headline": "I love it.",
        "comments": "One of the best moisturizers ive used and ive used quite a few. I honestly it better then even the more expensive, better reviewed competitors (like Tatcha or Glow Recipe). The smell is strong but it works really well and makes my skin glow and feel good.",
        "nickname": "M",
        "location": "Pittsburgh, Pa",
        "created_date": 1715362690972,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 511508154,
        "rating": 5,
        "headline": "best container for a moisturizer",
        "comments": "lightweight, not too glowy , easy to layer with sunscreens",
        "nickname": "chelsea",
        "location": "denver",
        "created_date": 1713246043842,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 508649900,
        "rating": 5,
        "headline": "This erased redness and itchy skin",
        "comments": "I was advised to try this instead of more makeup to cover red areas on my skin. It worked immediately and just zapped my dry skin issues. My friend, who has suffered from Excema for years saw her redness and itchy skin gone within days.",
        "nickname": "Tina",
        "location": "North Carolina",
        "created_date": 1710611352826,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 497630530,
        "rating": 5,
        "headline": "Updated Review after consistent use...",
        "comments": "Came back to do a review update because I'm on bottle 3 of this gem right now and I figured most reviews are done after a couple uses or a week of use. I like to read reviews after extensive use of a product. Okay so after bottle #2 I decided to branch out and try something new (I know we all do it!) so after almost 3 mths of using something else my face lacked it's glow and some of my hyperpigmentation returned around my cheeks and upper lip. I had managed to clear almost all of it up while using this! Stupidly I fell for a video of a different product and switched to it. I just went out and bought this again and already my face feels softer again and I know my hyperpigmentation will decrease again! I won't make that mistake again! This formula does not contain dimethicone which is important to me, I don't want a fake softness to my skin, I want a nourished softness. This is light and silky going on and even with dehydrated, dry skin I can skip a top moisturizer most days. The light smell goes away within seconds and does not bother me at all - strong botanical smells cause a migraine- lucky me! This is not a gel it is more like a serum texture or a light lotion texture, it sinks in pretty quickly. The bottle is glass and beautiful on my countertop, plus pump bottles are way more sanitary than droppers or jars. I appreciate a good pump bottle because I know when something comes with a spatula I'm using my fingers after about a week and a dropper always ends up touching my face or not sucking up enough product so I get mad at it! Come on beauty industry there is nothing wrong with a pump dispenser! Take note!!! I highly recommend this product and pray Lancome doesn't ever discontinue it! \nSo if you have uneven tone, hyperpigmentation, dry and or dehydrated skin, aging skin, and dislike dimethicone you may love this formula!",
        "nickname": "kay",
        "location": "Murfreesboro, TN",
        "created_date": 1706122250088,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 486187812,
        "rating": 5,
        "headline": "Love it!",
        "comments": "I have been using this product for several years. I began using it during a Summer because it was lightweight, and continued through the year.",
        "nickname": "",
        "location": "Eastern NC",
        "created_date": 1704048302311,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 481334070,
        "rating": 2,
        "headline": "Mixed feelings",
        "comments": "I have dry skin and this is a very light moisturizer. So, it's ok during summer, but as soon as it starst getting cold, I needed to double down. I like it's consistency, look and fragrance, but I don't think is worth the price.",
        "nickname": "Southern Belle",
        "location": "Birmingham AL",
        "created_date": 1699764956099,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 479484010,
        "rating": 2,
        "headline": "Not for dry skin",
        "comments": "I wanted to like it because its lightweight but unfortunately its too light for dry skin.",
        "nickname": "Jil0123",
        "location": "Los Angeles, CA",
        "created_date": 1699043161033,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 478459266,
        "rating": 2,
        "headline": "Doesn't do much",
        "comments": "It makes my skin appear oily on my t-zone but still dry everywhere else. It doesnt help my combination skin. I usually mix it with one of my retinol serums to add a little moisture to it.",
        "nickname": "Dani",
        "location": "Seattle, WA",
        "created_date": 1698297964003,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 477429289,
        "rating": 5,
        "headline": "Hello gorgeous",
        "comments": "This light-weight, highly-absorbant lotion is truly the best facial treatment I've ever used. I am 48 and struggle with dry, rosacea-prone skin. I have tried everything from drugstore heros $ to high-end, European elixirs $$$. I read the ratings and reviews, and then basically pray that the next product will be The One. I have used Lancôme products on and off over the years and have never been impressed until now. The Hydra Zen light weight moisturizer is everything I've been looking for. It absorbs quickly and keeps my skin looking glowing and fresh all day long. I have had several people (including my mom who isnt a products person) ask me what I am doing differently with my skin. Am I drinking more water? Exercising more? Doing masks or getting facials? Nope. It's the light weight Hydra Zen. At night, I'm using the toner and then occasionally follow up with the thicker Hydra Zen Cream and I love the way my skin looks and feels. The scent is old fashioned but doesnt bother me and quickly fades. \nI know this is a long review but it is entirely worth it. I would absolutely suggest this lotion and the accompanying products to a friend.",
        "nickname": "HollyfromRaleigh",
        "location": "Raleigh, NC",
        "created_date": 1697979523449,
        "bottom_line": null,
        "helpful_votes": 8,
        "not_helpful_votes": 0
      },
      {
        "review_id": 474620120,
        "rating": 4,
        "headline": "Comparison",
        "comments": "Purchased the lotion  and crème gel to compare the both types of Hydra zen.\nHave been using the crème gel and like it. This lotion feels creamier. Probably preferred by a combination skin type.",
        "nickname": "Bonny",
        "location": "Wailuku,Hawaii",
        "created_date": 1696093589663,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 473006702,
        "rating": 4,
        "headline": "One of the best",
        "comments": "I love it, i got it during the 21 days of beauty… the only reason i took a star away is bc of its cost. Its pretty expensive, glad i got it 50% off.",
        "nickname": "Dani",
        "location": "Elmira NY",
        "created_date": 1695379850684,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 1
      },
      {
        "review_id": 472254405,
        "rating": 5,
        "headline": "THE BEST!!!",
        "comments": "Ive been using this for a few years now and it is a wonder lotion. My skin gets so moisturized and soft and radiant, nothing else compares.\nI have very sensitive skin and have tried so many I am grateful for these Lancome products.\nThank you",
        "nickname": "Den",
        "location": "Massachusetts",
        "created_date": 1694718146694,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 57,
      "pages_total": 3,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2016440/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "Made my face worse than it was",
              "count": 1
            },
            {
              "label": "Causes breakouts",
              "count": 1
            },
            {
              "label": "Strong fragrance",
              "count": 1
            }
          ],
          "display_values": [
            "Causes breakouts",
            "Made my face worse than it was",
            "Strong fragrance"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "Active",
              "count": 1
            },
            {
              "label": "Combo skin",
              "count": 1
            }
          ],
          "display_values": [
            "Active",
            "Casual Dresser",
            "Combo skin",
            "Comfort-seeking",
            "Energetic/Active",
            "Stylish/Fashionista",
            "Trendy/Stylish Dresser",
            "Youthful"
          ]
        },
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Combination",
              "count": 4
            },
            {
              "label": "Dry",
              "count": 2
            },
            {
              "label": "Normal",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        2,
        10,
        4,
        6,
        35
      ],
      "review_histogram": [
        2,
        10,
        4,
        6,
        35
      ],
      "rating_count": 57,
      "review_count": 57,
      "average_rating": 4.09,
      "recommended_ratio": 0.75,
      "media": [],
      "faceoff_positive": {
        "comments": "Came back to do a review update because I'm on bottle 3 of this gem right now and I figured most reviews are done after a couple uses or a week of use. I like to read reviews after extensive use of a product. Okay so after bottle #2 I decided to branch out and try something new (I know we all do it!) so after almost 3 mths of using something else my face lacked it's glow and some of my hyperpigmentation returned around my cheeks and upper lip. I had managed to clear almost all of it up while using this! Stupidly I fell for a video of a different product and switched to it. I just went out and bought this again and already my face feels softer again and I know my hyperpigmentation will decrease again! I won't make that mistake again! This formula does not contain dimethicone which is important to me, I don't want a fake softness to my skin, I want a nourished softness. This is light and silky going on and even with dehydrated, dry skin I can skip a top moisturizer most days. The light smell goes away within seconds and does not bother me at all - strong botanical smells cause a migraine- lucky me! This is not a gel it is more like a serum texture or a light lotion texture, it sinks in pretty quickly. The bottle is glass and beautiful on my countertop, plus pump bottles are way more sanitary than droppers or jars. I appreciate a good pump bottle because I know when something comes with a spatula I'm using my fingers after about a week and a dropper always ends up touching my face or not sucking up enough product so I get mad at it! Come on beauty industry there is nothing wrong with a pump dispenser! Take note!!! I highly recommend this product and pray Lancome doesn't ever discontinue it! \nSo if you have uneven tone, hyperpigmentation, dry and or dehydrated skin, aging skin, and dislike dimethicone you may love this formula!",
        "headline": "Updated Review after consistent use...",
        "rating": 5,
        "ugc_id": 497630530
      },
      "faceoff_negative": {
        "comments": "I typically love Lancôme products- I use the foundation, face and eye serums and face wash, but I did not like not this product. While it was moisturizing, it stayed tacky and a little greasy. I have combo to dry skin so it may work better for someone with a drier skin type but it did not work for me. Also the scent is like an \"old lady perfume\" kind of smell which wouldn't really bother me if it would go away quickly but it sticks around for quite awhile and is a dealbreaker for me. Sadly not a fan.",
        "headline": "Grandma perfume and tacky",
        "rating": 2,
        "ugc_id": 341484266
      },
      "name": "Hydra Zen Glow Lightweight Liquid Moisturizer with Hyaluronic Acid",
      "native_review_count": 57,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 0,
      "locale": "en_US"
    }
  }
}