{
  "product_id": "pimprod2040682",
  "product_url": "https://www.ulta.com/p/hueskin-hydrating-serum-concealer-pimprod2040682",
  "extracted_at": "2025-09-23T04:09:39.897193+00:00",
  "product_name": "Live TintedHueskin Hydrating Serum Concealer",
  "brand": "Live Tinted",
  "categories": [
    "Home",
    "Makeup",
    "Face",
    "Concealer"
  ],
  "category_keys": [
    "home",
    "makeup",
    "face",
    "concealer"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "29.00",
  "availability": "in_stock",
  "rating_avg": "4.1",
  "rating_count": "404",
  "images": [
    "https://media.ulta.com/i/ulta/2614727?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2614727?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2614727_sm?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2614724cm_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2614724cm_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2614724cm_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2614724cm_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2614724cm_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2614724cm_vid01/thumbs/3119666a-a126-4cef-8c29-fdc55e183ee9?w=600&h=337&fmt=auto",
    "https://media.ulta.com/v/ulta/2614724cm_vid02/thumbs/7eba90ab-f4bb-4d11-9f88-e76c118fa86b?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganA lightweight, medium-to-full coverage serum concealer that instantly evens out dark circles and spots, Live Tinted's Hueskin Hydrating Serum Concealer contains powerhouse skincare ingredients that hydrate dry skin and help with fine lines and wrinkles.",
  "details": "DetailsFeaturesMedium-to-full buildable coverageConceals under-eye circles, dark spots & blemishes for up to 12 hoursLightweight feel on skinCreamy texture blends easily and effectivelyHydrates and brightens for a more radiant-looking, even eye areaFragrance FreeKey IngredientsNiacinamide moisturizes, brightens, improves skin texture, and helps with the appearance of fine lines and wrinkles.Hyaluronic Acid Complex is a combination of 5 hyaluronic acids at different molecular levels to help to attract and retain moisture and improve elasticity.Bakuchiol is a gentle, plant-based ingredient with similar benefits to retinol and helps reduce hyperpigmentation and acne.Caffeine helps fade dark spots resulting in more luminous, even skin tone.Vitamin C helps to protect against environmental damage.Research ResultsClinically tested to significantly improve the appearance of hyperpigmentation and dark spots, undereye discoloration, fine lines and wrinkles, and dry skin.Clinically tested for up to 12-hour wear.In a clinical study with 30 participants, 90% of users showed a significant improvement in undereye discoloration after 8 weeks.In a consumer study on 30 participants, 100% agreed that Hueskin provides the perfect amount of coverage while still looking natural after 1 use.In a consumer study on 30 participants, 100% agreed that Hueskin covers dark circles and leaves their undereye area looking brighter and more awake after 8 weeks.In a consumer study on 30 participants, 100% agreed that Hueskin helped fade hyperpigmentation onto the areas in which they've applied it (on clean skin) after 8 weeksItem 2614727How To UseDot and blend using fingers or a makeup sponge onto areas you want to even skin tone or brighten. Feel free to add layers- its buildable!IngredientsAqua/Water/Eau, Shea Butter Ethyl Esters, Polyglyceryl-6 Pentaoleate, Isoamyl Laurate, Undecane, Glycerin, Disteardimonium Hectorite, Caprylic/Capric Triglyceride, Tridecane, Jojoba Esters, Magnesium Sulfate, Niacinamide, Caffeine, Bakuchiol, Sodium Hyaluronate, Sodium Hyaluronate Crosspolymer, Hyaluronic Acid, Hydrolyzed Hyaluronic Acid, Acacia Decurrens Flower Wax, Ascorbyl Tetraisopalmitate, Tocopherol, Raspberry Ketone, Persea Gratissima (Avocado) Oil, Helianthus Annuus (Sunflower) Seed Wax, Phenoxyethanol, Aluminum Hydroxide, Propylene Carbonate, Glycolipids, Ethylhexylglycerin, Polyglycerin-3, Propanediol, Hydrolyzed Glycosaminoglycans, Benzyl Glycol, Citric Acid. May Contain: Titanium Dioxide (CI 77891), Iron Oxides (CI 77492, CI 77491, CI 77499).Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Dot and blend using fingers or a makeup sponge onto areas you want to even skin tone or brighten. Feel free to add layers- its buildable!",
  "ingredients": [
    "Aqua/Water/Eau",
    "Shea Butter Ethyl Esters",
    "Polyglyceryl-6 Pentaoleate",
    "Isoamyl Laurate",
    "Undecane",
    "Glycerin",
    "Disteardimonium Hectorite",
    "Caprylic/Capric Triglyceride",
    "Tridecane",
    "Jojoba Esters",
    "Magnesium Sulfate",
    "Niacinamide",
    "Caffeine",
    "Bakuchiol",
    "Sodium Hyaluronate",
    "Sodium Hyaluronate Crosspolymer",
    "Hyaluronic Acid",
    "Hydrolyzed Hyaluronic Acid",
    "Acacia Decurrens Flower Wax",
    "Ascorbyl Tetraisopalmitate",
    "Tocopherol",
    "Raspberry Ketone",
    "Persea Gratissima (Avocado) Oil",
    "Helianthus Annuus (Sunflower) Seed Wax",
    "Phenoxyethanol",
    "Aluminum Hydroxide",
    "Propylene Carbonate",
    "Glycolipids",
    "Ethylhexylglycerin",
    "Polyglycerin-3",
    "Propanediol",
    "Hydrolyzed Glycosaminoglycans",
    "Benzyl Glycol",
    "Citric Acid. May Contain: Titanium Dioxide (",
    "Iron Oxides ("
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "makeup",
      "face",
      "cosmetics"
    ],
    "product_type": [
      "serum",
      "foundation"
    ],
    "skin_type": [
      "dry",
      "combination",
      "sensitive",
      "acne-prone",
      "mature"
    ],
    "finish": [
      "dewy",
      "sheer",
      "full coverage",
      "medium coverage",
      "creamy",
      "cream",
      "oil"
    ],
    "ingredients": [
      "hyaluronic-acid",
      "niacinamide",
      "sulfate-free"
    ],
    "brand": [
      "mid-range",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "natural",
      "fragrance-free",
      "anti-aging",
      "hydrating",
      "brightening",
      "soothing"
    ]
  },
  "reviews": {
    "product_id": "pimprod2040682",
    "total_reviews": 404,
    "reviews": [
      {
        "review_id": 563513105,
        "rating": 3,
        "headline": "GREAT PRODUCT TERRIBLE PACKAGING",
        "comments": "From what I've learned, they changed the wand to a doe foot instead of a brush which would be great if I hadn't purchased this before that change. If you have the old packaging know that the bristles fall out which isn't surprising since the base with the glue is in liquid which anyone who owns a makeup brush knows is bad. Also, the concealer smells expired. I've had zero reaction to it but know it smells a little mildewy. I'm going to need clean beauty brands to start using parabens again to prevent this, and if that's just how the formula smells, use some type of fragrance to mask it. Or the smell might be caused by the eroding brush glue and every problem comes down to the applicator. That's what I hope.\n\nAnyway, with all that negative the reason I give it 3 stars is because it's the perfect color match for me and perfect for spot concealing, and even better for when I'm wearing a more natural foundation. The concealer works great which is why I put up with it's flaws and depotted it so I can continue to use it. When I finish this one I'll probably repurchase with the new wand in hopes that all the problems are solved and I have my holy grail product.",
        "nickname": "Jazmin",
        "location": "CA",
        "created_date": 1758064789585,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 563511806,
        "rating": 5,
        "headline": "Top notch",
        "comments": "Goes on smoothly and doesn't sit in my fine lines and wrinkles. Blends well. Creamy and hydrating.",
        "nickname": "Naomi",
        "location": "Pittsburgh",
        "created_date": 1758061292342,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 563334677,
        "rating": 5,
        "headline": "Beautiful concealer!!",
        "comments": "I really love the coverage and finish of this concealer. Honestly reminds of the hourglass one. It stays put all day. I have shade 13 and absolutely love it!",
        "nickname": "Sherin",
        "location": "Texas",
        "created_date": 1757779936549,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 563282710,
        "rating": 5,
        "headline": "i am very happy with this concealer",
        "comments": "i was surprised to  see that everything this concealer says it does, it does! it's hydrating not matte or dry, it goes on smooth and not watery, covers very well, under eye so hydrated and no cakey look, i am 56 and fine lines are covered and hydrated, i usually by Kosas and this is a level up from it.. the color match they provided is spot on.. i for sure will buy again even tho i really really like Kosas..",
        "nickname": "anabela",
        "location": "NJ",
        "created_date": 1757696118267,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 562991917,
        "rating": 5,
        "headline": "Very natural",
        "comments": "This concealer covers very well as I have very dark circles.  It goes on very smooth, it is creamy and lasts all day.",
        "nickname": "Jeannie",
        "location": "Cleveland , Ohio",
        "created_date": 1757348938492,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 561052748,
        "rating": 4,
        "headline": "Faulty application",
        "comments": "I love the concealer but the applicator is terrible…i thought i had a faulty product so I exchanged it but the samd thing happened and i see others had the same issue.",
        "nickname": "Beez",
        "location": "New York",
        "created_date": 1756069242722,
        "bottom_line": null,
        "helpful_votes": 11,
        "not_helpful_votes": 1
      },
      {
        "review_id": 559909167,
        "rating": 5,
        "headline": "All the right stuff!",
        "comments": "I don't wear a lot of makeup, and was looking for a concealer that I could use as a spot treatment as well as cover for a dark/age spot I have on my cheek. As this contains all the goodies I was hoping for, I am very happy with it! The ingredients sold me.",
        "nickname": "Catherine",
        "location": "WI",
        "created_date": 1754882516446,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 2
      },
      {
        "review_id": 557738788,
        "rating": 5,
        "headline": "The Winner",
        "comments": "I've tried dozens of concealers over many years (decades?) and this one is my favorite. Just the right amount of coverage, the color I chose suits me perfectly, and the formula is creamy and easy to blend with my BK Beauty Angie concealer brush or a finger. I really should just throw away the nine other concealers I have in my drawer as this is the one that never disappoints.",
        "nickname": "makeitadouble",
        "location": "Scottsdale, AZ",
        "created_date": 1752949963087,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556668767,
        "rating": 3,
        "headline": "hydrating but not great",
        "comments": "I like to buy concealers to try on 21 day sales so I can use them up on my everyday quick run makeup. This turned out to be the best option for this concealer because it is does not last and is very slippy. It doesn't play well with other products, is difficult to powder and creases immediately. What I like is that it is good for sensitive skin and has skincare in it. The shades have a good amount of tones with yellow and red. There are times where it completely lifts up even just blending it. It does dry down slightly but never sets.",
        "nickname": "s",
        "location": "ny",
        "created_date": 1751668588617,
        "bottom_line": "No",
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555654732,
        "rating": 2,
        "headline": "What is wrong with the applicator??",
        "comments": "I was hype to use this bc its my perfect match for a concealer only look. I was flabbergasted at how it fell apart on FIRST use!?!!? I am disappointed to say the least. Ill have to find a way to use it because the applicator is unusable. Sha",
        "nickname": "mwmakeup42",
        "location": "Arizona",
        "created_date": 1750484929681,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555125855,
        "rating": 5,
        "headline": "Really happy with this concealer",
        "comments": "I was eyeing this concealer for a while. I'm a light-skinned Indian woman and have a lot of trouble finding the right undertone in concealers, as well as a formula that doesn't make my 40-something undereyes look dry. The last close-to-perfect concealer I found was discontinued, so I've been on the search for a new favorite concealer.  It's only been a few days but I think this may be the one. I went into Ulta a couple of times to swatch it and watched as many YouTube reviews as I could find (there aren't a ton), and finally made the plunge when Ulta was having a 5X points multiplier on Live Tinted last week. When I was swatching it in the store I noticed it oxidizes a bit when it dries down (but NOT in an orange way, just darkening a bit), so I kept that in mind when deciding on my shade. I also asked an associate who agreed with me that shade 17 is my shade. I prefer my concealer shade to match the rest of my face (if a concealer is too light/bright it gives me a reverse raccoon effect). The one I bought has a regular sponge tip applicator, so I don't have the issue with errant brush hairs that others have mentioned. Shade 17 works perfectly on me. It makes my under eyes look hydrated and luminous and has pretty good lasting power (I don't set my concealer with powder or anything). So far I haven't really noticed any creasing. I'm really happy with this purchase.",
        "nickname": "B12R12",
        "location": "Chicago",
        "created_date": 1749865288682,
        "bottom_line": "Yes",
        "helpful_votes": 8,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552949992,
        "rating": 5,
        "headline": "love it!",
        "comments": "works great for mature undereye",
        "nickname": "",
        "location": "Pittsburgh",
        "created_date": 1746553133513,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552545937,
        "rating": 1,
        "headline": "new applicator",
        "comments": "glad they changed the wands. I bought this concealer when it first came out. I couldn't even really use it. the hairs on the wand fall apart reached out to ulta and the company couldn't get help. I threw both of the colors I got away.",
        "nickname": "moedazzle",
        "location": "Fontana ca",
        "created_date": 1745808857169,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 7
      },
      {
        "review_id": 552049009,
        "rating": 5,
        "headline": "Don't look further!",
        "comments": "I bought this concealer on the 21 days of beauty. It makes my skin look so youthful, non cakey, beautiful coverage and bedt part last all day. Has replace Tarte shape tape. I will re-purchase forever.🖤",
        "nickname": "Bre",
        "location": "Rockford, IL",
        "created_date": 1745051130383,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550803254,
        "rating": 4,
        "headline": "LOVEIT",
        "comments": "I am extremely picky with concealers this one gives you great coverage \nAnd it blends beautiful! \nThroughout the day it wears amazing\nI am so happy i found it !\nIt mimica hourglass but not so heavy 💓",
        "nickname": "Mom",
        "location": "El paso Texas",
        "created_date": 1743483749882,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550803245,
        "rating": 4,
        "headline": "LOVEIT",
        "comments": "I am extremely picky with concealers this one gives you great coverage \nAnd it blends beautiful! \nThroughout the day it wears amazing\nI am so happy i found it !\nIt mimica hourglass but not so heavy 💓",
        "nickname": "Mom",
        "location": "El paso Texas",
        "created_date": 1743483749018,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 550761720,
        "rating": 1,
        "headline": "Wish I had the chance to like",
        "comments": "I wanted to like this, but the applicator is terrible! The little hairs came off on my face and almost ruined my birthday makeup! SWITCH THE APPLICATOR PUHLEASE!",
        "nickname": "Big Chrissi",
        "location": "Memphganistan",
        "created_date": 1743406809897,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 548668945,
        "rating": 2,
        "headline": "Applicator is Horrible",
        "comments": "The concealer is not so bad, the applicator is horrible. The bristles are all over your face after applying. You have to pick them before you can complete your makeup.",
        "nickname": "K",
        "location": "Texas",
        "created_date": 1741860285562,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547955112,
        "rating": 3,
        "headline": "Defective brush !",
        "comments": "I dont know what is up with this brand.. They are saying they changed the janky brush but everytime i buy this concealer from ulta in store/online i get the same defective brush! It is so frusterating because the concealer is great but i cant apply it if the brush continues to fall out !",
        "nickname": "Kay",
        "location": "Atlanta, Ga",
        "created_date": 1741400479130,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547583190,
        "rating": 5,
        "headline": "Nice formula for mature skin",
        "comments": "The formula is thin, color match is nice. I was so impressed with this product I went ahead and purchased a shade darker for summer months during sale event. Also picked up liquid blush color and went back for more. Not enough noise made about this brand, the smell is odd but Wow! Impressive product.",
        "nickname": "Jean",
        "location": "Chicago",
        "created_date": 1740927078189,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 176,
      "pages_total": 9,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2040682/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        31,
        28,
        49,
        65,
        231
      ],
      "review_histogram": [
        31,
        28,
        49,
        65,
        231
      ],
      "rating_count": 404,
      "review_count": 404,
      "average_rating": 4.08,
      "recommended_ratio": 0.6,
      "media": [
        {
          "id": "532322515",
          "review_id": 532322497,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/bo1zau90mb9xoiku2axw.jpg",
          "headline": "Very cheap brush applicator",
          "rating": 1,
          "helpful_votes": 1,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Mirta",
          "created_date": 1725754655743
        },
        {
          "id": "527653588",
          "review_id": 527653403,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/istymficuilngtfek3xv.jpg",
          "headline": "Formula was nice tubing trash",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Aneet",
          "created_date": 1724126639094
        },
        {
          "id": "527653604",
          "review_id": 527653403,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ziiy6miah5udcqwrpeug.jpg",
          "headline": "Formula was nice tubing trash",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Literally slipped out while I was using it",
          "nickname": "Aneet",
          "created_date": 1724126639094
        },
        {
          "id": "523777022",
          "review_id": 523777011,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ypmxfbwaazrh5frw3o8m.jpg",
          "headline": "Flawed Bristle Brush / Not full coverage",
          "rating": 3,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Jaz",
          "created_date": 1719443023190
        },
        {
          "id": "523777021",
          "review_id": 523777011,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/q2h4tt6dl0k3hjjcn61h.jpg",
          "headline": "Flawed Bristle Brush / Not full coverage",
          "rating": 3,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Jaz",
          "created_date": 1719443023190
        },
        {
          "id": "523777020",
          "review_id": 523777011,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/pf0km27enndlswdgen4a.jpg",
          "headline": "Flawed Bristle Brush / Not full coverage",
          "rating": 3,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Flawed applicator",
          "nickname": "Jaz",
          "created_date": 1719443023190
        },
        {
          "id": "506973151",
          "review_id": 506973125,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/atyfdyo6pm25gju48ev8.jpg",
          "headline": "Love the Concealer, Hate the Applicator",
          "rating": 3,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Bristles falling out",
          "nickname": "T",
          "created_date": 1708966187201
        },
        {
          "id": "501848121",
          "review_id": 501847864,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/jp8jlbfddy0t0pahxsrv.jpg",
          "headline": "Pretty good but terrible applicator",
          "rating": 4,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "The bristles in a clump",
          "nickname": "Michelle",
          "created_date": 1706801615703
        },
        {
          "id": "485790637",
          "review_id": 485790713,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/o80dgscpxlv6rlctwrpo.jpg",
          "headline": "A hydrating formula but horrible brush!",
          "rating": 2,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Khanani",
          "created_date": 1703463467529
        },
        {
          "id": "485790694",
          "review_id": 485790713,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/x0yjduetnnvegwyv9xsq.jpg",
          "headline": "A hydrating formula but horrible brush!",
          "rating": 2,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Khanani",
          "created_date": 1703463467529
        },
        {
          "id": "485790682",
          "review_id": 485790713,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/l3aycapzdspltfeejhx7.jpg",
          "headline": "A hydrating formula but horrible brush!",
          "rating": 2,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Khanani",
          "created_date": 1703463467529
        },
        {
          "id": "485790681",
          "review_id": 485790713,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ibbhp0ctgxka95aq6tib.jpg",
          "headline": "A hydrating formula but horrible brush!",
          "rating": 2,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Khanani",
          "created_date": 1703463467529
        },
        {
          "id": "482068382",
          "review_id": 482068244,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/uf4vhqx8ykeq9xf38xnr.jpg",
          "headline": "The applicator brush came apart within a few days of use",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Kavya",
          "created_date": 1700528201545
        },
        {
          "id": "482068381",
          "review_id": 482068244,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/rvenpfw7amr0co0bogcg.jpg",
          "headline": "The applicator brush came apart within a few days of use",
          "rating": 1,
          "helpful_votes": 1,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Kavya",
          "created_date": 1700528201545
        },
        {
          "id": "482068179",
          "review_id": 482068244,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/nt2mhbldn6zmgp6srzfn.jpg",
          "headline": "The applicator brush came apart within a few days of use",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Kavya",
          "created_date": 1700528201545
        }
      ],
      "faceoff_positive": {
        "comments": "I was eyeing this concealer for a while. I'm a light-skinned Indian woman and have a lot of trouble finding the right undertone in concealers, as well as a formula that doesn't make my 40-something undereyes look dry. The last close-to-perfect concealer I found was discontinued, so I've been on the search for a new favorite concealer.  It's only been a few days but I think this may be the one. I went into Ulta a couple of times to swatch it and watched as many YouTube reviews as I could find (there aren't a ton), and finally made the plunge when Ulta was having a 5X points multiplier on Live Tinted last week. When I was swatching it in the store I noticed it oxidizes a bit when it dries down (but NOT in an orange way, just darkening a bit), so I kept that in mind when deciding on my shade. I also asked an associate who agreed with me that shade 17 is my shade. I prefer my concealer shade to match the rest of my face (if a concealer is too light/bright it gives me a reverse raccoon effect). The one I bought has a regular sponge tip applicator, so I don't have the issue with errant brush hairs that others have mentioned. Shade 17 works perfectly on me. It makes my under eyes look hydrated and luminous and has pretty good lasting power (I don't set my concealer with powder or anything). So far I haven't really noticed any creasing. I'm really happy with this purchase.",
        "headline": "Really happy with this concealer",
        "rating": 5,
        "ugc_id": 555125855
      },
      "faceoff_negative": {
        "comments": "From what I've learned, they changed the wand to a doe foot instead of a brush which would be great if I hadn't purchased this before that change. If you have the old packaging know that the bristles fall out which isn't surprising since the base with the glue is in liquid which anyone who owns a makeup brush knows is bad. Also, the concealer smells expired. I've had zero reaction to it but know it smells a little mildewy. I'm going to need clean beauty brands to start using parabens again to prevent this, and if that's just how the formula smells, use some type of fragrance to mask it. Or the smell might be caused by the eroding brush glue and every problem comes down to the applicator. That's what I hope.\n\nAnyway, with all that negative the reason I give it 3 stars is because it's the perfect color match for me and perfect for spot concealing, and even better for when I'm wearing a more natural foundation. The concealer works great which is why I put up with it's flaws and depotted it so I can continue to use it. When I finish this one I'll probably repurchase with the new wand in hopes that all the problems are solved and I have my holy grail product.",
        "headline": "GREAT PRODUCT TERRIBLE PACKAGING",
        "rating": 3,
        "ugc_id": 563513105
      },
      "native_review_count": 176,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 228,
      "locale": "en_US"
    }
  }
}