{
  "product_id": "pimprod2014586",
  "product_url": "https://www.ulta.com/p/triple-c-night-cream-pimprod2014586",
  "extracted_at": "2025-09-23T05:33:15.675156+00:00",
  "product_name": "Mad HippieTriple C Night Cream",
  "brand": "Mad Hippie",
  "categories": [
    "Home",
    "Skin Care",
    "Moisturizers",
    "Night Cream"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "moisturizers",
    "night-cream"
  ],
  "currency": "USD",
  "list_price": "33.99",
  "sale_price": "23.79",
  "availability": "in_stock",
  "rating_avg": "4.4",
  "rating_count": "368",
  "images": [
    "https://media.ulta.com/i/ulta/2564736?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2564736?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2564736_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2564736_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2564736_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2564736_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2564736_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2564736_alt06?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganSustainable PackagingGive BackMad Hippie's Triple C Night Cream is a deeply hydrating treatment packed with 3 forms of vitamin C, potent antioxidants & adaptogens.",
  "details": "DetailsKey IngredientsTriple C - 3 bioavailable forms of vitamin C, each with distinct biological processes, join forces to rejuvenate and protect the skin from exposure to daily stressorsTetrahexyldecyl Ascorbate, Magnesium Ascorbyl Phosphate & Ascorbyl Glucoside - all incredibly bioavailable & effective forms of vitamin C, work to brighten the skin and reduce the appearance of discoloration, while lessening the appearance of fine lines and wrinklesReishi - known as the \"mushroom of immortality\" in Chinese medicine, reishi is a powerful adaptogen that is packed with antioxidants and hydrating elementsSodium PCA - a naturally occurring humectant that helps bind moisture to the skin, dramatically improving skin hydrationCloudberry - a revered Nordic berry notorious for its ability to grow in the harshest of conditions that is packed with rejuvenating antioxidants such as vitamin C & beta carotene that help even the complexion and brightenTurmeric Extract - a powerhouse antioxidant great for acne-prone skin, turmeric extract helps lighten the appearance of skin discoloration and provide antioxidant protection and gives the benefits of the revered ancient herb, without the yellow staining effect of standard turmericChaga - a natural adaptogen packed with powerful antioxidants including superoxide dismutase and zinc; works to rejuvenate and protect the skin from daily stressors and exposure to pollutantsShea Butter - used in Africa for centuries for its moisturizing & soothing properties, rich source of the powerful antioxidants vitamin A & E, crucial fatty acids and cinnamic acidCeramide - forms a thin lipid barrier that holds in moisture, while protecting & nourishing the skinFormulated WithoutParabens, petrochemicals, animal ingredients, GMOs, phthalates, SLS, silicone, PEGs, synthetic fragrance and dyesItem 2564736How To UseGently massage into the skin to ensure actives fully penetrate. Can be worn over the Vitamin C or Vitamin A Serum.IngredientsDeionized Water (Aqua), Organic Carthamus Tinctorius (Safflower) Seed Oil, Isopropyl Palmitate, Tetrahexyldecyl Ascorbate (Vitamin C), Magnesium Ascorbyl Phosphate (Vitamin C), Ascorbyl Glucoside (Vitamin C), Cetyl Alcohol, Glycerin, Polyglyceryl-2 Stearate (and) Glyceryl Stearate (and) Stearyl Alcohol, Stearic Acid, Glyceryl Stearate, Inonotus Obliquus (Chaga Mushroom) Extract, Ganoderma Lucidum (Reishi Mushroom) Extract, Butyrospermum Parkii (Shea) Butter, Phenethyl Alcohol, Caprylyl Glycol, Ethylhexyl Glycerin, Calendula Officinalis Flower Extract, Rubus Chamaemorus (Cloudberry) Fruit Extract, Ribes Nigrum (Blackcurrant) Seed Oil, Squalane, Sodium PCA, Xanthan Gum, Steam Distilled Citrus Aurantium Dulcis (Sweet Orange) Oil, Sodium Hyaluronate Acid (Hyaluronic Acid), Tocotrienol (Vitamin E), Curcuma Longa (Turmeric) Root Extract, Chlorella Pyrenoidosa Extract, Allantoin, Ceramide 3, Riboflavin (Vitamin B2).",
  "how_to_use": "Gently massage into the skin to ensure actives fully penetrate. Can be worn over the Vitamin C or Vitamin A Serum.",
  "ingredients": [
    "Deionized Water (Aqua)",
    "Organic Carthamus Tinctorius (Safflower) Seed Oil",
    "Isopropyl Palmitate",
    "Tetrahexyldecyl Ascorbate (Vitamin C)",
    "Magnesium Ascorbyl Phosphate (Vitamin C)",
    "Ascorbyl Glucoside (Vitamin C)",
    "Cetyl Alcohol",
    "Glycerin",
    "Polyglyceryl-2 Stearate (and) Glyceryl Stearate (and) Stearyl Alcohol",
    "Stearic Acid",
    "Glyceryl Stearate",
    "Inonotus Obliquus (Chaga Mushroom) Extract",
    "Ganoderma Lucidum (Reishi Mushroom) Extract",
    "Butyrospermum Parkii (Shea) Butter",
    "Phenethyl Alcohol",
    "Caprylyl Glycol",
    "Ethylhexyl Glycerin",
    "Calendula Officinalis Flower Extract",
    "Rubus Chamaemorus (Cloudberry) Fruit Extract",
    "Ribes Nigrum (Blackcurrant) Seed Oil",
    "Squalane",
    "Sodium PCA",
    "Xanthan Gum",
    "Steam Distilled Citrus Aurantium Dulcis (Sweet Orange) Oil",
    "Sodium Hyaluronate Acid (Hyaluronic Acid)",
    "Tocotrienol (Vitamin E)",
    "Curcuma Longa (Turmeric) Root Extract",
    "Chlorella Pyrenoidosa Extract",
    "Allantoin",
    "Ceramide 3",
    "Riboflavin (Vitamin B2)"
  ],
  "extended_contents": {
    "images": [
      "https://content.syndigo.com/asset/b33d637f-16a2-40db-810e-c078b183fd1d/960.webp",
      "https://content.syndigo.com/asset/4ad278d2-747c-43cc-bb54-3fc2f00f9ce7/960.webp",
      "https://content.syndigo.com/asset/8d2ea270-fc53-4b35-aed2-a59d6908c210/960.webp",
      "https://content.syndigo.com/asset/17383bfd-d78c-408f-a8f1-9ec2f8c67c96/1920.webp",
      "https://content.syndigo.com/asset/17383bfd-d78c-408f-a8f1-9ec2f8c67c96/240.webp",
      "https://content.syndigo.com/asset/c3b02b10-5a80-461d-b3d3-241775441c6b/480.webp",
      "https://content.syndigo.com/asset/88c2854c-6167-4887-a9e3-69eb00fac9b1/480.webp"
    ]
  },
  "tags": {
    "product_type": [
      "moisturizer",
      "night cream"
    ],
    "skin_type": [
      "dry",
      "sensitive",
      "acne-prone",
      "mature"
    ],
    "finish": [
      "sheer",
      "cream",
      "oil"
    ],
    "ingredients": [
      "hyaluronic-acid",
      "vitamin-c",
      "vitamin-e",
      "ceramides",
      "organic"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "organic",
      "natural",
      "anti-aging",
      "hydrating",
      "soothing"
    ],
    "category": []
  },
  "reviews": {
    "product_id": "pimprod2014586",
    "total_reviews": 368,
    "reviews": [
      {
        "review_id": 563273318,
        "rating": 5,
        "headline": "I would buy this again!",
        "comments": "First of all, I love the texture and the smell is divine! After I put it on, my skin feels so clean and hydrated, and I get to smell that wonderful smell for a while! As far as if it's working or not, I will come back to you. I've only used it twice so far.",
        "nickname": "Stacia",
        "location": "NYC",
        "created_date": 1757687493169,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 562474125,
        "rating": 5,
        "headline": "So hydrating and softening",
        "comments": "I suffer from terribly dry skin and had been searching for something that really worked.  This product was it for me.  It hydrates and keeps my skin soft all day long.  I've been using for almost 6 months and really love it :)",
        "nickname": "Nikki",
        "location": "San Francisco",
        "created_date": 1756997649294,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560837419,
        "rating": 5,
        "headline": "Definitely buying again",
        "comments": "I just love how hydrated my skin feels. I have had to adjust to the fact that a little goes a long way too! At least I will have it for awhile before needing to buy another jar.\nI want to try some of their other products now...",
        "nickname": "Joanne",
        "location": "New York",
        "created_date": 1755880713313,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559319212,
        "rating": 5,
        "headline": "Best moisturizer I've found",
        "comments": "If you have really dry skin then this product is for you.  Being in my 50's my skin get so dry and most creams just won't do the trick.  This one is great though and lasts all day.  My skin is looking smoother and the discolored spots I have are fading.",
        "nickname": "Ginny",
        "location": "New Hampshire",
        "created_date": 1754410297517,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558315490,
        "rating": 1,
        "headline": "Strong smell",
        "comments": "I was really looking forward to this night cream, however the smell is very strong and offputting. I cannot enjoy this product and it's supposed benefits with the smell giving me a headache.",
        "nickname": "Ash",
        "location": "Diamond Bar, CA",
        "created_date": 1753503244284,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 2
      },
      {
        "review_id": 557932506,
        "rating": 5,
        "headline": "So far, so good!",
        "comments": "I use it with a few drops of rice bran oil and my skin loves it! This cream is light, absorbs well and doesn't have a strong scent. Also, key ingredients that I look for are in this product. Vitamin C, E , HA and other clean ingredients are what I prefer due to having sensitive, combination skin.",
        "nickname": "Sy",
        "location": "East Bay, California",
        "created_date": 1753123594702,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557870509,
        "rating": 1,
        "headline": "Terrible Product",
        "comments": "Unfortunately I purchased 2 sample sizes of this product. The smell when opened was absolutely terrible no to mention it is so so greasy. I felt like I applied a cheap cooking to my face and never absorbed into the skin. Save yourself the time of trying and don't waste your money on this companies products.",
        "nickname": "Ginny",
        "location": "Phoenix, AZ",
        "created_date": 1753038132896,
        "bottom_line": "No",
        "helpful_votes": 1,
        "not_helpful_votes": 4
      },
      {
        "review_id": 557450424,
        "rating": 5,
        "headline": "Very best moisturizer",
        "comments": "This product hydrates my skin like no other.  My skin is often very dry and many creams just won't do the trick.  After applying this cream my skin is immediately soft and brighter.  My wrinkles around my eyes and lips have definitely improved since starting it.",
        "nickname": "Giga",
        "location": "South Portland",
        "created_date": 1752782056462,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556755010,
        "rating": 4,
        "headline": "So far, I like this.",
        "comments": "I like the creaminess and my face feels very moisturized. I've also not had it a week so I will wait and see if there is any difference in my face. I prefer to give facial creams. Month before rating.",
        "nickname": "Debbie",
        "location": "North Carolina",
        "created_date": 1751901575942,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 556748119,
        "rating": 5,
        "headline": "Very Rich Whipped Creamy Moisturizer!",
        "comments": "The first time I tried and I absolutely loved the packaging, it's a heaving glass jar, comes with a scoop,rich and Whipped cream. Only con was the smell. it kind of had an old ladies flower smell. wish it had more of a honey smell to it. But I guess that's a sleep preference thing .",
        "nickname": "irma_Floresita",
        "location": "Mississippi",
        "created_date": 1751890163771,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555672972,
        "rating": 1,
        "headline": "Clumps and does not blend",
        "comments": "First of all, this smells nasty. I cannot put my finger on what the scent is, but it is bad. This is so clumpy and will not blend, it sits on top of the skin and does not moisturize. I do not know who this is working for, if anyone. It is like the clumps at the tip of a product pump that you have to discard: so much product is being wasted. And dont even think about trying to wear this under makeup— since it doesnt blend and sits/ clumps on the skin, makeup just clumps and swirls around and will NOT blend as long as this is on your face.",
        "nickname": "Alyssa",
        "location": "N/A",
        "created_date": 1750527801627,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 2
      },
      {
        "review_id": 554817986,
        "rating": 1,
        "headline": "No.",
        "comments": "thankfully, I only got a sample of this and didn't pay for a full size product. If I had, I'd be returning it so fast. Smells terrible and is so so so greasy. Like applying crisco to your face. Just slips and slides around and never actually absorbs.",
        "nickname": "LR",
        "location": "CT",
        "created_date": 1749517543122,
        "bottom_line": null,
        "helpful_votes": 4,
        "not_helpful_votes": 1
      },
      {
        "review_id": 554457012,
        "rating": 5,
        "headline": "My absolute favorite",
        "comments": "I was nervous about the new scent I had read about in recent reviews. My old jar lasted so long they had reformulated since I last purchased.  Glad I bought it anyway. The new scent is AWESOME!!! It's cocoa instead of floral now and I'm more into cocoa scent than floral anyway. I have allergies and sensitive skin, this moisturizer has never irritated my skin. I love that it comes in a glass jar (I do wish they had kept the metal lid though) My fav face cream ever!",
        "nickname": "Jess",
        "location": "Red Hill, PA",
        "created_date": 1748969989037,
        "bottom_line": "Yes",
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554365858,
        "rating": 5,
        "headline": "Fast Results",
        "comments": "I've had dry itchy irritated patches on my face for weeks that popped up out of nowhere and every other skincare I've tried has made it worse. Ordered this on a whim and one night of using it has my skin already looking and feeling better. 🩷",
        "nickname": "RM",
        "location": "IL",
        "created_date": 1748793235919,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554363234,
        "rating": 2,
        "headline": "I used to buy 2-3 jars at a time...",
        "comments": "but I am hugely disappointed with the new formula change. It's no longer a crelly (cream-jelly) like consistency--it's a thick cream! My combination skin LOVED the old formula; I used it for years religiously, every day and night. Every time I used it, my skin felt utterly refreshed and soft and supple to the touch--no greasiness, and none of that taut, sticky feeling some creams leave on the skin.\n\nUnfortunately, this cream is no longer what it used to be. Yes, it has Magnesium Ascorbyl Phosphate, which is not easy to come by in cosmetics, but there were so many other factors that once made this cream my bonafide, undeniable holy grail. My skin healed and lit up and I got many, many compliments; I did not hesitate to let my friends and family know what my holy grail was: the OLD formula! \n\nUnfortunately, I can no longer recommend this product to anyone. It's just like every other cream on the market now. It doesn't melt into my skin anymore; it leaves an unpleasant afterfeel; it smells stronger than it used to...and it costs more.\n\nWhy oh WHY do companies \"fix\" products that weren't broken in the first place!!!!! It drives me insane! This cream used to be stellar--I was hooked, I would have gladly paid more for it!!!! In my desperation, I tried the Barrier Cream, and to my dismay, it is even thicker--no bueno! I am now, sadly, in search for a replacement for my daily routine. I am so disappointed; if the old formula were to return, it would truly make my day.\n\n:'(",
        "nickname": "Ruby",
        "location": "Atlanta, GA",
        "created_date": 1748787314953,
        "bottom_line": "No",
        "helpful_votes": 9,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552529207,
        "rating": 5,
        "headline": "Serious hydration!",
        "comments": "It instantly makes a big difference.  I love to wake up to skin feeling so smooth!!!",
        "nickname": "BW",
        "location": "FL",
        "created_date": 1745767640999,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551854006,
        "rating": 5,
        "headline": "Great For Sensitive Skin",
        "comments": "I get sensitivity and redness to a lot of products. This product has been a amazing, no redness or sensitivity  and I use it every night.",
        "nickname": "TJMOM",
        "location": "New Hampshire",
        "created_date": 1744819209093,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551227684,
        "rating": 5,
        "headline": "New staple",
        "comments": "I usually go for a lighter moisturizer but this totally surprised me! It feels rich going on, but sinks in beautifully and leaves my skin super soft by morning. Definitely a new staple for my winter routine!",
        "nickname": "renee",
        "location": "Nashville, TN",
        "created_date": 1744135125469,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551227605,
        "rating": 5,
        "headline": "This stuff WORKS",
        "comments": "I had dry patches on my cheeks that nothing was helping, and they were gone after like 3 nights of using this. My skin feels way smoother now and makeup goes on so much better. Obsessed.",
        "nickname": "ellie",
        "location": "Boulder, CO",
        "created_date": 1744135021830,
        "bottom_line": "Yes",
        "helpful_votes": 4,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551168516,
        "rating": 5,
        "headline": "So rich and delicious!",
        "comments": "This cream goes on so smooth and feels heavenly on my skin.  It has a light smell of cocoa butter that makes me want to not just rub it into my skin but eat it :)",
        "nickname": "Stephanie",
        "location": "Austin, TX",
        "created_date": 1744057291327,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 247,
      "pages_total": 13,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2014586/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [
        {
          "display_type": "default",
          "key": "bestuses",
          "name": "Best Uses",
          "type": "tag",
          "values": [
            {
              "label": "When you need extra moisturizing or overnight",
              "count": 1
            },
            {
              "label": "overnight moisture",
              "count": 1
            },
            {
              "label": "Night cream",
              "count": 1
            },
            {
              "label": "nourishing cream",
              "count": 1
            },
            {
              "label": "nourishing night cream",
              "count": 1
            },
            {
              "label": "Daily moisturizer",
              "count": 1
            },
            {
              "label": "Night creme",
              "count": 1
            },
            {
              "label": "This is the best night time cream ever",
              "count": 1
            },
            {
              "label": "Night and day",
              "count": 1
            },
            {
              "label": "Overnight Moisturizing",
              "count": 1
            },
            {
              "label": "Morning and night",
              "count": 1
            },
            {
              "label": "Use at night and every night",
              "count": 1
            },
            {
              "label": "Light day time use",
              "count": 1
            },
            {
              "label": "Neck & under eyes",
              "count": 1
            },
            {
              "label": "Night time",
              "count": 1
            }
          ],
          "display_values": [
            "Daily moisturizer",
            "Light day time use",
            "Morning and night",
            "Neck & under eyes",
            "Night and day",
            "Night cream",
            "Night creme",
            "Night time",
            "Overnight Moisturizing",
            "This is the best night time cream ever",
            "Use at night and every night",
            "When you need extra moisturizing or overnight",
            "nourishing cream",
            "nourishing night cream",
            "overnight moisture"
          ]
        },
        {
          "display_type": "default",
          "key": "cons",
          "name": "Cons",
          "type": "tag",
          "values": [
            {
              "label": "None",
              "count": 2
            },
            {
              "label": "Smells awful",
              "count": 1
            },
            {
              "label": "costly",
              "count": 1
            },
            {
              "label": "packaging",
              "count": 1
            },
            {
              "label": "price",
              "count": 1
            },
            {
              "label": "Smell is Offputting",
              "count": 1
            },
            {
              "label": "Pricey / Poor Value",
              "count": 1
            }
          ],
          "display_values": [
            "None",
            "Pricey / Poor Value",
            "Smell is Offputting",
            "Smells awful",
            "costly",
            "packaging",
            "price"
          ]
        },
        {
          "display_type": "default",
          "key": "describeyourself",
          "name": "Describe Yourself",
          "type": "tag",
          "values": [
            {
              "label": "Sensitive and mature skin",
              "count": 1
            },
            {
              "label": "dry skin",
              "count": 1
            },
            {
              "label": "eczema",
              "count": 1
            },
            {
              "label": "beauty and skincare industry professional",
              "count": 1
            },
            {
              "label": "natural product lover",
              "count": 1
            },
            {
              "label": "sensitive skin",
              "count": 1
            },
            {
              "label": "skincare addict",
              "count": 1
            },
            {
              "label": "32 years old",
              "count": 1
            },
            {
              "label": "Light complexion",
              "count": 1
            },
            {
              "label": "Sensitive, normal skin",
              "count": 1
            },
            {
              "label": "Over 40",
              "count": 1
            },
            {
              "label": "Dry skin",
              "count": 1
            },
            {
              "label": "Middle-aged woman with Dry Skin",
              "count": 1
            },
            {
              "label": "Combination acne prone skin",
              "count": 1
            },
            {
              "label": "Skin care product junkie",
              "count": 1
            },
            {
              "label": "Health & Beauty enthusiasts",
              "count": 1
            },
            {
              "label": "Mom",
              "count": 1
            },
            {
              "label": "Combo skin",
              "count": 1
            },
            {
              "label": "Early 30s",
              "count": 1
            },
            {
              "label": "Latin",
              "count": 1
            },
            {
              "label": "Like products without harmful ingredients in it",
              "count": 1
            }
          ],
          "display_values": [
            "32 years old",
            "Casual Dresser",
            "Combination acne prone skin",
            "Combo skin",
            "Comfort-seeking",
            "Dry skin",
            "Early 30s",
            "Energetic/Active",
            "Health & Beauty enthusiasts",
            "Latin",
            "Light complexion",
            "Like products without harmful ingredients in it",
            "Middle-aged woman with Dry Skin",
            "Mom",
            "Over 40",
            "Sensitive and mature skin",
            "Sensitive, normal skin",
            "Skin care product junkie",
            "Stylish/Fashionista",
            "Trendy/Stylish Dresser",
            "Youthful",
            "beauty and skincare industry professional",
            "dry skin",
            "eczema",
            "natural product lover",
            "sensitive skin",
            "skincare addict"
          ]
        },
        {
          "display_type": "default",
          "key": "pros",
          "name": "Pros",
          "type": "tag",
          "values": [
            {
              "label": "Moisturizing",
              "count": 3
            },
            {
              "label": "nourishing",
              "count": 2
            },
            {
              "label": "smells great",
              "count": 2
            },
            {
              "label": "Very moisture rich, Great on my sensitive skin",
              "count": 1
            },
            {
              "label": "Hydration",
              "count": 1
            },
            {
              "label": "Smooth skin",
              "count": 1
            },
            {
              "label": "Soft skin",
              "count": 1
            },
            {
              "label": "Effective",
              "count": 1
            },
            {
              "label": "gentle",
              "count": 1
            },
            {
              "label": "must have",
              "count": 1
            },
            {
              "label": "Illuminates skin",
              "count": 1
            },
            {
              "label": "Clean ingredients",
              "count": 1
            },
            {
              "label": "Long lasting hydration",
              "count": 1
            },
            {
              "label": "Smoother skin",
              "count": 1
            },
            {
              "label": "Smell",
              "count": 1
            },
            {
              "label": "Very thick",
              "count": 1
            },
            {
              "label": "Skin feels so good! Only been using for a week,",
              "count": 1
            },
            {
              "label": "Reduces Appearance of Fine Lines",
              "count": 1
            },
            {
              "label": "Rich and Creamy",
              "count": 1
            },
            {
              "label": "Absorbent",
              "count": 1
            },
            {
              "label": "Good price for amount of product",
              "count": 1
            },
            {
              "label": "Not greasy after application",
              "count": 1
            },
            {
              "label": "Supplies all the moisture you need",
              "count": 1
            },
            {
              "label": "Love the consistency of the cream",
              "count": 1
            },
            {
              "label": "So moisturizing",
              "count": 1
            },
            {
              "label": "moisturizing",
              "count": 1
            },
            {
              "label": "natural",
              "count": 1
            },
            {
              "label": "Clean product",
              "count": 1
            },
            {
              "label": "Creamy",
              "count": 1
            },
            {
              "label": "Smells so good",
              "count": 1
            },
            {
              "label": "Smooth",
              "count": 1
            },
            {
              "label": "Thick",
              "count": 1
            }
          ],
          "display_values": [
            "Absorbent",
            "Clean ingredients",
            "Clean product",
            "Creamy",
            "Effective",
            "Good price for amount of product",
            "Hydration",
            "Illuminates skin",
            "Long lasting hydration",
            "Love the consistency of the cream",
            "Moisturizing",
            "Not greasy after application",
            "Reduces Appearance of Fine Lines",
            "Rich and Creamy",
            "Skin feels so good! Only been using for a week,",
            "Smell",
            "Smells so good",
            "Smooth",
            "Smooth skin",
            "Smoother skin",
            "So moisturizing",
            "Soft skin",
            "Supplies all the moisture you need",
            "Thick",
            "Very moisture rich, Great on my sensitive skin",
            "Very thick",
            "gentle",
            "moisturizing",
            "must have",
            "natural",
            "nourishing",
            "smells great"
          ]
        },
        {
          "display_type": "text",
          "key": "skintype",
          "name": "Skin Type",
          "type": "tag",
          "values": [
            {
              "label": "Combination",
              "count": 6
            },
            {
              "label": "Dry",
              "count": 6
            },
            {
              "label": "Normal",
              "count": 5
            },
            {
              "label": "Oily",
              "count": 1
            }
          ],
          "display_values": [
            "Combination",
            "Dry",
            "Normal",
            "Oily"
          ]
        }
      ],
      "rating_histogram": [
        24,
        18,
        26,
        21,
        279
      ],
      "review_histogram": [
        24,
        18,
        26,
        21,
        279
      ],
      "rating_count": 368,
      "review_count": 368,
      "average_rating": 4.39,
      "recommended_ratio": 0.86,
      "media": [
        {
          "id": "479696684",
          "review_id": 479696721,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ghrp3n38yoepcqr1bktm.jpg",
          "headline": "Leaves my skin bouncy, and absorbs well.",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Susan",
          "created_date": 1699114506735
        },
        {
          "id": "425507106",
          "review_id": 425507098,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/amswuwytlewzaglzk7tw.jpg",
          "headline": "Not for even the slightest sensitive skin types",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Itchy red flare up",
          "nickname": "Trish",
          "created_date": 1663789027621
        },
        {
          "id": "420838369",
          "review_id": 420838405,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/xi1soj2gp3ys3qom8yvf.jpg",
          "headline": "If you have sensitive skin, skip this!",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Burning & itching",
          "nickname": "Erin",
          "created_date": 1660443305099
        },
        {
          "id": "420838447",
          "review_id": 420838405,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/ggmfhjl8y75lviaxjopt.jpg",
          "headline": "If you have sensitive skin, skip this!",
          "rating": 1,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Burning & itching",
          "nickname": "Erin",
          "created_date": 1660443305099
        }
      ],
      "faceoff_positive": {
        "comments": "I look for reviews that say \"too thick, leaves my skin feeling oily, etc\" because my skin will drink it up so fast that that's exactly what I'm looking for. It does leave my skin feeling almost oily, borderline, but not quite. Once it absorbs my skin feels silky and literally like... brighter? I've never had a product that I genuinely feels like makes me face look nicer. I got it as a sample when I purchased the vitamin c serum, and I used it one time at and was immediately in love with the scent and the thick texture of it. Then the next morning my face felt amazing! After literally just one use. I don't use the serum anymore because it just wasn't for me.. but this is. It's honestly my holy grail and I'm only finishing my first tub. Again tho, def thick but that's perfect for me.",
        "headline": "Perfect for me 🥺",
        "rating": 5,
        "ugc_id": 341371556
      },
      "faceoff_negative": {
        "comments": "but I am hugely disappointed with the new formula change. It's no longer a crelly (cream-jelly) like consistency--it's a thick cream! My combination skin LOVED the old formula; I used it for years religiously, every day and night. Every time I used it, my skin felt utterly refreshed and soft and supple to the touch--no greasiness, and none of that taut, sticky feeling some creams leave on the skin.\n\nUnfortunately, this cream is no longer what it used to be. Yes, it has Magnesium Ascorbyl Phosphate, which is not easy to come by in cosmetics, but there were so many other factors that once made this cream my bonafide, undeniable holy grail. My skin healed and lit up and I got many, many compliments; I did not hesitate to let my friends and family know what my holy grail was: the OLD formula! \n\nUnfortunately, I can no longer recommend this product to anyone. It's just like every other cream on the market now. It doesn't melt into my skin anymore; it leaves an unpleasant afterfeel; it smells stronger than it used to...and it costs more.\n\nWhy oh WHY do companies \"fix\" products that weren't broken in the first place!!!!! It drives me insane! This cream used to be stellar--I was hooked, I would have gladly paid more for it!!!! In my desperation, I tried the Barrier Cream, and to my dismay, it is even thicker--no bueno! I am now, sadly, in search for a replacement for my daily routine. I am so disappointed; if the old formula were to return, it would truly make my day.\n\n:'(",
        "headline": "I used to buy 2-3 jars at a time...",
        "rating": 2,
        "ugc_id": 554363234
      },
      "name": "Triple C Night Cream",
      "native_review_count": 247,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 121,
      "locale": "en_US"
    }
  }
}