{
  "product_id": "pimprod2045857",
  "product_url": "https://www.ulta.com/p/collagen-ampoule-pad-pimprod2045857",
  "extracted_at": "2025-09-23T03:38:28.982939+00:00",
  "product_name": "MEDIHEALCollagen Ampoule Pad",
  "brand": "MEDIHEAL",
  "categories": [
    "Home",
    "Skin Care",
    "Cleansers",
    "Toner"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "cleansers",
    "toner"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "24.00",
  "availability": "in_stock",
  "rating_avg": "4.3",
  "rating_count": "33",
  "images": [
    "https://media.ulta.com/i/ulta/2626994?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2626994?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2626994_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2626994_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2626994_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2626994_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2626994_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2626994_vid01/thumbs/c749f44b-6257-4369-978e-8fa19b01b1c0?w=600&h=337&fmt=auto"
  ],
  "summary": "SummaryMEDIHEAL Collagen Ampoule Pad nourishes and firms aging, sagging skin. It improves the appearance of wrinkles and fine lines.",
  "details": "DetailsBenefitsProven to help improve skin elasticity and reduce the appearance of wrinklesInstantly improves skin elasticity by 106%Reduces the appearance of fine lines in the eye area and smile lines by 30% and forehead lines by 33%FeaturesMade with Micro Perforated 'EcoSlik' PadsSized (2.6\") to cover a wide areaRounded corners for a perfect fit on skinKey IngredientsFormulated with CollagenFactor complex and liposome delivery system for optimal resultsMicroparticlized CollagenFactor: 300Da Micromolecular Collagen + Ceramide + Milk Protein - With Liposome-based Technology - MicroparticlizedItem 2626994How To UseAs a treatment mask: Apply on targeted areas (forehead, cheeks and chin) after cleansing for an intensive treatment. Leave on for 15 minutes, remove and let the remaining serum absorb into skin.As a treatment pad: After cleansing, gently swipe across skin to tone, moisturize and prep skin. Can be used daily both in the AM and PM.IngredientsWater, Glycerin, Glycereth-26, 1,2-Hexanediol, Diphenyl Dimethicone, Triethylhexanoin, Betaine, Hydroxyacetophenone, Hydrogenated Lecithin, Polyglyceryl-10 Oleate, Hydroxyethyl Urea, Dipotassium Glycyrrhizate, Sodium Citrate, Allantoin, Octyldodeceth-16, Xanthan Gum, Hydroxyethylcellulose, Collagen Extract (1,000 ppm), Adenosine, Citric Acid, Disodium EDTA, Olea Europaea (Olive) Fruit Oil, Butylene Glycol, Pelargonium Graveolens Flower Oil, Lavandula Angustifolia (Lavender) Oil, Anthemis Nobilis Flower Oil, Citrus Aurantium Dulcis (Orange) Peel Oil, Juniperus Mexicana Oil, Mangifera Indica (Mango) Fruit Extract, Lactobacillus Ferment, Ceramide NP, Milk Protein Extract, Caprylyl Glycol, Tripeptide-1, Acetyl Hexapeptide-8, Copper Tripeptide-1, Palmitoyl Tripeptide-1, Palmitoyl Pentapeptide-4.",
  "how_to_use": "As a treatment mask: Apply on targeted areas (forehead, cheeks and chin) after cleansing for an intensive treatment. Leave on for 15 minutes, remove and let the remaining serum absorb into skin.As a treatment pad: After cleansing, gently swipe across skin to tone, moisturize and prep skin. Can be used daily both in the AM and PM.",
  "ingredients": [
    "Water",
    "Glycerin",
    "Glycereth-26",
    "2-Hexanediol",
    "Diphenyl Dimethicone",
    "Triethylhexanoin",
    "Betaine",
    "Hydroxyacetophenone",
    "Hydrogenated Lecithin",
    "Polyglyceryl-10 Oleate",
    "Hydroxyethyl Urea",
    "Dipotassium Glycyrrhizate",
    "Sodium Citrate",
    "Allantoin",
    "Octyldodeceth-16",
    "Xanthan Gum",
    "Hydroxyethylcellulose",
    "Collagen Extract (1",
    "000 ppm)",
    "Adenosine",
    "Citric Acid",
    "Disodium EDTA",
    "Olea Europaea (Olive) Fruit Oil",
    "Butylene Glycol",
    "Pelargonium Graveolens Flower Oil",
    "Lavandula Angustifolia (Lavender) Oil",
    "Anthemis Nobilis Flower Oil",
    "Citrus Aurantium Dulcis (Orange) Peel Oil",
    "Juniperus Mexicana Oil",
    "Mangifera Indica (Mango) Fruit Extract",
    "Lactobacillus Ferment",
    "Ceramide NP",
    "Milk Protein Extract",
    "Caprylyl Glycol",
    "Tripeptide-1",
    "Acetyl Hexapeptide-8",
    "Copper Tripeptide-1",
    "Palmitoyl Tripeptide-1",
    "Palmitoyl Pentapeptide-4"
  ],
  "extended_contents": {
    "images": [
      "https://content.syndigo.com/asset/05d2bade-3e78-49c9-aaa3-fabdf307c02c/960.webp",
      "https://content.syndigo.com/asset/23a143a8-a574-4cf7-9279-35b287debc1d/960.webp",
      "https://content.syndigo.com/asset/d805433b-fa23-48e9-804f-6878ce5bbe59/960.webp",
      "https://content.syndigo.com/asset/cf772081-20f5-4ac6-8708-6eade9198548/960.webp"
    ]
  },
  "tags": {
    "product_type": [
      "cleanser",
      "serum",
      "toner"
    ],
    "skin_type": [
      "mature"
    ],
    "finish": [
      "oil"
    ],
    "ingredients": [
      "peptides",
      "ceramides",
      "collagen"
    ],
    "brand": [
      "mid-range",
      "affordable"
    ],
    "special_features": [
      "anti-aging",
      "purifying"
    ],
    "category": []
  },
  "reviews": {
    "product_id": "pimprod2045857",
    "total_reviews": 33,
    "reviews": [
      {
        "review_id": 562949721,
        "rating": 1,
        "headline": "Returning",
        "comments": "I was referred to use this because I have Rosacea. Unfortunately after the second use I had a horrible reaction. After not using it for a week, I am still battling the discomfort from this product. I am returning it today. I don't recommend if you have any type of skin conditions.",
        "nickname": "Shari",
        "location": "Idaho",
        "created_date": 1757260071353,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560400109,
        "rating": 2,
        "headline": "Broke out",
        "comments": "I really wanted to like these and it felt great on my skin when applying, but I used these for about 10 days and it dried out my face really bad and made me break out and I have never been one in my 40 years of life that has dealt with acne.",
        "nickname": "Chey",
        "location": "Chandler Az",
        "created_date": 1755528560223,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559002102,
        "rating": 5,
        "headline": "soothing",
        "comments": "plumping, soothing, and hydrating",
        "nickname": "christy",
        "location": "chicago",
        "created_date": 1754008941289,
        "bottom_line": null,
        "helpful_votes": 2,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559002105,
        "rating": 5,
        "headline": "soothing",
        "comments": "plumping, soothing, and hydrating",
        "nickname": "christy",
        "location": "chicago",
        "created_date": 1754008935658,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 1
      },
      {
        "review_id": 557372320,
        "rating": 5,
        "headline": "Amazing product! New holy grail.",
        "comments": "I love these pads! I use them at night and swipe across my face, but then I place it on my forehead to soak in that area while I brush my teeth. My forehead looks more plump and my lines are improving. This is a great, easy to use product.",
        "nickname": "Paula",
        "location": "Frankfort, Ky",
        "created_date": 1752683008773,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 0
      },
      {
        "review_id": 557063761,
        "rating": 5,
        "headline": "This is a amazing product!",
        "comments": "This not only hydrated my skin but has erased fine lines and soften wrinkles.",
        "nickname": "Pamela",
        "location": "California",
        "created_date": 1752424930546,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555882330,
        "rating": 5,
        "headline": "Yes, I would buy it!",
        "comments": "Love the smell! Feeling nice on my face. Very smooth!",
        "nickname": "Sheryl",
        "location": "Cincinnati, Ohio",
        "created_date": 1750874377624,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 555015183,
        "rating": 1,
        "headline": "Gave me cystic acne. 0 stars.",
        "comments": "To preface, I am NOT acne prone. I had high hopes for this product, but it gave me the WORST breakout I have ever had, ever, in my life. Huge, deep, painful cystic pimples all over my face — even under my eyes, where I had focused the solution. It will likely take weeks, if not longer, for my skin to recover from this nightmare. If I could give this 0 stars, I would",
        "nickname": "AG",
        "location": "Dallas, TX",
        "created_date": 1749769658709,
        "bottom_line": null,
        "helpful_votes": 10,
        "not_helpful_votes": 1
      },
      {
        "review_id": 554844749,
        "rating": 5,
        "headline": "I would like to buy this product again and again",
        "comments": "I just loved it , it make my skin so smooth and soft . It was a great purchase",
        "nickname": "",
        "location": "Plano",
        "created_date": 1749569508133,
        "bottom_line": "Yes",
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554640737,
        "rating": 5,
        "headline": "My skin seems to like it",
        "comments": "Only been using for less than 2wks, but so far so good. I have super sensitive skin that has a hard time accepting almost any products. I put it on at night followed by Beekman 1802 Collagen Booster Electric Daisy & Peptide Firming Serum.",
        "nickname": "Teresa",
        "location": "Idaho",
        "created_date": 1749229515403,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 554427031,
        "rating": 5,
        "headline": "OMG! I'm In Love! ❤️",
        "comments": "I recently stumbled upon Mediheal, instantly fell in love. It feels like I've unlocked a secret!\n\nI love the sun and have never been one to use sunscreen. I know, I know! I can be somewhat lazy with my evening skincare routine, but I never skip using the Mediheal pads-probably because they're so easy to use and very effective. I apply them in the morning after my shower, before using my other skincare products. Sometimes, I'll use them twice daily. One pad covers my entire face, neck, and chest. They are very moist, so I recommend letting your face dry before applying serums, moisturizers, and sunscreen. Once I've used the pad all over, I go back for my under-eye area and eyelids after the pad isn't too wet. DO NOT be a dummy like me & use a fresh & really wet pad on your eyelids and under-eye area, or you'll end up with it in your eyes and be hit with instant regret! \n\nSometimes, I speed up the drying process with my hairdryer if I'm in a hurry. These pads don't leave a greasy residue on your skin; in fact, they provide an instant glass skin effect, making your makeup go on smoother.\n\nOnce I hit my late 40's, my skin transitioned from oily-combo to combo-dry in some areas and began experiencing terrible acne. I also developed dermatitis around my mouth from a steroid inhaler I've used for years, which left me with really dry, flaky skin near my smile lines as it healed. As I've aged, I noticed I was getting deeper lines on my forehead, noticeable upper lip wrinkles—which nobody seems to talk about. I had more defined smile lines, increased fine lines around my eyes, wrinkles on my chest & near my cleavage, and let's not even discuss my newly developed slightly sagging turkey neck! I was losing elasticity was diminishing as I approached the big 5-0!\n\nMy skin was really struggling! I had completely forgotten about these pads. I started using the Mediheal collagen ampoule pads without realizing the power these suckers held. They instantly gave my skin a gorgeous glow and kept it very hydrated. I noticed a significant improvement in my skin's elasticity, bounce, firmness, hydration, and texture not long after incorporating these into my routine with my regular serums and moisturizers. Within a few weeks, my deep forehead lines appeared considerably less visible. My upper lip lines, fine lines everywhere, lines on my upper chest and neck, sagging turkey neck, and cleavage wrinkles had all significantly improved. You wouldn't believe the amount of money I've wasted on products of all calibers, yet I had this...just sitting there for months!-insert face palm!\n\nMy dermatitis required short-term antibiotics to manage, it left behind constant flakiness around the edges of my nose, corners of my lips and smile lines as it healed. The Mediheal Collagen Ampoule pads actually helped clear that up and corrected the deeper smile lines that formed from me picking at my face, for which I'm incredibly grateful for. I also noticed a substantial decrease in acne, though I'm not sure what the correlation is there. \n\nI'm a straight shooter and don't usually leave reviews, so if you're still wondering if these pads are worth it, trust me, you won't regret it! The price for Mediheal is affordable, which I really appreciate! In fact. \n\nI wouldn't be sad at all if @mediheal_global wanted to send me products to try!!",
        "nickname": "Cindy",
        "location": "Sherwood, OR",
        "created_date": 1748905817354,
        "bottom_line": "Yes",
        "helpful_votes": 18,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553100979,
        "rating": 5,
        "headline": "excellent for mature skin",
        "comments": "i'm in my early 50s with dry skin. after using these (now on my 2nd package) my face is more plump and firm. forehead lines and 11 lines have diminished, marionette lines have diminished, neck lines are diminished. sometimes i use them twice a day, sometimes only once. there's a difference when i skip using these completely. \n\nthe container does leak a bit if packed on a trip and not transported upright - solve this by transferring a stack of the pads into a ziploc. they stay moist and take up less space in your luggage. \n\nuse as the first step after ckeansing as it is watery and does take a minute or two to dry. one pad covers the face and neck/upper chest easily. follow with other serums of increasingly thicker viscosity before moisturizer and sunscreen. \n\nwhile using these i haven't had any negative interactions with other products or reactions on my skin so they should be fine for anyone with skin sensitivity.",
        "nickname": "littlebittx",
        "location": "texas",
        "created_date": 1746791786149,
        "bottom_line": null,
        "helpful_votes": 17,
        "not_helpful_votes": 0
      },
      {
        "review_id": 552568376,
        "rating": 5,
        "headline": "Easily applied",
        "comments": "These pads come with a little plastic tweezers that your can use to get out of the container and split to your face. They stick where you place them, so they're not slipping all over your face. My face always feels extra hydrated after using these.",
        "nickname": "Ingrid",
        "location": "Madison, WI",
        "created_date": 1745861506019,
        "bottom_line": "Yes",
        "helpful_votes": 3,
        "not_helpful_votes": 1
      },
      {
        "review_id": 551908322,
        "rating": 5,
        "headline": "10/10",
        "comments": "These pads have become a holy grail in my skincare routine! I have rosacea and combination skin, so my skin can get really dry at times. Ever since I started using these, they've helped retain moisture and leave my skin feeling noticeably more plump. I also have sensitive skin, and thankfully, I haven't experienced any irritation!",
        "nickname": "K.",
        "location": "Ontario, Ca",
        "created_date": 1744920181875,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551202321,
        "rating": 5,
        "headline": "Glowy Skin",
        "comments": "The more I use these pads, the glowier my skin looks. Lately, I've been receiving compliments on my skin when I apply my makeup, and I know this product is one of the reasons. I highly recommend it!",
        "nickname": "Frosty",
        "location": "Austin, TX",
        "created_date": 1744081960823,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 551029131,
        "rating": 2,
        "headline": "Ehhh",
        "comments": "They sre just ok. I like the tweezer in it but tbe formula us only so so gor me. I prefer the carrot face pads i get from yesstyle",
        "nickname": "Kate",
        "location": "WV",
        "created_date": 1743780718222,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 11
      },
      {
        "review_id": 551029130,
        "rating": 2,
        "headline": "Ehhh",
        "comments": "They sre just ok. I like the tweezer in it but tbe formula us only so so gor me. I prefer the carrot face pads i get from yesstyle",
        "nickname": "Kate",
        "location": "WV",
        "created_date": 1743780717871,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 6
      },
      {
        "review_id": 550857457,
        "rating": 5,
        "headline": "Perfect for combo/ dry skin",
        "comments": "This product is so good at keeping my skin hydrated, definitely worth it. Its very soothing on the skin and has not broken me out. Already on my 3rd one !",
        "nickname": "❤️",
        "location": "Laredo, TX",
        "created_date": 1743584298845,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 549857070,
        "rating": 5,
        "headline": "Softening",
        "comments": "Ive been trying these pads for about a week now, and I love how my skin feels after using them. Plump, soft, and hydrated! Love Mediheal products. So glad they're now carried at Ulta!",
        "nickname": "Kris",
        "location": "Chicago",
        "created_date": 1743006260147,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 548715699,
        "rating": 5,
        "headline": "Honestly - MAGICAL!",
        "comments": "I'm 55yrs old with wrinkles creeping in around my mouth.  I buy expensive products for my face & nothing works.  Bought this product per my daughter's recommendation and immediately saw improvement.  The deep lines appear reduced, and my face has a more youthful glow.",
        "nickname": "Trish",
        "location": "Plymouth, MN",
        "created_date": 1741958000523,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 33,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2045857/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        3,
        3,
        1,
        0,
        26
      ],
      "review_histogram": [
        3,
        3,
        1,
        0,
        26
      ],
      "rating_count": 33,
      "review_count": 33,
      "average_rating": 4.3,
      "recommended_ratio": 0.86,
      "media": [
        {
          "id": "554427052",
          "review_id": 554427031,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/zm6ijxsqhnfb7efuwhfu.jpg",
          "headline": "OMG! I'm In Love! ❤️",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Help! Pic says it all-50 yrs old",
          "nickname": "Cindy",
          "created_date": 1748905817354
        },
        {
          "id": "554427051",
          "review_id": 554427031,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/wijghdgqyjdag0acp5o1.jpg",
          "headline": "OMG! I'm In Love! ❤️",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "06/02/25 No makeup! Hot Summer",
          "nickname": "Cindy",
          "created_date": 1748905817354
        },
        {
          "id": "554427050",
          "review_id": 554427031,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/xuypufvrafrup1z1brn6.jpg",
          "headline": "OMG! I'm In Love! ❤️",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "After-No makeup-Age 50",
          "nickname": "Cindy",
          "created_date": 1748905817354
        },
        {
          "id": "554427049",
          "review_id": 554427031,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/xmnacbvdi8b0ilxpn3re.jpg",
          "headline": "OMG! I'm In Love! ❤️",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Loss of elasticity-Turkey Neck-49 yrs old",
          "nickname": "Cindy",
          "created_date": 1748905817354
        },
        {
          "id": "554427032",
          "review_id": 554427031,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/zggvwm0qehxznrv25zjv.jpg",
          "headline": "OMG! I'm In Love! ❤️",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "My New BFF",
          "nickname": "Cindy",
          "created_date": 1748905817354
        },
        {
          "id": "554427048",
          "review_id": 554427031,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/roykanahpubcy4tusmsc.jpg",
          "headline": "OMG! I'm In Love! ❤️",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Firmness and elasticity restored",
          "nickname": "Cindy",
          "created_date": 1748905817354
        }
      ],
      "faceoff_positive": {
        "comments": "I recently stumbled upon Mediheal, instantly fell in love. It feels like I've unlocked a secret!\n\nI love the sun and have never been one to use sunscreen. I know, I know! I can be somewhat lazy with my evening skincare routine, but I never skip using the Mediheal pads-probably because they're so easy to use and very effective. I apply them in the morning after my shower, before using my other skincare products. Sometimes, I'll use them twice daily. One pad covers my entire face, neck, and chest. They are very moist, so I recommend letting your face dry before applying serums, moisturizers, and sunscreen. Once I've used the pad all over, I go back for my under-eye area and eyelids after the pad isn't too wet. DO NOT be a dummy like me & use a fresh & really wet pad on your eyelids and under-eye area, or you'll end up with it in your eyes and be hit with instant regret! \n\nSometimes, I speed up the drying process with my hairdryer if I'm in a hurry. These pads don't leave a greasy residue on your skin; in fact, they provide an instant glass skin effect, making your makeup go on smoother.\n\nOnce I hit my late 40's, my skin transitioned from oily-combo to combo-dry in some areas and began experiencing terrible acne. I also developed dermatitis around my mouth from a steroid inhaler I've used for years, which left me with really dry, flaky skin near my smile lines as it healed. As I've aged, I noticed I was getting deeper lines on my forehead, noticeable upper lip wrinkles—which nobody seems to talk about. I had more defined smile lines, increased fine lines around my eyes, wrinkles on my chest & near my cleavage, and let's not even discuss my newly developed slightly sagging turkey neck! I was losing elasticity was diminishing as I approached the big 5-0!\n\nMy skin was really struggling! I had completely forgotten about these pads. I started using the Mediheal collagen ampoule pads without realizing the power these suckers held. They instantly gave my skin a gorgeous glow and kept it very hydrated. I noticed a significant improvement in my skin's elasticity, bounce, firmness, hydration, and texture not long after incorporating these into my routine with my regular serums and moisturizers. Within a few weeks, my deep forehead lines appeared considerably less visible. My upper lip lines, fine lines everywhere, lines on my upper chest and neck, sagging turkey neck, and cleavage wrinkles had all significantly improved. You wouldn't believe the amount of money I've wasted on products of all calibers, yet I had this...just sitting there for months!-insert face palm!\n\nMy dermatitis required short-term antibiotics to manage, it left behind constant flakiness around the edges of my nose, corners of my lips and smile lines as it healed. The Mediheal Collagen Ampoule pads actually helped clear that up and corrected the deeper smile lines that formed from me picking at my face, for which I'm incredibly grateful for. I also noticed a substantial decrease in acne, though I'm not sure what the correlation is there. \n\nI'm a straight shooter and don't usually leave reviews, so if you're still wondering if these pads are worth it, trust me, you won't regret it! The price for Mediheal is affordable, which I really appreciate! In fact. \n\nI wouldn't be sad at all if @mediheal_global wanted to send me products to try!!",
        "headline": "OMG! I'm In Love! ❤️",
        "rating": 5,
        "ugc_id": 554427031
      },
      "faceoff_negative": {
        "comments": "To preface, I am NOT acne prone. I had high hopes for this product, but it gave me the WORST breakout I have ever had, ever, in my life. Huge, deep, painful cystic pimples all over my face — even under my eyes, where I had focused the solution. It will likely take weeks, if not longer, for my skin to recover from this nightmare. If I could give this 0 stars, I would",
        "headline": "Gave me cystic acne. 0 stars.",
        "rating": 1,
        "ugc_id": 555015183
      },
      "name": "Collagen Ampoule Pad",
      "native_review_count": 33,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 0,
      "locale": "en_US"
    }
  }
}