{
  "product_id": "pimprod2050527",
  "product_url": "https://www.ulta.com/p/pore-eclipse-mattifying-blurring-transfer-proof-setting-spray-pimprod2050527",
  "extracted_at": "2025-09-23T04:51:46.516199+00:00",
  "product_name": "MILK MAKEUPPore Eclipse Mattifying + Blurring Transfer-Proof Setting Spray",
  "brand": "MILK MAKEUP",
  "categories": [
    "Home",
    "Makeup",
    "Face",
    "Setting Spray & Powder"
  ],
  "category_keys": [
    "home",
    "makeup",
    "face",
    "setting-spray--powder"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "38.00",
  "availability": "in_stock",
  "rating_avg": "4.6",
  "rating_count": "315",
  "images": [
    "https://media.ulta.com/i/ulta/2634889?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2634889?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2634889_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2634889_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2634889_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2634889_alt04?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2634889_alt05?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2634889_alt06?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2634889_alt07?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganGive BackMilk Makeup Pore Eclipse 16HR Matte Setting Spray locks on makeup, helps blur pores, and controls shine for a long-lasting soft-focus matte finish.",
  "details": "DetailsBenefitsMattifying + blurring setting sprayClinically proven to extends the wear of makeup up to 16 hoursAlcohol-free for a non-drying feelSoft matte finish that lasts all dayPacked with skincare benefitsNon-sticky, transfer-proof formulaWeightless microfine mistNon-comedogenic, so it won't clog poresParaben-free and oil-free86% naturalKey IngredientsLentil extract controls shineNiacinamide and pore-blurring microspheres minimize the look of pores and fine linesBakuchiol helps smooth skin textureResearch ResultsIn a consumer perception study of 30 people using the product immediately and in a 16-hour period:100% said their skin and makeup immediately look smoother100% said the setting spray felt weightless90% said their makeup stayed set in place and their skin looked mattified after 16 hoursItem 2634889How To UseShake to mix and activate makeup-locking formula.Hold bottle 8 to 10 inches away from face and mist evenly onto skin. Close mouth and eyes while spraying.Let set for one minute.Reapply throughout the day as needed to help mattify skin and control oil.Pro Tip: For extra oil control, pair with Pore Eclipse Mattifying Primer and Pore Eclipse Matte Translucent Setting Powder (both sold separately).IngredientsAqua/Water/Eau, Vinyl Dimethicone/Methicone Silsesquioxane Crosspolymer, Acrylates Copolymer, Pentylene Glycol, PVP, Polyglyceryl-10 Myristate, Niacinamide, Bakuchiol, Lens Esculenta (Lentil) Seed Extract, Hamamelis Virginiana (Witch Hazel) Leaf Extract, Xanthan Hydroxypropyltrimonium Chloride, Sodium Hyaluronate, Butylene Glycol, Ethylhexylglycerin, Sodium Dehydroacetate, Phenoxyethanol.Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Shake to mix and activate makeup-locking formula.Hold bottle 8 to 10 inches away from face and mist evenly onto skin. Close mouth and eyes while spraying.Let set for one minute.Reapply throughout the day as needed to help mattify skin and control oil.Pro Tip: For extra oil control, pair with Pore Eclipse Mattifying Primer and Pore Eclipse Matte Translucent Setting Powder (both sold separately).",
  "ingredients": [
    "Aqua/Water/Eau",
    "Vinyl Dimethicone/Methicone Silsesquioxane Crosspolymer",
    "Acrylates Copolymer",
    "Pentylene Glycol",
    "PVP",
    "Polyglyceryl-10 Myristate",
    "Niacinamide",
    "Bakuchiol",
    "Lens Esculenta (Lentil) Seed Extract",
    "Hamamelis Virginiana (Witch Hazel) Leaf Extract",
    "Xanthan Hydroxypropyltrimonium Chloride",
    "Sodium Hyaluronate",
    "Butylene Glycol",
    "Ethylhexylglycerin",
    "Sodium Dehydroacetate",
    "Phenoxyethanol"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "makeup",
      "face",
      "cosmetics"
    ],
    "product_type": [
      "toner"
    ],
    "skin_type": [
      "oily",
      "dry"
    ],
    "finish": [
      "matte",
      "sheer",
      "long-wear",
      "smudge-proof",
      "creamy",
      "powdery",
      "oil"
    ],
    "ingredients": [
      "niacinamide"
    ],
    "brand": [
      "clean-beauty",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "vegan",
      "natural",
      "non-comedogenic",
      "paraben-free",
      "alcohol-free",
      "oil-free"
    ]
  },
  "reviews": {
    "product_id": "pimprod2050527",
    "total_reviews": 315,
    "reviews": [
      {
        "review_id": 563445593,
        "rating": 3,
        "headline": "I would not buy this again",
        "comments": "I have an oily t-zone and big pores and this setting spray did make my makeup super blurring and matte. I dislike that it is not long lasting at all and it low key made my face dry. I started noticing dry ugly patches on my face an hour after I did my makeup after it looked so beautiful. I tried not too touch my face or else my makeup would come off. I wear side parts on my hair and so my makeup under my hair never scratches off but with this setting spray all the makeup on the side of my forehead came off and ruined it. :( Not really worth the price.",
        "nickname": "Joselyn",
        "location": "Riverside, CA",
        "created_date": 1757989791621,
        "bottom_line": "No",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 561518909,
        "rating": 3,
        "headline": "Super Matte!",
        "comments": "This says matte and it is! If you want a VERY matte look, this for you. Keeps your makeup in place.",
        "nickname": "D",
        "location": "Ohio",
        "created_date": 1756826693124,
        "bottom_line": null,
        "helpful_votes": 1,
        "not_helpful_votes": 0
      },
      {
        "review_id": 561021206,
        "rating": 3,
        "headline": "Needs better sprayer",
        "comments": "the spray itself is good but it clogs up the bottle after just a couple uses don't spray evenly making my makeup look blotchy. Needs to be addressed I have bought 2 bottles and both did same thing. For the price it should work a lot better",
        "nickname": "Sherry",
        "location": "Tennessee",
        "created_date": 1755984749501,
        "bottom_line": "No",
        "helpful_votes": 27,
        "not_helpful_votes": 1
      },
      {
        "review_id": 560451978,
        "rating": 3,
        "headline": "Nozzle Not Good At All - Otherwise, Great Product",
        "comments": "I love the product itself as it mattifies my skin and keeps my makeup looking good throughout the day, However, after a few uses, the nozzle sprays a thick shot like a kid's squirt gun instead of spraying an even fine mist.  I reached out to the company and they suggested that I wipe the nozzle off after every use (which I do) and to keep the cap on it (which I do).  Another thing they suggested was to use a clean pin in the sprayer hole.  I plan to try that.  If that doesn't work, I'll look for another brand next time.  But I certainly hope the pin helps.  I would rate the product a five and the nozzle a 1 so that equals out to a 3 star for me.",
        "nickname": "Wild Honey",
        "location": "Tennessee",
        "created_date": 1755619473997,
        "bottom_line": null,
        "helpful_votes": 25,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559025157,
        "rating": 1,
        "headline": "Worst setting spray",
        "comments": "I love the brand MILK and have never had issues with there other products. Now this setting spray the issue was not necessarily the formula but the packaging. The sprayer is horrible, it does not spray even it shoots all wild and then leave streaks on your face and ruins makeup.",
        "nickname": "Tay",
        "location": "Corpus Christi, TX",
        "created_date": 1754060589902,
        "bottom_line": null,
        "helpful_votes": 24,
        "not_helpful_votes": 3
      },
      {
        "review_id": 558432903,
        "rating": 5,
        "headline": "I Like It!",
        "comments": "This is a very good setting spray for someone with oily skin.  Others have dried out my eyelids and lashes.  This one does not.",
        "nickname": "Wild Honey",
        "location": "Tennessee",
        "created_date": 1753735211878,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 1
      },
      {
        "review_id": 555857165,
        "rating": 1,
        "headline": "horrible nozzle!",
        "comments": "This setting spray is great - it sets my makeup all day with a matte finish and barely any shine at the end of the day. However. the nozzle is awful. I mean, it started out good spraying a fine mist but 2 months in and it's all of a sudden spraying a stream of liquid. I have ran the nozzle under hot water and used a push pin to try to open the sprayer back up, both to no avail. And of course at 2 months it's past the 30 day return/exchange window, which is really awful because this is a pricey item. For it's price, I would expect a better made nozzle. but it seems to be an ongoing issue according to the reviews. What a shame to not fix the bottle/nozzle!",
        "nickname": "BearM",
        "location": "California",
        "created_date": 1750834042744,
        "bottom_line": null,
        "helpful_votes": 24,
        "not_helpful_votes": 2
      },
      {
        "review_id": 555261475,
        "rating": 1,
        "headline": "Nozzle",
        "comments": "Horrible despenser. stopped working after a weeks use and now is just a stream of liquid.",
        "nickname": "Abby",
        "location": "St. Louis, MO",
        "created_date": 1750186985012,
        "bottom_line": null,
        "helpful_votes": 8,
        "not_helpful_votes": 1
      },
      {
        "review_id": 554735757,
        "rating": 1,
        "headline": "Terrible nozzle",
        "comments": "This is the worst setting spray I've ever used solely because of the nozzle. It is a solid stream of liquid and not a mist. I really wanted to love it because it is acne safer, but I cannot get behind the packaging",
        "nickname": "Lia",
        "location": "VA",
        "created_date": 1749399497246,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 3
      },
      {
        "review_id": 554299299,
        "rating": 5,
        "headline": "Amazing",
        "comments": "I'm going to post the same review to the Pore Eclipse Primer, because I found that they work best together. I had first tried the primer on its own, and liked it but was not amazed. I have a very oily t-zone, especially my nose, with large pores. It has always been common to get a pimple/whitehead during the day, not noticing until after work. They are always around my nose. The primer gave some results but it didn't last through the day. However, when I applied the primer right after face lotion, as suggested, and then used the Pore Eclipse setting spray, that changed everything. The 2 products together work perfectly. I do my makeup around 6am and almost 12 hours later my skin doesn't look oily. It's just crazy to me because I've never had products actually control my excessively oily skin. So I highly recommend using the 2 products together, you don't need much spray, and the primer applies better right after your moisturizer. I also apply my foundation/skin tint right after that, and it sets perfect after the spray.",
        "nickname": "Lisha",
        "location": "Philadelphia",
        "created_date": 1748642457894,
        "bottom_line": null,
        "helpful_votes": 12,
        "not_helpful_votes": 0
      },
      {
        "review_id": 553151606,
        "rating": 2,
        "headline": "The nozzle needs revamping",
        "comments": "The product is amazing - when the nozzle works properly. Unfortunately, the nozzle only worked the very first time I used the product. Every time after it sprays unevenly and/or not at all.  Currently searching for something else.",
        "nickname": "Jen",
        "location": "Midwest",
        "created_date": 1746899375790,
        "bottom_line": "No",
        "helpful_votes": 8,
        "not_helpful_votes": 2
      },
      {
        "review_id": 552675969,
        "rating": 2,
        "headline": "Fix the nozzle!!",
        "comments": "The formula is great, the product just comes out streaming unevenly! Ill stick to my one size setting spray. Returned it!",
        "nickname": "Quinnofmakeup",
        "location": "RanchoPV",
        "created_date": 1746095767216,
        "bottom_line": null,
        "helpful_votes": 9,
        "not_helpful_votes": 1
      },
      {
        "review_id": 551071696,
        "rating": 2,
        "headline": "High quality formula, low quality packaging",
        "comments": "Loved the formula of this setting spray to lock in my makeup and keep me looking matte throughout the day. However, the nozzle often sprayed in a stream-like fashion instead of a mist. Would only repurchase if Milk improved the packaging.",
        "nickname": "Ashlyn",
        "location": "KS",
        "created_date": 1743865228456,
        "bottom_line": null,
        "helpful_votes": 16,
        "not_helpful_votes": 3
      },
      {
        "review_id": 549626375,
        "rating": 5,
        "headline": "Game Changer!",
        "comments": "Mattifies all day! My makeup looks so good that I don't want to wash it off at night!",
        "nickname": "GC",
        "location": "Ohio",
        "created_date": 1742527007255,
        "bottom_line": null,
        "helpful_votes": 3,
        "not_helpful_votes": 0
      },
      {
        "review_id": 548859577,
        "rating": 5,
        "headline": "Great Product/keeps makeup matte and in place",
        "comments": "lt's so good. It's the only setting spray that keeps my face matte throughout the day. I can also tell it keeps my makeup in place even in the hot florida heat.",
        "nickname": "Jaz",
        "location": "Florida",
        "created_date": 1742121072337,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 0
      },
      {
        "review_id": 547398399,
        "rating": 4,
        "headline": "Iffy about this product",
        "comments": "Overall i like this product, but there's better, id say if you have extra time after you get ready to get it. If not, dont. Its sticky until after about 15 minutes of having it on.",
        "nickname": "adelyn",
        "location": "Ks",
        "created_date": 1740527000103,
        "bottom_line": null,
        "helpful_votes": 5,
        "not_helpful_votes": 1
      }
    ],
    "paging": {
      "total_results": 16,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        4,
        3,
        24,
        40,
        244
      ],
      "review_histogram": [
        4,
        3,
        24,
        40,
        244
      ],
      "rating_count": 315,
      "review_count": 315,
      "average_rating": 4.64,
      "recommended_ratio": 0.25,
      "media": [],
      "faceoff_positive": {
        "comments": "I recently tried out the Pore Eclipse Matte Setting Spray from Milk Makeup and I must say, I am thoroughly impressed with this product. The soft matte finish it gave me was absolutely amazing. It made my skin look flawless and airbrushed, which is something I have been looking for in a setting spray for a long time.One of the things that really stood out to me was how long my makeup stayed on after using the Pore Eclipse Matte Setting Spray. My makeup stayed put for hours without budging, even during a long day at work. This was definitely a game-changer for me as I no longer have to worry about touch-ups throughout the day.After using the Pore Eclipse Matte Setting Spray, my skin felt smooth and hydrated. It did not feel dry or tight like it has with other setting sprays I've tried in the past. This is definitely a plus as I have dry skin and have struggled to find a setting spray that doesn't exacerbate my skin's dryness.The fine mist is another feature of this product that I really appreciate. It sprays evenly and doesn't leave any visible droplets on my skin, which is something I've struggled with in the past with other setting sprays.Overall, I highly recommend the Pore Eclipse Matte Setting Spray from Milk Makeup to anyone looking for a setting spray that will give them a soft matte finish, keep their makeup in place all day, and leave their skin feeling hydrated and smooth. This is definitely a product worth trying out! Gifted by Milk Makeup",
        "headline": "A great setting spray!",
        "rating": 5,
        "ugc_id": 547478936
      },
      "faceoff_negative": {
        "comments": "This setting spray is great - it sets my makeup all day with a matte finish and barely any shine at the end of the day. However. the nozzle is awful. I mean, it started out good spraying a fine mist but 2 months in and it's all of a sudden spraying a stream of liquid. I have ran the nozzle under hot water and used a push pin to try to open the sprayer back up, both to no avail. And of course at 2 months it's past the 30 day return/exchange window, which is really awful because this is a pricey item. For it's price, I would expect a better made nozzle. but it seems to be an ongoing issue according to the reviews. What a shame to not fix the bottle/nozzle!",
        "headline": "horrible nozzle!",
        "rating": 1,
        "ugc_id": 555857165
      },
      "name": "Pore Eclipse Mattifying + Blurring Transfer-Proof Setting Spray",
      "native_review_count": 16,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 299,
      "locale": "en_US"
    }
  }
}