{
  "product_id": "pimprod2050537",
  "product_url": "https://www.ulta.com/p/cooling-water-under-eye-gel-stick-pimprod2050537",
  "extracted_at": "2025-09-23T03:40:46.864957+00:00",
  "product_name": "MILK MAKEUPCooling Water Under Eye Gel Stick",
  "brand": "MILK MAKEUP",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Serums"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "serums"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "28.00",
  "availability": "in_stock",
  "rating_avg": "4.6",
  "rating_count": "101",
  "images": [
    "https://media.ulta.com/i/ulta/2635585?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2635585?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2635585_alt01?w=600&h=600&fmt=auto"
  ],
  "summary": "SummaryHighlightsClean IngredientsCruelty FreeVeganGive BackMilk Makeup Cooling Water is a cooling under-eye gel stick that hydrates, soothes, and visibly reduces the look of puffiness with caffeine and seawater.",
  "details": "DetailsBenefitsUnique cooling gel stick is infused with caffeine to visibly reduce puffiness and seawater to soothe and refresh skinCan be used under eyes, all over face, and bodyPro tip: Store in the fridge for extra chillKey IngredientsCaffeine reduces the appearance of puffinessSeawater soothes and hydratesFormulated WithoutParabensSiliconesOilsAlcoholGlutenTalcSoyItem 2635585How To UseSwipe onto under-eye area, face, neck, and body to cool and refresh.IngredientsAqua/Water/Eau, Propanediol, Bis-PEG-18 Methyl Ether Dimethyl Silane, Sodium Stearate, Aloe Barbadensis Leaf Juice, Kappaphycus Alvarezii Extract, Maris Aqua/Sea Water/Eau de Mer, Caffeine, Glycerin, Stearic Acid, Nylon-12, Sodium Sulfate, Sodium Chloride, Citric Acid, Potassium Sorbate, Sodium Benzoate, Chlorphenesin, Phenoxyethanol, Blue 1 (CI 42090).Shipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Swipe onto under-eye area, face, neck, and body to cool and refresh.",
  "ingredients": [
    "Aqua/Water/Eau",
    "Propanediol",
    "Bis-PEG-18 Methyl Ether Dimethyl Silane",
    "Sodium Stearate",
    "Aloe Barbadensis Leaf Juice",
    "Kappaphycus Alvarezii Extract",
    "Maris Aqua/Sea Water/Eau de Mer",
    "Caffeine",
    "Glycerin",
    "Stearic Acid",
    "Nylon-12",
    "Sodium Sulfate",
    "Sodium Chloride",
    "Citric Acid",
    "Potassium Sorbate",
    "Sodium Benzoate",
    "Chlorphenesin",
    "Phenoxyethanol",
    "Blue 1 ("
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "cleanser",
      "serum",
      "mask",
      "treatment",
      "eye cream"
    ],
    "finish": [
      "sheer",
      "gel",
      "oil"
    ],
    "ingredients": [
      "sulfate-free"
    ],
    "brand": [
      "clean-beauty",
      "mid-range"
    ],
    "special_features": [
      "cruelty-free",
      "vegan"
    ],
    "skin_type": []
  },
  "reviews": {
    "product_id": "pimprod2050537",
    "total_reviews": 101,
    "reviews": [
      {
        "review_id": 553420539,
        "rating": 4,
        "headline": "Looooove!",
        "comments": "So, I absolutely love this! When I wake up my eyes feel so bleh. They barely want to be open and they feel tired. Apply this straight onto the eye area all around and INSTANTLY awake untired eyes! Its a smooth texture, no real smell and just feels so good! The only reason I gave 4 stars is bc its a massive round stick, makes it hard to apply around the eye area. Also I don't really see that it helps depuff the eye area either. But it's definitely worth purchasing!",
        "nickname": "Meggie",
        "location": "California",
        "created_date": 1747344927217,
        "bottom_line": null,
        "helpful_votes": 13,
        "not_helpful_votes": 1
      },
      {
        "review_id": 552474490,
        "rating": 1,
        "headline": "does nothing",
        "comments": "one of my friends gave it to me and im so glad i got it for free because this product isn't good. definitely not worth the money. literally doesn't do anything.",
        "nickname": "lauryn's",
        "location": "waianae, Hi",
        "created_date": 1745607655940,
        "bottom_line": null,
        "helpful_votes": 6,
        "not_helpful_votes": 5
      },
      {
        "review_id": 547718470,
        "rating": 5,
        "headline": "This is a amazing I would bye it a thousand times if icould",
        "comments": "I love it so much would recommend",
        "nickname": "Savannah",
        "location": "Or astoria",
        "created_date": 1741158188528,
        "bottom_line": "Yes",
        "helpful_votes": 5,
        "not_helpful_votes": 1
      }
    ],
    "paging": {
      "total_results": 3,
      "pages_total": 1,
      "page_size": 20,
      "current_page_number": 1
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        1,
        0,
        9,
        19,
        72
      ],
      "review_histogram": [
        1,
        0,
        9,
        19,
        72
      ],
      "rating_count": 101,
      "review_count": 101,
      "average_rating": 4.59,
      "recommended_ratio": 1.0,
      "media": [],
      "faceoff_positive": {
        "comments": "I purchased this product in a mini size, as I have been all around the block with different eye serums and eye treatments & just wanted to give this one a try before committing fully. I was absolutely surprised and happy with this product's performance! First, I love how the packaging/product is in a 'glue stick' format- a quick twist and I have just the amount I need for the day. The texture of the product is very smooth and silky, it leaves no residue and I have no issues layering other moisture or makeup on top. The almost 'gel' solid format provides a sort of cooling sensation and feels great if you apply it from the fridge. I love how it quickly tackles my dark circles and firms my eye area. This is a new staple in my routine and I'm for sure coming back for the full size!",
        "headline": "Obsessed; Like Your Morning Coffee, You NEED This 'Wake-Up'!",
        "rating": 5,
        "ugc_id": 547481086
      },
      "faceoff_negative": {
        "comments": "I have slightly sensitive skin not too sensitive though, & oily/dry combo skin. i liked it at first, i applied it to my under eyes and around my smile lines, but then after about an hour i noticed my skin flaring up slightly, it was like red splotches only along the spots i put it. It had a nice cooling effect at first & it did depuff my eyes, but it just made my skin bright red where i put it so im gonna have to return it. It doesnt have a strong scent & also i question how clean it is to continuously reapply a stick of product to your face daily, it will catch a lot of bacteria on the stick. the packaging is cute; but the product itself did not much for me, kinda disappointing, i wanted to like it.",
        "headline": "Maureen R",
        "rating": 3,
        "ugc_id": 547480188
      },
      "name": "Cooling Water Under Eye Gel Stick",
      "native_review_count": 3,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 98,
      "locale": "en_US"
    }
  }
}