{
  "product_id": "pimprod2050869",
  "product_url": "https://www.ulta.com/p/ionplex-hydra-gel-power-patches-pimprod2050869",
  "extracted_at": "2025-09-23T04:17:46.579896+00:00",
  "product_name": "NuFACEIonPlex Hydra-Gel Power Patches",
  "brand": "NuFACE",
  "categories": [
    "Home",
    "Skin Care",
    "Eye Treatments",
    "Eye Masks"
  ],
  "category_keys": [
    "home",
    "skin-care",
    "eye-treatments",
    "masks"
  ],
  "currency": "USD",
  "list_price": "",
  "sale_price": "55.00",
  "availability": "in_stock",
  "rating_avg": "4.9",
  "rating_count": "26",
  "images": [
    "https://media.ulta.com/i/ulta/2639610?w=500&h=500"
  ],
  "detailed_images": [
    "https://media.ulta.com/i/ulta/2639610?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2639610_alt01?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2639610_alt02?w=600&h=600&fmt=auto",
    "https://media.ulta.com/i/ulta/2639610_alt03?w=600&h=600&fmt=auto",
    "https://media.ulta.com/v/ulta/2639610_vid01/thumbs/4c2272cc-73ae-48f8-bb4f-a374b9e76bd3?w=600&h=896&fmt=auto"
  ],
  "summary": "SummaryThe IonPlex Hydra-Gel Power Patches are energizing eye masks formulated with NuFACE IonPlex, amino acids, and magnesium to brighten, tighten, and hydrate in minutes.",
  "details": "DetailsBenefitsENERGIZE & BRIGHTEN: Proprietary IonPlex electrolyte blend replenishes moisture stores while magnesium brightens under eyes for an energized, wide-awake appearance.SMOOTH LINES & FIRM: Powerful anti-aging ingredient arginine amino acid helps to actively smooth fine lines and firm skin.LOCK IN HYDRATION: Ultra-hydrating glycerin attracts and holds moisture in the skin, while the hydra-gel mask seals in hydration for healthy, glowing skin.DEPUFF & SOOTHE: The cooling hydra-gel mask infused with allantoin and magnesium depuffs under eye bags while soothing irritated skin.PROTECT: Antioxidant powerhouse zinc improves skin barrier repair, while magnesium protects delicate under eyes from free radical damage.PREP: IonPlex infused eye masks effectively hydrate skin to prep for microcurrent treatment while the mask itself distributes microcurrent for faster, more powerful results.Key IngredientsELECTROLYTES: Proprietary IonPlex blend of ions and glacial water deeply hydrates skin and enhances microcurrent treatmentAMINO ACID: Helps to actively smooth and tighten skinMAGNESIUM: Helps to brighten and depuff under eyes while protecting from free radical damageItem 2639610How To UseGently apply to under eye area and leave on for 5 minutes. After removing, tap excess serum into the skin. Power Patches may be used alone or paired with your NuFACE Microcurrent Treatment for supercharged results.Use only as directed. For external use only. Avoid in contact with eyes. Discontinue use if irritation develops. Power Patches are your MVP -- most versatile patch -- with multiple ways to use: +Use solo to brighten, tighten, and hydrate under eyes -- anytime, anywhere. +Pair with your FIX treatment to supercharge your eye area microcurrent results. +Use on under eyes while doing your microcurrent facial sculpting routine for a multi-tasking treatment. +Use anywhere your skin needs an extra boost. The curved ergonomic shape hugs the contours of the face to treat smile lines and nasolabial folds, eyelids, crow's feet, and even the forehead.IngredientsWater, Glycerin, Carrageenan, Butylene Glycol, Sea Silt Extract, Hexylene Glycol, Cyamopsis Tetragonoloba (Guar) Gum, Ceratonia Siliqua (Carob) Gum, Pentylene Glycol, Propanediol, Calcium Chloride, Polyglyceryl-10 Laurate, Pinus Sylvestris Leaf Extract, Hydroxyacetophenone, Allantoin, Sodium Chloride, Titanium Dioxide, Cellulose Gum, Potassium Chloride, Synthetic Fluorphlogopite, Sucrose, Illicium Verum (Anise) Fruit Extract, Calcium Lactate, Dipotassium Glycyrrhizate, Magnesium Aspartate, Zinc Gluconate, Ethylhexylglycerin, Fragrance, Polymethylsilsesquioxane, Sea Salt, Sodium Phytate, Ultramarines, Arginine, Silica, Polyglyceryl-10 Oleate, Phenoxyethanol, Copper Gluconate, Himanthalia Elongata Extract, Caprylyl Glycol, Sodium Benzoate, Potassium SorbateShipping & Coupon RestrictionsThis brand is excluded from most Ulta Beauty coupons.See brand eligibility details",
  "how_to_use": "Gently apply to under eye area and leave on for 5 minutes. After removing, tap excess serum into the skin. Power Patches may be used alone or paired with your NuFACE Microcurrent Treatment for supercharged results.Use only as directed. For external use only. Avoid in contact with eyes. Discontinue use if irritation develops. Power Patches are your MVP -- most versatile patch -- with multiple ways to use: +Use solo to brighten, tighten, and hydrate under eyes -- anytime, anywhere. +Pair with your FIX treatment to supercharge your eye area microcurrent results. +Use on under eyes while doing your microcurrent facial sculpting routine for a multi-tasking treatment. +Use anywhere your skin needs an extra boost. The curved ergonomic shape hugs the contours of the face to treat smile lines and nasolabial folds, eyelids, crow's feet, and even the forehead.",
  "ingredients": [
    "Water",
    "Glycerin",
    "Carrageenan",
    "Butylene Glycol",
    "Sea Silt Extract",
    "Hexylene Glycol",
    "Cyamopsis Tetragonoloba (Guar) Gum",
    "Ceratonia Siliqua (Carob) Gum",
    "Pentylene Glycol",
    "Propanediol",
    "Calcium Chloride",
    "Polyglyceryl-10 Laurate",
    "Pinus Sylvestris Leaf Extract",
    "Hydroxyacetophenone",
    "Allantoin",
    "Sodium Chloride",
    "Titanium Dioxide",
    "Cellulose Gum",
    "Potassium Chloride",
    "Synthetic Fluorphlogopite",
    "Sucrose",
    "Illicium Verum (Anise) Fruit Extract",
    "Calcium Lactate",
    "Dipotassium Glycyrrhizate",
    "Magnesium Aspartate",
    "Zinc Gluconate",
    "Ethylhexylglycerin",
    "Fragrance",
    "Polymethylsilsesquioxane",
    "Sea Salt",
    "Sodium Phytate",
    "Ultramarines",
    "Arginine",
    "Silica",
    "Polyglyceryl-10 Oleate",
    "Phenoxyethanol",
    "Copper Gluconate",
    "Himanthalia Elongata Extract",
    "Caprylyl Glycol",
    "Sodium Benzoate",
    "Potassium Sorbate"
  ],
  "extended_contents": {},
  "tags": {
    "category": [
      "eye",
      "eyes"
    ],
    "product_type": [
      "cleanser",
      "mask",
      "treatment",
      "eye cream"
    ],
    "skin_type": [
      "dry",
      "sensitive",
      "mature"
    ],
    "finish": [
      "dewy",
      "creamy",
      "gel"
    ],
    "ingredients": [
      "synthetic",
      "fragrance"
    ],
    "brand": [
      "mid-range",
      "premium"
    ],
    "special_features": [
      "anti-aging",
      "hydrating",
      "soothing"
    ]
  },
  "reviews": {
    "product_id": "pimprod2050869",
    "total_reviews": 26,
    "reviews": [
      {
        "review_id": 560518542,
        "rating": 5,
        "headline": "Love these!",
        "comments": "This was a gifted by NuFace, but is a product I will be buying! I love these patches because they are very refreshing and do not fall off my face. They visibly brighten my face and are hydrating! Love these for a little daily self care!",
        "nickname": "Tatum",
        "location": "Madison, WI",
        "created_date": 1755720601437,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 560482474,
        "rating": 4,
        "headline": "Hydrating",
        "comments": "Gifted by nuface ! I love how light weight they feel under the eyes. They are super hydrating, especially for my dry skin. The tool is super helpful when needing to scoop out the eye pads. My only con is that they slide down a bit / doesn't stay in place.",
        "nickname": "Trish",
        "location": "ATL",
        "created_date": 1755660333681,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559796325,
        "rating": 4,
        "headline": "I buy it again!",
        "comments": "Gifted by nuface. I absolutely love this product! It provides incredible hydration, leaving my under-eye area looking revitalized and healthy. When I apply makeup after using it, my skin feels so much better and more refreshed.",
        "nickname": "Katherine",
        "location": "Huntington Beach",
        "created_date": 1754614860993,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559796029,
        "rating": 4,
        "headline": "They are good!",
        "comments": "I absolutely love this product! It provides incredible hydration, leaving my under-eye area looking revitalized and healthy. When I apply makeup after using it, my skin feels so much better and more refreshed.",
        "nickname": "Katherine",
        "location": "Huntington Beach",
        "created_date": 1754614266094,
        "bottom_line": null,
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559410952,
        "rating": 5,
        "headline": "10/10!",
        "comments": "I absolutely love these eye patches gifted by NuFace. They were super hydrating and brightened my under eyes up so quickly. I love that you only need to have them on for only 5 minutes and you can see a difference. If you have not tried these yet, you need to!",
        "nickname": "Chloe",
        "location": "Connecticut",
        "created_date": 1754496408084,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559383846,
        "rating": 5,
        "headline": "A must before applying concealer!",
        "comments": "I've been using the IonPlex Hydra-Gel Power Patches complimentary from NuFACE , and they've officially earned a permanent spot in my morning routine. I love applying them before my makeup! They instantly de-puff and hydrate my under-eyes, leaving my skin feeling smooth, refreshed, and prepped for concealer. The cooling sensation is so soothing, and you can see the difference in minutes. They're also the perfect multitasking treat while I'm using my NuFACE Microcurrent Device, sculpting and lifting while the patches do their thing.",
        "nickname": "Abiodun",
        "location": "Dallas, TX",
        "created_date": 1754456515809,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559383726,
        "rating": 5,
        "headline": "Live it)",
        "comments": "gifted by NuFACE Tried the IonPlex Hydra-Gel Power Patches and I'm impressed! 🩵 They feel so refreshing on the skin and deliver an instant boost of hydration. After just one use, my under-eye area looked brighter, smoother, and felt incredibly soft. I love that the formula is clean and gentle, yet works so effectively. Perfect for a quick self-care moment that actually shows results!",
        "nickname": "Anna",
        "location": "Santa Monica",
        "created_date": 1754455782334,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559383598,
        "rating": 5,
        "headline": "Instantly hydrate!",
        "comments": "These patches work incredible! I use them immediately when I wake up and they instantly hydrate my under eyes. They help with fine lines and give me an overall great base for under makeup. On top of that they're made with great ingredients which makes me feel even better putting them on my skin daily! Gifted by nuface",
        "nickname": "Alyssa",
        "location": "CA",
        "created_date": 1754455473245,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559315690,
        "rating": 5,
        "headline": "love this product",
        "comments": "I love this product so much it makes my skin feel extremely hydrated and plump. My under eyes have never felt better. This product was kindly gifted to me. I can't wait to keep using this and incorporated into my skincare routine.",
        "nickname": "Talar",
        "location": "Los Angeles",
        "created_date": 1754404009195,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559255989,
        "rating": 5,
        "headline": "Instant Refrash",
        "comments": "Gifted by nuface. These are definitely a new staple in my skincare routine — especially on mornings when I didn't get enough sleep. Highly recommend if you're looking for an instant boost and a little self-care moment.",
        "nickname": "Jordan",
        "location": "Florida",
        "created_date": 1754342511742,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559202769,
        "rating": 5,
        "headline": "Wonderful eyepatches - brightens, fills fine lines",
        "comments": "The power patches are an amazing quality and absolute must to have very smooth and beautiful all around eye area. My skin around my eyes gets dry and because of that I get fine lines. After having the patched for about an hour - it works like magic. It was gifted to me, but I would invest in these patches because it helps my skin concerns.",
        "nickname": "Natasha",
        "location": "Salt Lake City",
        "created_date": 1754236781173,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559176950,
        "rating": 5,
        "headline": "Very hydrating patches",
        "comments": "I am loving the power patches from Nuface! I was gifted by them and I'm soo excited about my results! I will most definitely be buying more in the future. And they will always be in rotation! Thanks Nuface!",
        "nickname": "Shun",
        "location": "Texas",
        "created_date": 1754166394714,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 559113737,
        "rating": 5,
        "headline": "Instantly Brighter, Tighter, and Hydrated Eyes!",
        "comments": "Gifted by NuFACE – I've been trying the NuFACE Power Patches and I'm honestly loving them! These eye masks are super hydrating, feel refreshing on the skin, and help smooth fine lines fast. After just one use, my under-eyes looked noticeably brighter, tighter, and more awake. I also love how clean and effective the formula is — no irritation, just a refreshed, glowing look. Perfect for a quick pick-me-up! ✨ #NuFACE #EyeMasks #LineSmoothing #Hydrating",
        "nickname": "",
        "location": "New York",
        "created_date": 1754070689624,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558831198,
        "rating": 5,
        "headline": "They really help depuff and brighten my under-eyes!",
        "comments": "This is my second tub of the IonPlex Hydra-Gel Power Patches, and I absolutely love them. They really help depuff and brighten my under-eyes—perfect after a long work week or right before a special event. I like to keep them in the fridge for a refreshing, cooling boost. They leave my eyes looking more awake and feeling refreshed every time. A staple in my skincare routine! complimentary from NuFace",
        "nickname": "Sasha",
        "location": "Florida",
        "created_date": 1753988267039,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558519174,
        "rating": 5,
        "headline": "Lovely eye gels!",
        "comments": "Complimentary from nuface. I'm loving these eye gels! I love the electrolytes as an ingredient, and I think these do a great job of hydrating my skin. They're great prep for before using the NuFace but also great for after too. They stay put and are a nice size so they cover a good area. They're definitely an easy favorite for me and I highly recommend them!",
        "nickname": "Kristin",
        "location": "New York",
        "created_date": 1753746738172,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558393310,
        "rating": 5,
        "headline": "boost of hydration!",
        "comments": "was gifted by nuface and i am absolutely loving these patches! they're so easy to use, give me the hydration my eyes are craving and really make my morning routine so much better! i leave them on as i get ready and my eyes look fresh for the rest of the day!",
        "nickname": "regina",
        "location": "los angeles",
        "created_date": 1753670050930,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558350062,
        "rating": 5,
        "headline": "LOVE",
        "comments": "Complimentary from nuface. I use the nuface eye patches every morning and have noticed such a difference in my under eyes! They feel and look more hydrated. I cannot go a morning without using my nuface eye patches!",
        "nickname": "",
        "location": "NY",
        "created_date": 1753558495226,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558319250,
        "rating": 5,
        "headline": "NuFACE is my new go-to for a natural lift.",
        "comments": "Gifted by nuface. In just 5 minutes a day, my jawline feels tighter, my cheekbones more defined, and my skin visibly firmer. It's like a mini face-lift—without the needles. Totally worth it!",
        "nickname": "binal",
        "location": "Arizona",
        "created_date": 1753512965063,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558277529,
        "rating": 5,
        "headline": "I would buy this product again and again",
        "comments": "These are the perfect eye patches that are quick, easy, and leave my eyes hydrated and looking alive. I definitely recommend these if you're looking for good quality eye patches.",
        "nickname": "Annie",
        "location": "Minnesota",
        "created_date": 1753468857321,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      },
      {
        "review_id": 558166269,
        "rating": 5,
        "headline": "Essential to my daily routine!",
        "comments": "Complimentary from nuface. Don't forget — taking care of your eye contour is just as important! These patches are amazing. They're designed to deeply hydrate, brighten, reduce puffiness, and help tighten the skin. You can truly see the difference before and after — and I love how refreshed and smooth my under eyes feel. If you're looking for something to treat this delicate area, I highly recommend these. You'll love the results!",
        "nickname": "Dali",
        "location": "Salt Lake City",
        "created_date": 1753419832485,
        "bottom_line": "Yes",
        "helpful_votes": 0,
        "not_helpful_votes": 0
      }
    ],
    "paging": {
      "total_results": 26,
      "pages_total": 2,
      "page_size": 20,
      "current_page_number": 1,
      "next_page_url": "/m/6406/l/en_US/product/pimprod2050869/reviews?paging.from=20&paging.size=20&filters=&search=&sort=Newest&image_only=false&page_locale=en_US&native_only=true"
    },
    "rollup": {
      "properties": [],
      "rating_histogram": [
        0,
        0,
        0,
        3,
        23
      ],
      "review_histogram": [
        0,
        0,
        0,
        3,
        23
      ],
      "rating_count": 26,
      "review_count": 26,
      "average_rating": 4.88,
      "recommended_ratio": 1.0,
      "media": [
        {
          "id": "559202771",
          "review_id": 559202769,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/leashrmtylvjkx4ncb5y.jpg",
          "headline": "Wonderful eyepatches - brightens, fills fine lines",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Fresh eyes",
          "nickname": "Natasha",
          "created_date": 1754236781173
        },
        {
          "id": "559202775",
          "review_id": 559202769,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/aho2ztbhr0s5rnpzt2k3.jpg",
          "headline": "Wonderful eyepatches - brightens, fills fine lines",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Beautiful packaging",
          "nickname": "Natasha",
          "created_date": 1754236781173
        },
        {
          "id": "559202770",
          "review_id": 559202769,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/wblf2zpx6ysy4lyzmzrr.jpg",
          "headline": "Wonderful eyepatches - brightens, fills fine lines",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Right after removing- only 10 min effect",
          "nickname": "Natasha",
          "created_date": 1754236781173
        },
        {
          "id": "559202742",
          "review_id": 559202769,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/zgbfjh2qjdq5812djmbx.jpg",
          "headline": "Wonderful eyepatches - brightens, fills fine lines",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Patches on",
          "nickname": "Natasha",
          "created_date": 1754236781173
        },
        {
          "id": "558831199",
          "review_id": 558831198,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/mqjqsspz3opmcddzvpo1.jpg",
          "headline": "They really help depuff and brighten my under-eyes!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "caption": "Love these!",
          "nickname": "Sasha",
          "created_date": 1753988267039
        },
        {
          "id": "558519157",
          "review_id": 558519174,
          "uri": "//res.cloudinary.com/powerreviews/image/upload/f_auto,q_auto,h_768,w_auto/d_portal-no-product-image_ttlfpi.svg/prod/xuosbsnguwyprnltcy7b.jpg",
          "headline": "Lovely eye gels!",
          "rating": 5,
          "helpful_votes": 0,
          "not_helpful_votes": 0,
          "type": "image",
          "nickname": "Kristin",
          "created_date": 1753746738172
        }
      ],
      "name": "IonPlex Hydra-Gel Power Patches",
      "native_review_count": 26,
      "native_sampling_review_count": 0,
      "native_sweepstakes_review_count": 0,
      "native_community_content_review_count": 0,
      "syndicated_review_count": 0,
      "locale": "en_US"
    }
  }
}